{
  "component-definition": {
    "uuid": "6ea39842-f831-4298-8527-8dbfa9dd8f42",
    "metadata": {
      "title": "APP.4.6 SAP ABAP-Programmierung - Benutzerdefiniert",
      "last-modified": "2025-11-22T12:46:07.929142+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "1f753a61-289c-4721-b82c-ac41b05f4e97",
        "type": "software",
        "title": "APP.4.6 SAP ABAP-Programmierung",
        "description": "This component represents the implementation of all controls for Baustein APP.4.6.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Häufig werden in SAP-Systemen Eigenentwicklungen programmiert. Die Gründe dafür sind vielfältig, so können Geschäftsprozesse oder Anforderungen an das Reporting mit Hilfe von Eigenentwicklungen individuell an die Institution angepasst werden. Außerdem ist es möglich, spezielle Funktionen zu erstellen, die in der Standard-Auslieferung nicht vorhanden sind.<BR><BR>Eigenentwicklungen werden von Entwickelnden der Institution oder von beauftragten Entwickelnden programmiert. Im SAP-Umfeld wird dazu häufig ABAP (Advanced Business Application Programming) verwendet.<BR><BR>ABAP ist eine proprietäre, plattformunabhängige Programmiersprache des Unternehmens SAP. Sie wurde für die Programmierung kommerzieller Anwendungen im SAP-Umfeld entwickelt und ähnelt in ihrer Grundstruktur entfernt der Sprache COBOL. Wichtige Merkmale sind:<BR><BR>• Integration eines Authentisierungs-, Rollen- und Berechtigungskonzepts,<BR>• Verwendung eines proprietären, datenbankunabhängigen SQL-Derivats (Open SQL),<BR>• Unterstützung der Kommunikation zwischen verschiedenen SAP-Systemen sowie<BR>• Integration von Audit-Optionen."
          },
          {
            "name": "Zielsetzung",
            "value": "Der Baustein zeigt ABAP-Entwickelnden und Sicherheitstestenden relevante technische Risiken auf, die sich durch ABAP-Eigenentwicklungen ergeben können. Außerdem werden Anforderungen definiert, die aufzeigen, wie ABAP-Programme sicher entwickelt und eingesetzt werden können.<BR><BR>Der Baustein setzt grundlegende Kenntnisse in ABAP und im Umgang mit ABAP-Entwicklungswerkzeugen voraus."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein APP.4.6 SAP ABAP-Programmierung ist auf jedes SAP-System einmal anzuwenden, wenn Eigenentwicklungen in der Programmiersprache ABAP erstellt werden.<BR><BR>Mit diesem Baustein werden die Bausteine CON.8 Software-Entwicklung, APP.6 Allgemeine Software und APP.7 Entwicklung von Individualsoftware um konkrete Aspekte zur Entwicklung von ABAP-Programmen erweitert.<BR><BR>Der Baustein stellt keine vollständige Anleitung dar, um ABAP-Programme zu entwickeln, sondern beschreibt die generellen Risiken der Programmiersprache ABAP. Im Baustein werden Anforderungen definiert, die bei der Entwicklung von ABAP-Programmen aus Sicherheitssicht erfüllt werden sollten.<BR><BR>Da Webanwendungen nur einen sehr geringen Anteil aller ABAP-Anwendungen in SAP-Implementierungen ausmachen, stehen Web-Schwachstellen nicht im Fokus dieses Dokuments."
          },
          {
            "name": "2.1. Fehlende Berechtigungsprüfungen",
            "value": "In SAP werden Berechtigungen nur dann geprüft, wenn eine entsprechende Berechtigungsprüfung von Entwickelnden im Programm implementiert wurde. Ohne eine solche Prüfung im Programm-Code wird also nicht getestet, ob Benutzende auch wirklich berechtigt sind eine Aktion auszuführen. In selbst entwickeltem Programm-Code werden Berechtigungsprüfungen aber häufig vergessen. Somit greift das gesamte Berechtigungskonzept oftmals nicht und unberechtigte Personen können auf die im SAP-System gespeicherten Daten zugreifen. Dadurch kann etwa auch gegen Compliance-Anforderungen verstoßen werden. Dies kann besonders bei Wirtschaftsprüfungen schwerwiegende Folgen nach sich ziehen."
          },
          {
            "name": "2.2. Verlust von Vertraulichkeit oder Integrität von kritischen Daten",
            "value": "SAP-Systeme enthalten viele institutionskritische Informationen. Der SAP-Standard sieht verschiedene Mechanismen vor, diese Daten zu schützen. Allerdings könnte durch fehlerhafte ABAP-Eigenentwicklungen unerlaubt auf institutionskritische Informationen zugegriffen werden. Mitarbeitende oder Angreifende könnten die Daten so in eine nicht mehr kontrollierbare Umgebung transferieren. Ebenso könnten mit Hilfe von ABAP-Programmen kritische Daten manipuliert werden, indem die Sicherheitsmechanismen des SAP-Standards umgangen werden."
          },
          {
            "name": "2.3. Injection-Schwachstellen",
            "value": "Injection-Schwachstellen entstehen dadurch, dass Angreifende Steuerzeichen bzw. Kommandos über das Eingabefeld in eine Anwendung einschleust. Ein erfolgreicher Angriff kann den geplanten Programmablauf durch unerwartete Kommandos stören.<BR><BR>Injection-Schwachstellen stellen für Eigenentwicklungen das größte Sicherheitsrisiko dar. Durch fehlerhaften Code in einer ABAP-Anwendung können Angreifende ein SAP-System mitunter vollständig kontrollieren. Da solche Angriffe sehr komplex sind und es viele Varianten davon gibt, lassen sie sich ohne spezielle Schulungen kaum erkennen und beheben."
          },
          {
            "name": "2.4. Umgehung von vorhandenen SAP-Sicherheitsmechanismen",
            "value": "Der SAP-Standard stellt verschiedene Schutzmechanismen für Daten zur Verfügung. Dazu gehören unter anderem die Mandantentrennung, Identity-Management sowie Rollen und Berechtigungen. Diese Sicherheitsmechanismen können im Code jedoch bewusst umgangen oder ungewollt weggelassen werden."
          }
        ],
        "control-implementations": [
          {
            "uuid": "d08a0f0a-d218-43a8-83fd-77887c0f4306",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Kompendien/Grundschutz%2B%2B-Kompendium/profile/anwendungen_profile.json",
            "description": "Implementation for all controls in Baustein APP.4.6",
            "implemented-requirements": [
              {
                "uuid": "1e2e164c-adc7-4b13-975a-b9d1f6bddc83",
                "control-id": "BES.2.1.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DEV",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.7.A1-m1",
                    "uuid": "8d10b3d9-890a-4c4c-9b38-04c991c86b27",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die Entwicklung von Individualsoftware ist lediglich ein technischer Ansprechpartner benannt. Es existieren keine formalisierten Verantwortlichkeiten oder ein definiertes Vorgehensmodell."
                      },
                      {
                        "name": "guidance",
                        "value": "In der Praxis bedeutet dies oft, dass die Kommunikation und Steuerung der Entwicklung ad hoc und informell über einen einzelnen Entwickler oder Projektleiter läuft, ohne dass dies in einem organisatorischen Rahmen verankert ist."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, ob überhaupt ein Ansprechpartner für die Software-Entwicklung benannt ist. Es wird geprüft, ob jegliche Dokumentation über Rollen und Verantwortlichkeiten fehlt."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A1-m2",
                    "uuid": "6dd190a5-2778-42e7-910f-e40386eebf1f",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist eine verantwortliche Stelle für die Steuerung und Koordination der Software-Entwicklung benannt. Ein grundlegendes, aber informelles Projektmanagementmodell (z. B. eine einfache Liste von Aufgaben und Meilensteinen) wird verwendet."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Person oder eine Abteilung wird offiziell als zuständig erklärt. Die Projektplanung erfolgt oft in Standard-Office-Dokumenten und wird nicht systematisch nachverfolgt oder aktualisiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz einer offiziellen Benennung der zuständigen Stelle. Es wird geprüft, ob eine grundlegende, wenn auch informelle, Projektplanung existiert (z.B. Aufgabenlisten, E-Mail-Korrespondenz)."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A1-m3",
                    "uuid": "9d9bd895-e9a7-4407-bd82-e29f3b1d1dd7",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Planung des Software-Einsatzes MUSS um Aspekte von Individualsoftware ergänzt werden, indem definiert wird, wer dafür zuständig ist, die Software-Entwicklung bzw. den Auftragnehmenden zu steuern und zu koordinieren, sowie in was für einen organisatorischen Rahmen die Software zu entwickeln ist (Projektmanagementmodell)."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Zuständigkeiten werden in einer Rollen- und Verantwortlichkeitsmatrix (RACI) dokumentiert. Als Projektmanagementmodell wird ein etabliertes Modell wie Scrum, Kanban oder ein klassisches Wasserfallmodell ausgewählt und dessen Anwendung für das Projekt verbindlich festgelegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Dokumentation der Zuständigkeiten und des gewählten Projektmanagementmodells vorlegen. Es wird verifiziert, dass diese Dokumente für das spezifische Entwicklungsprojekt gelten und den Beteiligten bekannt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A1-m4",
                    "uuid": "58dc51ff-b3af-43bf-bf33-f6a3f98008bd",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Individualsoftware SOLLTE im Rahmen eines Entwicklungsprojektes entwickelt werden. Das Entwicklungsprojekt sollte anhand eines Ablaufplans zeitlich grob geplant werden. Das gewählte Projektmanagementmodell ist mit den übergeordneten Sicherheitsrichtlinien der Institution verknüpft."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein formeller Projektauftrag wird erstellt. Ein grober Zeitplan mit den wichtigsten Phasen (Konzeption, Entwicklung, Test, Inbetriebnahme) und Meilensteinen wird in einem Projektmanagement-Tool erfasst und regelmäßig aktualisiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert, ob ein formelles Entwicklungsprojekt eingerichtet wurde und ob ein zeitlicher Ablaufplan existiert. Es wird geprüft, ob der Plan realistisch ist und ob Fortschritte anhand des Plans nachverfolgt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A1-m5",
                    "uuid": "0454a1b2-9b73-40eb-9bb1-4dadeadedfb7",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Projektmanagementmodell ist vollständig in die Risikomanagement- und Sicherheits-Governance-Prozesse der Institution integriert. Die definierten Rollen umfassen spezifische Sicherheitsverantwortlichkeiten. Die Planung wird durch dedizierte Tools unterstützt, die eine kontinuierliche Überwachung des Projektfortschritts und der Einhaltung von Sicherheitsmeilensteinen ermöglichen."
                      },
                      {
                        "name": "guidance",
                        "value": "Tools wie Jira oder Azure DevOps werden verwendet, um nicht nur funktionale, sondern auch Sicherheitsanforderungen (Security Stories) zu verwalten. Das Risikomanagement des Projekts ist direkt mit dem zentralen Risikoregister der Organisation verknüpft. Die Einhaltung wird durch automatisierte Berichte und Dashboards überwacht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der Projektmanagement-Tools, um die Integration von Sicherheitsprozessen zu verifizieren. Es wird durch Stichproben geprüft, ob Sicherheitsrisiken im Projekt systematisch identifiziert, bewertet und in das zentrale Risikomanagement überführt werden. Ein automatisierter Abruf von Konformitätsberichten aus dem Tool kann Teil der Prüfung sein."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "1052dcfa-8a00-4b62-931f-634ff6634a69",
                "control-id": "DEV.2.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DOCS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.7.A6-m1",
                    "uuid": "b05801ab-8b66-428c-b60a-942721b326a8",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Anforderungen existieren nur in unstrukturierter Form, beispielsweise als Sammlung von E-Mails, Tickets oder User Stories in einem Backlog. Es gibt kein konsolidiertes, versioniertes Anforderungsdokument."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle Anforderungen sind in einem Jira-Projekt erfasst, aber es gibt keine übergeordnete Spezifikation oder Dokumentation, die den Gesamtkontext beschreibt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, dass keine zusammenfassende und versionierte Anforderungsdokumentation existiert, die den Entwicklern zur Verfügung gestellt wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A6-m2",
                    "uuid": "4bb63768-f90f-4cc9-b2aa-0abd59c3018f",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anforderungen sind in einem Dokument zusammengefasst und werden den Entwicklern zur Verfügung gestellt. Die Aktualisierung dieses Dokuments bei Änderungen erfolgt jedoch informell und nicht über einen gesteuerten Prozess."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt ein Word-Dokument „Anforderungen_v1.docx“. Änderungen werden mündlich besprochen und das Dokument wird nur sporadisch aktualisiert und per E-Mail in neuen Versionen verteilt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer identifiziert das Anforderungsdokument, stellt aber fest, dass es keinen formellen Änderungsmanagementprozess gibt und verschiedene, inkonsistente Versionen im Umlauf sein können."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A6-m3",
                    "uuid": "7e998c0f-d2f2-4ec6-bd19-339e206f121b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anforderungen aus dem Anforderungskatalog, die Sicherheitsanforderungen an den Prozess der Software-Entwicklung, sowie die Sicherheitsfunktionen zur Systemintegration SOLLTEN umfassend dokumentiert werden. Die Dokumentation mitsamt Sicherheitsprofil SOLLTE den Entwickelnden zur Software-Entwicklung zur Verfügung gestellt werden. Die Dokumentation SOLLTE bei Änderungen an der Individualsoftware sowie bei funktionalen Updates aktualisiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle Anforderungsdokumente werden in einem zentralen, versionierten Repository (z.B. Confluence, SharePoint, Git) gepflegt. Es gibt einen definierten Prozess für Änderungsanträge (Change Requests), der sicherstellt, dass die Dokumentation bei jeder relevanten Änderung aktualisiert wird. Ein initiales Sicherheitsprofil wird als Teil der Dokumentation erstellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz und Vollständigkeit der zentralen, versionierten Dokumentation. Es wird geprüft, ob ein Änderungsmanagementprozess definiert und gelebt wird. Stichprobenartig wird eine kürzliche funktionale Änderung ausgewählt und geprüft, ob die zugehörige Dokumentation entsprechend aktualisiert wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A6-m4",
                    "uuid": "3ceb81f0-4274-4bda-90bf-6515cf771c5f",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Insbesondere SOLLTE ein Sicherheitsprofil für die Anwendung erstellt werden. Dieses SOLLTE den Schutzbedarf der zu verarbeitenden Daten und Funktionen dokumentieren. Das Sicherheitsprofil wird versioniert und unterliegt einem formalen Freigabeprozess."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein dediziertes Dokument „Sicherheitsprofil“ wird erstellt. Es enthält eine Schutzbedarfsfeststellung für die Anwendung und die verarbeiteten Datenkategorien. Jede neue Version des Profils muss vom Informationssicherheitsbeauftragten (ISB) und dem Fachverantwortlichen formal genehmigt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das Sicherheitsprofil an und prüft dessen Inhalt, insbesondere die Schutzbedarfsfeststellung. Anhand der Versionshistorie und der Freigabevermerke wird kontrolliert, ob der formale Genehmigungsprozess eingehalten wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A6-m5",
                    "uuid": "024c0b48-6dfb-4042-966c-0265ebcb0d73",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die gesamte Anforderungsdokumentation wird in einem zentralen Repository als „Documentation as Code“ verwaltet und ist direkt mit dem Quellcode, den Tests und den Bereitstellungskonfigurationen verknüpft. Änderungen an Anforderungen lösen automatisierte Workflows für Review, Test und Bereitstellung aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Anforderungen werden in einem Format wie Markdown oder AsciiDoc in einem Git-Repository neben dem Anwendungscode gespeichert. Pull Requests, die die Dokumentation ändern, erfordern eine Genehmigung. Die Verknüpfung zu User Stories in Jira und zu Testfällen in einem Testmanagement-Tool ist direkt in der Dokumentation enthalten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das Git-Repository und die Konfiguration der CI/CD-Pipeline. Es wird verifiziert, ob die Dokumentation als Code verwaltet wird und ob die Review-Workflows (z.B. über Pull Requests) etabliert sind. Die Nachvollziehbarkeit von Anforderung zu Code zu Test wird stichprobenartig geprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "4010c821-5bba-4ca6-88c8-56df1c9fba59",
                "control-id": "DEV.2.6",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DEV",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.7.A2-m1",
                    "uuid": "b2f6482a-9835-45e6-82e2-dbaadbdc1548",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird lediglich die allgemeine Erwartung geäußert, dass die Software „sicher“ entwickelt werden soll. Es werden keine spezifischen Anforderungen an den Entwicklungsprozess oder die Entwicklungsumgebung formuliert."
                      },
                      {
                        "name": "guidance",
                        "value": "Dies entspricht oft einer reinen Beauftragung auf Basis funktionaler Anforderungen, bei der Sicherheitsaspekte dem Entwickler überlassen werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch Einsicht in die Ausschreibungs- und Vertragsunterlagen fest, dass keine spezifischen Sicherheitsanforderungen an den Entwicklungsprozess dokumentiert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A2-m2",
                    "uuid": "d0f2c741-7f05-4057-a713-56b8c51a0ab2",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden allgemeine Sicherheitsrichtlinien der Institution an den Software-Entwickler übergeben. Es gibt jedoch keine spezifischen Vorgaben, wie diese im Entwicklungsprozess umzusetzen sind oder welche technischen Maßnahmen in der Entwicklungsumgebung erforderlich sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Dem Entwickler wird beispielsweise die allgemeine IT-Sicherheitsrichtlinie des Unternehmens zur Verfügung gestellt, ohne konkrete Ableitungen für das Projekt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass allgemeine Sicherheitsdokumente an den Entwickler übermittelt wurden, stellt aber gleichzeitig fest, dass keine projektspezifischen Anforderungen an den Entwicklungsprozess abgeleitet und definiert wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A2-m3",
                    "uuid": "505667e7-8b5b-4838-ba52-504d708b1cfd",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution MUSS klare Anforderungen an den Prozess der Software-Entwicklung definieren. Aus den Anforderungen MUSS hervorgehen, in was für einer Umgebung die Software entwickelt werden darf und welche technischen und organisatorischen Maßnahmen von Seiten der beauftragten Software-Entwickelnden umzusetzen sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Dies wird durch ein Dokument umgesetzt, das Vorgaben zu sicheren Codierungsrichtlinien (z.B. OWASP Secure Coding Practices), zur Absicherung der Entwicklungsumgebung (z.B. Zugriffskontrollen auf Repositories) und zur Durchführung von Code-Reviews enthält."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich das Dokument mit den Anforderungen an den Entwicklungsprozess vorlegen. Es wird geprüft, ob klare und umsetzbare Vorgaben zur Entwicklungsumgebung und zu den erforderlichen Maßnahmen des Entwicklers enthalten sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A2-m4",
                    "uuid": "457b0cc6-de57-41fe-bf9c-fc3b43119757",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anforderungen an den Entwicklungsprozess umfassen messbare Sicherheitsmetriken. Dies beinhaltet Vorgaben zur minimalen Testabdeckung durch Sicherheitstests, die verpflichtende Nutzung von Werkzeugen zur statischen Code-Analyse (SAST) und eine Obergrenze für die Anzahl erlaubter kritischer Schwachstellen bei der Auslieferung."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Vertrag wird beispielsweise festgelegt, dass der Code eine SAST-Prüfung ohne kritische oder hohe Befunde bestehen muss, bevor ein Release abgenommen wird. Die Ergebnisse der Scans müssen vorgelegt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die vertraglichen Vereinbarungen auf messbare Sicherheitsanforderungen. Es werden stichprobenartig Berichte von Sicherheitstests und SAST-Scans angefordert und mit den Vorgaben abgeglichen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A2-m5",
                    "uuid": "668b2ff0-1f2c-405e-9f76-a7af6f9f2257",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Einhaltung der Sicherheitsanforderungen an den Entwicklungsprozess wird durch eine sichere CI/CD-Pipeline (DevSecOps) automatisch erzwungen. Die Pipeline integriert SAST-, DAST- und SCA-Werkzeuge (Software Composition Analysis) und verhindert ein Deployment, wenn vordefinierte Sicherheits-Gates nicht erfüllt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "In der Jenkins-, GitLab- oder Azure-DevOps-Pipeline werden Sicherheitsscans als obligatorische Schritte konfiguriert. Ein Build schlägt fehl und kann nicht ausgeliefert werden, wenn beispielsweise neue kritische Schwachstellen im Code oder in verwendeten Bibliotheken gefunden werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der CI/CD-Pipeline (z.B. `gitlab-ci.yml`, `Jenkinsfile`). Es wird verifiziert, dass Sicherheits-Gates korrekt implementiert sind und nicht umgangen werden können. Ein automatisierter Test könnte darin bestehen, Code mit einer bekannten Schwachstelle einzureichen und zu prüfen, ob der Build wie erwartet blockiert wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "8ae19b82-43a1-4e0d-9142-6597c94a8737",
                "control-id": "DEV.4.10",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DEV",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.7.A5-m1",
                    "uuid": "93aa6c23-ea0f-41c1-8557-b154fcfb7fcd",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Entwicklung wird ad-hoc durch informelle Status-Updates gesteuert. Es fehlt ein strukturiertes Vorgehens- oder Projektmanagementmodell."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Steuerung erfolgt durch gelegentliche Telefonate oder E-Mails zwischen Auftraggeber und Entwickler, ohne feste Termine oder eine strukturierte Agenda."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch Befragung der Beteiligten und Einsicht in die Projektkommunikation fest, dass kein systematisches Steuerungsmodell verwendet wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A5-m2",
                    "uuid": "f5984bfc-5aa9-47d5-b82c-65ab75f62308",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird ein Projektmanagementmodell wie Scrum oder Kanban verwendet, dieses fokussiert sich jedoch rein auf die Umsetzung funktionaler Anforderungen. Aspekte wie Risikomanagement oder formale Qualitätsziele sind nicht explizit integriert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt regelmäßige Sprint-Meetings und ein Product Backlog. Sicherheitsanforderungen werden jedoch wie normale funktionale Anforderungen behandelt und nicht gesondert priorisiert oder nachverfolgt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das Vorgehen im Projekt (z.B. durch Teilnahme an einem Sprint-Review). Es wird festgestellt, dass ein agiles Modell gelebt wird, aber explizite Artefakte für Risikomanagement oder die Steuerung von Qualitätszielen fehlen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A5-m3",
                    "uuid": "18531d72-ac6c-469e-b565-477c3888939f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei der Entwicklung von Individualsoftware SOLLTE ein geeignetes Steuerungs- und Projektmanagementmodell verwendet werden. Hierbei SOLLTE das ausgewählte Modell mit dem Auftragnehmenden abgestimmt werden. Bei der Steuerung SOLLTE berücksichtigt werden, dass das benötigte Personal ausreichend qualifiziert ist. Alle relevanten Phasen SOLLTEN während des Lebenszyklus der Software abgedeckt werden. Außerdem SOLLTE es ein geeignetes Entwicklungsmodell, ein Risikomanagement sowie Qualitätsziele enthalten."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor Projektbeginn wird gemeinsam mit dem Entwickler entschieden, ob z.B. nach Scrum oder einem V-Modell XT vorgegangen wird. Es wird ein Risikoregister für das Projekt angelegt. Qualitätsziele, wie z.B. Antwortzeitverhalten oder Code-Qualität, werden explizit definiert und dokumentiert. Die Qualifikation des Personals wird durch Prüfung von Lebensläufen oder Zertifikaten sichergestellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Projekt-Charta oder ähnliche Gründungsdokumente, um das vereinbarte Modell zu verifizieren. Es wird geprüft, ob ein Risikoregister und eine Liste mit Qualitätszielen existieren und ob diese Artefakte im Projektverlauf gepflegt werden. Die Qualifikationsnachweise des eingesetzten Personals werden stichprobenartig geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A5-m4",
                    "uuid": "ade2d807-48ee-4ec0-9993-4038b3c316e8",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Steuerungsprozess beinhaltet regelmäßige, formale Reviews von Sicherheitsmeilensteinen und Risikobewertungen. Die Ergebnisse dieser Reviews werden dokumentiert und fließen nachweislich in den weiteren Entwicklungsprozess ein."
                      },
                      {
                        "name": "guidance",
                        "value": "In regelmäßigen Abständen (z.B. einmal pro Monat) findet ein Security Review Meeting statt, in dem der Status der Sicherheitsanforderungen und das Risikoregister besprochen werden. Die Entscheidungen und neuen Aufgaben werden protokolliert und im Projektmanagement-Tool erfasst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Protokolle der Security Review Meetings der letzten Monate vorlegen. Es wird geprüft, ob die identifizierten Maßnahmen und Risiken im Projektmanagement-System nachverfolgt und umgesetzt wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A5-m5",
                    "uuid": "152ef208-9c50-433b-a6ab-42c8d24828e4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Steuerung wird durch ein Projektmanagement-Tool unterstützt, das sicherheitsrelevante Aufgaben, Risiken und Qualitätsmetriken automatisiert nachverfolgt. Es stellt den Stakeholdern Echtzeit-Dashboards zum Sicherheitsstatus des Projekts zur Verfügung."
                      },
                      {
                        "name": "guidance",
                        "value": "In Jira oder Azure DevOps werden spezielle Ticket-Typen für Sicherheitsanforderungen und Sicherheitsrisiken verwendet. Dashboards werden so konfiguriert, dass sie die Anzahl offener Sicherheitstickets pro Kritikalität, die Ergebnisse von Sicherheitsscans aus der CI/CD-Pipeline und den Status des Risikoregisters visualisieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer erhält Lesezugriff auf das Projektmanagement-Tool. Es wird die Konfiguration der Dashboards und der automatisierten Berichte analysiert. Es wird geprüft, ob die dargestellten Daten korrekt und aktuell sind und ob sie für die Projektsteuerung aktiv genutzt werden. Die Prüfung kann automatisiert erfolgen, indem die API des Tools abgefragt wird, um die Konformität der Prozesse zu verifizieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ae9410f0-2eb5-4266-a40a-82d578214596",
                "control-id": "DEV.4.11",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "TEST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.7.A8-m1",
                    "uuid": "41bb53b9-ece2-4b26-9ba5-9e252a99aea5",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Fachverantwortlichen werden erst unmittelbar vor der Inbetriebnahme durch eine Demonstration des fertigen Produkts einbezogen. Es finden keine Tests durch die Fachverantwortlichen statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Woche vor Go-Live wird eine Präsentation der Software gehalten. Feedback wird zwar entgegengenommen, kann aber in der Regel nicht mehr umgesetzt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch Befragung der Fachverantwortlichen fest, dass deren einzige Beteiligung eine Abschlusspräsentation war."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A8-m2",
                    "uuid": "5edad7f1-7d60-4515-acc2-ca6ec5c215bd",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Fachverantwortlichen werden am Ende des Entwicklungszyklus in formale Abnahmetests (User Acceptance Tests, UAT) einbezogen. Eine Beteiligung während der Entwicklung findet nicht statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Nachdem der Entwickler die Software als „fertig“ meldet, erhalten die Fachverantwortlichen eine Testversion und eine Liste von Testfällen, um die Software zu prüfen, bevor die finale Abnahme erfolgt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Protokolle der UAT vorlegen und verifiziert die Beteiligung der Fachverantwortlichen. Gleichzeitig wird festgestellt, dass es keine frühere Beteiligung im Entwicklungsprozess gab."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A8-m3",
                    "uuid": "58dc0c69-5a73-44ce-bc7b-aeced7d2dcae",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Fachverantwortliche SOLLTEN schon vor der endgültigen Abnahme frühzeitig an entwicklungsbegleitenden Tests der Software-Entwickelnden beteiligt werden. Dies SOLLTE in Abstimmung mit dem Auftragnehmenden bereits initial im Projektablaufplan berücksichtigt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Projektablaufplan werden feste Termine für Zwischen-Reviews oder Tests durch die Fachverantwortlichen eingeplant (z.B. am Ende jeder Entwicklungsphase oder nach Erreichen wichtiger Meilensteine). Die Fachverantwortlichen erhalten Zugang zu Testversionen der Software."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert den initialen Projektablaufplan auf geplante, frühzeitige Testaktivitäten mit den Fachverantwortlichen. Anhand von Protokollen oder Testberichten wird verifiziert, dass diese Tests tatsächlich stattgefunden haben."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A8-m4",
                    "uuid": "f39b3a62-c506-42d7-b787-b1297abb71a7",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Fachverantwortlichen werden kontinuierlich in den agilen Entwicklungsprozess einbezogen, beispielsweise durch Teilnahme an Sprint-Reviews. Sie haben permanenten Zugang zu einer Staging-Umgebung, um neue Funktionen zu testen, sobald diese entwickelt sind. Ihr Feedback wird formal erfasst und in nachfolgenden Sprints eingeplant."
                      },
                      {
                        "name": "guidance",
                        "value": "Am Ende jedes Sprints präsentieren die Entwickler die neuen Inkremente den Fachverantwortlichen. Das Feedback wird direkt in User Stories oder Bugs für das Backlog umgewandelt. Eine dedizierte Testumgebung wird nach jedem erfolgreichen Build automatisch aktualisiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer nimmt an einem Sprint-Review teil oder sichtet die Protokolle mehrerer solcher Meetings. Es wird im Backlog-Management-Tool geprüft, wie das Feedback der Fachverantwortlichen erfasst und in der Planung berücksichtigt wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A8-m5",
                    "uuid": "6d0aee66-a5e8-4af2-8a15-541f0fb7ad0f",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Automatisierte Akzeptanztests werden in Zusammenarbeit mit den Fachverantwortlichen unter Verwendung eines Frameworks wie Behavior-Driven Development (BDD) entwickelt. Diese Tests laufen automatisch in der CI/CD-Pipeline und geben sofortiges Feedback, ob neuer Code die fachlichen Anforderungen erfüllt."
                      },
                      {
                        "name": "guidance",
                        "value": "Fachverantwortliche schreiben oder validieren Testfälle in einer einfachen Sprache (z.B. Gherkin: „Given-When-Then“). Diese Spezifikationen werden von Entwicklern verwendet, um automatisierte Tests (z.B. mit Cucumber oder SpecFlow) zu implementieren. Die Ausführung dieser Tests ist ein obligatorischer Bestandteil der Build-Pipeline."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das Code-Repository auf BDD-Feature-Dateien und die dazugehörigen Test-Implementierungen. In der CI/CD-Pipeline wird geprüft, ob die Ausführung dieser Akzeptanztests obligatorisch ist. Es wird kontrolliert, ob ein Build fehlschlägt, wenn ein Akzeptanztest nicht erfolgreich ist."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e68cf3c5-c7c9-4c07-b572-b2ef72eb1095",
                "control-id": "DEV.5.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DLS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.7.A4-m1",
                    "uuid": "da632c29-8ef7-49e7-9c2d-b253de486575",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Beauftragung der Entwicklung erfolgt auf Basis einer informellen Anfrage oder einer kurzen Beschreibung des gewünschten Ergebnisses. Formale Anforderungsdokumente werden nicht verwendet."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein typisches Beispiel ist eine Beauftragung per E-Mail mit dem Inhalt „Bitte erstellen Sie ein Tool zur Erfassung von Arbeitszeiten“."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, dass dem Entwicklungsauftrag keine der formalen Anforderungsdokumente (Anforderungskatalog, Prozessanforderungen, Integrationsanforderungen) zugrunde lagen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A4-m2",
                    "uuid": "a606c1b6-7d0d-405d-8169-b5002d515f14",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Beauftragung basiert auf einem funktionalen Anforderungskatalog. Sicherheitsanforderungen an den Prozess oder die Systemintegration sind jedoch nicht Teil der Beauftragungsgrundlage."
                      },
                      {
                        "name": "guidance",
                        "value": "Dem Entwickler wird ein Lastenheft mit User Stories übergeben, aber keine der in A2 und A3 erstellten Sicherheitsdokumente."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die Beauftragungsunterlagen mit den existierenden Anforderungsdokumenten und stellt fest, dass der funktionale Anforderungskatalog verwendet wurde, die spezifischen Sicherheitsdokumente jedoch nicht."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A4-m3",
                    "uuid": "4801f4a0-ef3f-41e3-92f7-1750e3001046",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wird Individualsoftware durch die eigene Institution entwickelt oder extern beauftragt, dann MÜSSEN neben den bestehenden rechtlichen und organisatorischen Vorgaben insbesondere der Anforderungskatalog, die Sicherheitsanforderungen an den Prozess der Software-Entwicklung, sowie die Sicherheitsfunktionen zur Systemintegration als Grundlage zur Software-Entwicklung verwendet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle relevanten Anforderungsdokumente (funktionaler Katalog aus APP.6, Prozessanforderungen aus APP.7.A2, Integrationsanforderungen aus APP.7.A3) werden zu einem integralen Bestandteil der Ausschreibungsunterlagen bzw. des internen Projektauftrags gemacht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die vollständigen Vergabeunterlagen oder den internen Projektauftrag vorlegen. Es wird verifiziert, dass alle drei genannten Anforderungsdokumente explizit als Grundlage der Entwicklung aufgeführt und beigefügt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A4-m4",
                    "uuid": "a0eb1b3a-3ca6-420f-86da-dda3bfb48d51",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Beschaffungsprozess beinhaltet einen formalen Verifikationsschritt, bei dem die Angebote der potenziellen Auftragnehmer daraufhin überprüft werden, ob alle spezifizierten Sicherheitsanforderungen adäquat adressiert und verstanden wurden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine Bewertungsmatrix verwendet, in der für jede Sicherheitsanforderung geprüft wird, wie der Bieter diese umzusetzen plant. Angebote, die Sicherheitsanforderungen ignorieren oder unzureichend beschreiben, werden aus dem weiteren Verfahren ausgeschlossen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Protokolle des Vergabeverfahrens und die Bewertungsunterlagen. Es wird geprüft, ob eine systematische Bewertung der Sicherheitsaspekte in den Angeboten stattgefunden hat und wie das Ergebnis die Vergabeentscheidung beeinflusst hat."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A4-m5",
                    "uuid": "3d7b5a13-eddc-44c9-93e3-fefbfb89cbe3",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Vertrag mit dem Auftragnehmer enthält Konventionalstrafen für die Nichteinhaltung wesentlicher Sicherheitsanforderungen. Der Auftragnehmer wird vertraglich verpflichtet, die Einhaltung durch nachprüfbare Belege (z.B. Audit-Berichte Dritter, Ergebnisse von Penetrationstests, SAST/DAST-Protokolle) nachzuweisen."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Vertrag wird beispielsweise festgelegt: „Wird bei der Abnahme eine kritische Schwachstelle gemäß OWASP Top 10 gefunden, wird eine Vertragsstrafe in Höhe von X fällig. Der Auftragnehmer muss vor jeder Auslieferung einen unaufgeforderten SAST-Bericht vorlegen.“"
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet den finalen Vertrag und verifiziert die Existenz von Klauseln zu Vertragsstrafen und Nachweispflichten bezüglich der Sicherheit. Es wird stichprobenartig geprüft, ob die vereinbarten Nachweise (z.B. Testberichte) tatsächlich eingefordert und geprüft wurden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "9fa9a9be-0c17-4333-8545-95d40bcc9a8e",
                "control-id": "DEV.5.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BES",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.7.A7-m1",
                    "uuid": "7d17269a-1d7d-45a8-a0a3-e55e50406227",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Auftragnehmer für die Software-Entwicklung wird primär auf Basis der niedrigsten Kosten ausgewählt. Eine Bewertung der Sicherheitskompetenz des Auftragnehmers findet nicht statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Entscheidung fällt auf den günstigsten Anbieter, ohne dessen Referenzen oder Zertifizierungen im Bereich der sicheren Softwareentwicklung zu prüfen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Vergabeunterlagen und stellt fest, dass die Sicherheitskompetenz kein Kriterium im Bewertungs- und Entscheidungsprozess war."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A7-m2",
                    "uuid": "d4d9af09-c90a-4456-975a-1afb92ea6955",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Beschaffungsprozess bewertet die allgemeinen Fähigkeiten des Auftragnehmers. Dessen Sicherheitsexpertise ist jedoch kein primäres oder entscheidendes Auswahlkriterium. Öffentliche Ausschreibungen können hochrangige Architekturentscheidungen offenlegen."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Rahmen der Ausschreibung werden allgemeine Unternehmensinformationen und Referenzen abgefragt, aber keine spezifischen Nachweise für sichere Entwicklung. Die Leistungsbeschreibung in der öffentlichen Ausschreibung enthält möglicherweise Details zur geplanten Technologie."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass Sicherheit im Kriterienkatalog der Ausschreibung nur eine untergeordnete Rolle spielt. Es wird geprüft, ob die öffentliche Ausschreibung unnötigerweise sensible Informationen enthielt."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A7-m3",
                    "uuid": "7a0a2986-9f4f-4663-962e-601c0d14919e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Entwicklungsprojekt SOLLTE im Rahmen des hierfür bestens geeigneten Projektmanagementmodells beauftragt werden. Sicherheitsaspekte SOLLTEN dabei bereits bei der Ausschreibung und Vergabe berücksichtigt werden, sodass einerseits nur geeignete Auftragnehmende beauftragt werden, andererseits aber keine weitreichenden Rückschlüsse auf die Sicherheitsarchitektur durch die öffentlich verfügbaren Informationen möglich sind. In der Institution SOLLTEN definierte Prozesse und festgelegte Kontaktpersonen existieren, die sicherstellen, dass die jeweiligen Rahmenbedingungen berücksichtigt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Ausschreibung enthält Eignungskriterien zur Sicherheitskompetenz des Anbieters. Die Leistungsbeschreibung wird bewusst abstrakt gehalten, um keine Details der Sicherheitsarchitektur preiszugeben. Ein definierter Prozess stellt sicher, dass die Beschaffungsstelle mit dem Informationssicherheitsbeauftragten zusammenarbeitet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Ausschreibungsunterlagen auf Eignungskriterien zur Sicherheit und auf die Formulierung der Leistungsbeschreibung. Es wird geprüft, ob der definierte Abstimmungsprozess zwischen Beschaffung und Informationssicherheit nachweislich (z.B. durch Protokolle, E-Mails) stattgefunden hat."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A7-m4",
                    "uuid": "b9f0c898-7022-4a2b-b47d-f9776a1c56cd",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Beschaffungsprozess verlangt von potenziellen Auftragnehmern explizite Nachweise ihrer Sicherheitsexpertise. Dies können Zertifizierungen (z.B. ISO 27001) oder detaillierte Referenzen für vergleichbare Projekte zur sicheren Softwareentwicklung sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Als Eignungskriterium in der Ausschreibung wird gefordert: „Der Bieter muss eine gültige ISO 27001-Zertifizierung für den Geltungsbereich Softwareentwicklung nachweisen ODER mindestens zwei Referenzprojekte der letzten drei Jahre mit vergleichbarem Schutzbedarf benennen.“"
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert, ob die Eignungskriterien in der Ausschreibung entsprechende Nachweise fordern und ob die vorgelegten Nachweise des erfolgreichen Bieters geprüft und als valide bewertet wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A7-m5",
                    "uuid": "d5b6ad4f-9e93-4e1e-aa69-a213b44535f5",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird ein mehrstufiges Beschaffungsverfahren (z.B. Teilnahmewettbewerb) verwendet. Detaillierte Informationen zur Sicherheitsarchitektur werden erst nach einer Eignungsprüfung und Unterzeichnung einer Geheimhaltungsvereinbarung (NDA) an eine engere Auswahl von Bietern weitergegeben. Der endgültige Vertrag enthält spezifische Service Level Agreements (SLAs) zur Informationssicherheit."
                      },
                      {
                        "name": "guidance",
                        "value": "In der ersten Stufe werden nur allgemeine Informationen veröffentlicht und die Eignung der Bewerber geprüft. In der zweiten Stufe erhalten die qualifizierten Bieter nach Unterzeichnung eines NDA die detaillierte Leistungsbeschreibung. Der Vertrag enthält SLAs wie „Die Zeit zur Behebung von kritischen Schwachstellen beträgt maximal 48 Stunden.“"
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den gesamten Ablauf des Vergabeverfahrens und prüft die Dokumentation beider Stufen. Es wird der Vertrag auf die Existenz von Sicherheits-SLAs geprüft und stichprobenartig kontrolliert, ob deren Einhaltung im Betrieb überwacht wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "1d82811f-4b85-45d4-adac-9b8527c555e2",
                "control-id": "KONF.11.8",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DEV",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.7.A3-m1",
                    "uuid": "577ec312-03ea-49ee-9527-0745ca4fdde0",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird nur der allgemeine Zweck der Software beschrieben, ohne spezifische Anforderungen an die technische Plattform, Ressourcen oder Schnittstellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Anforderung lautet beispielsweise „Wir benötigen ein System zur Verwaltung von Kundendaten“, ohne Details zur Datenbank, zum Betriebssystem oder zur Anbindung an andere Systeme."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt anhand der Anforderungsdokumente fest, dass keine technischen Spezifikationen für die Einsatzumgebung oder Schnittstellen definiert wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A3-m2",
                    "uuid": "c41abc16-70ba-4eeb-a874-38889ce26425",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Zielplattform (z.B. „Windows Server mit IIS“) ist grob spezifiziert. Ressourcenbeschränkungen und detaillierte Schnittstellenanforderungen sind jedoch nur allgemein und nicht formal beschrieben."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird festgelegt, dass die Anwendung auf der vorhandenen Server-Infrastruktur laufen muss, aber ohne genaue Angaben zu verfügbarem RAM, CPU oder den exakten Versionen der Software-Stacks."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass die Zielplattform benannt ist, stellt aber fest, dass detaillierte, quantifizierbare Anforderungen an Ressourcen und Schnittstellen fehlen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A3-m3",
                    "uuid": "937a9131-2c05-48ba-b60d-f4be63079169",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der IT-Betrieb und die zuständigen Fachverantwortlichen MÜSSEN Anforderungen an die technische Einsatzumgebung der geplanten Individualsoftware erstellen und mit der Software-Entwicklung abstimmen. Aus den Anforderungen MUSS klar hervorgehen: auf was für einer Hardware-Plattform, auf was für einer Software-Plattform (inklusive gesamten Software-Stack), mit welchen zur Verfügung stehenden Ressourcen (z. B. CPU-Cluster oder Arbeitsspeicher), und mit welchen Schnittstellen mit anderen IT-Systemen oder Anwendungen die Anwendung eingesetzt werden soll sowie welche Sicherheitsfunktionen sich hieraus ergeben."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein technisches Zieldokument erstellt, das die genauen Versionen von Betriebssystem und Datenbank, die zugewiesenen vCPU-Kerne und RAM, die erforderlichen Netzwerkports und die Formate der Datenschnittstellen (z.B. REST-Endpunkte mit Beispieldaten) spezifiziert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich das Anforderungsdokument für die Einsatzumgebung vorlegen. Es wird geprüft, ob alle Aspekte (Hardware, Software-Stack, Ressourcen, Schnittstellen) klar und unmissverständlich definiert sind und ob die daraus resultierenden Sicherheitsfunktionen (z.B. Notwendigkeit der Authentisierung an einer Schnittstelle) abgeleitet wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A3-m4",
                    "uuid": "772e67a6-f7ad-4211-bfae-258a98bee35b",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Schnittstellen mit anderen IT-Systemen SOLLTEN in standardisierten technischen Formaten modelliert und definiert werden. Dies umfasst die Definition von Datenmodellen und Endpunkten."
                      },
                      {
                        "name": "guidance",
                        "value": "Für REST-APIs wird eine OpenAPI-Spezifikation (Version 3.x) erstellt. Für Webservices wird eine WSDL-Datei bereitgestellt. Diese Spezifikationen werden versioniert und als Teil der Anforderungsdokumentation verwaltet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Schnittstellenspezifikationen (z.B. OpenAPI/Swagger-Datei) an. Es wird geprüft, ob diese Spezifikationen vollständig, standardkonform und aktuell sind. Es kann geprüft werden, ob Code-Generatoren diese Spezifikationen fehlerfrei verarbeiten können."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.7.A3-m5",
                    "uuid": "e051d192-982f-4521-bad6-8c2d0409e7db",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Plattform- und Schnittstellenanforderungen sind als „Infrastructure as Code“ (z.B. mit Terraform, Ansible) und „Policy as Code“ (z.B. mit Open Policy Agent) definiert. Dies stellt eine automatisierte Validierung und die konsistente Bereitstellung der Einsatzumgebung sicher."
                      },
                      {
                        "name": "guidance",
                        "value": "Terraform-Skripte definieren die Ziel-VM inklusive Netzwerkkonfiguration. Ansible-Playbooks installieren und härten den Software-Stack. OPA-Regeln definieren die zulässige Kommunikation zwischen den Systemen. Diese Artefakte werden im Code-Repository der Anwendung mitverwaltet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die „Infrastructure as Code“- und „Policy as Code“-Skripte im Repository. Es wird geprüft, ob die produktive Umgebung nachweislich aus diesen Skripten erstellt wurde und ob die Skripte die definierten Sicherheitsanforderungen korrekt umsetzen. Ein automatisierter Audit kann die Konfiguration der Cloud-Umgebung mit dem im Repository definierten Zustand vergleichen."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}