{
  "component-definition": {
    "uuid": "864e6b38-0da1-422e-b2ae-2fbb58791df6",
    "metadata": {
      "title": "APP.4.3 Relationale Datenbanken - Benutzerdefiniert",
      "last-modified": "2025-11-15T16:31:49.917537+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "e4b30ae4-ac8c-4da3-a7ed-3779da82beb2",
        "type": "software",
        "title": "APP.4.3 Relationale Datenbanken",
        "description": "This component represents the implementation of all controls for Baustein APP.4.3.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Datenbanksysteme (DBS) sind ein oft genutztes Hilfsmittel, um IT-gestützt große Datensammlungen zu organisieren, zu erzeugen, zu verändern und zu verwalten. Ein DBS besteht aus dem so genannten Datenbankmanagementsystem (DBMS) und einer oder mehreren Datenbanken. Eine Datenbank ist eine Zusammenstellung von Daten samt ihrer Beschreibung (Metadaten), die dauerhaft im Datenbanksystem abgelegt werden. Da Datenbanksysteme oft eine zentrale Bedeutung in einer IT-Infrastruktur einnehmen, ergeben sich an sie wesentliche Sicherheitsanforderungen. Meist sind Kernprozesse einer Institution von den Informationen aus den Datenbanken abhängig. Dadurch ergeben sich entsprechende Verfügbarkeitsanforderungen. Zusätzlich bestehen oft hohe Anforderungen an die Vertraulichkeit und Integrität der in den Datenbanken gespeicherten Informationen."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es, relationale Datenbanksysteme sicher betreiben zu können sowie die Informationen, die in Datenbanken verarbeitet und gespeichert werden, angemessen zu schützen. Dazu werden Anforderungen beschrieben, mit denen sich Datenbanksysteme sicher planen, umsetzen und betreiben lassen und durch die Gefährdungen reduziert werden können."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein APP.4.3 Relationale Datenbanken ist auf jedes relationale Datenbanksystem einmal anzuwenden. In diesem Baustein werden Anforderungen an relationale Datenbanksysteme beschrieben. Sicherheitsanforderungen an nicht-relationale Datenbanksysteme sind nicht Gegenstand des vorliegenden Bausteins. Um die Informationen in den Datenbanken durchgängig zu schützen, sollten bereits in der Anwendungsentwicklung Sicherheitsanforderungen an den Aufbau der Datenbanktabellen und den Zugriff auf die Datenbank beachtet werden. Anforderungen zu diesen Themen werden jedoch nicht in diesem Baustein aufgeführt. Ebenso geht der Baustein nicht auf Gefährdungen und Anforderungen ein, die das Betriebssystem und die Hardware betreffen, auf denen das Datenbanksystem installiert ist. Aspekte dazu finden sich in den entsprechenden betriebssystemspezifischen Bausteinen der Schicht SYS IT-Systeme, z. B. SYS.1.3 Server unter Linux und Unix oder SYS.1.2.3 Windows Server. Relationale Datenbanksysteme sollten grundsätzlich im Rahmen der Bausteine OPR.4 Identitäts- und Berechtigungsmanagement, OPS.1.1.3 Patch- und Änderungsmanagement, CON.3 Datensicherungskonzept, OPS.1.2.2 Archivierung, OPS.1.1.5 Protokollierung sowie OPS.1.1.2 Ordnungsgemäße IT-Administration mit berücksichtigt werden."
          },
          {
            "name": "2.1. Unzureichende Dimensionierung der Systemressourcen",
            "value": "Verfügt die Hardware eines Datenbanksystems nicht über genügend Systemressourcen, kann die Datenbank ganz ausfallen oder fehlerhaft arbeiten. Dadurch können beispielsweise Daten nicht gespeichert werden. Auch können zu Stoßzeiten die Ressourcen stark ausgelastet werden. Dadurch kann sich die Performance verschlechtern. Dies wiederum kann dazu führen, dass Anwendungen nicht oder nicht fehlerfrei ausgeführt werden."
          },
          {
            "name": "2.2. Aktivierte Standard-Konten",
            "value": "Bei der Erstinstallation bzw. im Auslieferungszustand eines Datenbankmanagementsystems sind Standard-Konten (Konten der Benutzenden und Administrierenden) häufig nicht oder nur mit Passwörtern gesichert, die öffentlich bekannt sind. Dadurch kann es passieren, dass diese Konten missbräuchlich genutzt werden. Beispielsweise können sich Angreifende mit den öffentlich bekannten Anmeldedaten am Datenbankmanagementsystem als Benutzende oder sogar als Administrierende anmelden. Danach können sie die Konfiguration oder die gespeicherten Daten auslesen, manipulieren oder löschen."
          },
          {
            "name": "2.3. Unverschlüsselte Datenbankanbindung",
            "value": "In der Standardkonfiguration verbinden sich viele Datenbankmanagementsysteme unverschlüsselt mit den Anwendungen. Wird zwischen Anwendungen und Datenbankmanagementsystem unverschlüsselt kommuniziert, können übertragene Daten und Zugangsinformationen mitgelesen oder auf dem Transportweg manipuliert werden."
          },
          {
            "name": "2.4. Datenverlust in der Datenbank",
            "value": "Durch Hardware- oder Softwarefehler sowie durch menschliches Versagen können Daten in der Datenbank verloren gehen. Da in Datenbanken meist wichtige Informationen für Anwendungen gespeichert sind, können Dienste ausfallen oder ganze Produktionsprozesse stillstehen."
          },
          {
            "name": "2.5. Integritätsverlust der gespeicherten Daten",
            "value": "Durch falsch konfigurierte Datenbanken, Softwarefehler oder manipulierte Daten kann die Integrität der Informationen in der Datenbank verletzt werden. Wird dies nicht oder erst spät bemerkt, können Kernprozesse der Institution stark beeinträchtigt werden. Werden beispielsweise die Integritätsbeziehungen (referenzielle Integrität) zwischen den Tabellen nicht korrekt definiert, kann dies dazu führen, dass die Daten in der Datenbank fehlerhaft sind. Wird dieser Fehler erst im Produktivbetrieb oder gar nicht bemerkt, müssen nicht nur die inkonsistenten Daten aufwändig bereinigt und rekonstruiert werden. Es kann mit der Zeit auch ein großer Schaden entstanden sein, beispielsweise wenn es sich um kritische Daten, zum Beispiel steuerrelevante Daten, Rechnungsdaten oder gar um Steuerungsdaten für ganze Produktionssysteme handelt."
          },
          {
            "name": "2.6. SQL-Injections",
            "value": "Eine häufige Angriffsmethode auf Datenbanksysteme sind SQL-Injections. Greift eine Anwendung auf die Daten einer SQL-Datenbank zu, so werden Befehle in Form von SQL-Anweisungen an das DBMS übermittelt. Werden Eingabedaten innerhalb der Anwendung unzureichend validiert, können Angreifende eigene SQL-Befehle in die Anwendung einschleusen, die dann mit der Berechtigung des Dienstkontos der Anwendung bearbeitet werden. Angreifende können so Daten lesen, manipulieren, löschen, neue Daten hinzufügen oder auch Systembefehle aufrufen. Obwohl SQL-Injections primär die Anwendungen im Frontend betreffen, wirken sie sich auch erheblich auf das Datenbanksystem selbst und die damit verbundene Infrastruktur aus."
          },
          {
            "name": "2.7. Unsichere Konfiguration des Datenbankmanagementsystems",
            "value": "Häufig sind in der Standardkonfiguration des Datenbankmanagementsystems nicht benötigte Funktionen aktiviert, die es bei einem potenziellen Angriff erleichtern, Informationen aus der Datenbank auszulesen oder zu manipulieren. Beispielsweise können sich Angreifende aufgrund einer unveränderten Standardinstallation mit einer von der Institution nicht benutzten Programmierschnittstelle verbinden, um das DBMS zu administrieren, ohne sich dafür authentifizieren zu müssen. Dadurch können sie unerlaubt auf die Datenbanken der Institution zugreifen."
          },
          {
            "name": "2.8. Malware und unsichere Datenbank-Skripte",
            "value": "Bei vielen Datenbankmanagementsystemen ist es möglich, bestimmte Aktionen über Skripte zu automatisieren, die im Kontext der Datenbank ausgeführt werden, z. B. mithilfe der Procedural Language/Structured Query Language (PL/SQL). Dazu gehören unter anderem auch sogenannte Datenbanktrigger. Werden diese jedoch von den Zuständigen ungeprüft benutzt, könnten die Datenbankskripte nicht den Anforderungen an die Softwareentwicklung der Institution genügen. Ebenfalls können bei Angriffen Kernfunktionen einer Datenbank, wie z. B. Data Dictionary Tables manipuliert werden, beispielsweise mithilfe von Schadprogrammen oder Datenbank-Skripten. Diese Art von Angriffen ist nur schwer zu entdecken. Qualitätsmängel in diesen Skripten und Malware können sowohl die Vertraulichkeit als auch die Integrität und die Verfügbarkeit der in den Datenbanken abgelegten Daten gefährden."
          }
        ],
        "control-implementations": [
          {
            "uuid": "7f57c125-7352-4361-8eaa-ef3f2374bf8b",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/anwendungen_profile.json",
            "description": "Implementation for all controls in Baustein APP.4.3",
            "implemented-requirements": [
              {
                "uuid": "9f0af64f-af69-4116-b8d7-2692dd363d4e",
                "control-id": "ARCH.8.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.2.2-a12-m1",
                    "uuid": "6fbe3748-f461-4a15-bff0-75a7fdbe0d16",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Redundanz wird ausschließlich auf der Hardware-Ebene betrachtet, z.B. durch redundante Netzteile oder Festplatten (RAID). Es gibt keine Maßnahmen zur Hochverfügbarkeit auf Ebene des Betriebssystems oder der Anwendung."
                      },
                      {
                        "name": "guidance",
                        "value": "Beim Kauf von Servern wird auf redundante Komponenten geachtet, aber die vom Betriebssystem bereitgestellten Hochverfügbarkeitsfunktionen werden nicht genutzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer inspiziert die Hardware-Spezifikationen der Server. Es wird festgestellt, dass keine OS-Level-HA-Technologien wie Failover Clustering oder NLB konfiguriert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a12-m2",
                    "uuid": "17fd0c35-2288-46be-8c52-acb9a2fbdbd7",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Einfache Redundanzfunktionen wie NIC-Teaming (LBFO) zur Erhöhung der Netzwerkverfügbarkeit werden implementiert. Komplexere Hochverfügbarkeitstechnologien wie Failover Clustering werden jedoch auch dort nicht eingesetzt, wo sie zur Erfüllung der Verfügbarkeitsanforderungen notwendig wären."
                      },
                      {
                        "name": "guidance",
                        "value": "NIC-Teaming wird als Standard auf allen Servern mit mehreren Netzwerkadaptern konfiguriert. Eine Analyse, ob für bestimmte Dienste ein Failover Cluster erforderlich ist, findet nicht statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration des NIC-Teamings auf den Servern. Es wird kritische, nicht-redundante Dienste identifiziert, für die keine Hochverfügbarkeitslösung implementiert wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a12-m3",
                    "uuid": "c428e880-f850-4f1d-b50a-ac683a1d9029",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es muss eine dokumentierte Analyse durchgeführt werden, um zu bestimmen, welche nativen Windows Server-Hochverfügbarkeitsfunktionen (z. B. Failover Clustering, Network Load Balancing, DFS, NIC-Teaming) zur Erfüllung der definierten Verfügbarkeitsanforderungen geeignet sind. Die auf Basis der Analyse ausgewählten Funktionen müssen grundlegend konfiguriert sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Für jeden kritischen Dienst wird ein Service Level Agreement (SLA) hinsichtlich der Verfügbarkeit definiert. Auf dieser Basis wird in einem Konzept entschieden, welche HA-Technologie (z.B. Failover Cluster für eine SQL-Datenbank) eingesetzt wird. Die Installation und Basiskonfiguration dieser Technologie wird durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Analyse- und Konzeptdokumente an und vergleicht sie mit den definierten SLAs. Es wird geprüft, ob die ausgewählten HA-Technologien auf den entsprechenden Systemen installiert und grundsätzlich funktionsfähig sind, z.B. durch Abfrage des Cluster-Status (`Get-Cluster`)."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a12-m4",
                    "uuid": "1ab6c7e5-1850-4d68-a2fc-8be8f9c4a6f5",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Failover Clustering und/oder Network Load Balancing werden für kritische Dienste konsequent auf Basis der Analyse implementiert und optimiert. Für standortübergreifende Szenarien wird Distributed File System (DFS) für einen resilienten Dateizugriff genutzt. Für Außenstellen wird BranchCache aktiviert, um die Verfügbarkeit und Performance zu verbessern."
                      },
                      {
                        "name": "guidance",
                        "value": "Cluster-Quorum-Einstellungen werden optimiert und Cluster-Validierungstests werden regelmäßig durchgeführt. DFS-Namespaces und -Replikation werden für wichtige Dateifreigaben eingerichtet. BranchCache wird per GPO für die entsprechenden Server und Clients in den Außenstellen aktiviert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer auditiert die Konfiguration der Failover Cluster, einschließlich der Quorum-Einstellungen. Die DFS-Topologie wird überprüft. Die GPOs zur Konfiguration von BranchCache werden analysiert und es wird stichprobenartig geprüft, ob der Dienst auf den Zielsystemen läuft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a12-m5",
                    "uuid": "e8e9ed60-1a78-4586-bcee-82dbdea2babc",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine umfassende Hochverfügbarkeits- und Disaster-Recovery-Lösung wird implementiert, die potenziell mehrere Rechenzentren umspannt (z.B. ein Multi-Site-Cluster oder Stretch-Cluster). Die Funktionsfähigkeit der Lösung wird regelmäßig durch geplante, automatisierte Failover-Tests überprüft. Die Integrität des Clusters und der replizierten Daten wird kontinuierlich überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein Stretch-Failover-Cluster mit synchroner oder asynchroner Replikation (z.B. via Storage Replica oder Drittanbieter-Lösungen) eingerichtet. Automatisierte Testskripte werden entwickelt, die in regelmäßigen Abständen einen Failover simulieren und die Verfügbarkeit des Dienstes überprüfen. Monitoring-Tools überwachen permanent den Cluster-Zustand und die Replikationslatenz."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Architektur der Multi-Site-Lösung. Die Protokolle und Ergebnisse der automatisierten Failover-Tests werden angefordert und ausgewertet. Das Monitoring-Dashboard wird eingesehen, um den aktuellen Zustand des Clusters und der Replikation zu verifizieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c082fbeb-906e-4521-8c06-ac24a323fc81",
                "control-id": "BES.2.1.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.2.2-a1-m1",
                    "uuid": "56136088-528e-4201-9d16-f888b26e19bf",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Planung für den Einsatz von Windows Server 2012 erfolgt ad-hoc und unvollständig. Es wird sich typischerweise nur auf einzelne Aspekte wie die Hardwarebeschaffung konzentriert, während wichtige Entscheidungen zur Server-Edition, Active Directory-Integration oder zur Nutzung von Cloud-Diensten nicht getroffen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "In dieser Phase wird oft einfach ein Server bestellt, ohne eine formale Analyse der Softwareanforderungen durchzuführen. Die Entscheidungen werden von einzelnen Administratoren ohne formale Dokumentation oder Abstimmung getroffen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, ob überhaupt Planungsdokumente existieren. Durch Interviews mit den Administratoren wird ermittelt, ob die Entscheidungsfindung für den Servereinsatz systematisch oder spontan erfolgte."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a1-m2",
                    "uuid": "5bb487e3-83d4-4b7f-82a5-649a7df6a7c7",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Planung für den Einsatz von Windows Server 2012 wird durchgeführt. Die Hardwareanforderungen und die Server-Edition werden bestimmt. Der Planungsprozess ist jedoch nicht formell dokumentiert und Aspekte wie Cloud-Integration oder spezifische Sicherheitskonfigurationen werden nicht berücksichtigt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein einfaches Planungsdokument oder eine Checkliste wird verwendet. Die Spezifikation des Einsatzzwecks und die Einbindung ins Active Directory werden zwar angedacht, aber nicht detailliert ausgearbeitet oder formal genehmigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die grundlegenden Planungsdokumente an und prüft, ob die wesentlichen Aspekte (Hardware, Edition) abgedeckt sind. Es wird geprüft, ob die Entscheidungen nachvollziehbar sind, auch wenn keine formale Genehmigung vorliegt."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a1-m3",
                    "uuid": "a7abb8ac-98d0-43d2-af2d-28bf7d19d7ce",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Einsatz von Windows Server 2012 MUSS vor der Installation sorgfältig geplant werden. Die Anforderungen an die Hardware MÜSSEN vor der Beschaffung geprüft werden. Es MUSS eine begründete und dokumentierte Entscheidung für eine geeignete Edition des Windows Server 2012 getroffen werden. Der Einsatzzweck des Servers sowie die Einbindung ins Active Directory MÜSSEN dabei spezifiziert werden. Die Nutzung von ins Betriebssystem integrierten Cloud-Diensten MUSS grundsätzlich abgewogen und geplant werden. Wenn nicht benötigt, MUSS die Einrichtung von Microsoft-Konten auf dem Server blockiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für die Planung wird eine Vorlage verwendet, die alle in der Anforderung genannten Punkte abdeckt. Die Entscheidung für oder gegen Cloud-Dienste wird in einem Konzept dokumentiert. Die Blockierung von Microsoft-Konten kann über eine Gruppenrichtlinie (GPO) umgesetzt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Planungsdokumentation an. Es wird verifiziert, dass die Hardwareprüfung, die Editionsentscheidung, die Spezifikation des Einsatzzwecks und die Planung der AD-Einbindung dokumentiert sind. Es wird geprüft, ob eine dokumentierte Abwägung zu Cloud-Diensten existiert und ob die Blockierung von Microsoft-Konten (falls zutreffend) technisch umgesetzt wurde, z.B. durch Überprüfung der entsprechenden GPO-Einstellung."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a1-m4",
                    "uuid": "e8f3782f-46d5-4785-acad-e8292eaca18c",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Planungsprozess ist formalisiert, wird dokumentiert, überprüft und genehmigt. Der Plan enthält spezifische Vorgaben für die Basiskonfiguration und die Härtung des Systems. Die Entscheidung über die Nutzung von Cloud-Diensten basiert auf einer dokumentierten Risikoanalyse. Der gesamte Prozess wird versioniert."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Planungsprozess ist in das IT-Servicemanagement-System integriert. Vorlagen für Serverpläne werden zentral gepflegt. Die Ergebnisse der Planung, inklusive der Konfigurations-Baselines, werden in einem Konfigurationsmanagementsystem (CMS) hinterlegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die formalen Planungs- und Genehmigungsdokumente. Es wird geprüft, ob die Planung eine Risikoanalyse für Cloud-Dienste umfasst und ob die geplanten Konfigurationen eine nachvollziehbare Sicherheitsbaseline darstellen. Die Versionierung der Planungsdokumente wird ebenfalls stichprobenartig geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a1-m5",
                    "uuid": "e6cb1e39-49e9-4e4e-bf86-cee82e4f5d4b",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Planungsprozess ist vollständig in ein übergeordnetes Enterprise-Architecture-Management und Change-Management-Framework integriert. Die Planung berücksichtigt Lebenszyklus-, Disaster-Recovery- und Business-Continuity-Aspekte. Die Planungsdokumente sind lebende Dokumente, die bei Änderungen an der Systemlandschaft dynamisch angepasst werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Spezialisierte Tools für das Enterprise-Architecture-Management werden zur Planung und Visualisierung der Serverlandschaft eingesetzt. Kapazitätsplanung und Performance-Analyse sind feste Bestandteile des Planungsprozesses. Die Planung wird regelmäßig auditiert und verbessert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Integration des Planungsprozesses in die übergeordneten Management-Frameworks. Es wird geprüft, ob Disaster-Recovery-Pläne existieren und mit der Serverplanung konsistent sind. Durch die Analyse von Änderungsanträgen wird nachvollzogen, ob die Planungsprozesse bei Änderungen an der IT-Infrastruktur eingehalten und die Dokumente aktualisiert werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c6effc19-29c6-426b-9810-7340563ab552",
                "control-id": "DET.3.1.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.2.2-a11-m1",
                    "uuid": "0b3b0104-7214-43c2-8bb7-2a2402fbdab6",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Protokollierung auf den Servern ist mit den Standardeinstellungen aktiviert. Die Ereignisprotokolle werden nur lokal auf den Maschinen gespeichert und nur reaktiv nach einem Sicherheitsvorfall manuell ausgewertet."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden keine erweiterten Überwachungsrichtlinien konfiguriert. Die Größe der lokalen Ereignisprotokolle ist oft zu klein, was dazu führt, dass wichtige Informationen schnell überschrieben werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Konfiguration der Überwachungsrichtlinien (`auditpol /get /category:*`) und die Größe der Ereignisprotokolle auf einem Server und stellt fest, dass nur die Basiseinstellungen aktiv sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a11-m2",
                    "uuid": "7aea68b7-0833-49eb-b29b-d5a460f8678e",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wichtige sicherheitsrelevante Ereignisse werden zentral gesammelt, beispielsweise in einem Log-Aggregator. Es gibt jedoch keinen etablierten Prozess zur aktiven und regelmäßigen Analyse oder Alarmierung auf Basis dieser Daten."
                      },
                      {
                        "name": "guidance",
                        "value": "Windows Event Forwarding (WEF) oder ein Log-Agent wird verwendet, um die Sicherheits-Ereignisprotokolle an einen zentralen Server zu senden. Die gesammelten Daten werden primär zur Archivierung und für forensische Analysen vorgehalten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration der Protokollweiterleitung. Auf dem zentralen Log-Server wird geprüft, ob Protokolle von den Servern ankommen. Durch Interviews wird festgestellt, dass keine proaktive Auswertung der Protokolle stattfindet."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a11-m3",
                    "uuid": "69b76c4d-e04e-4550-b987-a0529435114c",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Sicherheitsrelevante Ereignisse müssen auf dem Server aktiviert und an ein zentrales Log-Management-System zur Sammlung und Auswertung weitergeleitet werden. Verschlüsselte Partitionen (z.B. mit BitLocker) müssen so konfiguriert sein, dass sie nach einer definierten Anzahl fehlgeschlagener Entsperrversuche gesperrt werden, um Brute-Force-Angriffe zu erschweren."
                      },
                      {
                        "name": "guidance",
                        "value": "Erweiterte Überwachungsrichtlinien werden per GPO konfiguriert und aktiviert. Die Protokolle werden an ein SIEM-System gesendet. Die BitLocker-Sperre nach fehlgeschlagenen Versuchen wird ebenfalls per GPO konfiguriert ('Standard user lockout')."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer auditiert die GPOs für die Überwachungsrichtlinien. Es wird geprüft, ob im SIEM Protokolle von den Servern ankommen. Die BitLocker-bezogenen GPO-Einstellungen zur Sperrung werden verifiziert. Automatisiert können die Überwachungsrichtlinien mit `auditpol` ausgelesen werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a11-m4",
                    "uuid": "4bb17a89-a612-4fa1-802e-251f30c9292a",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die im zentralen SIEM gesammelten Protokolle werden aktiv und automatisiert mithilfe von vordefinierten Korrelationsregeln analysiert, um verdächtige Aktivitäten und Angriffsmuster zu erkennen. Bei Ereignissen mit hoher Priorität werden automatisch Alarme an das Sicherheitsteam generiert. Die Protokollierung wird gehärtet, z.B. durch die Aktivierung von PowerShell Script Block Logging."
                      },
                      {
                        "name": "guidance",
                        "value": "Im SIEM werden Regeln implementiert, die z.B. auf fehlgeschlagene Anmeldeversuche von mehreren Quellen, die Erstellung neuer administrativer Konten oder das Löschen von Ereignisprotokollen prüfen. PowerShell Script Block Logging wird per GPO aktiviert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Korrelationsregeln im SIEM und deren Schwellenwerte. Die Konfiguration der Alarmierung wird geprüft. Es wird verifiziert, dass PowerShell Script Block Logging aktiv ist und die entsprechenden Ereignisse (ID 4104) generiert und weitergeleitet werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a11-m5",
                    "uuid": "3071ba73-844d-4392-a93c-8d34e8727bd9",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das SIEM nutzt fortschrittliche Analysemethoden und maschinelles Lernen (User and Entity Behavior Analytics - UEBA), um Anomalien und komplexe Angriffe zu erkennen. Die Angriffserkennung ist mit einem Security Orchestration, Automation and Response (SOAR) System integriert, um Bedrohungen automatisiert und in nahezu Echtzeit einzudämmen (z.B. durch Netzwerkisolation eines kompromittierten Servers). Das Sicherheitsteam führt regelmäßig proaktive Bedrohungssuchen (Threat Hunting) auf Basis der gesammelten Protokolldaten durch."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein SIEM mit UEBA-Modul wird eingesetzt. SOAR-Playbooks werden entwickelt, um auf spezifische Alarme zu reagieren, z.B. durch Ausführung von Skripten auf Firewalls oder auf dem betroffenen Endpunkt. Für das Threat Hunting werden Hypothesen auf Basis von Threat Intelligence aufgestellt und systematisch mit den verfügbaren Daten überprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer auditiert die Konfiguration des UEBA-Moduls und die SOAR-Playbooks. Es wird ein simulierter Angriff durchgeführt, um zu verifizieren, dass die automatisierte Reaktion wie erwartet funktioniert. Die Dokumentation und Ergebnisse der durchgeführten Threat-Hunting-Aktivitäten werden eingesehen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ac4a23b5-260e-4795-866d-eaf09f338849",
                "control-id": "DEV.2.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.2.2-a6-m1",
                    "uuid": "c093934c-39b1-49c5-8254-1c96acb5f6e3",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden ausschließlich Standard-Authentifizierungsmechanismen ohne zusätzliche Härtungsmaßnahmen verwendet. Privilegierte Konten sind nicht besonders geschützt."
                      },
                      {
                        "name": "guidance",
                        "value": "Authentifizierung erfolgt nur über Benutzername und Passwort. Es gibt keine Maßnahmen zum Schutz von Anmeldeinformationen im Arbeitsspeicher."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, dass keine der erweiterten Sicherheitsfunktionen wie LSA Protection oder die Gruppe 'Geschützte Benutzer' konfiguriert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a6-m2",
                    "uuid": "2125a60d-01dd-4978-aa39-d2a14b2b2a51",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der LSA-Schutz (Local Security Authority) ist auf den kritischsten Servern, wie z.B. Domänencontrollern, aktiviert, wird aber nicht universell auf allen Servern durchgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Registry-Schlüssel `HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Lsa` mit dem Wert `RunAsPPL` wird auf Domänencontrollern manuell oder über eine spezielle GPO gesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert den genannten Registry-Schlüssel auf Domänencontrollern und vergleicht dies mit der Konfiguration auf regulären Mitgliedsservern, um die inkonsistente Anwendung festzustellen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a6-m3",
                    "uuid": "74ffce6b-8b43-47d5-b0a5-f585d936fa58",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der PPL-Schutz (Protected Process Light) für den Local Credential Store (LSA) muss auf allen Servern aktiviert sein, um das Auslesen von Anmeldeinformationen aus dem Arbeitsspeicher zu erschweren."
                      },
                      {
                        "name": "guidance",
                        "value": "Der LSA-Schutz wird über eine Gruppenrichtlinie für alle Server der Domäne aktiviert. Dies geschieht durch Setzen des Registry-Schlüssels `HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Lsa` auf `RunAsPPL` = 1."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die relevanten Gruppenrichtlinien, um sicherzustellen, dass die Einstellung global erzwungen wird. Auf einem repräsentativen Server wird der Registry-Schlüssel überprüft. Automatisiert kann dies mittels PowerShell geprüft werden: `(Get-ItemProperty -Path 'HKLM:\\SYSTEM\\CurrentControlSet\\Control\\Lsa' -Name 'RunAsPPL').RunAsPPL -eq 1`."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a6-m4",
                    "uuid": "75163cab-1003-48e6-ab21-31ee35f0ea71",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zum LSA-Schutz werden auf Windows Server 2012 R2 alle Benutzerkonten mit erhöhten Rechten Mitglied der Sicherheitsgruppe „Geschützte Nutzer“ (Protected Users) gemacht. Für Dienstkonten werden nach Möglichkeit „Managed Service Accounts“ (MSAs) oder „group Managed Service Accounts“ (gMSAs) verwendet."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Prozess wird etabliert, um alle administrativen Konten (z.B. Domänen-Admins) der Gruppe 'Protected Users' hinzuzufügen. Bestehende Dienste, die mit Standard-Benutzerkonten laufen, werden identifiziert und auf die Verwendung von MSAs/gMSAs umgestellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Mitgliedschaften der Gruppe 'Protected Users' anzeigen und vergleicht diese mit der Liste der Administratoren. Die Konfiguration von Diensten auf Servern wird stichprobenartig geprüft, um die Verwendung von MSAs/gMSAs zu verifizieren. `Get-ADGroupMember -Identity 'Protected Users'` kann zur automatisierten Prüfung verwendet werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a6-m5",
                    "uuid": "1304f42a-d593-40fc-a1f7-4d778aacf0fe",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Kontrollen der vorherigen Stufen sind umgesetzt und automatisiert. Zusätzlich wird die Authentisierung für alle administrativen Zugriffe durch eine Multi-Faktor-Authentifizierung (MFA) gestärkt. Für die Autorisierung auf Dateiservern wird die dynamische Zugriffsteuerung (Dynamic Access Control, DAC) für eine feingranulare, attributbasierte Rechtevergabe genutzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine MFA-Lösung (z.B. Smartcards, Windows Hello for Business oder eine Drittanbieter-Lösung) wird für RDP- und PowerShell-Remoting-Zugriffe erzwungen. DAC wird konfiguriert, indem zentrale Zugriffsregeln und -richtlinien definiert und über Gruppenrichtlinien verteilt werden, die auf Benutzer- und Geräte-Claims basieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer auditiert die MFA-Konfiguration und testet einen administrativen Anmeldeversuch, um die MFA-Anforderung zu verifizieren. Die DAC-Konfiguration, einschließlich der definierten Claims und zentralen Zugriffsregeln, wird analysiert. Es wird praktisch auf einem Dateiserver getestet, ob der Zugriff gemäß der DAC-Richtlinien korrekt gewährt oder verweigert wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "dd169153-5dcb-47e4-b9df-b84a64f3802c",
                "control-id": "KONF.10.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.2.2-a4-m1",
                    "uuid": "34872d46-dd46-42c4-b919-873bd3f58131",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Härtung der Server-Systeme findet nur sporadisch und ad-hoc auf besonders kritischen Systemen statt. Es gibt keine konsistente Sicherheitsbaseline oder Vorlagen."
                      },
                      {
                        "name": "guidance",
                        "value": "Einzelne Administratoren ändern manuell einige Sicherheitseinstellungen, von denen sie wissen, ohne dass dies auf einem dokumentierten Standard basiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die Konfigurationen mehrerer Server und stellt signifikante Inkonsistenzen in den Sicherheitseinstellungen fest. Es kann keine Dokumentation zu einer Härtungsrichtlinie vorgelegt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a4-m2",
                    "uuid": "b3f0268b-f594-4b72-9b97-47461d245625",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird eine grundlegende Härtungs-Checkliste oder ein einfaches Skript verwendet. Dieses wird jedoch nicht konsequent auf alle Server angewendet oder regelmäßig aktualisiert, was zu Konfigurationsdrift führt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Basis-Sicherheitstemplate (z.B. aus dem Security Compliance Manager) wird bei der Ersteinrichtung angewendet, aber spätere Änderungen an der Vorlage werden nicht auf bestehende Systeme ausgerollt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Härtungs-Checkliste oder das Skript an. Anschließend wird auf mehreren älteren und neueren Servern geprüft, ob die Konfiguration der Vorlage entspricht, um Konfigurationsdrift festzustellen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a4-m3",
                    "uuid": "87df939b-73eb-4853-9f1d-cd0a9548f627",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Vor der Inbetriebnahme muss das System grundlegend gehärtet werden. Dafür müssen funktionsspezifische und institutionsweite Sicherheitsvorlagen erstellt, gepflegt und auf die Server ausgerollt werden. Dieser Prozess muss wiederholbar und dokumentiert sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Sicherheitsvorlagen werden als Gruppenrichtlinienobjekte (GPOs) erstellt und über Organisationseinheiten (OUs) im Active Directory an die entsprechenden Server zugewiesen. Es gibt eine Basis-GPO für alle Server und spezifische GPOs für verschiedene Serverrollen (z.B. Webserver, Datenbankserver)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die GPO-Struktur und die darin definierten Sicherheitsvorlagen. Mit Werkzeugen wie `gpresult` wird auf einem repräsentativen Server geprüft, ob die korrekten Richtlinien angewendet werden. Die Dokumentation der Vorlagen wird auf Aktualität und Vollständigkeit geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a4-m4",
                    "uuid": "82446f32-ca8d-4ed6-b4d2-d45641e88aef",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wesentliche Funktionen und Rollen werden auf verschiedene Server aufgeteilt, um die Angriffsfläche zu reduzieren. Der Internet Explorer wird nur in der 'Enhanced Security Configuration' und im 'Enhanced Protected Mode' genutzt. Die Anwendung der Sicherheitsvorlagen wird automatisiert und regelmäßig auf Konformität überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein dedizierter Server wird beispielsweise nur für die Rolle des Webservers genutzt und nicht gleichzeitig als Datenbankserver. Die IE-Einstellungen werden per GPO erzwungen. Die Konformität wird mittels Security Compliance Manager (SCM) oder Konfigurationselementen im System Center Configuration Manager (SCCM) überwacht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Server-Architektur auf eine sinnvolle Rollentrennung. Die GPOs für die IE-Härtung werden inspiziert. Berichte aus dem Überwachungstool (SCM/SCCM) werden angefordert, um die Konformitätsrate der Serverflotte zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a4-m5",
                    "uuid": "a3268c72-8936-4349-8b24-11ad17baf7ae",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Serverkonfiguration wird durch ein Desired State Configuration (DSC) Werkzeug verwaltet und erzwungen. Jegliche Abweichung von der gehärteten Baseline wird automatisch erkannt und entweder gemeldet oder sofort korrigiert. Die Konfigurationsbaseline basiert auf international anerkannten Benchmarks (z.B. CIS Benchmarks) und wird kontinuierlich auditiert und verbessert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird PowerShell DSC oder ein Drittanbieter-Tool wie Ansible, Puppet oder Chef eingesetzt. Die DSC-Konfigurationen werden in einem Git-Repository versioniert (Infrastructure as Code). Ein zentraler DSC-Pull-Server oder ein äquivalentes System wird für die Verteilung und Überwachung der Konfigurationen verwendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer auditiert die DSC-Konfigurationsskripte und deren Verwaltung im Repository. Das Dashboard des Konfigurationsmanagement-Tools wird eingesehen, um den Konformitätsstatus der gesamten Serverflotte zu überprüfen. Es wird getestet, ob eine manuelle, nicht autorisierte Konfigurationsänderung auf einem Server erkannt und korrigiert wird. Die automatische Prüfung kann durch `Test-DscConfiguration -Detailed` auf einem Zielknoten erfolgen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "9202ec91-d35a-468b-9cd3-46b6167b457c",
                "control-id": "KONF.10.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.2.2-a2-m1",
                    "uuid": "99bfeb39-10ba-4ff1-84e9-7fdbec9c878e",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Installation von Windows Server 2012 wird ohne Beachtung des Prinzips der minimalen Rechte durchgeführt. Es wird typischerweise die vollständige GUI-Version mit zahlreichen nicht benötigten Rollen und Features installiert. Ein Patching während der Installation findet nicht statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Installation erfolgt manuell über das Installationsmedium, wobei die Standardeinstellungen weitgehend übernommen werden. Die Auswahl der zu installierenden Komponenten erfolgt ohne vorherige Analyse des tatsächlichen Bedarfs."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer inspiziert eine Auswahl von Servern und vergleicht die Liste der installierten Rollen und Features mit dem tatsächlichen Einsatzzweck des Servers. Der Patch-Stand wird überprüft, um festzustellen, ob zeitnah zur Installation Patches eingespielt wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a2-m2",
                    "uuid": "2bb8938c-f1c4-48e1-91c8-4eb8d68efbd3",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei der Installation wird darauf geachtet, nur die benötigten Serverrollen und Features zu installieren. Das Einspielen von Patches erfolgt jedoch erst nach der abgeschlossenen Installation als separater Schritt. Die Entscheidung zwischen Server Core und der GUI-Variante wird nicht formal begründet."
                      },
                      {
                        "name": "guidance",
                        "value": "Administratoren verwenden eine Checkliste, um sicherzustellen, dass nur notwendige Rollen und Features während der manuellen Installation ausgewählt werden. Das System wird nach der Installation und vor der produktiven Inbetriebnahme mit dem zentralen Patch-Management-System verbunden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die installierten Rollen und Features auf ihre Notwendigkeit. Es wird anhand von Logs oder Tickets nachvollzogen, wie schnell das System nach der Installation gepatcht wurde. In Interviews wird nach der Begründung für die Wahl der Installationsvariante (Core/GUI) gefragt."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a2-m3",
                    "uuid": "3e389132-6a3a-439d-8f6d-54abcb070cf3",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es DÜRFEN KEINE anderen als die benötigten Serverrollen und Features bzw. Funktionen installiert werden. Wenn es vom Funktionsumfang her ausreichend ist, MUSS die Server-Core-Variante installiert werden. Andernfalls MUSS begründet werden, warum die Server-Core-Variante nicht genügt. Der Server MUSS bereits während der Installation auf einen aktuellen Patch-Stand gebracht werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Um Patches während der Installation einzuspielen (Offline Servicing), werden die Installationsmedien regelmäßig mit den neuesten Updates aktualisiert, beispielsweise mithilfe von DISM (Deployment Image Servicing and Management). Die Entscheidung für oder gegen Server Core wird pro Serverrolle in einem Konzept dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Liste der installierten Rollen und Features auf mehreren Systemen. Es wird die Dokumentation eingesehen, in der die Nutzung der GUI-Variante begründet wird. Es wird geprüft, ob der Prozess zum Aktualisieren der Installationsmedien etabliert ist und regelmäßig durchgeführt wird, z.B. durch Überprüfung der Zeitstempel der Installations-Images."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a2-m4",
                    "uuid": "f8c05f0f-be5f-48d4-a108-927298e55607",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Installationsprozess wird mithilfe von Antwortdateien (unattend.xml) oder Deployment-Skripten automatisiert, um Konsistenz sicherzustellen. Die Entscheidung für Server Core ist die dokumentierte Standardvorgabe, von der nur mit begründeter Ausnahme abgewichen wird. Eine initiale Sicherheitskonfiguration (Härtung) wird bereits während der Installation angewendet."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Tools wie der Windows Deployment Services (WDS) oder das Microsoft Deployment Toolkit (MDT) eingesetzt. PowerShell-Skripte werden verwendet, um nach der Basisinstallation automatisch Härtungseinstellungen anzuwenden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die verwendeten Antwortdateien oder Deployment-Skripte und prüft sie auf Korrektheit und Vollständigkeit. Es wird kontrolliert, ob die Server-Core-Variante der de-facto-Standard ist. Der Prüfer vergleicht die Konfiguration eines neu installierten Servers mit der definierten Härtungs-Baseline."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.2.2-a2-m5",
                    "uuid": "13b17820-bcd4-40a8-aab2-5a4229032d4a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die Bereitstellung wird eine vollständig automatisierte 'Golden Image'-Pipeline verwendet. Diese Images sind vorgehärtet, enthalten alle aktuellen Patches sowie minimale Rollen und werden vor der Freigabe automatisiert auf Schwachstellen gescannt. Die Verwendung von Server Core ist, wo technisch möglich, obligatorisch und Abweichungen erfordern einen formalen Genehmigungsprozess."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine CI/CD-Pipeline (z.B. mit Jenkins, Azure DevOps oder Packer) wird genutzt, um die Golden Images automatisch zu erstellen, zu patchen, zu testen und zu verteilen. Die Images werden in einer zentralen Artefakt-Registry versioniert und verwaltet. Die Konfiguration wird mittels Desired State Configuration (DSC) durchgesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer auditiert die CI/CD-Pipeline und die zugehörigen Skripte. Es wird verifiziert, dass automatisierte Sicherheits-Scans Teil der Pipeline sind und dass deren Ergebnisse nachverfolgt werden. Der Genehmigungsprozess für Abweichungen von der Server-Core-Richtlinie wird auf seine Wirksamkeit überprüft."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}