{
  "component-definition": {
    "uuid": "aefd8b82-59a2-4f14-9447-3e07e23e8427",
    "metadata": {
      "title": "OPS.2.2 Cloud-Dienste - Benutzerdefiniert",
      "last-modified": "2025-11-22T12:46:05.788144+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "a42b1448-f8ed-4bf7-bf37-5df83e082902",
        "type": "policy",
        "title": "OPS.2.2 Cloud-Dienste",
        "description": "This component represents the implementation of all controls for Baustein OPS.2.2.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Cloud Computing bezeichnet das dynamisch an den Bedarf angepasste Anbieten, Nutzen und Abrechnen von IT-Dienstleistungen über ein Netz. Angebot und Nutzung dieser Dienstleistungen erfolgen dabei ausschließlich über definierte technische Schnittstellen und Protokolle. Die Spannbreite der im Rahmen von Cloud Computing angebotenen Dienstleistungen umfasst das komplette Spektrum der Informationstechnik und beinhaltet unter anderem Infrastruktur (z. B. Rechenleistung, Speicherplatz), Plattformen und Software.<BR><BR>Cloud Computing bietet viele Vorteile: Die IT-Dienste können bedarfsgerecht, skalierbar und flexibel genutzt und je nach Funktionsumfang, Nutzungsdauer und Anzahl der Benutzenden abgerechnet werden. Auch kann auf spezialisierte Kenntnisse und Ressourcen der Cloud-Diensteanbietenden zugegriffen werden, wodurch interne Ressourcen für andere Aufgaben freigesetzt werden können. In der Praxis zeigt sich jedoch häufig, dass sich die Vorteile, die Institutionen von der Cloud-Nutzung erwarten, nicht vollständig auswirken. Die Ursache dafür ist meistens, dass wichtige kritische Erfolgsfaktoren im Vorfeld der Cloud-Nutzung nicht ausreichend betrachtet werden. Daher müssen Cloud-Dienste strategisch geplant sowie (Sicherheits-)Anforderungen, Verantwortlichkeiten und Schnittstellen sorgfältig definiert und vereinbart werden. Auch das Bewusstsein und Verständnis für die notwendigerweise geänderten Rollen, sowohl auf Seiten des IT-Betriebs als auch der Benutzenden der auftraggebenden Institution, ist ein wichtiger Erfolgsfaktor.<BR><BR>Zusätzlich sollte bei der Einführung von Cloud-Diensten auch das Thema Governance berücksichtigt werden (Cloud Governance). Kritische Bereiche sind beispielsweise die Vertragsgestaltung, die Umsetzung von Mandantenfähigkeit, die Sicherstellung von Portabilität unterschiedlicher Services, die Abrechnung genutzter Service-Leistungen, das Monitoring der Service-Erbringung, das Sicherheitsvorfallmanagement und zahlreiche Datenschutzaspekte."
          },
          {
            "name": "Zielsetzung",
            "value": "Der Baustein beschreibt Anforderungen, durch die sich Cloud-Dienste sicher nutzen lassen. Er richtet sich an alle Institutionen, die solche Dienste bereits nutzen oder sie zukünftig einsetzen wollen."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein OPS.2.2 Cloud-Nutzung ist immer auf eine konkrete Cloud-Dienstleistung anzuwenden. Nutzt eine Institution unterschiedliche Cloud-Diensteanbietende, so ist der Baustein für alle Cloud-Diensteanbietenden anzuwenden. Die Schnittstelle zwischen den Cloud-Diensteanbietenden ist ebenfalls Gegenstand des Bausteins und muss für alle Cloud-Dienstleistungen betrachtet werden.<BR><BR>In nahezu allen Bereitstellungsmodellen, abgesehen von der Nutzung einer Private Cloud On-Premise, stellen Cloud-Dienste eine Sonderform des Outsourcings (siehe Baustein OPS.2.3 Nutzung von Outsourcing) dar. Die im vorliegenden Baustein beschriebenen Gefährdungen und Anforderungen werden daher häufig auch im Outsourcing angewendet. Bei Cloud-Diensten gibt es jedoch einige Besonderheiten, die sich ausschließlich in diesem Baustein wiederfinden. Der Baustein OPS.2.3 Nutzung von Outsourcing ist daher nicht auf Cloud-Dienste anzuwenden.<BR><BR>Die in diesem Baustein beschriebenen Gefährdungen und Anforderungen gelten dabei grundsätzlich unabhängig vom genutzten Service- und Bereitstellungsmodell.<BR><BR>Sicherheitsanforderungen, mit denen Anbietende ihre Cloud-Dienste schützen können, sind nicht Gegenstand dieses Bausteins. Gefährdungen und spezifische Sicherheitsanforderungen, die durch die Anbindung eines Cloud-Dienstes über entsprechende Schnittstellen (englisch API, Application Programming Interface) als relevant anzusehen sind, werden ebenfalls nicht in diesem Baustein betrachtet.<BR><BR>Abgrenzung zum klassischen IT-Outsourcing<BR><BR>Beim Outsourcing werden Arbeits-, Produktions- oder Geschäftsprozesse einer Institution ganz oder teilweise zu externen Dienstleistenden ausgelagert. Dies ist ein etablierter Bestandteil heutiger Organisationsstrategien. Das klassische IT-Outsourcing ist meist so gestaltet, dass die komplette gemietete Infrastruktur exklusiv von einem Kunden oder einer Kundin genutzt wird (Single Tenant Architektur), auch wenn Anbietende von Outsourcing normalerweise mehrere Kunden oder Kundinnen haben. Zudem werden Outsourcing-Verträge meistens über längere Laufzeiten abgeschlossen.<BR><BR>Die Nutzung von Cloud-Diensten gleicht in vielen Punkten dem klassischen Outsourcing, aber es kommen noch einige Unterschiede hinzu, die zu berücksichtigen sind:<BR><BR>• Aus wirtschaftlichen Gründen teilen sich oft in einer Cloud mehrere Anwendende eine gemeinsame Infrastruktur.<BR>• Cloud-Dienste sind dynamisch und dadurch innerhalb viel kürzerer Zeiträume nach oben und unten skalierbar. So können Cloud-basierte Angebote rascher an den tatsächlichen Bedarf der Anwendenden angepasst werden.<BR>• Die in Anspruch genommenen Cloud-Dienste werden in der Regel mittels einer Webschnittstelle durch die Cloud-Anwendenden selbst gesteuert. So können sie automatisiert die genutzten Dienste auf ihre Bedürfnisse zuschneiden.<BR>• Durch die beim Cloud Computing genutzten Techniken ist es möglich, die IT-Leistung dynamisch über mehrere Standorte zu verteilen, die geographisch sowohl im In- als auch im Ausland weit verstreut sein können.<BR>• Die Anwendenden können die genutzten Dienste und ihre Ressourcen einfach über Web-Oberflächen oder passende Schnittstellen administrieren, wobei wenig Interaktion mit den Cloud-Diensteanbietenden erforderlich ist."
          },
          {
            "name": "2.1. Fehlende oder unzureichende Strategie für die Cloud-Nutzung",
            "value": "Cloud-Dienste in einer Institution einzusetzen, ist eine strategische Entscheidung. Durch eine fehlende oder unzureichende Strategie für die Cloud-Nutzung ist es z. B. möglich, dass sich eine Institution für ungeeignete Cloud-Dienste oder Cloud-Diensteanbietende entscheidet. Auch könnten die ausgewählten Cloud-Dienste mit der eigenen IT, den internen Geschäftsprozessen oder dem Schutzbedarf nicht kompatibel sein. Dies kann sich organisatorisch, technisch oder auch finanziell negativ auf die Geschäftsprozesse auswirken. Generell kann eine fehlende oder unzureichende Strategie für die Cloud-Nutzung dazu führen, dass die damit verbundenen Ziele nicht erreicht werden oder das Sicherheitsniveau signifikant sinkt."
          },
          {
            "name": "2.2. Abhängigkeit von Cloud-Diensteanbietenden (Kontrollverlust)",
            "value": "Nutzt eine Institution externe Cloud-Dienste, ist sie mehr oder weniger stark von den Cloud-Diensteanbietenden abhängig. Dadurch kann es passieren, dass die Institution die ausgelagerten Geschäftsprozesse und die damit verbundenen Informationen nicht mehr vollständig kontrollieren kann, insbesondere deren Sicherheit. Auch ist die Institution trotz möglicher Kontrollen ab einem gewissen Punkt darauf angewiesen, dass die Cloud-Diensteanbietenden Sicherheitsmaßnahmen auch korrekt umsetzen. Machen sie das nicht, sind Geschäftsprozesse und geschäftskritische Informationen unzureichend geschützt.<BR><BR>Zudem kann die Nutzung externer Cloud-Dienste dazu führen, dass in der Institution Know-how über Informationssicherheit und -technik verloren geht. Dadurch kann die Institution unter Umständen gar nicht mehr beurteilen, ob die von Anbietenden ergriffenen Schutzmaßnahmen ausreichend sind. Auch ein Wechsel der Cloud-Dienstleistung ist so nur noch sehr schwer möglich. Die Cloud-Diensteanbietenden könnten diese Abhängigkeit zum Beispiel auch ausnutzen, um Preiserhöhungen durchzusetzen oder die Dienstleistungsqualität zu senken."
          },
          {
            "name": "2.3. Mangelhaftes Anforderungsmanagement bei der Cloud-Nutzung",
            "value": "Wenn sich eine Institution dafür entscheidet, einen Cloud-Dienst zu nutzen, sind daran in der Regel viele Erwartungen geknüpft. So erhoffen sich Mitarbeitende beispielsweise eine höhere Leistungsfähigkeit oder einen größeren Funktionsumfang der ausgelagerten Dienste, während die Institutionsleitung auf geringere Kosten spekuliert. Ein mangelndes Anforderungsmanagement vor der Cloud-Nutzung kann jedoch dazu führen, dass die Erwartungen nicht erfüllt werden und der Dienst nicht den gewünschten Mehrwert, z. B. hinsichtlich der Verfügbarkeit, liefert."
          },
          {
            "name": "2.4. Verstoß gegen rechtliche Vorgaben",
            "value": "Viele Anbietende bieten ihre Cloud-Dienste in einem internationalen Umfeld an. Damit unterliegen sie oft anderen nationalen Gesetzgebungen. Häufig sieht die Cloud-Kundschaft nur die mit dem Cloud Computing verbundenen Vorteile (z. B. Kostenvorteile) und schätzt die rechtlichen Rahmenbedingungen falsch ein, wie z. B. Datenschutz, Informationspflichten, Insolvenzrecht, Haftung oder Informationszugriff für Dritte. Dadurch könnten geltende Richtlinien und Vorgaben verletzt werden. Auch die Sicherheit der ausgelagerten Informationen könnte beeinträchtigt werden."
          },
          {
            "name": "2.5. Fehlende Mandantenfähigkeit bei Cloud-Diensteanbietenden",
            "value": "Beim Cloud Computing teilen sich meistens verschiedene Institutionen eine gemeinsame Infrastruktur, wie z. B. IT-Systeme, Netze und Anwendungen. Werden beispielsweise die Ressourcen der verschiedenen Institutionen nicht ausreichend sicher voneinander getrennt, kann eine Institution eventuell auf die Bereiche einer anderen Institution zugreifen und dort Informationen manipulieren oder löschen."
          },
          {
            "name": "2.6. Unzulängliche vertragliche Regelungen mit Cloud-Diensteanbietenden",
            "value": "Aufgrund von unzulänglichen vertraglichen Regelungen mit Cloud-Diensteanbietenden können vielfältige und auch schwerwiegende Sicherheitsprobleme auftreten. Wenn Verantwortungsbereiche, Aufgaben, Leistungsparameter oder Aufwände ungenügend oder missverständlich beschrieben wurden, kann es passieren, dass die Cloud-Diensteanbietenden unbeabsichtigt oder aufgrund fehlender Ressourcen Sicherheitsmaßnahmen nicht oder nur ungenügend umsetzen.<BR><BR>Auch wenn Situationen eintreten, die nicht eindeutig vertraglich geregelt sind, können Nachteile für die auftraggebende Institution daraus resultieren. So nutzen Cloud-Diensteanbietende für ihre Services häufig die Dienste Dritter. Bestehen hier unzureichende vertragliche Vereinbarungen oder wurden die Abhängigkeiten zwischen den Dienstleistenden und Dritten nicht offengelegt, kann sich dies auch negativ auf die Informationssicherheit und die Serviceleistung der Institution auswirken."
          },
          {
            "name": "2.7. Mangelnde Planung der Migration zu Cloud-Diensten",
            "value": "Die Migration zu einem Cloud-Dienst ist fast immer eine kritische Phase. Durch mangelhafte Planungen können Fehler auftreten, die sich auf die Informationssicherheit innerhalb der Institution auswirken. Verzichtet eine Institution beispielsweise durch eine ungenügende Planungsphase leichtfertig auf eine stufenweise Migration, kann dies in der Praxis zu erheblichen Problemen führen. Gibt es im Vorfeld etwa keine Testphasen, Pilot-Benutzenden oder einen zeitlich begrenzten Parallelbetrieb von bestehender Infrastruktur und Cloud-Diensten, können wichtige Daten verloren gehen oder Dienste komplett ausfallen."
          },
          {
            "name": "2.8. Unzureichende Einbindung von Cloud-Diensten in die eigene IT",
            "value": "Es ist erforderlich, dass Cloud-Dienste angemessen in die IT-Infrastruktur der Institution eingebunden werden. Setzen die Zuständigen dies nur unzureichend um, kann es passieren, dass die Benutzenden die beauftragten Cloud-Dienstleistungen nicht in vollem Umfang abrufen können. Die Cloud-Dienste liefern so eventuell nicht die erforderliche und vereinbarte Leistung oder auf sie kann gar nicht oder nur eingeschränkt zugegriffen werden. Dadurch können Geschäftsprozesse verlangsamt werden oder ganz ausfallen. Werden Cloud-Dienste falsch in die eigene IT eingebunden, können auch schwerwiegende Sicherheitslücken entstehen."
          },
          {
            "name": "2.9. Unzureichende Regelungen für das Ende eines Cloud-Nutzungs-Vorhabens",
            "value": "Unzureichende Regelungen für eine mögliche Kündigung des Vertragsverhältnisses können gravierende Folgen für die Institution haben. Das ist erfahrungsgemäß immer dann besonders problematisch, wenn ein aus Sicht der Institution kritischer Fall unerwartet eintritt, wie beispielsweise die Insolvenz, der Verkauf der Cloud-Diensteanbietenden oder schwerwiegende Sicherheitsbedenken. Ohne eine ausreichende interne Vorsorge sowie genaue Vertragsregelungen kann sich die Institution nur schwer aus dem für die Cloud-Dienstleistung abgeschlossenen Vertrag lösen. In diesem Fall ist es schwierig bis unmöglich, den ausgelagerten Cloud-Dienst zeitnah beispielsweise auf eine andere Cloud-Computing-Plattform zu übertragen oder ihn wieder in die eigene Institution einzugliedern.<BR><BR>Auch kann eine unzureichend geregelte Datenlöschung nach Vertragsende dazu führen, dass unberechtigt auf die Informationen der Institution zugegriffen wird."
          },
          {
            "name": "2.10. Unzureichendes Administrationsmodell für die Cloud-Nutzung",
            "value": "Werden Cloud-Dienste genutzt, verändert sich häufig das Rollenverständnis innerhalb des IT-Betriebs auf Seiten der nutzenden Institution. So entwickeln sich Administrierende oft weg von der klassischen Systemadministration hin zu Service-Administration. Wird dieser Prozess nicht ausreichend begleitet, kann sich dies negativ auf die Cloud-Nutzung auswirken, etwa, wenn die Administrierenden nicht das nötige Verständnis für die Umstellungen mitbringen oder sie für ihre neue Aufgabe nicht oder nur unzureichend geschult sind. In der Folge sind eventuell die Cloud-Dienste nicht ordnungsgemäß administriert und so nur noch eingeschränkt verfügbar oder sie fallen ganz aus."
          },
          {
            "name": "2.11. Unzureichendes Notfallvorsorgekonzept",
            "value": "Eine unzureichende Notfallvorsorge hat bei der Cloud-Nutzung schnell gravierende Folgen. Wenn der Cloud-Dienst oder Teile hiervon ausfallen, führen Versäumnisse bei den Notfallvorsorgekonzepten bei Cloud-Diensteanbietenden sowie bei den Schnittstellen immer zu unnötig langen Ausfallzeiten mit entsprechenden Folgen für die Produktivität bzw. Dienstleistung der auftraggebenden Institution. Daneben können mangelhaft abgestimmte Notfallszenarien zwischen auftraggebender Institution und Dienstleistenden zu Lücken in der Notfallvorsorge führen."
          },
          {
            "name": "2.12. Ausfall der IT-Systeme der Cloud-Diensteanbietenden",
            "value": "Bei Cloud-Diensteanbietenden können die dort betriebenen Prozesse, IT-Systeme und Anwendungen teilweise oder ganz ausfallen, wovon folglich auch die Cloud-Kundschaft betroffen ist. Werden die Institutionen unzureichend voneinander getrennt, kann auch ein ausgefallenes IT-System, das nicht der Institution zugeordnet ist, dazu führen, dass diese Institution ihre vertraglich zugesicherte Dienstleistung nicht mehr abrufen kann. Ähnliche Probleme ergeben sich, wenn die Anbindung zwischen Cloud-Diensteanbietenden und -Kundschaft ausfällt oder wenn die genutzte Cloud-Computing-Plattform erfolgreich angegriffen wird."
          }
        ],
        "control-implementations": [
          {
            "uuid": "3c3e9b00-c3c6-4b03-99d4-b170d114da07",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Kompendien/Grundschutz%2B%2B-Kompendium/profile/cloud-dienste_profile.json",
            "description": "Implementation for all controls in Baustein OPS.2.2",
            "implemented-requirements": [
              {
                "uuid": "6f6338aa-97d0-42de-bd9c-deca2b6c1a11",
                "control-id": "BES.1.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GOV",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A1-m1",
                    "uuid": "7bf79baa-158c-4fd7-8a71-2273a1d25ce1",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine formale Strategie zur Cloud-Nutzung existiert nicht. Entscheidungen werden ad hoc und pro Einzelprojekt getroffen, meist basierend auf Kostenerwägungen, ohne systematische Betrachtung von Risiken, Chancen oder rechtlichen Rahmenbedingungen."
                      },
                      {
                        "name": "guidance",
                        "value": "In dieser Phase gibt es typischerweise keine dedizierten Dokumente. Die 'Strategie' lässt sich höchstens aus E-Mail-Verläufen oder Besprechungsprotokollen einzelner Projekte ableiten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer befragt die IT-Leitung und Projektverantwortliche, ob eine formale, verschriftlichte und freigegebene Cloud-Strategie existiert. Es wird geprüft, ob es ein zentrales Dokument gibt, das über einzelne Projekte hinausgeht."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A1-m2",
                    "uuid": "80c8d17b-200c-477f-9304-98bf1ed3eef6",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Strategie ist entworfen und dokumentiert. Sie benennt die primären Ziele (z.B. Flexibilisierung, Kostensenkung) und die bevorzugten Cloud-Dienste. Eine tiefergehende Machbarkeitsstudie oder eine umfassende Risikoanalyse fehlt jedoch noch."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein erstes Strategiedokument wird erstellt, oft im Rahmen einer IT-Abteilungsplanung. Es wird Microsoft Word oder ein Wiki-System verwendet, um die grundlegenden Ziele und den Anwendungsbereich festzuhalten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das Strategiedokument an und prüft, ob darin grundlegende Ziele und die vorgesehenen Dienste definiert sind. Es wird verifiziert, dass das Dokument mehr als nur eine lose Ideensammlung ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A1-m3",
                    "uuid": "a5242d8c-6268-4d9f-97bd-db2f026a1959",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Strategie für die Cloud-Nutzung MUSS erstellt werden. Darin MÜSSEN Ziele, Chancen und Risiken definiert werden, die die Institution mit der Cloud-Nutzung verbindet. Zudem MÜSSEN die rechtlichen und organisatorischen Rahmenbedingungen sowie die technischen Anforderungen untersucht werden. Die Ergebnisse dieser Untersuchung MÜSSEN in einer Machbarkeitsstudie dokumentiert werden. Es MUSS festgelegt werden, welche Dienste in welchem Bereitstellungsmodell zukünftig von Cloud-Diensteanbietenden bezogen werden sollen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Strategie wird als offizielles Dokument von der Institutionsleitung verabschiedet. Eine Machbarkeitsstudie wird durchgeführt, die eine Kosten-Nutzen-Analyse, eine grundlegende Risikoanalyse und die Prüfung der rechtlichen Konformität (insb. Datenschutz) umfasst. Ein Template für Machbarkeitsstudien kann hierbei helfen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die offizielle Cloud-Strategie und die zugehörige Machbarkeitsstudie vorlegen. Es wird geprüft, ob alle MUSS-Anforderungen erfüllt sind, insbesondere die Definition von Zielen, Chancen, Risiken und die Untersuchung der Rahmenbedingungen."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A1-m4",
                    "uuid": "4ba004b2-e97c-4374-aaff-22316e557195",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für den geplanten Cloud-Dienst SOLLTE eine grobe individuelle Sicherheitsanalyse durchgeführt werden. Diese SOLLTE wiederholt werden, wenn sich technische und organisatorische Rahmenbedingungen wesentlich verändern. Für größere Cloud-Projekte SOLLTE zudem eine Roadmap erarbeitet werden, die festlegt, wann und wie ein Cloud-Dienst eingeführt wird."
                      },
                      {
                        "name": "guidance",
                        "value": "Zusätzlich zur Strategie wird eine standardisierte Vorgehensweise zur Sicherheitsanalyse für neue Cloud-Dienste etabliert. Für strategische Cloud-Vorhaben wird eine Roadmap mit Meilensteinen, Zeitplan und Verantwortlichkeiten erstellt, z.B. mit Projektmanagement-Software wie Jira oder MS Project."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz und Anwendung von Sicherheitsanalysen für ausgewählte Cloud-Dienste. Bei größeren Projekten wird die Roadmap eingesehen und auf Plausibilität und Vollständigkeit geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A1-m5",
                    "uuid": "e1d0f84d-7f2b-4218-b031-b96d21194cfa",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Cloud-Strategie ist vollständig in die übergeordnete Unternehmens- und IT-Sicherheitsstrategie integriert und wird regelmäßig (mindestens jährlich) überprüft und aktualisiert. Die Sicherheitsanalysen sind ein fester, automatisierter Bestandteil des Onboarding-Prozesses für neue Cloud-Dienste. Die Roadmap wird durch KPIs zur Erfolgsmessung ergänzt und deren Einhaltung kontinuierlich überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Cloud-Strategie wird in einem Governance, Risk & Compliance (GRC) Tool verwaltet. Der Onboarding-Prozess für Cloud-Dienste wird durch einen Workflow automatisiert, der die Sicherheitsanalyse, die rechtliche Prüfung und die Genehmigung umfasst. Der Fortschritt der Roadmap wird über ein zentrales Dashboard visualisiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Integration der Cloud-Strategie in die Gesamtstrategie durch Einsicht in die entsprechenden Dokumente und Protokolle der Leitungsebene. Es wird die Funktionsweise des automatisierten Onboarding-Prozesses und die Existenz von KPIs und Monitoring-Berichten für die Roadmap überprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "fcb7b2f7-6bb1-4318-803e-21b3b0e91adf",
                "control-id": "BES.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "REAL",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A5-m1",
                    "uuid": "57f8276e-475f-4e12-ae4b-2479724c9663",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Migration erfolgt ohne formales Konzept ('Lift and Shift'). Technische und organisatorische Risiken werden nicht im Vorfeld bewertet, was häufig zu Ausfällen, Datenverlusten oder unerwarteten Kosten führt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Migration wird ad hoc von einem technischen Team durchgeführt. Es gibt keinen schriftlichen Plan, keine definierten Testphasen und keine Abstimmung mit den Fachbereichen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer befragt die Verantwortlichen zu einer abgeschlossenen Migration und bittet um das Migrationskonzept. Wenn kein solches Dokument existiert, ist dieser Reifegrad erreicht."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A5-m2",
                    "uuid": "a0b93108-d883-449d-8252-26f6302670d7",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein grundlegender Migrationsplan existiert. Er konzentriert sich primär auf die technischen Schritte (z.B. Reihenfolge der Servermigration, Datenübertragung). Organisatorische Aspekte wie Prozessanpassungen oder Schulungen werden nur am Rande erwähnt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein technischer Ablaufplan erstellt, z.B. in Form einer Checkliste oder eines einfachen Projektplans. Die Aufgabenverteilung beschränkt sich auf das technische Migrationsteam."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet den Migrationsplan und bewertet, ob er über eine rein technische Checkliste hinausgeht und zumindest grundlegende organisatorische Aspekte berücksichtigt."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A5-m3",
                    "uuid": "dfe14f84-bd2f-4ed0-a3ca-cc2a4c9d0146",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bevor zu einem Cloud-Dienst migriert wird, SOLLTE ein Migrationskonzept erstellt werden. Dafür SOLLTEN zunächst organisatorische Regelungen sowie die Aufgabenverteilung festgelegt werden. Zudem SOLLTEN bestehende Betriebsprozesse hinsichtlich der Cloud-Nutzung identifiziert und angepasst werden. Es SOLLTE sichergestellt werden, dass die eigene IT ausreichend im Migrationsprozess berücksichtigt wird. Auch SOLLTEN die Zuständigen ermitteln, ob die Mitarbeitenden auf Seiten der Institution zusätzlich geschult werden sollten."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein formales Migrationskonzept wird erstellt, das technische und organisatorische Aspekte umfasst. Es beinhaltet eine Analyse der zu migrierenden Systeme, eine Anpassungsplanung für die ITSM-Prozesse (Incident, Change, etc.), eine klare Aufgabenverteilung (RACI) und einen Plan zur Schulung der betroffenen Anwender und Administratoren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich das Migrationskonzept vorlegen. Es wird geprüft, ob alle in der Anforderung genannten SOLLTE-Aspekte (organisatorische Regelungen, Aufgaben, Prozessanpassung, Berücksichtigung der IT, Schulungsbedarf) adressiert werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A5-m4",
                    "uuid": "e56669af-b2a9-4a68-a792-5ad0bc43ee2d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Migrationskonzept wird um eine dedizierte Risikoanalyse für die Migrationsphase, einen detaillierten Zeit- und Ressourcenplan sowie einen expliziten Rollback-Plan ergänzt. Vor der produktiven Migration werden Testmigrationen und Funktionstests in einer separaten Umgebung durchgeführt."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Konzept wird um die Kapitel Risikoanalyse, Testmanagement und Notfallplanung (Rollback) erweitert. Es wird eine Testumgebung in der Cloud aufgebaut, um die Migration und die Funktionalität der Anwendung Ende-zu-Ende zu validieren, bevor der produktive Umzug stattfindet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das erweiterte Migrationskonzept und die Protokolle der durchgeführten Testmigrationen. Es wird geprüft, ob ein dokumentierter Rollback-Plan existiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A5-m5",
                    "uuid": "4ca17f12-df0d-406e-9188-93c971b34f76",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Migration wird mit spezialisierten, weitgehend automatisierten Werkzeugen durchgeführt (z.B. Cloud-native Migrationstools, Infrastructure-as-Code). Der gesamte Prozess wird engmaschig mit automatisierten Tools überwacht, um die Datenintegrität zu sichern und Performance-Engpässe oder Sicherheitsanomalien in Echtzeit zu erkennen. Nach der Migration erfolgt eine automatisierte Verifikation des Systemzustands."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Tools wie der AWS Database Migration Service oder Azure Migrate eingesetzt. Die Zielumgebung wird mittels Terraform oder ARM-Templates (IaC) definiert. Die Überwachung erfolgt durch Cloud-Monitoring-Dienste (z.B. CloudWatch, Azure Monitor) mit vordefinierten Alarmen. Post-Migration-Checks werden mit automatisierten Test-Skripten durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Konfiguration der Automatisierungswerkzeuge und die IaC-Skripte zeigen. Anhand der Logfiles und Monitoring-Dashboards wird der automatisierte Migrations- und Verifikationsprozess nachvollzogen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "92221a1a-ab9f-4a33-89f2-d1b67e029f1a",
                "control-id": "BES.2.1.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A6-m3",
                    "uuid": "e78d0379-4ddb-4d18-b1f0-3d1e547f5e0e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bevor ein Cloud-Dienst genutzt wird, SOLLTE sorgfältig geplant werden, wie er in die IT der Institution eingebunden wird. Hierfür SOLLTE mindestens geprüft werden, ob Anpassungen der Schnittstellen, der Netzanbindung, des Administrationsmodells sowie des Datenmanagementmodells notwendig sind. Die Ergebnisse SOLLTEN dokumentiert und regelmäßig aktualisiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für jeden neuen Cloud-Dienst wird ein Integrationskonzept erstellt. Dieses Dokument analysiert die vier genannten Bereiche (Schnittstellen, Netz, Administration, Datenmanagement) und beschreibt die notwendigen Änderungen an der bestehenden IT-Infrastruktur und den Prozessen. Die Dokumentation erfolgt in einem zentralen Wissensmanagementsystem (z.B. Confluence)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer wählt einen Cloud-Dienst aus und bittet um das zugehörige Integrationskonzept. Es wird geprüft, ob die vier genannten Bereiche analysiert und die Ergebnisse dokumentiert wurden. Zudem wird geprüft, ob ein Prozess zur regelmäßigen Aktualisierung existiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A6-m4",
                    "uuid": "a62940a2-2ea5-481e-9fb2-a2f51bb71f8c",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Planung der Einbindung umfasst zusätzlich die Integration in zentrale Sicherheitskomponenten wie Identitäts- und Access-Management (IAM), Security Information and Event Management (SIEM) und Backup-Lösungen. Die Konfiguration der Netzanbindung (z.B. VPN, Direct Connect) wird detailliert geplant und redundant ausgelegt."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Integrationskonzept wird um Kapitel zur Anbindung an das zentrale Azure AD / IAM, zur Log-Weiterleitung an das SIEM (z.B. Splunk oder Sentinel) und zur Integration in die zentrale Backup-Software (z.B. Veeam) erweitert. Es wird ein detailliertes Netzwerkdiagramm erstellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert im Integrationskonzept die Planung der Anbindung an zentrale Sicherheitskomponenten. Es wird die Konfiguration im IAM- und SIEM-System geprüft, um die tatsächliche Umsetzung zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A6-m5",
                    "uuid": "6e695566-7aa8-43f9-9c2b-8ac77a4aaf35",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Einbindung des Cloud-Dienstes erfolgt vollständig automatisiert mittels Infrastructure-as-Code (IaC) und Konfigurationsmanagement-Tools. Standardisierte Integrationsmuster (Blueprints) für verschiedene Arten von Cloud-Diensten werden vordefiniert und wiederverwendet, um eine konsistente und sichere Anbindung zu gewährleisten."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Terraform- oder CloudFormation-Templates für die Bereitstellung der Infrastruktur und Ansible-Playbooks für die Konfiguration verwendet. Diese Blueprints umfassen standardmäßig die Netzwerkintegration, IAM-Rollen, Logging- und Monitoring-Konfiguration. Die Blueprints werden in einem Git-Repository versioniert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die IaC-Templates und Blueprints im Git-Repository zeigen. Es wird nachvollzogen, wie ein neuer Dienst ausgerollt wird und ob dabei die standardisierten und sicheren Integrationsmuster zur Anwendung kommen. Eine automatisierte Prüfung kann durch statische Code-Analyse der IaC-Skripte erfolgen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "278bf9a2-a503-4e78-9404-7ee2c110244f",
                "control-id": "BES.3.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BES",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A8-m3",
                    "uuid": "13f2dcd3-a1c2-49d2-8cb1-786e619eb2f9",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Basierend auf der Service-Definition für den Cloud-Dienst SOLLTE ein detailliertes Anforderungsprofil für Cloud-Diensteanbietende erstellt werden. Eine Leistungsbeschreibung und ein Lastenheft SOLLTEN erstellt werden. Für die Bewertung von Cloud-Diensteanbietenden SOLLTEN auch ergänzende Informationsquellen herangezogen werden. Ebenso SOLLTEN verfügbare Service-Beschreibungen der Cloud-Diensteanbietenden sorgfältig geprüft und hinterfragt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein formaler Prozess zur Anbieterauswahl wird etabliert. Dieser beinhaltet die Erstellung eines Anforderungskatalogs (Lastenheft), der funktionale, technische, sicherheitstechnische und rechtliche Anforderungen enthält. Zur Bewertung werden neben den Anbieterdokumentationen auch Testberichte, Analysten-Ratings (z.B. Gartner) und Zertifizierungen (z.B. ISO 27001, C5) herangezogen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich für einen ausgewählten Cloud-Dienst die Dokumentation des Auswahlprozesses zeigen, inklusive Lastenheft und Bewertungsmatrix. Es wird geprüft, ob die Auswahl systematisch und auf Basis der definierten Anforderungen erfolgte."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A8-m4",
                    "uuid": "fd60b400-7c5e-4450-abf1-6c8ee9aeda86",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Auswahlprozess umfasst eine detaillierte Prüfung der vom Anbieter vorgelegten Zertifikate und Testate, inklusive einer genauen Analyse des Geltungsbereichs (Scope). Es wird ein Proof of Concept (PoC) oder eine Teststellung durchgeführt, um die zugesicherten Eigenschaften und die Eignung des Dienstes praktisch zu überprüfen."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor Vertragsabschluss werden die Zertifikate (z.B. ISO 27001) und Testate (z.B. BSI C5, SOC 2) angefordert und sorgfältig geprüft, ob der relevante Dienst und Standort im Scope enthalten sind. Ein PoC wird mit definierten Testfällen und Akzeptanzkriterien durchgeführt, um die Funktionalität und Sicherheit in der Praxis zu validieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Dokumentation der Zertifikatsprüfung und die Ergebnisse des Proof of Concept. Es wird geprüft, ob die Erkenntnisse aus dem PoC die Auswahlentscheidung nachvollziehbar untermauert haben."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A8-m5",
                    "uuid": "d98d2ee2-39a3-488d-ab4e-bfc2bd1878d9",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution führt ein kontinuierliches Anbietermanagement durch. Die Leistungsfähigkeit und die Sicherheitslage der Anbieter werden permanent überwacht und regelmäßig (mindestens jährlich) im Rahmen eines formalen Reviews bewertet. Die Ergebnisse fließen in die Entscheidung über die Weiterführung oder Beendigung der Vertragsbeziehung ein."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein GRC-Tool wird verwendet, um die Risikobewertung von Anbietern zu verwalten und nachzuverfolgen. Regelmäßige Service-Review-Meetings mit dem Anbieter werden abgehalten. Die Ergebnisse von Audits, neue Zertifizierungen und öffentliche Informationen zur Sicherheitslage des Anbieters werden kontinuierlich gesammelt und bewertet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Protokolle der Service-Review-Meetings und die Dokumentation des kontinuierlichen Anbietermanagements zeigen. Es wird geprüft, ob ein systematischer Prozess zur Überwachung und Neubewertung der Anbieter etabliert ist."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "800845ed-c6e7-487e-99c9-2176b13459fe",
                "control-id": "BES.4.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DLS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A9-m3",
                    "uuid": "2cc515e6-f7e9-4e7c-9def-5527ba1c730a",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die vertraglichen Regelungen zwischen der auftraggebenden Institution und den Cloud-Diensteanbietenden SOLLTEN in Art, Umfang und Detaillierungsgrad dem Schutzbedarf der Informationen angepasst sein. Es SOLLTE geregelt werden, an welchem Standort die Leistung erbracht wird. Zusätzlich SOLLTEN Eskalationsstufen und Kommunikationswege definiert werden. Auch SOLLTE vereinbart werden, wie die Daten sicher zu löschen sind. Ebenso SOLLTEN Kündigungsregelungen schriftlich fixiert werden. Die Cloud-Diensteanbietenden SOLLTEN alle Subunternehmen offenlegen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Standardverträge der Anbieter werden sorgfältig geprüft und, wo möglich, durch eigene Zusatzvereinbarungen (z.B. Auftragsverarbeitungsvertrag gemäß DSGVO, individuelle SLAs) ergänzt. Eine Checkliste wird verwendet, um sicherzustellen, dass alle in der Anforderung genannten Punkte (Standort, Eskalation, Löschung, Kündigung, Subunternehmer) vertraglich abgedeckt sind. Die Rechtsabteilung wird systematisch einbezogen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Verträge für einen ausgewählten Cloud-Dienst vorlegen. Anhand einer Checkliste wird geprüft, ob alle in der Anforderung genannten SOLLTE-Aspekte vertraglich geregelt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A9-m4",
                    "uuid": "530d72c9-26df-4d86-85a7-d871815e4217",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Vertrag enthält detaillierte und messbare Service Level Agreements (SLAs) für Verfügbarkeit, Performance und Support-Reaktionszeiten. Es werden explizite Regelungen zu Audit- und Kontrollrechten, zur Vorgehensweise bei Sicherheitsvorfällen (inkl. Meldefristen) und zur Unterstützung bei Auskunftsersuchen von Betroffenen oder Behörden vereinbart."
                      },
                      {
                        "name": "guidance",
                        "value": "Die SLAs werden so formuliert, dass sie messbar sind und bei Nichteinhaltung Vertragsstrafen (Pönalen) vorsehen. Die Auditrechte werden so gestaltet, dass sie eine wirksame Prüfung ermöglichen (z.B. Recht auf Einsicht in Auditberichte Dritter). Der Prozess zur Meldung und gemeinsamen Bearbeitung von Sicherheitsvorfällen wird detailliert im Vertrag beschrieben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet den Vertrag und prüft das Vorhandensein und die Qualität der Regelungen zu SLAs, Auditrechten und dem Management von Sicherheitsvorfällen. Es wird bewertet, ob diese Regelungen ausreichend konkret und durchsetzbar sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A9-m5",
                    "uuid": "644163df-86d3-4481-b3f0-852d95af5843",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Vertragsgestaltung berücksichtigt explizit Exit-Szenarien und stellt sicher, dass Daten und Konfigurationen in einem standardisierten, maschinenlesbaren Format extrahiert werden können, um einen Anbieterwechsel (Portabilität) zu erleichtern. Die Verträge werden regelmäßig, mindestens bei jeder Vertragsverlängerung, auf Basis der gesammelten Erfahrungen und geänderter rechtlicher oder technischer Rahmenbedingungen überprüft und neu verhandelt."
                      },
                      {
                        "name": "guidance",
                        "value": "In den Vertrag werden detaillierte Klauseln zur Exit-Unterstützung aufgenommen. Diese spezifizieren das Datenformat (z.B. SQL-Dump, JSON), die Fristen für die Datenbereitstellung und die Verpflichtung zur sicheren Löschung nach der Übergabe. Ein formaler Prozess für die Vertragsüberprüfung wird im Anbietermanagement etabliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer untersucht die vertraglichen Regelungen zum Vertragsende und zur Datenportabilität. Es wird geprüft, ob ein Prozess zur regelmäßigen Überprüfung und Anpassung der Verträge existiert und angewendet wird (z.B. durch Einsicht in die Verhandlungsprotokolle der letzten Vertragsverlängerung)."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "4f02fcb5-4ae3-4d34-bccb-c34bacaaa8d6",
                "control-id": "BES.4.6.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A18-m3",
                    "uuid": "a5396322-ea64-4b56-880a-9859775b60a9",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE geprüft werden, ob bei einem Cloud-Nutzungs-Vorhaben Verbunddienste (Federation Services) eingesetzt werden. Die Authentifizierung der Benutzer erfolgt über das zentrale Identity-Management-System der Institution (Single Sign-On)."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Cloud-Dienst wird an das zentrale Identitäts- und Access-Managementsystem (IAM), z.B. Microsoft Azure AD oder ein On-Premise ADFS, angebunden. Dies geschieht über Standardprotokolle wie SAML 2.0 oder OpenID Connect."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Konfiguration der Föderation im IAM-System und im Cloud-Dienst zeigen. Es wird geprüft, ob Benutzer sich nicht mehr mit lokalen Passwörtern am Cloud-Dienst anmelden, sondern über das zentrale IAM authentifiziert werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A18-m4",
                    "uuid": "c8b4371d-74ab-417b-adac-f35c131c4e6c",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE sichergestellt sein, dass in einem SAML (Security Assertion Markup Language)-Ticket nur die erforderlichen Informationen an die Cloud-Diensteanbietenden übertragen werden (Prinzip der Datenminimierung). Die Berechtigungen SOLLTEN regelmäßig, z.B. im Rahmen von Rezertifizierungskampagnen, überprüft werden. Der Zugriff auf den Cloud-Dienst wird durch Multi-Faktor-Authentifizierung (MFA) abgesichert."
                      },
                      {
                        "name": "guidance",
                        "value": "In der Konfiguration des IAM-Systems wird die Ausstellung der SAML-Token so konfiguriert, dass nur notwendige Attribute (z.B. Name, E-Mail, Gruppenmitgliedschaften) an den Cloud-Dienst übermittelt werden. MFA wird für alle Benutzer, die auf den Dienst zugreifen, erzwungen. Es werden jährliche Kampagnen zur Überprüfung der Zugriffsberechtigungen durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Konfiguration der Attributübermittlung im SAML-Ticket. Es wird geprüft, ob MFA für den Dienst erzwungen wird. Die Protokolle der letzten Berechtigungs-Rezertifizierungskampagne werden eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A18-m5",
                    "uuid": "50223c90-7c45-4a4c-9027-bbc6a4123c32",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zugriff wird über ein 'Conditional Access'-Framework gesteuert, das dynamisch den Kontext der Anfrage (z.B. Benutzer, Standort, Gerätetyp, Gerätezustand) bewertet, um den Zugriff zu gewähren oder zu verweigern (Zero Trust-Ansatz). Die Provisionierung und De-Provisionierung von Benutzerkonten und Berechtigungen im Cloud-Dienst erfolgt automatisiert (z.B. via SCIM)."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Richtlinien für den bedingten Zugriff (Conditional Access Policies) in Azure AD oder einem vergleichbaren System konfiguriert. Diese fordern z.B. MFA nur bei Zugriff von außerhalb des Unternehmensnetzes oder verweigern den Zugriff von nicht-konformen Geräten. Das 'System for Cross-domain Identity Management' (SCIM) wird konfiguriert, um Benutzer bei Eintritt oder Austritt automatisch im Cloud-Dienst an- oder abzulegen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die konfigurierten Conditional Access Policies zeigen und prüft deren Wirksamkeit anhand von Beispielszenarien. Es wird die Konfiguration der automatisierten Benutzerprovisionierung (SCIM) überprüft und nachvollzogen, wie ein neuer Mitarbeiter Zugriff erhält."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "9ac25a1a-806f-41ca-b3b4-ebbc7a837fa7",
                "control-id": "BES.4.6.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A17-m3",
                    "uuid": "ddb45409-6461-4e2d-81a6-a6f449abdb46",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wenn Daten durch Cloud-Diensteanbietende verschlüsselt werden, SOLLTE vertraglich geregelt werden, welche Verschlüsselungsmechanismen und welche Schlüssellängen eingesetzt werden dürfen. Es werden die Standard-Verschlüsselungsfunktionen der Cloud-Plattform genutzt (Encryption at Rest und in Transit)."
                      },
                      {
                        "name": "guidance",
                        "value": "In der Sicherheitsrichtlinie und im Vertrag werden Mindestanforderungen an die Verschlüsselung festgelegt (z.B. AES-256 für Daten im Ruhezustand, TLS 1.2 oder höher für die Übertragung). Es wird sichergestellt, dass die entsprechenden Standardoptionen beim Cloud-Anbieter (z.B. S3-Verschlüsselung, EBS-Verschlüsselung) für alle Ressourcen aktiviert sind."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Verträge auf entsprechende Klauseln und überprüft stichprobenartig in der Cloud-Management-Konsole, ob die Standard-Verschlüsselungsmechanismen für die genutzten Dienste aktiviert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A17-m4",
                    "uuid": "22354f28-4877-40d2-ac97-ecc068098657",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wenn eigene Verschlüsselungsmechanismen genutzt werden, SOLLTE ein geeignetes Schlüsselmanagement sichergestellt sein. Die Institution nutzt vom Anbieter bereitgestellte Key-Management-Systeme (KMS), um die Hoheit über die Schlüssel zu behalten (Customer-Managed Keys). Der Lebenszyklus der Schlüssel (Erstellung, Rotation, Vernichtung) wird aktiv verwaltet."
                      },
                      {
                        "name": "guidance",
                        "value": "Der native Key Management Service des Cloud-Anbieters (z.B. AWS KMS, Azure Key Vault) wird verwendet. Es werden kundenspezifische Schlüssel (CMK - Customer Master Key) erstellt und für die Verschlüsselung kritischer Daten verwendet. Richtlinien zur automatischen Schlüsselrotation (z.B. jährlich) werden konfiguriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Konfiguration des KMS zeigen. Es wird geprüft, ob Customer-Managed Keys verwendet werden und ob Richtlinien zur Schlüsselrotation aktiv sind. Die Zugriffsberechtigungen auf das KMS werden überprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A17-m5",
                    "uuid": "b35d5c1d-2143-4038-93ec-61939fc84f48",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für höchste Vertraulichkeitsanforderungen wird eine 'Bring Your Own Key' (BYOK) oder 'Hold Your Own Key' (HYOK) Strategie umgesetzt. Die Schlüssel werden in einem eigenen, On-Premise betriebenen Hardware-Sicherheitsmodul (HSM) erzeugt und verwaltet. Zusätzlich wird, wo technisch möglich, eine durchgehende Ende-zu-Ende-Verschlüsselung oder eine Verschlüsselung während der Verarbeitung (Confidential Computing) eingesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein On-Premise HSM wird beschafft und sicher betrieben. Über die BYOK-Funktion des Cloud-Anbieters werden die eigenen Schlüssel in das Cloud-KMS importiert. Alternativ wird bei HYOK die Ver- und Entschlüsselung clientseitig durchgeführt. Für rechenintensive Aufgaben mit sensiblen Daten werden Confidential-Computing-VMs (z.B. mit AMD SEV-SNP oder Intel TDX) genutzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Architektur und die Betriebsdokumentation des eigenen HSM zeigen. Es wird der Prozess des Schlüsselimports (BYOK) verifiziert. Die Konfiguration von Confidential-Computing-Diensten wird überprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "dca553dd-7522-49dd-b624-e6f2dd22c5f9",
                "control-id": "BES.4.8.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Audit",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "PERF",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A13-m3",
                    "uuid": "25649dd2-b494-43bd-ac70-9cfb03cf76c1",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE sich von den Cloud-Diensteanbietenden regelmäßig nachweisen lassen, dass die vereinbarten Sicherheitsanforderungen erfüllt sind. Der Nachweis SOLLTE auf einem international anerkannten Regelwerk basieren (z. B. IT-Grundschutz, ISO/IEC 27001, Anforderungskatalog Cloud Computing (C5), Cloud Controls Matrix der Cloud Security Alliance). Nutzen Cloud-Diensteanbietende Subunternehmen, SOLLTEN diese der Institution regelmäßig nachweisen, dass die Subunternehmen die notwendigen Audits durchführen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein Prozess etabliert, um jährlich die relevanten Zertifikate und Testate (z.B. ISO 27001, C5-Testat, SOC 2-Bericht) von den Cloud-Anbietern und deren wichtigen Subunternehmern anzufordern und zu archivieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Sammlung der aktuellen Zertifikate und Testate der genutzten Cloud-Anbieter zeigen. Es wird geprüft, ob diese regelmäßig eingefordert werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A13-m4",
                    "uuid": "d857dd0e-70f8-440e-a647-6a3cdeb6bf5b",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE die erhaltenen Nachweise (Zertifikate, Testate) sorgfältig prüfen. Dabei SOLLTE geprüft werden, ob der Geltungsbereich (Scope) des Nachweises die genutzten Cloud-Dienste, Standorte und Zeiträume abdeckt und ob der im Nachweis beschriebene Schutzbedarf mit dem eigenen Schutzbedarf übereinstimmt."
                      },
                      {
                        "name": "guidance",
                        "value": "Für jedes erhaltene Zertifikat und Testat wird eine dokumentierte Prüfung durchgeführt. Eine Checkliste hilft dabei, den Scope, die Gültigkeitsdauer und die Relevanz für die eigenen genutzten Dienste zu bewerten. Etwaige Abweichungen oder im Testat festgestellte Mängel werden bewertet und nachverfolgt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Dokumentation der Zertifikats- und Testatprüfung. Es wird nachvollzogen, ob eine inhaltliche Auseinandersetzung mit den Nachweisen stattgefunden hat und nicht nur eine reine Ablage der Dokumente."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A13-m5",
                    "uuid": "54f1a6d7-5851-4644-a0b6-cd38751e1cc5",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zur Prüfung externer Nachweise führt die Institution eigene, automatisierte Überprüfungen der Sicherheitskonfiguration auf Anbieterseite durch, soweit dies technisch möglich und vertraglich zulässig ist (z.B. mittels CSPM-Tools). Die Ergebnisse der externen und internen Prüfungen werden in einem zentralen GRC-Tool zusammengeführt, um eine ganzheitliche Risikobewertung des Anbieters zu ermöglichen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Ergebnisse der Anbieter-Audits (z.B. aus SOC 2 Berichten) und die eigenen technischen Überprüfungen (z.B. aus dem CSPM-Tool) werden im GRC-Tool erfasst. Dies ermöglicht ein kontinuierliches Monitoring der Anbieter-Compliance und eine risikobasierte Steuerung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich den Prozess im GRC-Tool zeigen. Es wird verifiziert, wie externe und interne Prüfergebnisse kombiniert werden, um ein umfassendes Bild der Sicherheitslage des Anbieters zu erhalten und wie auf festgestellte Risiken reagiert wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "33d9a712-76fe-40d3-915c-9b43862bb5ff",
                "control-id": "BES.4.9",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "PERS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A19-m3",
                    "uuid": "1db85ba9-f829-47ae-a15c-69a842ab0aef",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Mit externen Cloud-Diensteanbietenden SOLLTE vertraglich vereinbart werden, dass das eingesetzte Personal des Anbieters, das Zugriff auf die Daten der Institution hat, ausreichend qualifiziert und vertrauenswürdig ist."
                      },
                      {
                        "name": "guidance",
                        "value": "In den Vertrag mit dem Cloud-Anbieter wird eine Klausel aufgenommen, die den Anbieter verpflichtet, für die Sorgfalt bei der Auswahl, Schulung und Überwachung seiner Mitarbeitenden Sorge zu tragen. Der Anbieter sichert zu, dass nur vertrauenswürdiges Personal eingesetzt wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet den Vertrag mit dem Cloud-Anbieter und prüft, ob eine entsprechende Klausel zur Zuverlässigkeit und Qualifikation des Anbieterpersonals enthalten ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A19-m4",
                    "uuid": "e4842027-35bb-4ac5-abbc-ae8f421aedad",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Mit dem Cloud-Anbieter SOLLTEN gemeinsam Kriterien festgelegt werden, was unter qualifiziertem und vertrauenswürdigem Personal zu verstehen ist. Der Anbieter SOLLTE auf Anfrage nachweisen, dass seine Mitarbeitenden mit administrativen Rechten diese Kriterien erfüllen (z.B. durch Vorlage von Zertifikaten oder Bestätigung einer Hintergrundüberprüfung)."
                      },
                      {
                        "name": "guidance",
                        "value": "Als Anhang zum Vertrag werden die Kriterien für das Personal definiert. Dies kann die Forderung nach bestimmten technischen Zertifizierungen, regelmäßigen Sicherheitsschulungen und, je nach Schutzbedarf, die Vorlage eines polizeilichen Führungszeugnisses umfassen. Der Prozess zur Anforderung und Prüfung dieser Nachweise wird definiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die vertraglich vereinbarten Kriterien. Es wird stichprobenartig nachvollzogen, ob die entsprechenden Nachweise für administrative Mitarbeiter des Anbieters angefordert und geprüft wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A19-m5",
                    "uuid": "562606eb-4d60-4aa7-b501-69a3893c2825",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zugriff von Mitarbeitenden des Cloud-Anbieters auf die Systeme der Institution erfolgt ausschließlich nach dem 'Just-in-Time' (JIT) und 'Least Privilege'-Prinzip. Jeder administrative Zugriff wird explizit für einen begrenzten Zeitraum beantragt, genehmigt und vollständig protokolliert. Wo möglich, wird der Zugriff über 'Customer Lockbox'-Verfahren gesteuert, die eine explizite Freigabe durch die Institution für jeden einzelnen Zugriff erfordern."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Cloud-native Funktionen wie 'Azure AD Privileged Identity Management (PIM)' oder 'Customer Lockbox' (für Microsoft 365 oder Azure) bzw. 'Access Transparency' (für Google Cloud) eingesetzt. Der Prozess für die Anforderung, Genehmigung und Überwachung von privilegierten Zugriffen wird etabliert. Alle privilegierten Sitzungen werden aufgezeichnet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Konfiguration der PIM- oder Lockbox-Funktionen zeigen. Anhand der Audit-Logs wird der Genehmigungsprozess für einen privilegierten Zugriff des Anbieter-Supports nachvollzogen. Es wird geprüft, ob die Sitzungen aufgezeichnet und die Protokolle manipulationssicher aufbewahrt werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "b7ee2f3f-900c-4817-942a-a7ba986b8835",
                "control-id": "BES.5.13",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A16-m3",
                    "uuid": "6b25032e-ed53-468c-b2b5-717ce9db700f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE prüfen, ob zusätzlich zu den vertraglich festgelegten Datensicherungen der Cloud-Diensteanbietenden eigene Datensicherungen erstellt werden sollen. Dies kann die Kontrolle über die Daten erhöhen und vor Ausfällen oder Fehlern des Anbieters schützen."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Rahmen der Risikoanalyse für den Cloud-Dienst wird bewertet, ob die Backup-Leistungen des Anbieters ausreichend sind oder ob ein Restrisiko (z.B. Insolvenz des Anbieters, Ransomware-Angriff) die Erstellung eigener Backups erforderlich macht. Die Entscheidung wird dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Risikoanalyse und prüft, ob die Notwendigkeit eigener Backups bewertet und eine nachvollziehbare Entscheidung getroffen wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A16-m4",
                    "uuid": "2ab3b26d-3acc-4ca1-b20d-5274519e7c87",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wenn eigene Datensicherungen durchgeführt werden, SOLLTE die Institution detaillierte Anforderungen an einen Backup-Service erstellen. Die Backups SOLLTEN an einem vom primären Cloud-Anbieter unabhängigen Ort gespeichert werden (z.B. bei einem anderen Anbieter oder On-Premise). Die Wiederherstellung aus diesen Backups SOLLTE regelmäßig getestet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine Cloud-to-Cloud- oder Cloud-to-On-Premise-Backup-Lösung implementiert. Die Backup-Daten werden verschlüsselt an einem separaten, logisch und physisch getrennten Ort aufbewahrt. Regelmäßige Wiederherstellungstests stellen sicher, dass die Backups im Notfall auch nutzbar sind."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Architektur der eigenen Backup-Lösung und die Protokolle der Wiederherstellungstests zeigen. Es wird geprüft, ob die Backups an einem unabhängigen Ort gespeichert werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A16-m5",
                    "uuid": "404a22a6-6d92-4fb5-a0ff-5f88675c9ebd",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die eigene Datensicherung umfasst eine Point-in-Time-Recovery-Funktionalität und schützt die Backups durch Immutability (Unveränderbarkeit) oder Air-Gapping wirksam vor Ransomware-Angriffen. Der gesamte Backup- und Recovery-Prozess ist weitgehend automatisiert und wird kontinuierlich überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine Backup-Lösung eingesetzt, die unveränderliche Speicherung (Immutable Storage, z.B. in AWS S3 mit Object Lock) unterstützt. Dies verhindert, dass Ransomware die Backup-Daten verschlüsseln oder löschen kann. Die Überwachung des Backup-Prozesses ist in das zentrale Monitoring integriert und alarmiert bei Fehlern automatisch."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Konfiguration der Backup-Lösung zeigen und verifiziert die Einstellungen für die Unveränderbarkeit der Daten. Anhand der Monitoring-Logs wird die Zuverlässigkeit des automatisierten Backup-Prozesses überprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "6913bed8-5afa-4213-8d90-e9c299e744ba",
                "control-id": "BES.6.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Treatment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A15-m3",
                    "uuid": "2810f59d-025b-47cb-8e6e-38dd6857b672",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE alle technischen und organisatorischen Anforderungen definieren, die es ermöglichen, Cloud-Diensteanbietende zu wechseln oder den Cloud-Dienst bzw. die Daten in die eigene IT-Infrastruktur zurückzuholen. In den Verträgen mit den Cloud-Diensteanbietenden SOLLTEN Vorgaben festgehalten werden, mit denen sich die notwendige Portabilität gewährleisten lässt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein Dokument erstellt, das die Portabilitätsanforderungen definiert. Dies umfasst die Forderung nach offenen Standards, dokumentierten APIs und standardisierten Datenexportformaten. Diese Anforderungen fließen in die Vertragsverhandlungen (siehe A9) ein."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Dokument mit den Portabilitätsanforderungen und prüft in den Verträgen, ob diese Anforderungen rechtlich verankert wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A15-m4",
                    "uuid": "08437959-1406-4beb-b736-5a0312c640e8",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE regelmäßig, z.B. jährlich, Portabilitätstests durchführen. Dabei wird der Export von Daten und Konfigurationen in einem standardisierten, anbieterunabhängigen Format geübt und die Zeit für eine vollständige Wiederherstellung auf einer alternativen Plattform gemessen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Plan für jährliche Portabilitätstests wird erstellt. Für einen ausgewählten Dienst werden die Daten und Konfigurationen exportiert und es wird versucht, den Dienst auf einer alternativen Plattform (z.B. bei einem anderen Cloud-Anbieter oder On-Premise) wiederherzustellen. Die Durchführung und die Ergebnisse werden protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Pläne und Protokolle der durchgeführten Portabilitätstests zeigen. Es wird bewertet, ob die Tests aussagekräftig sind und ob die Erkenntnisse zur Reduzierung des Vendor-Lock-ins genutzt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A15-m5",
                    "uuid": "2f4e5667-029b-465b-b275-fed6be6752cd",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Portabilität wird durch eine aktive Multi-Cloud- oder Hybrid-Cloud-Strategie von vornherein sichergestellt. Anwendungen und Daten werden primär in containenbasierten Architekturen oder unter Verwendung von Infrastructure-as-Code (IaC) verwaltet, was einen schnellen und automatisierten Wechsel zwischen Anbietern ermöglicht. Portabilitätstests sind Teil der kontinuierlichen Integrations- und Deployment-Pipeline (CI/CD) und werden automatisiert ausgeführt."
                      },
                      {
                        "name": "guidance",
                        "value": "Anwendungen werden in Docker-Containern entwickelt und über Kubernetes orchestriert, das sowohl On-Premise als auch bei verschiedenen Cloud-Anbietern betrieben werden kann. Die Infrastruktur wird mit anbieterneutralen IaC-Tools wie Terraform verwaltet. CI/CD-Pipelines deployen die Anwendung testweise regelmäßig auf unterschiedlichen Zielplattformen, um die Portabilität kontinuierlich zu verifizieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Architektur (z.B. Kubernetes-Cluster), die IaC-Skripte (z.B. Terraform) und die CI/CD-Pipeline-Konfiguration zeigen. Es wird geprüft, ob die Architektur und die Werkzeuge tatsächlich einen anbieterunabhängigen Betrieb ermöglichen und ob die Portabilität automatisiert getestet wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "5eb909d3-5c30-4c06-b62c-d3db5f0774dc",
                "control-id": "BES.7.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "REAL",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A10-m3",
                    "uuid": "cd6e27c4-58ce-420d-b47a-9e6b45825f6a",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Migration zu einem Cloud-Dienst SOLLTE auf Basis des erstellten Migrationskonzeptes erfolgen. Während der Migration SOLLTE überprüft werden, ob das Sicherheitskonzept für die Cloud-Nutzung an potenzielle neue Anforderungen angepasst werden muss. Auch SOLLTEN alle Notfallvorsorgemaßnahmen vollständig und aktuell sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Migration wird als Projekt nach dem zuvor erstellten Konzept durchgeführt. Meilensteine werden überwacht. Vor dem Go-Live wird ein 'Change Freeze' für das Altsystem verhängt. Es wird überprüft, ob durch die Migration neue Risiken entstehen, die eine Anpassung des Sicherheitskonzeptes erfordern (z.B. neue öffentliche Schnittstellen)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Projekt- und Migrationsdokumentation zeigen. Es wird geprüft, ob die Migration gemäß dem Konzept erfolgte und ob die Sicherheits- und Notfallkonzepte im Zuge der Migration überprüft und ggf. angepasst wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A10-m4",
                    "uuid": "fc8ce376-58f2-414e-a2ef-7a8088ba92c6",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Migration zu einem Cloud-Dienst SOLLTE zunächst in einem Testlauf überprüft werden. Ist der Cloud-Dienst in den produktiven Betrieb übergegangen, SOLLTE abgeglichen werden, ob die Cloud-Diensteanbietenden die definierten Anforderungen der Institution erfüllen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Migration wird in einer Testumgebung vollständig durchgespielt (Generalprobe). Nach der produktiven Migration erfolgt eine formale Abnahme. Dabei wird anhand einer Checkliste, die auf dem Lastenheft und den vertraglichen Vereinbarungen basiert, geprüft, ob der Anbieter alle zugesicherten Leistungen und Sicherheitsanforderungen erfüllt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Protokolle des Testlaufs und der finalen Abnahme. Es wird geprüft, ob die Abnahme systematisch anhand der zuvor definierten Anforderungen erfolgte und ob Abweichungen dokumentiert und nachverfolgt wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A10-m5",
                    "uuid": "0947e3f9-be76-41b7-b7db-0b1aa3d53c7d",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Migration erfolgt in mehreren, gut geplanten Phasen (z.B. Pilotbetrieb mit einer kleinen Benutzergruppe, schrittweiser Rollout). Der Daten- und Konfigurationsabgleich zwischen altem und neuem System wird während der Migrationsphase automatisiert überwacht. Nach der Migration wird die Sicherheit der neuen Umgebung durch einen automatisierten Penetrationstest oder eine Schwachstellenanalyse validiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine stufenweise Migrationsstrategie (z.B. 'Canary Release' oder 'Blue-Green Deployment') angewendet. Automatisierte Skripte werden eingesetzt, um die Konsistenz der Daten während der Migration zu überprüfen. Nach Go-Live wird ein automatisierter Schwachstellenscan (z.B. mit Tenable oder Qualys) auf die neue Umgebung ausgeführt und die Ergebnisse werden bewertet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich den stufenweisen Migrationsplan und die Ergebnisse der automatisierten Konsistenzprüfungen zeigen. Die Berichte des nach der Migration durchgeführten Schwachstellenscans oder Penetrationstests werden eingesehen und bewertet."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "09621927-9f77-4cf3-be9c-248248d38c13",
                "control-id": "BES.7.4.10",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BES",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A3-m1",
                    "uuid": "26e1f927-8e6f-4c5f-9634-2c17fe5bde1b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt keine formale Definition der genutzten Cloud-Dienste. Die Kenntnis über den Funktionsumfang basiert allein auf der allgemeinen Produktbeschreibung des Anbieters."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Beschreibung der Dienste erfolgt ad hoc, oft nur mündlich. Es gibt keine zentrale, strukturierte Dokumentation."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fragt nach einer Liste und Definition der genutzten Cloud-Dienste. Es wird festgestellt, ob eine solche Dokumentation über die reine Nennung von Produktnamen hinausgeht."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A3-m2",
                    "uuid": "6fd2dd34-d64d-403c-bada-7de9ed71eef8",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die wichtigsten Cloud-Dienste existiert eine grundlegende Service-Beschreibung. Diese wird jedoch nicht systematisch für alle Dienste erstellt oder aktuell gehalten."
                      },
                      {
                        "name": "guidance",
                        "value": "In einem Wiki oder einer einfachen Liste werden die wesentlichen Cloud-Dienste mit ihrem Hauptzweck und den wichtigsten Funktionen stichpunktartig erfasst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die vorhandene Liste der Service-Beschreibungen und prüft stichprobenartig deren Aktualität und ob sie die grundlegenden Funktionen des Dienstes beschreibt."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A3-m3",
                    "uuid": "f8a3d4ac-e4cf-485a-a398-b5bc1b66d480",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für jeden Cloud-Dienst MUSS eine Service-Definition erarbeitet werden. Zudem SOLLTEN alle geplanten und genutzten Cloud-Dienste dokumentiert werden. Die Definition beschreibt den Service, seinen Funktionsumfang und seinen Einsatzzweck."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein standardisiertes Template für Service-Definitionen erstellt. Alle Cloud-Dienste werden in einem zentralen Verzeichnis (z.B. eine CMDB, ein Service-Katalog-Tool oder ein gepflegtes Wiki) erfasst und nach diesem Template beschrieben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich das Verzeichnis der Cloud-Dienste zeigen und prüft stichprobenartig, ob für jeden Dienst eine Service-Definition gemäß den Anforderungen existiert. Es wird geprüft, ob die Dokumentation vollständig ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A3-m4",
                    "uuid": "20326c04-2650-49dd-9603-8a937ddf00d5",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Service-Definition wird um detaillierte Informationen wie Service-Level-Ziele (SLOs), Abhängigkeiten von anderen Diensten, technische Schnittstellen und die verantwortlichen internen Ansprechpartner (Service Owner) erweitert."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Template für Service-Definitionen wird um Felder für SLOs, Abhängigkeiten und Service Owner erweitert. Diese Informationen werden systematisch für alle Dienste erfasst und gepflegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet ausgewählte Service-Definitionen und verifiziert, ob die erweiterten Informationen (SLOs, Abhängigkeiten, etc.) vorhanden, plausibel und aktuell sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A3-m5",
                    "uuid": "89246029-dd7b-4095-a876-124ad8840f6d",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Service-Definitionen sind vollständig in einem Service-Katalog-Tool oder einer CMDB integriert und mit dem Monitoring, dem Incident-Management und dem Change-Management-Prozess verknüpft. Die Dokumentation wird bei Änderungen an der Konfiguration oder den Schnittstellen automatisiert aktualisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Durch den Einsatz von Discovery-Tools und Infrastructure-as-Code (IaC) werden Abhängigkeiten und Konfigurationen automatisch erfasst und die CMDB/der Service-Katalog aktuell gehalten. Änderungen an Diensten erfordern einen formalen Change-Request, der auf die Service-Definition verweist."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Integration, indem er einen Change-Prozess für einen Cloud-Dienst nachvollzieht und prüft, ob die Service-Definition korrekt referenziert und aktualisiert wird. Es wird die Konfiguration der Automatisierungswerkzeuge eingesehen. Eine automatisierte Prüfung kann durch API-Abgleich zwischen IaC-Repository und CMDB erfolgen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "a202405b-5a52-43cc-896f-ff63f774dbd3",
                "control-id": "BES.7.4.6",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DLS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A4-m1",
                    "uuid": "def49bf9-b643-4af6-a94a-cb02db482fb0",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Verantwortlichkeiten sind unklar und nicht dokumentiert. Es herrscht die Annahme, dass der Cloud-Anbieter 'für alles verantwortlich' ist, oder es kommt zu Zuständigkeitskonflikten zwischen internen Teams."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt keine Dokumente wie RACI-Matrizen oder Prozessbeschreibungen. Zuständigkeiten werden im Bedarfsfall spontan geklärt, was zu Verzögerungen führt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fragt verschiedene Beteiligte (z.B. Entwickler, Betrieb, Informationssicherheit) nach ihren Verantwortlichkeiten im Zusammenhang mit einem Cloud-Dienst. Widersprüchliche oder unsichere Antworten deuten auf diese Reifegradstufe hin."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A4-m2",
                    "uuid": "c72729cd-67ab-4b2c-a418-c2f5dca4d121",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die grundlegende Abgrenzung der Verantwortlichkeiten basiert auf dem Standardmodell des Anbieters (Shared Responsibility Model), wurde aber nicht weiter detailliert oder auf interne Rollen heruntergebrochen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Verantwortungsmatrix des Cloud-Anbieters (z.B. für AWS oder Azure) ist bekannt und wird als Referenz verwendet. Eine spezifische Anpassung oder Detaillierung für die eigene Organisation fehlt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich zeigen, wie die Verantwortlichkeiten dokumentiert sind. Oft wird hier nur auf die Webseite des Cloud-Anbieters verwiesen, ohne eine eigene, institutionsspezifische Ausarbeitung."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A4-m3",
                    "uuid": "b0856e11-7e0a-4dae-8ee2-c390c9ff520e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Basierend auf der Service-Definition für Cloud-Dienste MÜSSEN alle relevanten Schnittstellen und Verantwortlichkeiten für die Cloud-Nutzung identifiziert und dokumentiert werden. Es MUSS klar erkennbar sein, wie die Verantwortungsbereiche zwischen Cloud-Diensteanbietenden und der auftraggebenden Institution voneinander abgegrenzt sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Für jeden Cloud-Dienst wird eine RACI-Matrix (Responsible, Accountable, Consulted, Informed) erstellt. Diese Matrix beschreibt detailliert die Aufgaben (z.B. Patching des Betriebssystems, Konfiguration der Firewall, Benutzerverwaltung) und weist die Verantwortlichkeiten den Rollen beim Cloud-Anbieter und in der eigenen Institution zu."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Dokumentation der Verantwortlichkeiten an (z.B. RACI-Matrix). Es wird geprüft, ob die Abgrenzung zwischen Anbieter und Institution klar und unmissverständlich für alle relevanten Aufgaben und Schnittstellen geregelt ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A4-m4",
                    "uuid": "4191d35d-618b-4dd5-8180-edc0fc623395",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die dokumentierten Verantwortlichkeiten und Schnittstellen werden regelmäßig, insbesondere bei Änderungen am Dienst, überprüft und aktualisiert. Die Prozessbeschreibungen für die Zusammenarbeit (z.B. bei Sicherheitsvorfällen, Supportanfragen) sind detailliert ausgearbeitet und den Beteiligten bekannt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die RACI-Matrix wird versioniert und ist Teil des jährlichen Review-Zyklus für den Cloud-Dienst. Wichtige Kooperationsprozesse werden als Flussdiagramme visualisiert und in der Prozessdokumentation abgelegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert den Review-Prozess für die Verantwortungsdokumentation. Anhand eines Beispielszenarios (z.B. Sicherheitsvorfall) wird geprüft, ob die Prozessbeschreibung klar und umsetzbar ist und die Schnittstellen korrekt definiert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A4-m5",
                    "uuid": "35f5a6f8-a5dd-4f5b-b16c-96554ec09821",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die definierten Verantwortlichkeiten sind technisch in den operativen Werkzeugen abgebildet. Tickets werden beispielsweise automatisch an die zuständigen internen oder externen Teams geroutet. Die Einhaltung der Prozesse an den Schnittstellen wird überwacht und durch Metriken bewertet."
                      },
                      {
                        "name": "guidance",
                        "value": "Im ITSM-Tool (z.B. ServiceNow, Jira Service Management) werden die Workflows so konfiguriert, dass sie den definierten Prozessen und Verantwortlichkeiten entsprechen. Eskalationspfade sind automatisiert. Die Performance an den Schnittstellen (z.B. Reaktionszeit des Anbieters) wird überwacht und im Service-Level-Reporting berücksichtigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Konfiguration der Workflows im ITSM-Tool zeigen. Anhand von Beispieltickets wird nachvollzogen, ob das Routing und die Eskalation den dokumentierten Verantwortlichkeiten entsprechen. Die Existenz von Metriken und Berichten zur Prozessperformance wird verifiziert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "32d82aec-67f4-4ce4-a9b9-cfa8952d6b8d",
                "control-id": "BES.8.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Improvement",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DLS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A14-m3",
                    "uuid": "e847314a-86ee-45d4-ac4f-687fbfa72783",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wenn das Dienstleistungsverhältnis mit den Cloud-Diensteanbietenden beendet wird, SOLLTE sichergestellt sein, dass dadurch die Geschäftstätigkeit oder die Fachaufgaben der Institution nicht beeinträchtigt wird. Die Verträge mit den Cloud-Diensteanbietenden SOLLTEN regeln, wie das jeweilige Dienstleistungsverhältnis geordnet aufgelöst werden kann."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein standardisierter Offboarding-Prozess für Cloud-Dienste definiert. Dieser Prozess stützt sich auf die vertraglichen Regelungen (siehe A9) und beschreibt die notwendigen Schritte, um einen Dienst geordnet zu beenden. Dazu gehört die Planung der Datenmigration zu einem Nachfolgedienst oder zurück in die eigene Infrastruktur."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich den definierten Offboarding-Prozess zeigen. Es wird geprüft, ob dieser die Aufrechterhaltung der Geschäftstätigkeit berücksichtigt und auf den vertraglichen Regelungen aufbaut."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A14-m4",
                    "uuid": "a4aba296-690a-483b-a65b-0f6ec28e1f5c",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Offboarding-Prozess umfasst einen detaillierten Plan für die Datenmigration, einschließlich der Überprüfung der Datenvollständigkeit und -integrität nach der Übertragung. Es muss sichergestellt werden, dass alle Daten (inklusive Backups) beim alten Anbieter nachweislich und sicher gelöscht werden. Der Anbieter muss hierfür eine Löschbestätigung ausstellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Offboarding-Plan enthält eine Checkliste für die Datenmigration (z.B. Einsatz von Hashing zur Integritätsprüfung) und eine Vorlage für die anzufordernde Löschbestätigung. Der Prozess stellt sicher, dass alle Benutzerkonten und Zugriffsberechtigungen beim alten Anbieter deaktiviert werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Bei einem abgeschlossenen Offboarding-Prozess lässt sich der Prüfer den Migrations- und Löschbericht, inklusive der Löschbestätigung des Anbieters, vorlegen. Es wird geprüft, ob die Datenintegrität verifiziert wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A14-m5",
                    "uuid": "1f86738d-250d-420f-9937-7476b6fb5e66",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Offboarding-Prozess wird regelmäßig im Rahmen von Portabilitätstests (siehe A15) geübt. Die Datenmigration und die De-Provisionierung der Ressourcen beim alten Anbieter erfolgen weitgehend automatisiert. Die sichere Löschung wird durch kryptografische Methoden (Crypto-Shredding) unterstützt, indem die verwendeten Schlüssel vernichtet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Automatisierte Skripte werden entwickelt, um Daten zu exportieren und Ressourcen beim Cloud-Anbieter (VMs, Speicher, etc.) kontrolliert abzubauen. Wo anwendbar, wird Crypto-Shredding als Teil der Löschstrategie eingesetzt. Die Erkenntnisse aus den Portabilitätstests fließen kontinuierlich in die Verbesserung des Offboarding-Prozesses ein."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Protokolle der Offboarding-Übungen und lässt sich die Automatisierungsskripte für die De-Provisionierung und Datenmigration zeigen. Es wird die Umsetzung der Crypto-Shredding-Strategie überprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "90e1cee5-ad61-4657-9b99-b290b92cfc2a",
                "control-id": "DLS.3.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "REAL",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A12-m3",
                    "uuid": "fbcc3a34-1251-4d8a-98d2-439fb266cd37",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle für die eingesetzten Cloud-Dienste erstellten Dokumentationen und Richtlinien SOLLTEN regelmäßig aktualisiert werden. Es SOLLTE außerdem periodisch kontrolliert werden, ob die vertraglich zugesicherten Leistungen erbracht werden. Auch SOLLTEN sich die Cloud-Diensteanbietenden und die Institution nach Möglichkeit regelmäßig abstimmen. Ebenso SOLLTE geplant und geübt werden, wie auf Systemausfälle zu reagieren ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein jährlicher Review-Prozess für alle Cloud-relevanten Dokumente (Konzepte, Richtlinien) etabliert. Regelmäßige Service-Review-Meetings (z.B. quartalsweise) mit dem Anbieter werden durchgeführt, um die Einhaltung der SLAs und die allgemeine Servicequalität zu besprechen. Notfallübungen werden geplant und durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Protokolle der Review-Meetings und der Notfallübungen zeigen. Es wird geprüft, ob ein Prozess zur Aktualisierung der Dokumentation existiert und ob dieser eingehalten wird (z.B. durch Überprüfung des Änderungsdatums der Dokumente)."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A12-m4",
                    "uuid": "31695243-54b6-4932-987f-e62f97fbe73b",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Sicherheit der Cloud-Umgebung wird proaktiv durch regelmäßige Schwachstellenscans und die Überwachung von Sicherheits-Logs überwacht. Ein definierter Prozess für das Patch- und Schwachstellenmanagement für die in der Cloud betriebenen Systeme wird etabliert und umgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Cloud-native oder Drittanbieter-Tools werden für regelmäßige Schwachstellenscans der Cloud-Workloads eingesetzt. Logs aus der Cloud-Umgebung werden an ein zentrales SIEM weitergeleitet und dort durch definierte Korrelationsregeln überwacht. Ein Patch-Management-Prozess stellt sicher, dass Sicherheitsupdates zeitnah eingespielt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Berichte der Schwachstellenscans und die Konfiguration der Log-Überwachung im SIEM. Anhand von Beispielen wird der Patch-Management-Prozess nachvollzogen und geprüft, ob Patches fristgerecht eingespielt wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A12-m5",
                    "uuid": "4b810e42-3b37-4e80-b2e5-1278c81d2e39",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Sicherheitskonfiguration der Cloud-Umgebung wird kontinuierlich und automatisiert durch ein Cloud Security Posture Management (CSPM) Tool überwacht. Abweichungen von der definierten Sicherheitsbaseline werden automatisch gemeldet und, wo möglich, selbstheilend korrigiert. Das Threat Hunting wird proaktiv betrieben, um Angriffe frühzeitig zu erkennen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein CSPM-Tool wird eingesetzt, um die Konfigurationen permanent mit Industriestandards (z.B. CIS Benchmarks) und eigenen Richtlinien abzugleichen. Automatisierte Runbooks (z.B. via AWS Lambda oder Azure Functions) werden genutzt, um bekannte Fehlkonfigurationen (z.B. offene S3-Buckets) automatisch zu beheben. Ein dediziertes Sicherheitsteam oder ein externer SOC-Dienstleister führt proaktives Threat Hunting in den Cloud-Logs durch."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich das Dashboard und die Konfiguration des CSPM-Tools zeigen. Es werden die Berichte über erkannte und behobene Abweichungen eingesehen. Die Prozesse und Ergebnisse des Threat Huntings werden überprüft. Eine automatisierte Prüfung kann durch API-Abfrage des CSPM-Tools erfolgen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "32617291-8d2e-4b05-979b-85bafd8bee8e",
                "control-id": "NOT.4.13",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "OPS.2.2.A11-m3",
                    "uuid": "33c17cd9-f00c-4543-8f35-f48aefac85ce",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die genutzten Cloud-Dienste SOLLTE ein Notfallkonzept erstellt werden. Es SOLLTE alle notwendigen Angaben zu Zuständigkeiten und Kontaktpersonen enthalten. Zudem SOLLTEN detaillierte Regelungen hinsichtlich der Datensicherung getroffen werden. Auch Vorgaben zu redundant auszulegenden Management-Tools und Schnittstellensystemen SOLLTEN festgehalten sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein spezifisches Notfallkonzept für den Cloud-Dienst wird als Ergänzung zum allgemeinen Notfallhandbuch der Institution erstellt. Es beschreibt Szenarien wie den Ausfall des Dienstes, den Ausfall der Internetanbindung oder den Verlust von Zugangsdaten. Es enthält Kontaktlisten, regelt die Datensicherung (was, wie oft, wo) und definiert, welche Komponenten (z.B. VPN-Gateway) redundant ausgelegt sein müssen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das Notfallkonzept für den Cloud-Dienst an und prüft, ob die in der Anforderung genannten Aspekte (Zuständigkeiten, Kontakte, Datensicherung, Redundanz) abgedeckt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A11-m4",
                    "uuid": "239d215a-dc00-469c-8d7d-8429288c0e4a",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Notfallkonzept wird um detaillierte Wiederanlaufpläne für spezifische Ausfallszenarien erweitert. Die Pläne beschreiben die notwendigen Schritte, die erforderliche Zeit und die verantwortlichen Personen. Die Funktionsfähigkeit der Datensicherung und der Wiederanlaufpläne wird regelmäßig, mindestens jährlich, getestet."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Notfallkonzept wird um schrittweise Anleitungen (Runbooks) für die Wiederherstellung ergänzt. Regelmäßig werden Wiederherstellungstests durchgeführt, bei denen Daten aus dem Backup in einer Testumgebung wiederhergestellt werden. Die Ergebnisse der Tests werden protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Wiederanlaufpläne und die Protokolle der durchgeführten Notfalltests und Wiederherstellungsübungen. Es wird geprüft, ob die Tests regelmäßig stattfinden und ob die Erkenntnisse zur Verbesserung der Pläne genutzt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "OPS.2.2.A11-m5",
                    "uuid": "5fc3b57e-e05e-4cc2-8df5-8ffab2313f29",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Hochverfügbarkeit wird durch den automatisierten Einsatz von Multi-Region- oder Multi-Cloud-Architekturen realisiert. Das Failover auf ein redundantes System erfolgt automatisiert und wird regelmäßig im Rahmen von 'Chaos Engineering'-Experimenten getestet, um die Resilienz des Gesamtsystems proaktiv zu überprüfen."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Dienst wird aktiv-aktiv über mehrere Verfügbarkeitszonen oder Regionen des Cloud-Anbieters betrieben. Das Failover wird durch Load Balancer und Health Checks automatisiert. Es werden Tools wie der 'Chaos Monkey' eingesetzt, um gezielt Störungen in der produktiven Umgebung zu simulieren und die automatischen Wiederherstellungsmechanismen zu testen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Architekturdiagramme und die Konfiguration der automatisierten Failover-Mechanismen zeigen. Die Protokolle und Ergebnisse der durchgeführten Chaos-Engineering-Tests werden eingesehen, um die Robustheit des Systems zu verifizieren."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}