{
  "component-definition": {
    "uuid": "1c1e4547-3373-407f-adbb-42795dde60af",
    "metadata": {
      "title": "APP.4.9 Dateiserver - Benutzerdefiniert",
      "last-modified": "2025-11-22T12:46:08.311941+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "8745b7bb-c289-4dde-aa04-b6d00db56245",
        "type": "software",
        "title": "APP.4.9 Dateiserver",
        "description": "This component represents the implementation of all controls for Baustein APP.4.9.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Objektbasierte Speicherlösungen (Object Storage) sind ein zentraler Baustein moderner IT-Architekturen, insbesondere in Cloud-Umgebungen (z. B. S3-kompatible Dienste) und in großen On-Premises-Infrastrukturen (z. B. mit Ceph oder OpenStack Swift). Im Gegensatz zu traditionellen Datei- oder Blockspeichern organisieren sie Daten als einzelne Objekte in flachen Hierarchien, sogenannten Buckets. Jedes Objekt besteht aus den eigentlichen Daten, einer eindeutigen ID und Metadaten.<BR>Der Zugriff auf Objektspeicher erfolgt ausschließlich über programmatische Schnittstellen (APIs), typischerweise über HTTP. Diese API-zentrierte Natur und ein sehr flexibles Berechtigungsmodell sind Stärken, aber auch die Quelle spezifischer Risiken. Eine einzige Fehlkonfiguration in einer Bucket-Richtlinie kann dazu führen, dass Terabytes an sensiblen Daten ungeschützt im Internet stehen. Die Sicherheit von Objektspeichern hängt daher entscheidend von der korrekten Konfiguration der Zugriffsrichtlinien und der Absicherung der API-Endpunkte ab."
          },
          {
            "name": "Zielsetzung",
            "value": "Dieser Baustein zeigt einen systematischen Weg auf, um objektbasierte Speicherlösungen sicher zu konfigurieren und zu betreiben. Ziel ist es, die Vertraulichkeit, Integrität und Verfügbarkeit der gespeicherten Objekte zu gewährleisten. Schwerpunkte sind die rigorose Kontrolle von Zugriffsberechtigungen auf Bucket- und Objektebene, die durchgängige Verschlüsselung der Daten, die Absicherung der API-Kommunikation und das lückenlose Logging aller Zugriffe."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein APP.4.9 ist auf alle eingesetzten objektbasierten Speicherlösungen anzuwenden.<BR>Dieser Baustein konkretisiert die allgemeinen Anforderungen aus APP.4.4 Speicherlösungen für den spezifischen Fall des Objektspeichers. Er behandelt nicht die Absicherung der zugrundeliegenden Server-Infrastruktur bei On-Premises-Lösungen (siehe OPS.1.1-Bausteine). Bei der Nutzung von Cloud-Diensten sind zusätzlich die Anforderungen aus OPS.2.3 Nutzung von Cloud-Diensten zu beachten."
          },
          {
            "name": "Unbeabsichtigte Veröffentlichung von Daten durch öffentliche Buckets",
            "value": "Dies ist eine der häufigsten und schwerwiegendsten Schwachstellen bei Objektspeichern. Durch eine fehlerhafte Konfiguration der Zugriffsrichtlinien (ACLs oder Bucket Policies) wird ein Bucket für die gesamte Welt lesbar oder sogar beschreibbar. Dies führt zur vollständigen Offenlegung aller darin enthaltenen Daten."
          },
          {
            "name": "Kompromittierung von API-Zugangsdaten",
            "value": "Der Zugriff auf Objektspeicher erfolgt über API-Schlüssel (Access Keys). Werden diese Schlüssel kompromittiert, beispielsweise weil sie in öffentlich zugänglichem Quellcode hinterlegt wurden, erlangt ein Angreifer die gleichen Rechte wie der legitime Besitzer der Schlüssel und kann Daten unbemerkt auslesen, manipulieren oder löschen."
          },
          {
            "name": "Unzureichende Zugriffskontrolle auf Objektebene",
            "value": "Selbst wenn ein Bucket nicht vollständig öffentlich ist, können zu weitreichende interne Berechtigungen zu Datenlecks führen. Erlaubt eine Richtlinie beispielsweise allen authentifizierten Benutzern einer Organisation den Lesezugriff auf alle Objekte, können Daten über die Abteilungsgrenzen hinweg unautorisiert eingesehen werden."
          },
          {
            "name": "Verlust oder Manipulation von Daten ohne Versionierung",
            "value": "Ist die Objekt-Versionierung nicht aktiviert, wird bei einer Überschreibung eines Objekts die alte Version unwiederbringlich gelöscht. Dies kann durch Angreifer, aber auch durch fehlerhafte Skripte oder menschliches Versagen zum permanenten Datenverlust oder zur unbemerkten Manipulation von Daten führen."
          },
          {
            "name": "Ausspähen von Daten während der Übertragung",
            "value": "Erfolgt die Kommunikation mit den API-Endpunkten des Objektspeichers unverschlüsselt über HTTP, können sowohl die übertragenen Daten als auch die zur Authentifizierung genutzten API-Schlüssel im Netzwerk mitgelesen werden."
          }
        ],
        "control-implementations": [
          {
            "uuid": "dced748f-9150-4c60-a1e9-ce89d99555ab",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Kompendien/Grundschutz%2B%2B-Kompendium/profile/dateiserver_profile.json",
            "description": "Implementation for all controls in Baustein APP.4.9",
            "implemented-requirements": [
              {
                "uuid": "25bdf9d0-9db9-4f6c-a1b2-b55962149bbc",
                "control-id": "DET.3.1.12",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.4.9.A7.M3",
                    "uuid": "8f4a3d76-6c38-4c06-9abb-c355e668f2e8",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für alle Buckets, die schützenswerte Daten enthalten, SOLLTE die Zugriffs-Protokollierung aktiviert werden. Alle API-Zugriffe (lesend, schreibend, löschend) SOLLTEN protokolliert und die Logs an ein zentrales System zur Auswertung weitergeleitet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die S3-Server-Zugriffsprotokollierung oder die Protokollierung von Datenereignissen über AWS CloudTrail wird für Buckets mit sensiblen Daten aktiviert. Die Logs werden in einem dedizierten, zentralen Logging-Bucket gespeichert, auf den nur autorisiertes Personal Zugriff hat."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Eine Liste der Buckets mit schützenswerten Daten anfordern und überprüfen, ob für diese die Zugriffsprotokollierung aktiviert ist. Die Konfiguration des Ziel-Buckets für die Logs prüfen und sicherstellen, dass dieser angemessen geschützt ist (z.B. eingeschränkter Zugriff, Versionierung, MFA-Delete)."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A7.M4",
                    "uuid": "5ca1869a-63c9-4d06-94ea-85dc0422a075",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Logging ist für alle Buckets standardmäßig aktiviert. Die Logs werden an ein SIEM-System weitergeleitet, wo automatisierte Regeln und Dashboards zur Erkennung von anomalen Zugriffsmustern (z.B. Massen-Downloads, Zugriffe von unbekannten IPs) implementiert sind."
                      },
                      {
                        "name": "guidance",
                        "value": "AWS CloudTrail wird so konfiguriert, dass Datenereignisse (Objekt-Level-API-Aktivität) für alle Buckets in der Organisation erfasst werden. Diese Logs werden an ein SIEM wie Splunk, Elastic oder Amazon OpenSearch Service gestreamt. Im SIEM werden Regeln erstellt, die z.B. bei einer ungewöhnlich hohen Anzahl von 'GetObject'-Anfragen von einer einzigen IP-Adresse oder bei Zugriffen von außerhalb erwarteter geografischer Regionen Alarm schlagen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die CloudTrail-Konfiguration prüfen und sicherstellen, dass sie für alle Buckets aktiv ist ('log all S3 buckets'). Die Konfiguration der Log-Weiterleitung an das SIEM verifizieren. Die im SIEM implementierten Regeln und Dashboards für die S3-Zugriffsüberwachung überprüfen und ihre Wirksamkeit bewerten."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A7.M5",
                    "uuid": "fdc0482c-70ea-4d1c-835a-eeecaae1bd3a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Log-Integrität wird durch spezielle Mechanismen (z. B. AWS CloudTrail Log File Integrity Validation) sichergestellt. Die Auswertung der Logs erfolgt in Echtzeit und löst automatisierte Reaktionen auf verdächtige Aktivitäten aus (z.B. temporäre Sperrung eines API-Schlüssels)."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Integritätsprüfung für CloudTrail-Logs ist aktiviert. Das SIEM ist so konfiguriert, dass es Alarme in Echtzeit verarbeitet. Ein erkannter Massen-Download von einer bestimmten IAM-Rolle könnte automatisch eine Lambda-Funktion auslösen, die dieser Rolle eine 'Deny'-Policy anhängt und das SOC informiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen, ob die CloudTrail-Log-Integritätsvalidierung aktiviert ist. Den Prozess der automatisierten Reaktion auditieren, von der Alarmerzeugung im SIEM bis zur Ausführung der Reaktions-Skripte. Die Dokumentation und die Protokolle vergangener automatischer Reaktionen prüfen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "eae1ee55-292a-49bd-8b17-56a3e90fafff",
                "control-id": "DEV.2.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.4.9.A5.M3",
                    "uuid": "cf9d55f6-dac3-439e-b741-2f00f8bb478f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für jede Anwendung und jeden Benutzer SOLLTE ein eigener technischer Benutzer (z. B. IAM-Benutzer) mit dedizierten API-Schlüsseln erstellt werden. Die Berechtigungen SOLLTEN so granular wie möglich auf die benötigten Aktionen (z. B. GetObject, PutObject) und Ressourcen (spezifische Buckets oder Pfade) beschränkt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Statt einen einzigen Benutzer für mehrere Anwendungen zu verwenden, wird für jede Anwendung ein separater IAM-Benutzer oder eine IAM-Rolle erstellt. Die zugehörige IAM-Policy wird so gestaltet, dass sie nur die exakt benötigten API-Aktionen (z.B. s3:GetObject) auf die exakt benötigten Ressourcen (z.B. arn:aws:s3:::my-bucket/data/*) erlaubt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Stichproben von IAM-Benutzern und -Rollen, die von Anwendungen genutzt werden, auswählen. Die zugehörigen IAM-Policies überprüfen und sicherstellen, dass sie keine übermäßigen Berechtigungen enthalten (z.B. 's3:*' auf '*'). Vergleichen, ob die Berechtigungen der dokumentierten Anforderung der Anwendung entsprechen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A5.M4",
                    "uuid": "a5e7e781-3f8c-4403-ad01-48c17066a461",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "API-Schlüssel werden regelmäßig und automatisiert rotiert. Es werden Werkzeuge eingesetzt, die Berechtigungen analysieren, um ungenutzte oder übermäßig freizügige Rechte zu identifizieren und zur Korrektur vorzuschlagen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Prozess für die automatisierte Rotation von API-Schlüsseln wird implementiert, z.B. mithilfe von AWS Secrets Manager oder HashiCorp Vault. Werkzeuge wie AWS IAM Access Analyzer werden genutzt, um Berichte über ungenutzte Berechtigungen zu erstellen. Diese Berichte werden regelmäßig vom Entwicklungs- oder Sicherheitsteam ausgewertet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die Konfiguration des Systems zur Schlüsselrotation überprüfen. Die Berichte des Access Analyzers oder ähnlicher Werkzeuge einsehen. Nachweisen lassen, dass auf Basis dieser Berichte regelmäßig Berechtigungen reduziert oder entfernt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A5.M5",
                    "uuid": "a2e89f95-61d2-41a1-bb30-514d7391214c",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Berechtigungen werden dynamisch und Just-in-Time (JIT) basierend auf dem aktuellen Kontext vergeben und nach Abschluss der Aufgabe automatisch wieder entzogen. Es werden keine langlebigen statischen API-Schlüssel mehr verwendet, sondern temporäre Anmeldeinformationen."
                      },
                      {
                        "name": "guidance",
                        "value": "Anwendungen, die auf Cloud-Plattformen laufen (z.B. in EC2, ECS, Lambda), verwenden IAM-Rollen, um automatisch temporäre Anmeldeinformationen zu erhalten. Für den Zugriff von außerhalb der Cloud-Umgebung werden Systeme wie AWS IAM Identity Center oder andere Identitäts-Broker eingesetzt, die kurzlebige Anmeldeinformationen ausstellen. Die Verwendung von statischen IAM-Benutzer-API-Schlüsseln ist durch SCPs verboten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen, ob SCPs die Erstellung von statischen IAM-Benutzer-API-Schlüsseln verhindern. Die Konfiguration der IAM-Rollen für Anwendungen und des JIT-Zugriffssystems auditieren. Sicherstellen, dass keine Anwendungen mehr langlebige Schlüssel verwenden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "5a5a2e07-b149-458a-841d-02b8098bbb30",
                "control-id": "DEV.2.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.4.9.A4.M3",
                    "uuid": "9b5957bc-68ab-4b7d-a1a5-f63df8c5e4a5",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die primären Zugangsdaten (Root-Account, Administrator) des Objektspeichersystems MÜSSEN besonders geschützt und DÜRFEN NICHT für den regulären, automatisierten Zugriff durch Anwendungen verwendet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Zugangsdaten des Root-Accounts werden nach der initialen Einrichtung sicher verwahrt und nicht mehr verwendet. Für alle administrativen und Anwendungs-Aufgaben werden dedizierte IAM-Benutzer oder -Rollen mit eingeschränkten Berechtigungen erstellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen, ob für den Root-Account Access Keys existieren. Falls ja, muss dies begründet werden. Die Nutzungshistorie des Root-Accounts überprüfen; es sollten keine oder nur sehr wenige, lang zurückliegende Anmeldungen vorhanden sein. Sicherstellen, dass es eine dokumentierte Richtlinie gibt, die die Verwendung des Root-Accounts für den regulären Betrieb verbietet."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A4.M4",
                    "uuid": "a583fde5-a64a-4329-b32a-f34bd17fc279",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Root-Account ist zwingend durch Multi-Faktor-Authentifizierung (MFA) geschützt. Jede Nutzung des Root-Accounts (Anmeldung an der Konsole) löst eine sofortige, hochpriorisierte Sicherheitswarnung an das Sicherheitsteam aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Hardware-MFA-Gerät wird für den Root-Account konfiguriert. Dienste wie AWS CloudTrail und Amazon CloudWatch Alarms (oder Äquivalente) werden konfiguriert, um bei jeder 'Root'-Anmeldung eine Benachrichtigung per E-Mail oder an einen Chat-Kanal zu senden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen, ob MFA für den Root-Account aktiviert ist. Die Konfiguration der Alarmierungsmechanismen für Root-Account-Nutzung verifizieren. Testweise eine Anmeldung mit dem Root-Account durchführen (im Rahmen eines genehmigten Tests) und sicherstellen, dass der Alarm ausgelöst wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A4.M5",
                    "uuid": "aa30fb2f-8f03-4510-a275-d8132cb482cc",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zugriff auf den Root-Account ist nur über einen stark gesicherten 'Break-Glass'-Prozess möglich, der mehrere Genehmigungsstufen erfordert und dessen Durchführung vollständig protokolliert wird. Für alle administrativen Aufgaben, auch solche, die traditionell Root-Rechte erfordern, werden dedizierte IAM-Rollen mit minimalen Rechten und zeitlich begrenztem Zugriff verwendet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Root-Account-Zugangsdaten (Passwort, MFA-Gerät) werden physisch getrennt in einem Safe aufbewahrt. Der Zugriff erfordert die Genehmigung von mindestens zwei autorisierten Personen (Vier-Augen-Prinzip). Ein Notfallkonzept beschreibt genau, wann und wie dieser Prozess genutzt werden darf. Administrative Aufgaben werden über IAM-Rollen abgewickelt, auf die über IAM Identity Center mit MFA zugegriffen wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die Dokumentation des 'Break-Glass'-Prozesses überprüfen. Die physischen Sicherheitsmaßnahmen für die Aufbewahrung der Zugangsdaten auditieren. Die IAM-Konfiguration verifizieren und sicherstellen, dass für alle administrativen Aufgaben dedizierte Rollen anstelle des Root-Accounts verwendet werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "8fe21f19-038f-43c7-85a7-cd56e187d25c",
                "control-id": "KONF.10.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.4.9.A1.M1",
                    "uuid": "6b4c41de-2032-4c3b-a453-c222a7082693",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der öffentliche Zugriff ist nur für einige, aber nicht alle Buckets blockiert. Es gibt kein übergreifendes Konzept oder eine zentrale Einstellung zur standardmäßigen Blockierung."
                      },
                      {
                        "name": "guidance",
                        "value": "Einzelne Administratoren konfigurieren manuell Blockaden für Buckets, die sie als sensibel erachten. Dies geschieht ad-hoc und ohne formellen Prozess."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen, ob es eine dokumentierte Richtlinie für die Blockierung des öffentlichen Zugriffs gibt. Stichprobenartig Buckets auswählen und prüfen, ob einige öffentlich zugänglich sind, obwohl sie sensible Daten enthalten könnten."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A1.M2",
                    "uuid": "90ac70ce-32e2-44e9-b0d8-b0ed6913c071",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Auf der obersten Ebene des Speichersystems ist eine technische Einstellung aktiviert, die den öffentlichen Zugriff auf neu erstellte Buckets standardmäßig blockiert. Es existiert jedoch kein formalisiertes Genehmigungsverfahren für Ausnahmen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die globale 'Block Public Access'-Einstellung des Cloud-Anbieters ist auf Account-Ebene aktiviert. Ausnahmen werden bei Bedarf von Administratoren ohne formalen Antrag oder Dokumentation eingerichtet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen, ob die globale Einstellung zur Blockierung des öffentlichen Zugriffs aktiv ist. Nachfragen, ob ein Prozess für die Genehmigung von Ausnahmen existiert und ob dieser dokumentiert ist. Prüfen, ob öffentlich zugängliche Buckets existieren und ob deren Freigabe begründet werden kann."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A1.M3",
                    "uuid": "f1bb091e-2a0d-442e-8050-09b81470feda",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS auf der obersten Ebene des Speichersystems (z. B. auf Account-Ebene) eine technische Einstellung aktiviert sein, die jeglichen öffentlichen Zugriff auf Buckets standardmäßig blockiert. Ausnahmen MÜSSEN explizit und nach einem Genehmigungsverfahren definiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine globale Einstellung zur Blockierung des öffentlichen Zugriffs ist aktiv. Ein formeller Prozess, beispielsweise über ein Ticketsystem, ist etabliert, um Ausnahmen zu beantragen, zu prüfen und zu genehmigen. Jede Ausnahme muss begründet und dokumentiert werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sicherstellen, dass die globale Blockierung des öffentlichen Zugriffs auf Account-Ebene aktiviert ist. Die Dokumentation des Genehmigungsverfahrens für Ausnahmen prüfen. Stichproben von öffentlich zugänglichen Buckets entnehmen und verifizieren, dass für jeden eine formelle, dokumentierte Genehmigung vorliegt."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A1.M4",
                    "uuid": "720b69f9-3d89-4138-a7e3-51090a036459",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Blockade des öffentlichen Zugriffs ist automatisiert durchgesetzt. Es werden regelmäßig automatisierte Scans durchgeführt, um versehentlich öffentlich gemachte Buckets zu identifizieren und zu melden. Jede Ausnahmeanfrage wird in einem Ticketsystem mit formeller Genehmigung und zeitlicher Begrenzung dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Cloud Security Posture Management (CSPM) Tool oder ein benutzerdefiniertes Skript wird eingesetzt, das kontinuierlich oder in kurzen Intervallen alle Buckets überprüft und bei öffentlichem Zugriff eine Warnung an das Sicherheitsteam sendet. Das Genehmigungsverfahren ist im IT-Service-Management-Tool abgebildet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die Konfiguration des automatisierten Scan-Tools und die zugehörigen Warnmeldungen prüfen. Den Workflow für Ausnahmeanträge im Ticketsystem überprüfen und sicherstellen, dass Genehmigungen nachvollziehbar und zeitlich befristet sind. Die Berichte der Scans auf ungenehmigte öffentliche Buckets analysieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A1.M5",
                    "uuid": "45cd9d56-a373-4c77-b261-f674c1cfb1ab",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Blockade des öffentlichen Zugriffs ist durch präventive technische Richtlinien (z. B. Service Control Policies auf Organisationsebene) unumgehbar gemacht und kann von einzelnen Account-Administratoren nicht aufgehoben werden. Jede Konfigurationsänderung an Bucket-Richtlinien wird in Echtzeit überwacht, und es gibt automatisierte Reaktionen bei Verstößen."
                      },
                      {
                        "name": "guidance",
                        "value": "Service Control Policies (SCPs) in AWS Organizations oder vergleichbare Mechanismen bei anderen Anbietern werden verwendet, um die Deaktivierung der 'Block Public Access'-Einstellung oder die Erstellung öffentlicher ACLs/Policies zu verbieten. Konfigurationsänderungen werden über Event-basierte Dienste (z. B. AWS Config, EventBridge) erfasst und lösen eine Lambda-Funktion aus, die unzulässige Konfigurationen automatisch zurücksetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die implementierten Service Control Policies (SCPs) und ihre Wirksamkeit überprüfen. Die Konfiguration der automatisierten Überwachungs- und Reaktionsmechanismen (z. B. AWS Config Rules, Lambda-Funktionen) auditieren. Sicherstellen, dass keine Möglichkeit besteht, diese präventiven Kontrollen auf Kontoebene zu umgehen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e8666afb-eabc-438d-b2ae-da8f5ce43b37",
                "control-id": "KONF.10.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Audit",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.4.9.A9.M3",
                    "uuid": "27492b2e-57b6-4584-a19a-87be2717632c",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Konfiguration aller Bucket-Richtlinien SOLLTE regelmäßig, vorzugsweise automatisiert, daraufhin überprüft werden, ob sie öffentliche oder übermäßig freizügige Zugriffe erlauben."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein wiederkehrender Prozess, z.B. quartalsweise, wird etabliert, in dessen Rahmen ein Administrator oder Sicherheitsexperte die Richtlinien aller Buckets manuell oder mit Hilfe von Skripten überprüft. Die Ergebnisse werden dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die Dokumentation der vergangenen Überprüfungen anfordern. Nachweisen lassen, dass die Überprüfungen im definierten Intervall stattfinden. Die Methodik der Überprüfung auf ihre Vollständigkeit und Korrektheit bewerten."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A9.M4",
                    "uuid": "c42100ae-7ca5-4734-a6db-fdbe54e97031",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Automatisierte Tools (z.B. Cloud-Security-Posture-Management-Tools) scannen kontinuierlich alle Bucket-Richtlinien und erstellen Berichte und Warnungen bei Abweichungen von der Sicherheits-Baseline, insbesondere bei öffentlichen oder kontoübergreifenden Zugriffen."
                      },
                      {
                        "name": "guidance",
                        "value": "Dienste wie AWS Config mit Managed Rules (z.B. 's3-bucket-public-read-prohibited'), AWS IAM Access Analyzer oder kommerzielle CSPM-Tools werden eingesetzt. Diese Tools laufen kontinuierlich und generieren Befunde (Findings) in einem zentralen Dashboard oder senden Warnungen an das Sicherheitsteam."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die Konfiguration des automatisierten Scan-Tools und die definierten Regeln überprüfen. Das Dashboard mit den Befunden einsehen und stichprobenartig prüfen, ob auf die Warnungen zeitnah reagiert wurde (z.B. durch Korrektur der Konfiguration oder dokumentierte Akzeptanz des Risikos)."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A9.M5",
                    "uuid": "f152db76-943f-4d9e-954c-b6244c55cc61",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Überprüfung ist vollständig automatisiert und in den Konfigurationsmanagement-Prozess integriert. Jede Änderung einer Bucket-Richtlinie löst einen sofortigen Scan aus. Kritische Befunde führen zu einer automatisierten Behebung (z.B. Rücknahme der Änderung)."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Konfiguration ist als 'Detection and Response' aufgebaut. Eine AWS Config Rule erkennt eine nicht konforme Bucket-Richtlinie (z.B. öffentlichen Zugriff). Über Amazon EventBridge löst dies eine AWS Lambda-Funktion aus, die die unsichere Richtlinie automatisch entfernt oder korrigiert und den Verantwortlichen benachrichtigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die gesamte Kette der automatisierten Behebung auditieren: die Erkennungsregel, den Event-Mechanismus und den Code der Behebungsfunktion. Die Protokolle vergangener automatischer Korrekturen prüfen und sicherstellen, dass diese wie erwartet funktioniert haben und keine unbeabsichtigten Nebeneffekte hatten."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "19ac46d8-c65a-48ab-9249-b01e73067368",
                "control-id": "KONF.11.8",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.4.9.A12.M3",
                    "uuid": "ec1eba51-6679-4b53-bd9c-2336f5b5d47f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zugriff auf die API des Objektspeichers SOLLTE, wann immer möglich, über private Netzwerkverbindungen erfolgen und nicht über das öffentliche Internet. Dies kann durch private Endpunkte innerhalb eines virtuellen Netzwerks oder über dedizierte Leitungen realisiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für VPCs (Virtual Private Clouds), die auf den Objektspeicher zugreifen müssen, werden VPC-Endpunkte (Gateway oder Interface Endpoints) für den S3-Dienst erstellt. Der Netzwerkverkehr von den Ressourcen in der VPC zum Objektspeicher verlässt dann nicht mehr das Netzwerk des Cloud-Anbieters."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die Netzwerkkonfiguration der relevanten VPCs überprüfen und sicherstellen, dass VPC-Endpunkte für den Objektspeicher-Dienst konfiguriert sind. Die Routing-Tabellen der Subnetze prüfen, um zu verifizieren, dass der Datenverkehr zum Objektspeicher über den Endpunkt geleitet wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A12.M4",
                    "uuid": "7d983094-19a8-4127-9d6a-0e5156f582f2",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird eine Bucket-Richtlinie verwendet, um den Zugriff auf den Bucket so einzuschränken, dass er ausschließlich über einen oder mehrere definierte private Endpunkte erfolgen kann. Der Zugriff über das öffentliche Internet wird auf Richtlinienebene blockiert."
                      },
                      {
                        "name": "guidance",
                        "value": "In der Bucket Policy wird eine 'Deny'-Anweisung mit einer Bedingung hinzugefügt. Die Bedingung prüft, ob die Anfrage nicht von einer bestimmten VPC-Endpunkt-ID ('aws:sourceVpce') oder einer bestimmten Quell-VPC ('aws:sourceVpc') stammt. Dies blockiert effektiv alle Zugriffe, die nicht aus dem definierten privaten Netzwerk kommen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die Bucket-Richtlinien überprüfen und sicherstellen, dass sie die Bedingung zur Einschränkung des Zugriffs auf bestimmte VPC-Endpunkte enthalten. Versuchen, von außerhalb der VPC (z.B. vom lokalen Rechner über das Internet) auf den Bucket zuzugreifen, und verifizieren, dass der Zugriff verweigert wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A12.M5",
                    "uuid": "1b29e590-819e-4369-9712-7600e4fc7a12",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Nutzung von privaten Endpunkten und die Einschränkung des Zugriffs darauf ist durch eine zentrale Richtlinie (z. B. SCP) für alle relevanten Konten erzwungen. Aller Datenverkehr zum Objektspeicher wird innerhalb des privaten Netzwerks geroutet und über zentrale Sicherheits-Appliances (z. B. Firewalls, Intrusion Detection Systems) inspiziert."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine SCP verbietet das Erstellen von Bucket-Richtlinien, die nicht die Bedingung 'aws:sourceVpce' enthalten. Der gesamte ausgehende Verkehr aus den VPCs wird durch eine zentrale Transit-VPC oder ein Gateway geleitet, in der virtuelle Firewall-Appliances den Verkehr zum S3-Endpunkt überwachen und filtern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die SCP, die die Verwendung von privaten Endpunkten erzwingt, auditieren. Die Netzwerkarchitektur und die Konfiguration der zentralen Sicherheits-Appliances überprüfen. Die Flow-Logs analysieren, um sicherzustellen, dass der gesamte Objektspeicher-Verkehr tatsächlich durch die Inspektionspunkte geleitet wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "a97aa68a-7bae-49c8-842f-a0783323481c",
                "control-id": "KONF.11.9",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.4.9.A6.M3",
                    "uuid": "bac84cfa-b579-4ba4-a2a1-4def8ce8cb1e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle in einem Bucket gespeicherten Objekte SOLLTEN standardmäßig serverseitig verschlüsselt werden (Encryption at Rest). Es SOLLTE sichergestellt sein, dass unverschlüsselte Objekte beim Speichern automatisch abgewiesen oder verschlüsselt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für jeden Bucket wird die standardmäßige Verschlüsselung (Default Encryption) aktiviert. Dies stellt sicher, dass alle neuen Objekte, die in den Bucket hochgeladen werden, automatisch verschlüsselt werden, auch wenn der Client keine Verschlüsselungsinformationen mitsendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die Konfigurationseinstellungen aller Buckets überprüfen und sicherstellen, dass die standardmäßige Verschlüsselung aktiviert ist. Stichprobenartig Objekte aus verschiedenen Buckets herunterladen und ihre Metadaten prüfen, um die Verschlüsselung zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A6.M4",
                    "uuid": "618855e4-e773-42a7-8d54-9a262c4b4460",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine zentrale Richtlinie (z. B. Bucket Policy) erzwingt die serverseitige Verschlüsselung für alle Objekte und weist Uploads von unverschlüsselten Objekten explizit ab. Für die Verschlüsselung wird ein kundenspezifischer Schlüssel (z. B. über AWS KMS) anstelle des vom Anbieter verwalteten Standardschlüssels verwendet."
                      },
                      {
                        "name": "guidance",
                        "value": "In die Bucket Policy wird eine 'Deny'-Regel aufgenommen, die 's3:PutObject' verhindert, wenn der Header 'x-amz-server-side-encryption' nicht vorhanden ist oder nicht den gewünschten Wert (z.B. 'aws:kms') hat. Die Standardverschlüsselung des Buckets wird auf einen kundenspezifischen KMS-Schlüssel konfiguriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die Bucket-Richtlinien auf die Existenz der 'Deny'-Regel für unverschlüsselte Uploads überprüfen. Sicherstellen, dass die Standardverschlüsselung auf einen kundenspezifischen Schlüssel (CMK/KMS) und nicht auf den S3-Managed Key (SSE-S3) eingestellt ist. Den Lebenszyklus und die Zugriffsrichtlinien des verwendeten KMS-Schlüssels überprüfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A6.M5",
                    "uuid": "5ebb02db-85e9-433e-8f1b-703f03934a7c",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Verschlüsselung ist auf Organisationsebene durch technische Richtlinien (z. B. SCPs) erzwungen und kann von einzelnen Benutzern nicht deaktiviert werden. Die Schlüsselverwaltung ist in ein zentrales, hochsicheres System (z.B. eigenes HSM) integriert und unterliegt strengen Rotations- und Zugriffsrichtlinien."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Service Control Policy (SCP) verhindert das Hochladen von Objekten ohne serverseitige Verschlüsselung in der gesamten Organisation. Für die Schlüssel wird entweder ein KMS mit importiertem Schlüsselmaterial (BYOK) oder ein CloudHSM-Cluster (HYOK) verwendet, um die maximale Kontrolle über das Schlüsselmaterial zu gewährleisten. Schlüsselrotation ist automatisiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die SCPs, die die Verschlüsselung erzwingen, auditieren. Die Konfiguration des KMS/HSM und den Prozess für die Schlüsselverwaltung (Erstellung, Rotation, Löschung, Zugriff) überprüfen. Sicherstellen, dass die Richtlinien nicht auf Account-Ebene umgangen werden können."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ea01c28e-1792-4164-b7ab-98b6bfa24503",
                "control-id": "KONF.14.1.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.4.9.A3.M3",
                    "uuid": "1b7202cf-1b7b-4c0c-98d3-155c231cfda2",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS sichergestellt sein, dass alle Verbindungen zu den API-Endpunkten des Objektspeichers ausschließlich über TLS-verschlüsselte Verbindungen (HTTPS) erfolgen. Unverschlüsselte Verbindungen MÜSSEN serverseitig abgewiesen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "In den Bucket-Richtlinien wird eine Bedingung hinzugefügt (z.B. 'aws:SecureTransport': 'false' mit 'Deny'-Effekt), die alle Anfragen über unverschlüsseltes HTTP blockiert. Dies stellt sicher, dass alle Clients TLS verwenden müssen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die Bucket-Richtlinien von mehreren kritischen Buckets überprüfen und sicherstellen, dass sie eine Bedingung zur Ablehnung von unverschlüsselten Verbindungen enthalten. Versuchen, eine Verbindung zu einem API-Endpunkt über HTTP herzustellen und verifizieren, dass die Anfrage abgewiesen wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A3.M4",
                    "uuid": "948a6506-f2fc-48ce-a14c-14881ff0023d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die TLS-Konfiguration für die API-Endpunkte wird aktiv verwaltet. Es wird eine Richtlinie durchgesetzt, die nur die Nutzung moderner und sicherer TLS-Protokolle (z. B. TLS 1.2 oder höher) und Cipher Suites erlaubt."
                      },
                      {
                        "name": "guidance",
                        "value": "Wenn benutzerdefinierte Endpunkte oder Proxies verwendet werden, wird deren TLS-Konfiguration gehärtet, um veraltete Protokolle (SSLv3, TLS 1.0, TLS 1.1) zu deaktivieren. Bei Cloud-Anbietern werden, falls verfügbar, Richtlinien für die minimale TLS-Version auf den Endpunkten konfiguriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die Konfiguration der API-Endpunkte mit einem externen Tool wie dem SSL Labs Server Test überprüfen, um die unterstützten TLS-Versionen und Cipher Suites zu validieren. Sicherstellen, dass die Konfiguration den dokumentierten Unternehmensrichtlinien für Verschlüsselung entspricht."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A3.M5",
                    "uuid": "eb2c4dd0-2e8d-45c1-b183-6eac6633fd46",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Erzwingung von verschlüsselten Verbindungen und die Vorgabe einer minimalen TLS-Version sind auf Organisationsebene durch technische Richtlinien (z. B. SCPs) festgelegt und können nicht umgangen werden. Verbindungsversuche von Clients mit veralteten TLS-Versionen werden nicht nur blockiert, sondern auch protokolliert und lösen eine Warnung aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Service Control Policy (SCP) wird eingesetzt, die das Erstellen oder Ändern von Bucket-Richtlinien verhindert, wenn diese nicht die Bedingung 'aws:SecureTransport' enthalten. Die Logs der API-Endpunkte (z. B. VPC Flow Logs, Load Balancer Logs) werden analysiert, um fehlgeschlagene TLS-Handshakes zu erkennen und das Sicherheitsteam zu informieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die implementierten SCPs überprüfen, die die TLS-Nutzung erzwingen. Die Konfiguration der Log-Analyse und der zugehörigen Alarmierungsmechanismen für fehlgeschlagene TLS-Verbindungen auditieren. Überprüfen, ob es einen Prozess gibt, um auf solche Alarme zu reagieren (z. B. Kontakt mit den Betreibern der unsicheren Clients)."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ebb7b28c-cbde-4192-a206-55179ddf353a",
                "control-id": "KONF.14.1.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.4.9.A10.M3",
                    "uuid": "2f1ea947-4a6a-4102-8ab4-c800d27813af",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für Objekte mit hochsensiblen Daten SOLLTE eine clientseitige Verschlüsselung eingesetzt werden. Die Daten MÜSSEN von der Anwendung verschlüsselt werden, bevor sie an den Objektspeicher übertragen werden. Die Schlüssel dürfen dem Betreiber des Speichersystems nicht bekannt sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Anwendungen, die hochsensible Daten verarbeiten, nutzen eine Verschlüsselungsbibliothek (z.B. AWS Encryption SDK), um die Daten vor dem Upload zu verschlüsseln. Die Schlüssel für diese Verschlüsselung werden von der Anwendung selbst verwaltet und nicht an den Objektspeicher-Anbieter übergeben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Den Quellcode oder die Architektur-Dokumentation der relevanten Anwendung überprüfen, um den Prozess der clientseitigen Verschlüsselung zu verifizieren. Sicherstellen, dass die Schlüsselverwaltung vom Objektspeicher-System getrennt ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A10.M4",
                    "uuid": "b700021f-b742-4b4d-afbc-b0c421ed09a8",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird ein zentral verwaltetes Schlüsselmanagementsystem (KMS) genutzt, das die Schlüssel für die clientseitige Verschlüsselung bereitstellt. Der Cloud-Anbieter hat jedoch keinen Zugriff auf das Klartext-Schlüsselmaterial (Bring Your Own Key - BYOK)."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein AWS KMS mit importiertem Schlüsselmaterial oder ein vergleichbarer Dienst wird verwendet. Die Anwendung fordert einen Datenschlüssel vom KMS an, verschlüsselt die Daten lokal und verwirft den Datenschlüssel. Der verschlüsselte Datenschlüssel wird mit dem Objekt gespeichert. Zum Entschlüsseln muss die Anwendung erneut das KMS um die Entschlüsselung des Datenschlüssels bitten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die KMS-Konfiguration überprüfen und verifizieren, dass importiertes Schlüsselmaterial (BYOK) verwendet wird. Die IAM-Richtlinien für den Zugriff auf das KMS prüfen, um sicherzustellen, dass nur autorisierte Anwendungen die Schlüssel verwenden können. Den Prozess der Schlüsselrotation für die importierten Schlüssel auditieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A10.M5",
                    "uuid": "782be899-14bc-4dc6-9fe3-e5eae4790a41",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die gesamte Schlüsselverwaltung, einschließlich Erstellung, Rotation und Widerruf, erfolgt über ein unternehmenseigenes, hochsicheres Hardware-Sicherheitsmodul (HSM), das nicht in der Cloud gehostet wird (Hold Your Own Key - HYOK). Der Verschlüsselungsprozess ist in zentrale Entwicklungs-Frameworks integriert, um eine konsistente und korrekte Anwendung sicherzustellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein On-Premises HSM wird betrieben. Anwendungen kommunizieren mit dem HSM, um Schlüsseloperationen durchzuführen. Die Cloud-Anwendung erhält niemals direkten Zugriff auf das Schlüsselmaterial. Die Nutzung der Verschlüsselungsfunktionen ist in den Standard-Bibliotheken und -Frameworks des Unternehmens fest verankert, sodass Entwickler diese nicht umgehen können."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die physische und logische Sicherheit des On-Premises HSM auditieren. Die Netzwerkpfade und Protokolle zwischen der Cloud-Anwendung und dem HSM auf Sicherheit überprüfen. Die Entwicklungs-Frameworks analysieren, um sicherzustellen, dass die Verschlüsselung nicht umgangen werden kann."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "311df485-758a-4259-92c0-c0f8e81a48f3",
                "control-id": "KONF.6.6.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.4.9.A2.M3",
                    "uuid": "2209f8e5-14ff-4396-8e3e-f2738f9031ad",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für jeden Bucket MUSS eine Zugriffsrichtlinie (Bucket Policy oder ACL) definiert sein, die den Zugriff auf einen explizit definierten und minimalen Kreis von Benutzern oder Diensten beschränkt."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei der Erstellung eines neuen Buckets wird standardmäßig eine restriktive Richtlinie angewendet. Diese Richtlinie wird dann gemäß dem Prinzip der geringsten Rechte (Least Privilege) angepasst, um nur den notwendigen Prinzipale (Benutzer, Rollen, Dienste) die erforderlichen Aktionen zu erlauben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Eine Liste aller Buckets anfordern und stichprobenartig die zugehörigen Bucket Policies und ACLs überprüfen. Sicherstellen, dass jede Richtlinie explizit definierte Prinzipale enthält und keine Wildcards wie '*' für Prinzipale verwendet werden, es sei denn, es ist explizit genehmigt und dokumentiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A2.M4",
                    "uuid": "07ab8478-d2a9-43c8-8795-4799a73afa36",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bucket-Richtlinien werden regelmäßig, mindestens quartalsweise, überprüft. Es werden automatisierte Werkzeuge zur Analyse von Berechtigungen eingesetzt, um übermäßig freizügige oder ungenutzte Zugriffe proaktiv zu identifizieren und zu melden."
                      },
                      {
                        "name": "guidance",
                        "value": "Werkzeuge wie AWS IAM Access Analyzer werden konfiguriert, um kontinuierlich Bucket-Richtlinien zu analysieren und Warnungen für öffentliche oder kontoübergreifende Zugriffe zu generieren. Die Ergebnisse werden in einem regelmäßigen Prozess vom Sicherheitsteam ausgewertet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die Konfiguration und die Berichte der automatisierten Analysewerkzeuge (z. B. IAM Access Analyzer) prüfen. Nachweise für die regelmäßigen Überprüfungen der Bucket-Richtlinien einsehen (z. B. Protokolle von Meetings, Tickets). Überprüfen, ob identifizierte übermäßige Berechtigungen zeitnah korrigiert wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A2.M5",
                    "uuid": "dc8ea1fe-0d6c-4d21-88f7-c164cdbac0f4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Erstellung und Änderung von Bucket-Richtlinien ist vollständig in einen automatisierten CI/CD-Prozess (Infrastructure as Code) integriert. Jede vorgeschlagene Änderung wird automatisch gegen eine Bibliothek von Sicherheits-Baselines validiert, bevor sie angewendet werden kann. Temporärer Zugriff wird über dedizierte, zeitlich begrenzte Workflows gewährt."
                      },
                      {
                        "name": "guidance",
                        "value": "Bucket-Richtlinien werden ausschließlich über Tools wie Terraform oder CloudFormation verwaltet. In der CI/CD-Pipeline werden Werkzeuge wie 'tfsec' oder 'checkov' eingesetzt, um Richtlinien vor dem Deployment zu validieren. Temporärer Zugriff wird über Systeme wie AWS IAM Identity Center oder selbst entwickelte Lösungen mit zeitlich begrenzten Rollen gewährt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die CI/CD-Pipeline für die Verwaltung von Bucket-Richtlinien überprüfen. Die Konfiguration der automatisierten Validierungs-Checks (Linting, Security Scanning) auditieren. Nachweisen lassen, dass manuelle Änderungen an Bucket-Richtlinien technisch unterbunden oder sofort erkannt und zurückgesetzt werden. Den Prozess für die Gewährung von temporärem Zugriff prüfen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "398d63e6-bcc1-4e22-8674-248e9230d298",
                "control-id": "KONF.6.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.4.9.A11.M3",
                    "uuid": "c01bb45b-7ce9-4c18-b1be-10f2a3f4e884",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTEN übergeordnete, technische Richtlinien (z. B. Service Control Policies) durchgesetzt werden, die es Benutzern unmöglich machen, unsichere Konfigurationen vorzunehmen. Solche Richtlinien können beispielsweise die Erstellung öffentlicher Buckets oder das Speichern unverschlüsselter Objekte für die gesamte Organisation unterbinden."
                      },
                      {
                        "name": "guidance",
                        "value": "Auf der Ebene der Organisationseinheit (OU) in AWS Organizations werden Service Control Policies (SCPs) implementiert. Diese SCPs verbieten bestimmte API-Aufrufe, wie z.B. das Deaktivieren der 'Block Public Access'-Einstellung oder das Hochladen von Objekten ohne Verschlüsselung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die auf die relevanten Accounts und OUs angewendeten SCPs überprüfen. Testen, ob ein Administrator in einem betroffenen Account eine durch die SCP verbotene Aktion durchführen kann. Das Ergebnis sollte eine explizite Ablehnung der Aktion sein."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A11.M4",
                    "uuid": "fb1f9acd-98f6-4d62-95a8-a4ebca8cb726",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein umfassendes Set an zentralen Richtlinien ist implementiert, das unsichere Konfigurationen präventiv verhindert. Zusätzlich gibt es detektivische Kontrollen, die Konfigurationsabweichungen in Bereichen erkennen, die nicht durch präventive Kontrollen abgedeckt werden können. Es gibt einen dokumentierten Prozess zur Beantragung von Ausnahmen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Set von SCPs wird durch ein Set von AWS Config Rules ergänzt. Während die SCPs Aktionen blockieren, erkennen die Config Rules den Zustand von Ressourcen (z.B. 'Ist Logging für diesen Bucket aktiviert?'). Für Ausnahmen von SCPs werden dedizierte OUs mit gelockerten Richtlinien und verstärktem Monitoring erstellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sowohl die präventiven SCPs als auch die detektivischen Config Rules auditieren. Den Prozess für die Beantragung und Genehmigung von Ausnahmen (z.B. Verschieben eines Accounts in eine andere OU) überprüfen. Die Berichte der detektivischen Kontrollen auf Konformitätsabweichungen prüfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A11.M5",
                    "uuid": "777d8356-9360-4f57-b5d2-fd70d706432a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein mehrschichtiges System von präventiven (z.B. SCPs), detektivischen (z.B. Config Rules) und reaktiven (z.B. Lambda-Funktionen zur automatischen Behebung) Kontrollen ist etabliert. Jede Abweichung von den zentralen Richtlinien wird sofort erkannt und entweder blockiert oder automatisch korrigiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Zusätzlich zu SCPs und Config Rules sind automatisierte Behebungsmaßnahmen implementiert. Beispiel: Eine Config Rule erkennt einen Bucket ohne Versionierung. Dies löst eine Lambda-Funktion aus, die die Versionierung automatisch für diesen Bucket aktiviert und den Account-Besitzer informiert. Dieser Ansatz wird als 'Policy as Code' mit Tools wie CloudFormation Guard oder OPA (Open Policy Agent) in die CI/CD-Pipeline integriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Das gesamte Zusammenspiel von präventiven, detektivischen und reaktiven Kontrollen auditieren. Die Logik und den Code der automatisierten Behebungsfunktionen überprüfen, um unbeabsichtigte Nebeneffekte auszuschließen. Die Integration von 'Policy as Code' in die Deployment-Pipelines verifizieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c645a3b6-cba9-4fbd-b581-e805c4b421e2",
                "control-id": "NOT.4.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.4.9.A8.M3",
                    "uuid": "fac0dac3-795d-4ed7-870d-66baa3d5523d",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für Buckets mit kritischen Daten SOLLTE die Objekt-Versionierung aktiviert werden, um Objekte vor unbeabsichtigtem Überschreiben oder Löschen zu schützen und die Wiederherstellung früherer Versionen zu ermöglichen."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei der Erstellung von Buckets, die für die Speicherung von kritischen Anwendungsdaten, Backups oder Konfigurationsdateien vorgesehen sind, wird die Versionierungsfunktion in den Bucket-Einstellungen aktiviert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die Konfigurationseinstellungen von kritischen Buckets überprüfen und sicherstellen, dass die Versionierung aktiviert ist. Einen Test durchführen, bei dem ein Objekt überschrieben und anschließend die vorherige Version erfolgreich wiederhergestellt wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A8.M4",
                    "uuid": "adabe1dc-0a8b-4187-ab6b-d4b0bab118f7",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Versionierung ist für alle kritischen Buckets aktiviert und wird mit Lifecycle-Policies kombiniert, um alte, nicht mehr aktuelle Versionen nach einer definierten Aufbewahrungsfrist automatisch zu löschen oder in kostengünstigere Speicherklassen zu verschieben."
                      },
                      {
                        "name": "guidance",
                        "value": "Zusätzlich zur Aktivierung der Versionierung wird eine Lifecycle-Konfiguration für den Bucket erstellt. Diese Konfiguration enthält Regeln, die z.B. nicht-aktuelle Versionen nach 30 Tagen in eine günstigere Speicherklasse (z.B. S3 Infrequent Access) verschieben und nach 365 Tagen endgültig löschen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die Lifecycle-Konfigurationen für versionierte Buckets überprüfen. Sicherstellen, dass die definierten Aufbewahrungsfristen den Unternehmens- und Compliance-Anforderungen entsprechen. Prüfen, ob die Regeln korrekt angewendet werden, indem der Speicherort und das Alter von nicht-aktuellen Objektversionen stichprobenartig kontrolliert werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.4.9.A8.M5",
                    "uuid": "c30a6b6a-db6d-41ea-bf5e-5b9498c79983",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Aktivierung der Versionierung ist durch eine zentrale Richtlinie für alle produktiven Buckets erzwungen. MFA-Delete ist zusätzlich aktiviert, um zu verhindern, dass ein Angreifer mit kompromittierten Schlüsseln sowohl Objekte als auch deren Versionen dauerhaft löschen kann."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine zentrale Richtlinie (z.B. eine AWS Config Rule mit automatischer Behebung oder eine SCP) stellt sicher, dass Versionierung auf allen als produktiv klassifizierten Buckets aktiv ist. Die Bucket-Konfiguration wird um 'MFA-Delete' erweitert. Jede Löschung einer Objektversion oder Änderung des Versionierungsstatus erfordert dann eine zusätzliche Authentifizierung mit einem MFA-Token."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Die zentrale Richtlinie zur Erzwingung der Versionierung überprüfen. Die Konfigurationseinstellungen der Buckets prüfen und sicherstellen, dass 'MFA-Delete' aktiviert ist. Den Prozess für das Löschen einer Objektversion auditieren und verifizieren, dass ein MFA-Code erforderlich ist."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}