{
  "component-definition": {
    "uuid": "11162498-69d8-4fd3-86d3-c0b52cae1704",
    "metadata": {
      "title": "APP.3.4 Dateiserver - Benutzerdefiniert",
      "last-modified": "2025-11-15T16:31:49.516105+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "b8ef6a3c-192c-443c-98ef-8a3ca35035d2",
        "type": "software",
        "title": "APP.3.4 Dateiserver",
        "description": "This component represents the implementation of all controls for Baustein APP.3.4.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Samba ist ein frei verfügbarer und vollwertiger Active Directory Domain Controller (ADDC), der Authentisierungs-, Datei- und Druckdienste bereitstellen kann und dadurch die Interoperabilität zwischen der Windows- und der Unix-Welt ermöglicht. Samba führt viele unterschiedliche Protokolle und Techniken zusammen. Dazu gehört beispielsweise das Server-Message-Block (SMB)-Protokoll. Als Samba-Server werden Server bezeichnet, auf denen Samba betrieben wird. In der Regel sind das Unix- Server. Wurde der Einsatz von Samba korrekt konzipiert und geeignet konfiguriert, interagiert Samba mit einem Windows-Client oder -Server, als ob es selbst ein Windows-System wäre."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel des Bausteins ist es darzustellen, wie Samba in Institutionen sicher eingesetzt werden kann und wie sich die durch Samba bereitgestellten Informationen schützen lassen."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein APP.3.4.Samba ist auf jeden Samba-Server des betrachteten Informationsverbunds anzuwenden.<BR>Dieser Baustein betrachtet Samba als Authentisierungs-, Datei- und Druckdienst. Da Samba in der Regel auf Unix-Servern eingesetzt wird und dort aus der Windows-Server-Welt bekannte Dienste bereitstellt, sind die Sicherheitsaspekte der Bausteine SYS.1.1 Allgemeiner Server und SYS.1.3 Server unter Linux und Unix zu berücksichtigen.<BR>Ein wichtiger Schwerpunkt bei der Absicherung eines Samba-Servers ist es, Zugriffsrechte auf Dateien nur restriktiv zu vergeben. Vertiefende Informationen zum Identitäts- und Berechtigungsmanagement sind nicht in diesem Baustein, sondern in ORP.4 Identitäts- und Berechtigungsmanagement zu finden.<BR>Generelle Sicherheitsanforderungen für Drucker, Fileserver oder Verzeichnisdienste sind nicht Bestandteil dieses Bausteins. Diese werden in den Bausteinen SYS.4.1 Drucker, Kopierer und Multifunktionsgeräte, APP.3.3 Fileserver und APP.2.1 Allgemeiner Verzeichnisdienst sowie APP.2.3 OpenLDAP beschrieben."
          },
          {
            "name": "Abhören ungeschützter Kommunikationsverbindungen von Samba",
            "value": "Wenn ungeschützte Kommunikationsverbindungen von Samba abgehört werden, können vertrauliche Informationen abgefangen und missbraucht werden. Beim Dateitransfer zwischen Unix-Servern, Windows-Servern und Clients werden oftmals Protokolle ohne umfangreiche Sicherheitseigenschaften eingesetzt, sodass sowohl Authentisierungs- als auch Nutzungsdaten für Dritte zugänglich sind und von Unberechtigten missbraucht werden könnten. Das kann dazu führen, dass schützenswerte Informationen der Institution in die falschen Hände gelangen."
          },
          {
            "name": "Unsichere Standardeinstellungen auf Samba-Servern",
            "value": "Um einige Fähigkeiten des Samba-Servers zu zeigen und um den Administrierenden einen schnellen Einstieg zu ermöglichen, wird während der Installation des Samba-Servers die Konfigurationsdatei smb.conf mit Standardeinstellungen erzeugt. Mit den in dieser Datei voreingestellten Optionen kann der Samba-Server im Anschluss gestartet werden. Wird diese Datei unbedacht ohne weitere Anpassungen benutzt, kann das zu erheblichen Sicherheitslücken führen. Werden die beispielhaft vorgenommenen Dateifreigaben nicht auskommentiert, können in diesen unerwünschten Freigaben sensible Informationen eingesehen werden."
          },
          {
            "name": "Unberechtigte Nutzung oder Administration von Samba",
            "value": "Unbefugte können durch die Nutzung von Anwendungen oder IT-Systemen an vertrauliche Informationen gelangen, diese manipulieren oder Störungen verursachen. So ist es möglich, dass sie Samba unberechtigt administrieren können. Besonders kritisch ist es, wenn veraltete und nicht mehr aktualisierte Konfigurationswerkzeuge eingesetzt werden, wie z. B. das Samba Web Administration Tool (SWAT)."
          },
          {
            "name": "Fehlerhafte Administration von Samba",
            "value": "Sind die Administrierenden mit den umfangreichen Komponenten, Funktionen, Optionen und Konfigurationseinstellungen von Samba zu wenig vertraut, kann dies zu weitreichenden Komplikationen führen. So können Fehlkonfigurationen des DNS oder des Berechtigungsmanagements dazu führen, dass Unbefugte auf Ressourcen zugreifen können. Des Weiteren kann dies zu Betriebsunterbrechungen führen oder es können schützenswerte Informationen offengelegt werden."
          },
          {
            "name": "Datenverlust bei Samba",
            "value": "Ein Datenverlust wirkt sich erheblich auf den IT-Einsatz aus. Wenn institutionsrelevante Informationen zerstört oder verfälscht werden, können dadurch Geschäftsprozesse und Fachaufgaben verzögert oder gar nicht mehr ausgeführt werden. Bei Samba ist beispielsweise zu beachten, dass sich die Eigenschaften der Dateisysteme unter Windows und Unix erheblich voneinander unterscheiden. Deswegen ist nicht immer sichergestellt, dass die Zugriffsrechte unter Windows aufrechterhalten bleiben, unter Umständen können so wichtige Dateieigenschaften verloren gehen. Auch können dadurch Informationen zu sogenannten Alternate Data Streams (ADS) und DOS-Attributen verloren gehen."
          },
          {
            "name": "Integritätsverlust schützenswerter Informationen bei Samba",
            "value": "Samba selbst legt wichtige Betriebsdaten in Datenbanken im Trivial-Database-(TDB)-Format ab. Sollten diese Datenbanken vom Betriebssystem nicht ausreichend leistungsfähig und konsistent behandelt werden, können sie Probleme verursachen, wenn Samba-Dienste genutzt werden."
          }
        ],
        "control-implementations": [
          {
            "uuid": "5afb1341-d70c-41e9-b710-9c7a8e724ebc",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/dateiserver_profile.json",
            "description": "Implementation for all controls in Baustein APP.3.4",
            "implemented-requirements": [
              {
                "uuid": "75773018-c0ca-403d-a5b1-5078c06a1956",
                "control-id": "BER.3.6",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.4-a6-m3",
                    "uuid": "f5e08dfb-eb9e-4639-aa9d-1cf93a09b456",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Falls nicht für jedes Domänen-Konto ein korrespondierendes Konto im Betriebssystem des Servers existiert, SOLLTE Winbind eingesetzt werden, um Domänen-Konten in Unix-Konten umzusetzen. Beim Einsatz von Winbind SOLLTE sichergestellt werden, dass Kollisionen zwischen lokalen Benutzenden in Unix und Benutzenden in der Domäne verhindert werden. Des Weiteren SOLLTEN die PAM (Pluggable Authentication Modules) eingebunden werden."
                      },
                      {
                        "name": "guidance",
                        "value": "In der `smb.conf` werden definierte und ausreichend große UID- und GID-Bereiche für das ID-Mapping der Domänenbenutzer und -gruppen festgelegt, die sich nicht mit den lokalen UIDs/GIDs überschneiden. Die PAM-Konfiguration (`/etc/pam.d/`) wird angepasst, um Winbind für die Authentifizierung (`auth`), Kontenverwaltung (`account`), Sitzungsverwaltung (`session`) und Passwortänderung (`password`) zu verwenden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die `smb.conf` auf die Konfiguration der `idmap config`-Parameter, insbesondere die definierten UID/GID-Bereiche. Die lokalen Benutzer in `/etc/passwd` werden mit dem konfigurierten Bereich verglichen, um Kollisionen auszuschließen. Die PAM-Konfigurationsdateien werden auf die korrekte Einbindung von `pam_winbind.so` geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a6-m4",
                    "uuid": "cd047814-32af-4cb8-8a90-62533451d5c9",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird eine robuste und zentral verwaltbare ID-Mapping-Konfiguration wie `idmap_rid` oder `idmap_ad` verwendet, um eine stabile und vorhersagbare Zuweisung von UIDs/GIDs sicherzustellen. Die gesamte Winbind- und ID-Mapping-Konfiguration ist detailliert dokumentiert. Die PAM-Konfiguration ist optimiert und beinhaltet eine sichere Sitzungsverwaltung, z.B. das automatische Erstellen von Home-Verzeichnissen."
                      },
                      {
                        "name": "guidance",
                        "value": "Das `idmap_ad`-Backend wird konfiguriert, um die in den AD-Benutzerobjekten gespeicherten `uidNumber`- und `gidNumber`-Attribute zu verwenden, falls diese gepflegt werden. Alternativ wird `idmap_rid` für eine algorithmische und stabile Zuordnung genutzt. Das PAM-Modul `pam_mkhomedir.so` wird in die `session`-Stack-Konfiguration aufgenommen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Verwendung von `idmap_ad` oder `idmap_rid` in der `smb.conf`. Die dazugehörige Dokumentation wird auf Vollständigkeit und Aktualität geprüft. Die PAM-Konfiguration wird auf erweiterte Sicherheits- und Komfortfunktionen wie `pam_mkhomedir.so` untersucht. Mit `getent passwd <domain_user>` und `id <domain_user>` wird die korrekte ID-Umsetzung stichprobenartig geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a6-m5",
                    "uuid": "1fe28606-0c44-47e9-a09e-11e234b2b8d4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Anstelle von Winbind oder ergänzend dazu wird der System Security Services Daemon (SSSD) für die Anbindung an Active Directory eingesetzt. SSSD bietet erweitertes Caching, höhere Performance und verbesserte Offline-Fähigkeiten. Die gesamte Konfiguration von SSSD und die dazugehörige PAM- und NSS-Integration wird zentral über ein Konfigurationsmanagementsystem verwaltet und durchgesetzt. Die PAM-Konfiguration ist gehärtet und wird regelmäßig auditiert."
                      },
                      {
                        "name": "guidance",
                        "value": "SSSD wird konfiguriert, um sich mit dem Active Directory zu verbinden (`id_provider = ad`). Die `sssd.conf` wird mittels Ansible oder Puppet auf alle relevanten Server verteilt. Die PAM- und NSS-Konfigurationen werden angepasst, um SSSD (`pam_sss.so`) anstelle von Winbind zu verwenden. Regelmäßige Audits der PAM-Konfiguration erfolgen mittels automatisierter Skripte."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass SSSD als Identitätsdienst läuft und korrekt konfiguriert ist. Die Konfiguration im Konfigurationsmanagementsystem wird analysiert. Es wird geprüft, ob Winbind deaktiviert ist, um Konflikte zu vermeiden. Die Ergebnisse der automatisierten PAM-Audits werden als Nachweis herangezogen. Der Befehl `sss_debuglevel` und die Analyse der SSSD-Logs können zur tiefgehenden Prüfung genutzt werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "8b2ce066-18d7-4690-b215-af123f846de5",
                "control-id": "BES.2.1.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.4-a1-m1",
                    "uuid": "9d9c58e3-fa60-4c8b-b2b9-c9e4f7769699",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Planung für den Samba-Einsatz existiert nur für einzelne, isolierte Server. Erweiterte Funktionen wie Active Directory-Integration, Cluster-Betrieb (CTDB) oder die gezielte Konfiguration von VFS-Modulen werden nicht berücksichtigt. Die Planung erfolgt ad-hoc und ist nicht dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "In diesem Reifegrad wird Samba typischerweise nur als einfacher Datei-Server in einer Arbeitsgruppe installiert, ohne eine tiefere Integration in bestehende Verzeichnisdienste. Die Konfiguration basiert auf Standardeinstellungen und wird bei Bedarf angepasst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, ob überhaupt ein Planungsdokument oder Konzept für den Samba-Einsatz existiert. Es wird geprüft, ob die Planung nur grundlegende Dateifreigaben abdeckt und Aspekte wie Authentisierung, hohe Verfügbarkeit oder IPv6 ignoriert werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a1-m2",
                    "uuid": "31187f18-bc00-4456-851e-578bc55f6d73",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert ein dokumentierter Plan für den Einsatz von Samba-Servern, der alle Server umfasst. Dieser Plan definiert die grundlegenden Aufgaben (z. B. Datei- und Druckdienste) und die Betriebsart. Konzepte für AD-Integration oder CTDB sind zwar erwähnt, aber nicht detailliert ausgearbeitet. Die Planung für IPv6 ist rudimentär."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein zentrales Dokument beschreibt die Standard-Installation und -Konfiguration von Samba. Es wird festgelegt, welche Server welche Rollen übernehmen. Die Konfiguration von fortgeschrittenen Features erfolgt jedoch noch weitgehend manuell und ohne detaillierte Vorab-Konzeption."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das Planungsdokument für den Samba-Einsatz an. Es wird überprüft, ob alle produktiven Samba-Server im Plan erfasst sind und ob die grundlegenden Aufgaben und Betriebsarten definiert sind. Die Detaillierung der Konzepte für AD, CTDB und IPv6 wird als oberflächlich bewertet."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a1-m3",
                    "uuid": "16130184-5152-4c9f-ba96-7bf84b07e37a",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der IT-Betrieb MUSS die Einführung eines Samba-Servers sorgfältig planen und regeln. Es MUSS, abhängig vom Einsatzszenario, definiert werden, welche Aufgaben der Server erfüllen soll und in welcher Betriebsart er betrieben wird. Es MUSS festgelegt werden, welche Samba-Komponenten erforderlich sind. Sollen CTDB, AD-Dienste, spezifische Authentisierungsverfahren oder VFS-Module eingesetzt werden, MÜSSEN diese ebenfalls sorgfältig konzipiert werden. Wird IPv6 genutzt, MUSS dies geplant und in einer Testumgebung auf fehlerfreie Funktion überprüft werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für jedes Einsatzszenario (z.B. Domain Controller, Mitgliedsserver) wird ein eigenes Konzeptdokument erstellt. Dieses Dokument beschreibt die genaue Konfiguration, die Auswahl und Reihenfolge der VFS-Module, die AD-Integration inklusive Authentisierungsmechanismen und die Netzwerkkonfiguration (IPv4/IPv6). Die Umsetzung SOLLTE dokumentiert werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verlangt die Vorlage der Planungs- und Konzeptionsdokumente für die verschiedenen Samba-Einsatzszenarien. Es wird verifiziert, ob die Dokumente alle MUSS-Anforderungen abdecken, insbesondere die detaillierte Konzeption für AD, CTDB, VFS und IPv6. Es wird stichprobenartig geprüft, ob die produktiven Systeme gemäß der Konzeption implementiert wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a1-m4",
                    "uuid": "6401a1dd-cda4-42da-a730-6313d4a1e071",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Planung (Level 3) wird um dokumentierte Testverfahren für alle wesentlichen Komponenten (AD, CTDB, VFS, IPv6) in einer dedizierten, betriebsnahen Testumgebung erweitert. Der Einführungsplan enthält detaillierte Rollout- und Rollback-Prozeduren. Die Umsetzung aller Konfigurationen wird konsequent dokumentiert, wie im Level 3 als SOLLTE gefordert."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor jeder größeren Änderung oder Einführung wird ein Testfallkatalog abgearbeitet. Die Ergebnisse der Tests werden protokolliert. Die Dokumentation der Umsetzung erfolgt in einem zentralen Konfigurationsmanagementsystem oder Wiki und wird versioniert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Testprotokolle und die Dokumentation der Testumgebung. Es wird überprüft, ob die Rollout- und Rollback-Pläne existieren und plausibel sind. Die Qualität und Vollständigkeit der Umsetzungsdokumentation wird bewertet. Als automatisierte Prüfung kann ein Skript die Konfiguration des Produktivsystems mit der dokumentierten Konfiguration abgleichen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a1-m5",
                    "uuid": "a3da41df-3cea-4d02-93e9-f784d956221d",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der gesamte Planungs- und Konzeptionsprozess ist vollständig in das Change-Management-System der Organisation integriert. Die Planung umfasst Kapazitäts- und Performance-Modellierung für verschiedene Lastszenarien. Das Sicherheitskonzept für Samba wird regelmäßig, mindestens jährlich, sowie anlassbezogen (z. B. bei neuen bekannten Schwachstellen) überprüft und an die aktuelle Bedrohungslage angepasst."
                      },
                      {
                        "name": "guidance",
                        "value": "Automatisierte Werkzeuge werden zur Überprüfung der Konzeption vor dem Deployment eingesetzt (z. B. 'testparm' in CI/CD-Pipelines). Performance-Tests werden automatisiert durchgeführt. Das Sicherheitskonzept wird durch regelmäßige, automatisierte Konfigurationsaudits und Penetrationstests validiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Integration des Samba-Managements in den Change-Management-Prozess. Die Existenz und Aktualität der Performance-Analysen und des proaktiv gepflegten Sicherheitskonzepts wird überprüft. Audit-Logs von automatisierten Konfigurationsprüfungen und die Berichte von Penetrationstests werden als Nachweis herangezogen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "25b72841-ccfd-45d0-ab5e-77edf516be23",
                "control-id": "KONF.10.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.4-a2-m2",
                    "uuid": "4bd0895b-a5b8-4a54-954f-84cbc01b9a7c",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die grundlegenden Sicherheitseinstellungen werden auf allen Samba-Servern angewendet. Dies beinhaltet die Konfiguration von Zugriffskontrollen für Freigaben und die Beschränkung des Netzwerkzugriffs (z.B. über `hosts allow / deny`). Das Konfigurationswerkzeug SWAT ist auf keinem Server installiert. Änderungen an der Konfiguration werden informell protokolliert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein einfaches Textdokument oder ein Eintrag in einem Ticket-System dient als Logbuch für Konfigurationsänderungen. Die Netzwerkeinschränkungen werden direkt in der `smb.conf` gepflegt. Die Überprüfung der Konfigurationssyntax erfolgt manuell mit `testparm` nach jeder Änderung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert auf allen Samba-Servern, ob das Paket für SWAT (samba-swat) deinstalliert ist. Die `smb.conf` wird auf die Verwendung von `hosts allow / deny` oder vergleichbaren Mechanismen überprüft. Das Änderungsprotokoll wird auf Vollständigkeit und Nachvollziehbarkeit stichprobenartig geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a2-m3",
                    "uuid": "fd8d6773-4dcb-4298-94d6-000dc396faed",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der IT-Betrieb MUSS den Samba-Server sicher konfigurieren. Hierfür MÜSSEN die Einstellungen für die Zugriffskontrolle angepasst werden. Samba MUSS so konfiguriert werden, dass Verbindungen nur von sicheren Hosts und Netzen entgegengenommen werden. Änderungen an der Konfiguration SOLLTEN sorgfältig dokumentiert werden. Nach jeder Änderung MUSS die Syntax der Konfigurationsdatei überprüft werden. Zusätzliche Softwaremodule wie SWAT DÜRFEN NICHT installiert werden. Einstellungen zur Leistungsfähigkeit SOLLTEN ebenfalls angepasst werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Konfiguration (`smb.conf`) wird nach einem dokumentierten Sicherheitsstandard erstellt. Änderungen werden in einem formellen Logbuch (z.B. Wiki mit Änderungshistorie) mit Angabe von Grund, Datum und Person festgehalten. Die Syntaxprüfung mit `testparm` ist ein obligatorischer Schritt nach jeder Änderung. Die Leistungsfähigkeit wird durch Anpassung von Parametern wie `socket options` beeinflusst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die Konfiguration (`smb.conf`) mit dem dokumentierten Sicherheitsstandard. Das Änderungsprotokoll wird auf Vollständigkeit und Regelkonformität geprüft. Es wird verifiziert, dass SWAT nicht installiert ist. Automatisiert kann per Skript geprüft werden, ob `testparm` auf allen Servern eine korrekte Syntax meldet."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a2-m4",
                    "uuid": "d0f8ff21-62ef-4ce1-b04f-0b51b3b41e90",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Konfigurationsdateien des Samba-Servers werden in einem Versionierungssystem (z.B. Git) verwaltet. Änderungen erfordern einen Review- und Genehmigungsprozess (z.B. Pull Request). Die Syntaxprüfung wird bei jedem Commit automatisch ausgeführt. Die SOLLTE-Anforderung zur Leistungsoptimierung wird systematisch umgesetzt und die Auswirkungen werden gemessen und dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine CI/CD-Pipeline wird für die Verwaltung der `smb.conf` eingesetzt. Jede vorgeschlagene Änderung wird automatisch mit `testparm` validiert. Die Dokumentation der Änderungen erfolgt automatisch durch die Commit-Historie im Versionierungssystem. Performance-Tuning wird auf Basis von Lasttests in der Testumgebung durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den konfigurierten Workflow im Versionierungssystem, inklusive der Review- und Genehmigungsschritte. Die Protokolle der CI/CD-Pipeline werden eingesehen, um die automatische Syntaxprüfung zu verifizieren. Dokumentationen zu durchgeführten Performance-Messungen werden geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a2-m5",
                    "uuid": "a7ce7329-cdd0-4544-8b5f-1377e39fafee",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein Konfigurationsmanagementsystem (z.B. Ansible, Puppet) wird eingesetzt, um die sichere Basiskonfiguration auf allen Samba-Servern automatisiert durchzusetzen und zu überwachen. Jede Abweichung von diesem 'Golden Image' wird automatisch korrigiert oder löst einen Alarm aus. Die Konfiguration wird regelmäßig automatisierten Audits gegen anerkannte Härtungsrichtlinien (z.B. CIS Benchmarks) unterzogen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ansible-Playbooks oder Puppet-Module definieren den Soll-Zustand der Samba-Konfiguration. Ein zentraler Server führt diese regelmäßig aus und stellt die Konformität sicher. Die Ergebnisse der Konfigurationsaudits werden in einem zentralen Dashboard visualisiert und zur kontinuierlichen Verbesserung genutzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer erhält Lesezugriff auf das Konfigurationsmanagementsystem und analysiert die definierten Konfigurations-Templates und -Regeln. Die Protokolle des Systems werden geprüft, um die automatische Durchsetzung und Alarmierung zu verifizieren. Die Berichte der Konformitäts-Scans gegen die Härtungsrichtlinien werden als Nachweis herangezogen. Ein automatisierter Audit-Befehl wäre z.B. `ansible-playbook --check playbook.yml`, um Abweichungen zu erkennen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "baed45eb-37ba-4923-9c32-b5a6d825f790",
                "control-id": "KONF.10.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.4-a9-m3",
                    "uuid": "bec9ec51-27cf-4deb-bebc-70d51041717b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zur Authentisierung SOLLTE das von Samba implementierte Heimdal Kerberos Key Distribution Center (KDC) verwendet werden. Es SOLLTE darauf geachtet werden, dass die von Samba vorgegebene Kerberos-Konfigurationsdatei (`krb5.conf`) verwendet wird. Es SOLLTEN nur sichere Verschlüsselungsverfahren für Kerberos-Tickets benutzt werden. Der zentrale Zeitserver SOLLTE lokal auf dem Samba-Server installiert sein, und der NTP-Dienst SOLLTE so konfiguriert werden, dass nur autorisierte Clients die Zeit abfragen können."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Standardkonfiguration des Samba AD DC wird verwendet. In der `smb.conf` werden veraltete Verschlüsselungstypen durch den Parameter `krb5_etypes` nicht explizit erlaubt. Der NTP-Dienst wird auf dem DC installiert und in der `ntp.conf` werden `restrict`-Anweisungen verwendet, um den Zugriff auf Clients aus dem eigenen Netzwerk zu beschränken."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die `smb.conf` und die `/etc/krb5.conf` auf sicherheitsrelevante Kerberos-Einstellungen, insbesondere auf das Fehlen oder die explizite Deaktivierung schwacher Chiffren. Die Konfiguration des NTP-Dienstes wird auf Zugriffsbeschränkungen geprüft. Mit `klist -e` wird auf einem Client geprüft, welche Verschlüsselungstypen für aktive Tickets verwendet werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a9-m4",
                    "uuid": "b44862fc-5f6e-4804-8074-27f02790770f",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Kerberos-Konfiguration wird aktiv gehärtet, indem alle bekannten schwachen Verschlüsselungstypen (z.B. RC4-HMAC, DES) explizit in der Konfiguration deaktiviert werden. Der NTP-Zugriff wird nicht nur auf Anwendungsebene, sondern zusätzlich durch eine Host-Firewall auf dem Server beschränkt. Die NTP-Konfiguration und die Kerberos-Härtung sind dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "In der `/etc/krb5.conf` werden unter `[libdefaults]` die Optionen `default_tgs_enctypes`, `default_tkt_enctypes` und `permitted_enctypes` explizit auf starke Algorithmen wie `aes256-cts-hmac-sha1-96` gesetzt. Die Firewall (z.B. firewalld, ufw) wird so konfiguriert, dass sie NTP-Anfragen nur von definierten IP-Subnetzen zulässt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die `krb5.conf` auf die explizite Deaktivierung schwacher Chiffren. Die Firewall-Regeln für den NTP-Dienst werden überprüft. Die dazugehörige Dokumentation wird auf Korrektheit und Aktualität geprüft. Automatisiert können Tools wie nmap verwendet werden, um die Erreichbarkeit des NTP-Ports von nicht-autorisierten Netzen aus zu testen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a9-m5",
                    "uuid": "3459ecfd-271c-4053-84ba-a8c8ab2680df",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein automatisierter Prozess auditiert regelmäßig die Kerberos-Konfiguration und die Eigenschaften von Benutzerkonten (z.B. 'DES encryption for this account') auf die Verwendung schwacher Verschlüsselungstypen. Der NTP-Dienst verwendet kryptographische Authentifizierung (z.B. Network Time Security (NTS) oder symmetrische Schlüssel), um die Integrität und Authentizität der Zeitquellen abzusichern und Man-in-the-Middle-Angriffe auf die Zeitsynchronisation zu verhindern."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Skript, das regelmäßig via Cron läuft, durchsucht das AD nach Benutzern oder Computern, bei denen veraltete Kerberos-Einstellungen aktiv sind, und meldet diese. Der NTP-Dienst wird (z.B. mit Chrony) für NTS konfiguriert oder es werden symmetrische Schlüssel zwischen NTP-Server und Clients eingerichtet, um die NTP-Pakete zu signieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Konfiguration und die Protokolle des automatisierten Audit-Skripts für Kerberos. Die Konfiguration des NTP-Dienstes wird auf die Verwendung von NTS oder symmetrischer Schlüsselauthentifizierung überprüft. Es wird die Konfiguration des NTP-Clients analysiert, um sicherzustellen, dass dieser ebenfalls die authentifizierte Zeitsynchronisation durchführt."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "f749d7cc-9e76-42f3-9be5-de114becc2bf",
                "control-id": "KONF.11.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.4-a8-m3",
                    "uuid": "012d2c81-93a3-4353-8183-93ce6dabf9db",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Werden die Benutzenden unter Samba mit LDAP verwaltet, SOLLTE die Konfiguration sorgfältig vom IT-Betrieb geplant und dokumentiert werden. Die Zugriffsberechtigungen auf das LDAP-Verzeichnis SOLLTEN mittels Access Control Lists (ACLs) geregelt werden, um das Prinzip der geringsten Rechte umzusetzen."
                      },
                      {
                        "name": "guidance",
                        "value": "Wenn Samba den internen LDAP-Server verwendet (als AD DC), werden die Standard-ACLs überprüft und bei Bedarf angepasst. Wenn ein externer LDAP-Server als Passdb-Backend genutzt wird, werden auf diesem Server spezifische ACLs eingerichtet, die dem Samba-Server nur die benötigten Lese- und Schreibrechte auf die Benutzer- und Gruppenobjekte gewähren. Anonymer Zugriff wird deaktiviert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Planungs- und Konfigurationsdokumentation für die LDAP-Anbindung. Die ACLs des LDAP-Servers werden analysiert, um sicherzustellen, dass sie dem Prinzip der geringsten Rechte folgen. Es wird versucht, mit einem anonymen oder unprivilegierten Benutzer auf sensible Attribute zuzugreifen, um die Wirksamkeit der ACLs zu testen. Automatisiert kann mit `ldapsearch` die Erreichbarkeit und die Berechtigungen geprüft werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a8-m4",
                    "uuid": "517cc00d-e3b0-4f4c-80a3-668f7cbd3fac",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die gesamte Kommunikation zwischen Samba und dem LDAP-Server sowie zwischen Clients und dem LDAP-Server wird zwingend mittels TLS (LDAPS auf Port 636 oder StartTLS auf Port 389) verschlüsselt. Die auf dem LDAP-Server definierten ACLs sind fein-granular und regeln den Zugriff auf Attribut-Ebene, basierend auf dem Prinzip der geringsten Rechte."
                      },
                      {
                        "name": "guidance",
                        "value": "Gültige TLS-Zertifikate von einer vertrauenswürdigen CA werden auf dem LDAP-Server installiert. Samba und andere Clients werden so konfiguriert, dass sie die verschlüsselte Verbindung erfordern und das Serverzertifikat validieren. Die LDAP-ACLs werden so gestaltet, dass z.B. ein normaler Benutzer sein eigenes Passwort ändern, aber nicht die Gruppenzugehörigkeiten anderer sehen kann."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration von Samba und des LDAP-Servers bezüglich der Erzwingung von TLS. Mittels eines Netzwerk-Sniffers (z.B. Wireshark) wird stichprobenartig geprüft, dass keine unverschlüsselten LDAP-Abfragen stattfinden. Die fein-granularen ACLs werden analysiert und ihre Wirksamkeit durch gezielte Abfragen mit verschiedenen Benutzerkonten getestet."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a8-m5",
                    "uuid": "f0ac2ab1-18fd-41a5-9a2c-a233f5260d6e",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das im Active Directory verwendete LDAP-Schema wird aktiv verwaltet und Erweiterungen werden nur nach einem formalen Genehmigungsprozess durchgeführt. Jeglicher administrative Zugriff auf das LDAP-Verzeichnis erfordert eine Multi-Faktor-Authentifizierung (MFA). Alle LDAP-Abfragen und -Änderungen werden detailliert protokolliert und von einem SIEM-System auf Anomalien (z.B. Massenexport von Daten, ungewöhnliche Zugriffszeiten) überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Change-Management-Prozess wird für Schema-Änderungen etabliert. MFA wird für alle administrativen Konten im AD durchgesetzt. Die Audit-Richtlinien auf den Domain Controllern werden so konfiguriert, dass detaillierte LDAP-Zugriffe protokolliert werden. Log-Forwarder senden diese Protokolle an ein zentrales SIEM, wo entsprechende Korrelations- und Alarmierungsregeln implementiert sind."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den Change-Management-Prozess für Schema-Änderungen. Es wird verifiziert, dass für administrative Konten MFA erzwungen wird. Die Konfiguration der Audit-Richtlinien auf den Domain Controllern und die Regeln im SIEM-System werden überprüft. Testweise werden anomale LDAP-Abfragen durchgeführt, um zu verifizieren, dass diese korrekt protokolliert und alarmiert werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "b3ca7b93-609f-4dff-b525-b753eb260d61",
                "control-id": "KONF.11.8",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.4-a10-m3",
                    "uuid": "0896981b-e4ce-4e6e-8241-8e326d469399",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Vom IT-Betrieb SOLLTE sichergestellt werden, dass Samba nur auf schadhafte Funktionen überprüfte und vertrauenswürdige externe Programme aufruft. Dies betrifft beispielsweise Skripte, die über Parameter wie `root preexec` aufgerufen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine informelle Richtlinie etabliert, die besagt, dass nur vom Administrator geprüfte und freigegebene Skripte in der Samba-Konfiguration verwendet werden dürfen. Eine Liste der erlaubten Skripte und Programme wird an zentraler Stelle gepflegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer durchsucht die `smb.conf` nach allen Parametern, die externe Programme aufrufen können (z.B. `*exec`, `*script`). Die aufgerufenen Programme werden mit der Liste der freigegebenen Programme abgeglichen. Die Skripte selbst werden stichprobenartig auf offensichtlich unsichere Konstrukte geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a10-m4",
                    "uuid": "04b9a02b-554b-4545-aab2-9d096a60a04d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert ein formaler, dokumentierter Genehmigungsprozess für jedes externe Programm oder Skript, das von Samba aufgerufen werden soll. Diese Skripte werden in einem Versionierungssystem (z.B. Git) verwaltet, und Änderungen unterliegen einem Code-Review-Prozess durch eine zweite Person, bei dem insbesondere auf Sicherheitsaspekte geachtet wird."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein dediziertes Verzeichnis (z.B. `/etc/samba/scripts`), dessen Berechtigungen stark eingeschränkt sind, wird für alle von Samba genutzten Skripte verwendet. Der Genehmigungsprozess ist in einem Ticketsystem abgebildet. Code-Reviews werden über Pull-Requests im Git-Repository durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den dokumentierten Genehmigungsprozess. Die Historie im Versionierungssystem wird stichprobenartig geprüft, um sicherzustellen, dass der Code-Review-Prozess eingehalten wird. Die Dateiberechtigungen des Skript-Verzeichnisses werden kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a10-m5",
                    "uuid": "460e1fe8-97cc-40e0-ad44-e891c69a06ba",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Ausführung externer Programme wird durch technische Maßnahmen wie Application Whitelisting und Sandboxing (z.B. mittels AppArmor oder SELinux) strikt auf die genehmigten Skripte und Programme beschränkt. Das SELinux/AppArmor-Profil für den Samba-Dienst (smbd) wird so gehärtet, dass es nur die explizit benötigten Aktionen erlaubt. Alle Aufrufe externer Programme werden detailliert protokolliert und auf verdächtige Aktivitäten überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein spezifisches AppArmor- oder SELinux-Profil wird für den `smbd`-Prozess entwickelt oder angepasst. Dieses Profil erlaubt nur den Lese- und Ausführungszugriff auf das genehmigte Skript-Verzeichnis. System-Auditing-Regeln (z.B. über `auditd`) werden erstellt, um jeden `execve`-Systemaufruf durch den `smbd`-Prozess zu protokollieren und an ein SIEM-System zur Analyse zu senden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das aktive AppArmor- oder SELinux-Profil für den Samba-Dienst. Die Konfiguration des System-Auditing-Frameworks wird überprüft. Es wird versucht, ein nicht genehmigtes Skript aus der Samba-Konfiguration heraus aufzurufen, um zu verifizieren, dass dies durch das Sandboxing-System verhindert und protokolliert wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "4739ac89-21d9-48c1-b30a-827fc815eef8",
                "control-id": "KONF.12.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.4-a4-m3",
                    "uuid": "ff9619a7-d999-413f-a12d-750b373ed642",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wird eine Version von Samba eingesetzt, die im New Technology File System (NTFS) keine Alternate Data Streams (ADS) abbilden kann, SOLLTEN Dateisystemobjekte KEINE ADS mit wichtigen Informationen enthalten, wenn sie über Systemgrenzen hinweg kopiert oder verschoben werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Administratoren und Benutzer werden über eine Richtlinie oder ein Merkblatt darüber informiert, dass die Speicherung von kritischen Daten in ADS auf von älteren Samba-Versionen verwalteten Shares nicht unterstützt wird und zu Datenverlust führen kann. Es wird empfohlen, auf die Verwendung von ADS zu verzichten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft, ob eine entsprechende Richtlinie oder Kommunikationsmaßnahme zur Vermeidung von ADS existiert und an die relevanten Benutzer verteilt wurde. Die eingesetzte Samba-Version wird überprüft, um festzustellen, ob das Problem überhaupt relevant ist (moderne Versionen können ADS meist abbilden)."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a4-m4",
                    "uuid": "f2d06a5c-82b2-49a0-96c1-450a5d5b690d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird eine moderne Samba-Version eingesetzt, die durch entsprechende VFS-Module (z.B. `vfs_streams_xattr`) in der Lage ist, NTFS Alternate Data Streams korrekt in erweiterten Dateiattributen des Unix-Dateisystems zu speichern. Die Konfiguration wird auf allen Servern konsistent angewendet. Alternativ wird ein Skript eingesetzt, das regelmäßig die Dateisysteme nach Dateien mit ADS durchsucht und diese meldet."
                      },
                      {
                        "name": "guidance",
                        "value": "In der `smb.conf` wird das VFS-Modul `streams_xattr` global oder für die relevanten Freigaben aktiviert. Die Funktionalität wird getestet, indem eine Datei mit ADS von einem Windows-Client auf den Share kopiert, zurückkopiert und die Integrität des ADS überprüft wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die `smb.conf` auf die Aktivierung des `vfs_streams_xattr`-Moduls oder eines vergleichbaren Moduls. Die korrekte Funktion wird durch einen praktischen Test verifiziert. Falls ein Scan-Skript verwendet wird, werden dessen Konfiguration und Protokolle geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a4-m5",
                    "uuid": "32d714b0-0c81-4026-af5c-cbeeaa563323",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Unterstützung für Alternate Data Streams ist durch eine moderne Samba-Version und die korrekte VFS-Konfiguration auf allen Systemen sichergestellt und wird durch Konfigurationsmanagement erzwungen. Ein Data-Loss-Prevention-(DLP)-System wird eingesetzt, um zu verhindern, dass Dateien, die sensible Informationen in ADS enthalten, auf unsichere Systeme oder über unsichere Kanäle übertragen werden, bei denen die ADS verloren gehen könnten."
                      },
                      {
                        "name": "guidance",
                        "value": "Die VFS-Konfiguration ist Teil des automatisierten Server-Build-Prozesses. Das DLP-System wird mit Regeln konfiguriert, die den Inhalt und die Metadaten von Dateien, einschließlich ADS, analysieren und bei Verstößen gegen die Datenklassifizierungsrichtlinie die Übertragung blockieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration im Konfigurationsmanagementsystem. Die Regeln und Protokolle des DLP-Systems werden analysiert. Es wird ein Testfall durchgeführt, bei dem versucht wird, eine Datei mit einem als sensibel klassifizierten ADS auf einen nicht konformen Speicherort zu kopieren, um die Blockierungsfunktion des DLP-Systems zu überprüfen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "bed0cca2-44a2-4b4d-ad96-8442ccafc9a3",
                "control-id": "KONF.14.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.4-a15-m3",
                    "uuid": "d72627d3-f421-4fa9-bec0-62363b7baf2f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Fähigkeit zur SMBv3-Verschlüsselung ist auf dem Server aktiviert und verfügbar. Die Verschlüsselung wird jedoch nicht global erzwungen, sondern gezielt für einzelne Freigaben aktiviert, die besonders sensible Daten enthalten. Die entsprechende Richtlinie, welche Freigaben verschlüsselt werden müssen, ist dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die globale Einstellung `smb encrypt` steht auf `auto` oder `if_required`. Für spezifische Freigaben, z.B. `[Personalakten]`, wird der Parameter `smb encrypt = required` in der `smb.conf` gesetzt. Die Liste der zu verschlüsselnden Freigaben ist in der Sicherheitsrichtlinie des Unternehmens festgehalten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die `smb.conf` auf die globalen und freigabe-spezifischen `smb encrypt`-Einstellungen. Die Liste der verschlüsselten Freigaben wird mit der Unternehmensrichtlinie abgeglichen. Mittels Wireshark wird verifiziert, dass der Zugriff auf eine sensible Freigabe verschlüsselt ist, während der Zugriff auf eine unkritische Freigabe unverschlüsselt sein kann."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a15-m4",
                    "uuid": "9135e172-af59-4da8-a8e5-c6d996a3f63c",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Einstellung `smb encrypt = required` wird global für den gesamten Server oder mindestens für alle Freigaben, die nicht ausschließlich öffentliche Daten enthalten, gesetzt. Verbindungsversuche von Clients, die keine SMBv3-Verschlüsselung unterstützen, werden aktiv abgewiesen und protokolliert. Ältere SMB-Dialekte wie SMBv1 werden explizit deaktiviert."
                      },
                      {
                        "name": "guidance",
                        "value": "In der globalen Sektion der `smb.conf` wird `smb encrypt = required` und `server min protocol = SMB3` (oder ein spezifischerer Dialekt wie `SMB3_11`) gesetzt. Die Samba-Logs werden auf fehlgeschlagene Verbindungsversuche aufgrund von Verschlüsselungsanforderungen überwacht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die globalen Einstellungen für `smb encrypt` und `server min protocol` in der `smb.conf`. Es wird versucht, eine Verbindung mit einem veralteten Client (der z.B. nur SMBv1 spricht) oder ohne Verschlüsselungsunterstützung herzustellen, um zu prüfen, ob die Verbindung korrekt abgewiesen wird. Die Logdateien werden auf entsprechende Einträge geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a15-m5",
                    "uuid": "42b027ee-6687-4735-9154-c47982e80e46",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Um die Sicherheit der Datenpakete auf dem Transportweg zu gewährleisten, SOLLTEN die Datenpakete mit den ab SMB Version 3 integrierten Verschlüsselungsverfahren verschlüsselt werden. Dies wird durch eine globale Konfiguration erzwungen, die Verschlüsselung für alle Verbindungen vorschreibt. Zusätzlich werden unsichere SMB-Dialekte (SMBv1, SMBv2) explizit deaktiviert, um Downgrade-Angriffe zu verhindern. Der Netzwerkverkehr wird aktiv überwacht, um sicherzustellen, dass kein unverschlüsselter SMB-Verkehr zum oder vom Server stattfindet."
                      },
                      {
                        "name": "guidance",
                        "value": "In der `smb.conf` werden die Parameter `server min protocol = SMB3_11` und `smb encrypt = required` global gesetzt. Diese Konfiguration wird durch ein Konfigurationsmanagementsystem erzwungen. Ein Intrusion Detection System (IDS) im Netzwerk wird mit Regeln konfiguriert, die Alarm schlagen, wenn unverschlüsselte SMB-Pakete (Port 445/TCP) an den Samba-Server adressiert sind."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Samba-Konfiguration im Konfigurationsmanagementsystem. Die Regeln und Alarmierungsprotokolle des IDS werden analysiert. Es wird ein aktiver Scan des Netzwerkverkehrs zum Samba-Server durchgeführt (z.B. mit einem SPAN-Port und Wireshark), um zu bestätigen, dass ausschließlich verschlüsselte SMB3-Kommunikation stattfindet."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e12ed1d2-1243-4f0d-bcd0-2ce65b46b0dd",
                "control-id": "KONF.6.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.4-a5-m3",
                    "uuid": "918d40eb-c4e9-465a-99f9-89edc8f0480c",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die von Samba standardmäßig verwendeten Parameter, mit denen DOS-Attribute auf das Unix-Dateisystem abgebildet werden, SOLLTEN NICHT verwendet werden. Stattdessen SOLLTE Samba so konfiguriert werden, dass es DOS-Attribute in Extended Attributes speichert. Die Freigaben SOLLTEN ausschließlich über die Samba-Registry verwaltet werden. Ferner SOLLTEN die effektiven Zugriffsberechtigungen auf die Freigaben des Samba-Servers regelmäßig überprüft werden."
                      },
                      {
                        "name": "guidance",
                        "value": "In der `smb.conf` werden Parameter wie `map archive = no`, `map hidden = no` etc. gesetzt und stattdessen `store dos attributes = yes` verwendet. Die Verwaltung von Freigaben wird von der `smb.conf` in die Registry-Datenbank (`net conf setparm` und `net share add`) verlagert. Es gibt einen definierten, manuellen Prozess für eine jährliche Überprüfung der Berechtigungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die `smb.conf` auf die korrekten Parameter für die Attribut-Speicherung. Mit `net conf list` und `net share list` wird geprüft, ob die Freigaben in der Registry verwaltet werden. Die Protokolle der jährlichen Berechtigungs-Reviews werden eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a5-m4",
                    "uuid": "975eb6d7-4d13-4123-8f78-d1c94a11decd",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle SOLLTE-Anforderungen aus Level 3 sind umgesetzt. Es ist ein dokumentierter Prozess für die quartalsweise Überprüfung der Zugriffsberechtigungen etabliert und wird nachweislich befolgt. Es werden Skripte eingesetzt, um die Überprüfung der Berechtigungen zu vereinfachen, indem beispielsweise die effektiven Rechte für kritische Verzeichnisse automatisiert ausgelesen und mit einem Soll-Zustand verglichen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein PowerShell- oder Shell-Skript wird entwickelt, das `smbcacls` oder ähnliche Werkzeuge verwendet, um die NTFS-ACLs auf den Freigaben auszulesen und in einem übersichtlichen Bericht darzustellen. Dieser Bericht dient als Grundlage für das quartalsweise Review durch die jeweiligen Datenverantwortlichen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Dokumentation des Review-Prozesses und die Protokolle der letzten vier Quartals-Reviews. Das Skript zur Berechtigungsanalyse wird eingesehen und dessen Ergebnisse werden stichprobenartig mit den tatsächlichen Berechtigungen auf dem Server verglichen. Automatisiert kann das Skript erneut ausgeführt werden, um einen aktuellen Bericht zu generieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a5-m5",
                    "uuid": "a5b75f7b-4a15-4303-8588-396cad6a7a39",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Überprüfung der Zugriffsberechtigungen (Access Reviews) ist vollständig durch ein Identity- und Access-Management-(IAM)-Werkzeug automatisiert. Dieses Werkzeug fordert die Datenverantwortlichen regelmäßig (z.B. quartalsweise) zur Re-Zertifizierung der bestehenden Zugriffe auf. Jede Abweichung von der definierten Berechtigungs-Baseline, die durch das IAM-System festgestellt wird, führt zu einem sofortigen Alarm und einem automatisierten Korrektur- oder Eskalationsprozess."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein IAM-Tool wie SailPoint, OneIdentity oder eine Open-Source-Lösung wird mit dem Samba-Server (via AD-Integration) verbunden. Workflows für die Access-Zertifizierung werden eingerichtet. Alarmierungsregeln werden im IAM- oder SIEM-System konfiguriert, um auf kritische Berechtigungsänderungen (z.B. 'Jeder' erhält Vollzugriff) sofort zu reagieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration und die Workflows im IAM-System. Die Berichte der abgeschlossenen Zertifizierungs-Kampagnen werden als Nachweis für durchgeführte Reviews herangezogen. Es wird geprüft, ob Alarmierungsregeln für Berechtigungsabweichungen existieren und ob Test-Alarme erfolgreich ausgelöst werden können."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "b0f6d00b-1f4d-4c72-ab10-549fe7c882a7",
                "control-id": "NOT.4.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.4-a13-m3",
                    "uuid": "b01590c0-cd72-4c44-a8ee-7604b61f9da8",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTEN alle Systemkomponenten in das institutionsweite Datensicherungskonzept eingebunden werden, die erforderlich sind, um einen Samba-Server wiederherzustellen. Dies umfasst Kontoinformationen aus allen eingesetzten Backends (z.B. `passdb.tdb`), alle TDB-Dateien und, falls für Freigaben eingesetzt, die Samba-Registry (`registry.tdb`)."
                      },
                      {
                        "name": "guidance",
                        "value": "Zusätzlich zur Sicherung der eigentlichen Dateifreigaben wird der Backup-Job so konfiguriert, dass er explizit die Verzeichnisse mit den Samba-Datenbanken (z.B. `/var/lib/samba/`, `/var/cache/samba/`, `/etc/samba/`) mitsichert. Es wird sichergestellt, dass die Sicherung bei laufendem Betrieb konsistent ist, z.B. durch Nutzung von Snapshots oder durch kurzzeitiges Stoppen der Dienste."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der Backup-Software. Es wird verifiziert, dass die Pfade zu den kritischen Samba-Systemdateien (insbesondere TDB-Dateien) in der Backup-Job-Definition enthalten sind. Die Protokolle der letzten Sicherungsläufe werden auf erfolgreiche Durchführung geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a13-m4",
                    "uuid": "af380bc7-45be-4e0d-91ee-a873e41b2c29",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Sicherungsprozess ist vollständig automatisiert. Es werden regelmäßig, mindestens halbjährlich, automatisierte Wiederherstellungstests durchgeführt, um die Integrität und Vollständigkeit der Sicherungen zu überprüfen. Diese Tests umfassen die vollständige Wiederherstellung eines Samba-Servers (inklusive AD-Rolle, falls zutreffend) in einer isolierten Testumgebung."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Skript automatisiert den Wiederherstellungstest: Es provisioniert eine neue VM, stellt das Betriebssystem und die Samba-Daten aus dem Backup wieder her und führt eine Reihe von Funktionstests durch (z.B. Authentifizierung, Dateizugriff). Die Ergebnisse der Tests werden protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Protokolle der durchgeführten Wiederherstellungstests der letzten 12 Monate an. Die Skripte für die automatisierten Tests werden eingesehen. Die Dokumentation des Wiederherstellungsprozesses wird auf Vollständigkeit und Verständlichkeit geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.4-a13-m5",
                    "uuid": "0e79ee34-8c2f-44ed-93bb-164e67fbd4fb",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Sicherungs- und Wiederherstellungsprozess ist in einem detaillierten Notfallplan (Disaster Recovery Plan) dokumentiert. Die Ziele für Wiederherstellungszeit (RTO) und Wiederherstellungspunkt (RPO) sind definiert und werden durch die quartalsweise durchgeführten Wiederherstellungstests regelmäßig überprüft. Alle Sicherungen werden vor der Übertragung und am Speicherort stark verschlüsselt und an einem geografisch getrennten, sicheren Ort aufbewahrt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der DR-Plan wird jährlich überprüft und aktualisiert. Die Backup-Software wird so konfiguriert, dass sie Ende-zu-Ende-Verschlüsselung verwendet. Die Backups werden an einen zweiten, räumlich getrennten Standort repliziert. Die Ergebnisse der RTO/RPO-Messungen aus den Tests werden dem Management berichtet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den Notfallplan und die definierten RTO/RPO-Werte. Die Konfiguration der Verschlüsselung in der Backup-Lösung wird verifiziert. Die Protokolle der letzten Wiederherstellungstests werden geprüft, um die Einhaltung von RTO und RPO zu validieren. Es wird ein Nachweis über die Lagerung der Backups an einem externen Standort gefordert."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}