{
  "component-definition": {
    "uuid": "1f5ede86-8fb3-4a1e-902b-4199a742499b",
    "metadata": {
      "title": "INF.6 Datenträgerarchiv - Benutzerdefiniert",
      "last-modified": "2025-11-14T22:09:01.817069+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "5925eeab-7016-45ee-81de-45c565134a77",
        "type": "physical",
        "title": "INF.6 Datenträgerarchiv",
        "description": "This component represents the implementation of all controls for Baustein INF.6.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Datenträgerarchive sind abgeschlossene Räumlichkeiten innerhalb einer Institution, in denen Datenträger jeder Art gelagert werden. Dazu gehören neben Datenträgern, auf denen digitale Informationen abgespeichert sind, auch Papierdokumente, Filme oder sonstige Medien."
          },
          {
            "name": "Zielsetzung",
            "value": "In diesem Baustein werden die typischen Gefährdungen und Anforderungen bezüglich der Informationssicherheit für ein Datenträgerarchiv beschrieben. Ziel ist der Schutz der Informationen, die sich auf den dort archivierten Datenträgern und weiteren Medien befinden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein INF.6 Datenträgerarchiv ist für alle Räume anzuwenden, die als Archiv von Datenträgern genutzt werden.<BR>Dieser Baustein betrachtet technische und nichttechnische Sicherheitsanforderungen für Datenträgerarchive. Empfehlungen zur korrekten Archivierung werden in diesem Baustein nicht behandelt. Hinweise dazu finden sich im Baustein OPS.1.2.2 Archivierung.<BR>Im Rahmen des IT-Grundschutzes werden an die Archivräume hinsichtlich des Brandschutzes keine erhöhten Anforderungen gestellt. Zusätzliche Anforderungen an den Brandschutz können aber durch die Behältnisse erfüllt werden, in denen die Datenträger aufbewahrt werden."
          },
          {
            "name": "2.1. Unzulässige Temperatur und Luftfeuchtigkeit",
            "value": "Bei der Lagerung von digitalen Langzeitspeichermedien können Temperaturschwankungen oder zu hohe Luftfeuchtigkeit zu Datenfehlern und reduzierter Speicherdauer führen."
          },
          {
            "name": "2.2. Fehlende oder unzureichende Regelungen",
            "value": "Wenn Mitarbeitende die Fenster und Türen nach Verlassen des Datenträgerarchivs nicht schließen oder verschließen, können Datenträger oder andere Informationen entwendet werden. Sensible Informationen könnten dann von unberechtigten Personen eingesehen oder weitergegeben werden. Wenn Mitarbeitenden die entsprechenden Regelungen nicht hinreichend bekannt sind, können Sicherheitslücken auftreten. Regelungen lediglich festzulegen ist nicht ausreichend. Sie müssen beachtet werden, damit der Betrieb störungsfrei ist. Viele Probleme entstehen, wenn Regelungen zwar vorhanden, aber nicht bekannt sind."
          },
          {
            "name": "2.3. Unbefugter Zutritt zu schutzbedürftigen Räumen",
            "value": "Fehlen Zutrittskontrollen oder sind diese unzureichend, können unberechtigte Personen ein Datenträgerarchiv betreten und schützenswerte Informationen einsehen, entwenden oder manipulieren. Dadurch kann die Verfügbarkeit, Vertraulichkeit und Integrität der archivierten Informationen beeinträchtigt werden. Selbst wenn keine unmittelbaren Schäden zu erkennen sind, kann der Betriebsablauf gestört werden."
          },
          {
            "name": "2.4. Diebstahl",
            "value": "Da viele Datenträger sehr handlich sind, ist es umso leichter, sie unbemerkt in eine Tasche oder unter die Kleidung zu stecken und mitzunehmen. Gibt es keine Kopien von den Informationen, sind die auf den gestohlenen Datenträgern abgespeicherten Informationen verloren. Darüber hinaus könnten die Personen, die Datenträger entwendet haben, vertrauliche Informationen einsehen und offenlegen. Dadurch können weitere Schäden entstehen. Diese wiegen in den meisten Fällen deutlich schwerer als die Kosten von ersatzweise angeschafften Datenträgern."
          }
        ],
        "control-implementations": [
          {
            "uuid": "7e5ba8e9-31e1-4a6a-b99e-3170eddc3497",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/datentrgerarchiv_profile.json",
            "description": "Implementation for all controls in Baustein INF.6",
            "implemented-requirements": [
              {
                "uuid": "df8ec331-f8db-48fa-b170-81e642a6d26d",
                "control-id": "GEB.11.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.6.A1-m1",
                    "uuid": "0acf5ebd-3583-422d-8195-3ed5a6bce3f4",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist nur ein einziger Handfeuerlöscher vorhanden, dessen Standort nicht allen relevanten Mitarbeitenden bekannt ist. Es finden keine regelmäßigen Inspektionen oder Schulungen statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Maßnahme beschränkt sich auf die passive Bereitstellung eines einzelnen Feuerlöschers ohne organisatorische Einbettung. Meist handelt es sich um einen universellen ABC-Löscher."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, ob ein Feuerlöscher existiert. Durch Befragung von Mitarbeitenden wird festgestellt, ob dessen Standort und Bedienung bekannt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A1-m2",
                    "uuid": "249ff461-8a94-4965-a878-5057cfc79fd4",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Geeignete Handfeuerlöscher sind an mehreren strategischen Punkten im und am Datenträgerarchiv platziert. Die Wartungsintervalle werden jedoch nur unregelmäßig eingehalten. Eine grundlegende Einweisung in die Benutzung wird auf Nachfrage erteilt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Standorte der Feuerlöscher sind markiert. Die Wartung wird oft nur im Rahmen allgemeiner Gebäudebegehungen durchgeführt, nicht spezifisch für das Archiv."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz und Kennzeichnung von Handfeuerlöschern. Die Wartungsplaketten werden stichprobenartig kontrolliert. Es wird geprüft, ob Unterlagen für Einweisungen existieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A1-m3",
                    "uuid": "d567919e-d1c5-4738-ab97-bf0a9ac7cd11",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Im Brandfall MÜSSEN im Datenträgerarchiv geeignete Handfeuerlöscher leicht erreichbar sein. Diese Handfeuerlöscher MÜSSEN regelmäßig inspiziert und gewartet werden. Mitarbeitende, die in der Nähe eines Datenträgerarchivs tätig sind, MÜSSEN in die Benutzung der Handfeuerlöscher eingewiesen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein Plan für die Standorte der Handfeuerlöscher erstellt, wobei auf die Eignung für IT-Brände (z.B. CO2-Löscher) geachtet wird. Inspektionen, Wartungen und Schulungen werden dokumentiert. Die Zuständigkeit liegt beim Brandschutzbeauftragten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer gleicht die Standorte und Typen der Feuerlöscher mit dem Brandschutzkonzept ab. Die Wartungs- und Schulungsnachweise werden für den geforderten Zeitraum eingesehen und auf Vollständigkeit geprüft. Es kann eine automatisierte Prüfung durch Abfrage der Wartungsdatenbank des Dienstleisters erfolgen."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A1-m4",
                    "uuid": "30d26d66-0204-430a-b8e2-494a3a76d7ba",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zu den definierten Maßnahmen sind automatische Brandmelder (z.B. Rauchmelder) installiert, die an eine interne Alarmierungsstelle gekoppelt sind. Die Art der Feuerlöscher ist spezifisch auf die gelagerten Medien abgestimmt (z.B. CO2-Löscher, um Schäden an Elektronik zu vermeiden)."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Brandmeldeanlage wird in das Gebäudeleitsystem integriert. Regelmäßige Tests der Meldekette werden durchgeführt und protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Funktionsfähigkeit der Brandmelder durch einen Testalarm. Die Spezifikation der Löscher wird auf ihre Eignung für IT-Umgebungen geprüft. Alarmierungsprotokolle werden eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A1-m5",
                    "uuid": "456a581c-5903-4315-8393-42a67daa88e0",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist eine automatische, für IT-Medien unschädliche Gaslöschanlage installiert. Die Anlage wird regelmäßig geprüft und ist an das zentrale Sicherheitsmanagementsystem gekoppelt, um im Alarmfall sofortige Reaktionen und eine automatische Abschaltung von Lüftungsanlagen auszulösen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Gaslöschanlage ist VdS-zertifiziert. Die Auslösung ist mit der Zutrittskontrolle gekoppelt, um eine Gefährdung von Personen auszuschließen. Die Wartung und Tests der Gesamtanlage werden von spezialisierten Fachfirmen durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Zertifizierungs- und Wartungsunterlagen der Gaslöschanlage. Die Protokolle der letzten Systemtests, einschließlich der korrekten Ansteuerung von Umsystemen (Lüftung, Alarmierung), werden geprüft. Eine automatisierte Überprüfung kann den Status der Löschanlage über das zentrale Sicherheitsmanagementsystem abfragen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "f60ef3e1-49f8-4d74-922e-9c771f23bc8d",
                "control-id": "GEB.11.1.6",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "risk-analysis",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.6.A9-m2",
                    "uuid": "26c10550-5451-41b6-b929-d8a6fb60c5ab",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es sind batteriebetriebene Standalone-Rauchmelder sowie ein einfacher Tür-Magnetkontakt installiert, der bei Öffnung einen lokalen Alarm (Sirene) auslöst."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Geräte sind aus dem Einzelhandel und nicht miteinander vernetzt oder an eine externe Stelle aufgeschaltet. Die Batterien müssen manuell und regelmäßig geprüft werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer testet die Funktion der Rauchmelder und des Türkontakts. Es wird nachgefragt, wie die regelmäßige Prüfung der Batterien sichergestellt wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A9-m3",
                    "uuid": "e8820a66-74fc-450d-9f13-ac64ba54701f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE in Datenträgerarchiven eine angemessene Gefahrenmeldeanlage eingerichtet werden. Diese Gefahrenmeldeanlage SOLLTE regelmäßig geprüft und gewartet werden. Es SOLLTE sichergestellt sein, dass diejenigen Personen, die Gefahrenmeldungen empfangen, in der Lage sind, auf Alarmmeldungen angemessen zu reagieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Gefahrenmeldeanlage, die mindestens Einbruch und Brand meldet, wird installiert. Die Alarmmeldungen laufen bei einer internen Stelle (z.B. Pforte, IT-Abteilung) auf. Es existiert ein dokumentierter Plan, der festlegt, wer im Alarmfall welche Schritte unternimmt. Die Anlage wird gemäß Herstellervorgaben gewartet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Konzept der Gefahrenmeldeanlage, die Wartungsverträge und den Alarmplan. Durch einen Testalarm wird die Meldekette zur internen Stelle überprüft. Es wird durch Befragung verifiziert, ob die Empfänger der Meldung ihre Aufgaben kennen."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A9-m4",
                    "uuid": "f9da995d-2918-4b43-aecb-acb63f8ae856",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist eine integrierte Gefahrenmeldeanlage installiert, die Einbruch (Öffnungs- und Bewegungsmelder), Brand (Rauch- und Wärmemelder) sowie Wassereinbruch abdeckt. Die Anlage ist auf eine 24/7 besetzte Sicherheitsleitstelle (intern oder extern) aufgeschaltet. Die Reaktionsprozeduren sind detailliert dokumentiert und werden regelmäßig geübt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Anlage ist nach VdS-Klasse A oder B zertifiziert. Der Vertrag mit der Sicherheitsleitstelle regelt die Interventionszeiten und -maßnahmen. Die Übungen und deren Ergebnisse werden protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Zertifizierung der Anlage und den Vertrag mit der Sicherheitsleitstelle. Die Protokolle der letzten Übungen werden analysiert. Die Auslösung eines Testalarms dient der Überprüfung der gesamten Melde- und Interventionskette. Die Konfiguration der Anlage kann automatisiert auf die Einhaltung der definierten Sicherheitsrichtlinien überprüft werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A9-m5",
                    "uuid": "4915de76-a434-4306-8076-956f34bc790c",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Gefahrenmeldeanlage ist nach VdS-Klasse C zertifiziert. Sie integriert multiple, redundante Sensortypen (z.B. Lichtschranken, Körperschallsensoren, Brandfrühesterkennung durch Rauchansaugsysteme). Alarme werden automatisch mit den Aufzeichnungen der Videoüberwachungsanlage korreliert und dem Interventionspersonal bereitgestellt. Die Integrität der Anlage und ihrer Kommunikationswege wird permanent überwacht (Sabotageschutz)."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Planung und Installation erfolgen durch einen VdS-zertifizierten Errichter. Die Korrelation von Alarm- und Videodaten wird über eine Gefahrenmanagement-Software realisiert. Die Übertragung zur Leitstelle erfolgt über mindestens zwei voneinander unabhängige, überwachte Wege."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die vollständige VdS-Attestierung der Anlage. Die Konfiguration des Gefahrenmanagementsystems wird geprüft. Die Sabotagesicherheit wird durch Simulation einer Leitungsunterbrechung getestet. Die Korrelation von Alarm und Videobild wird durch Auslösung verschiedener Sensoren verifiziert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "dee04b6e-0533-4f02-a5a5-d0e43d732673",
                "control-id": "GEB.11.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.6.A6-m1",
                    "uuid": "d880a6cc-5404-4f13-bdfa-e5a2ac910c9b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Existenz von wasserführenden Leitungen im oder über dem Archivraum ist bekannt, es werden jedoch keine spezifischen Schutzmaßnahmen ergriffen."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Risiko wird als gering eingestuft oder ignoriert. Es gibt keine Vorkehrungen, um Lecks zu erkennen oder darauf zu reagieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer identifiziert bei einer Begehung wasserführende Leitungen und fragt nach, welche Maßnahmen zum Schutz vor Wasserschäden existieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A6-m2",
                    "uuid": "67e84694-d7ed-4293-b4fa-bd1b51d0e6dc",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wasserführende Leitungen werden im Rahmen von allgemeinen, regelmäßigen Gebäudebegehungen visuell auf Dichtigkeit und Korrosion überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Diese Überprüfung ist Teil einer Checkliste für den Hausmeister, wird aber nicht spezifisch dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer befragt den Hausmeister zu den Inspektionsroutinen und sichtet die allgemeinen Checklisten für Gebäudebegehungen."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A6-m3",
                    "uuid": "b9209b1c-d8cd-4fa4-902e-a7800dda567f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In Datenträgerarchiven SOLLTEN unnötige wasserführende Leitungen generell vermieden werden. Sind dennoch Wasserleitungen durch das Datenträgerarchiv hinweg verlegt, SOLLTEN diese regelmäßig daraufhin überprüft werden, ob sie noch dicht sind. Zudem SOLLTEN Vorkehrungen getroffen werden, um frühzeitig erkennen zu können, ob dort Wasser austritt. Für ein Datenträgerarchiv mit Hochverfügbarkeitsanforderungen SOLLTE es Reaktionspläne geben, die genau vorgeben, wie im Fall eines Lecks vorzugehen ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei der Planung neuer Archive wird die Vermeidung wasserführender Leitungen als Anforderung definiert. Für bestehende Archive werden die Leitungen in einem Kataster erfasst und regelmäßige, dokumentierte Inspektionen durchgeführt. Es wird ein einfacher Reaktionsplan erstellt, der Kontaktpersonen und erste Schritte festlegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet den Leitungskataster, die Inspektionsprotokolle und den Reaktionsplan. Planungsunterlagen für neue Archive werden auf die Einhaltung der Anforderung geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A6-m4",
                    "uuid": "d9db902a-ca8d-4bc0-be6c-579b16b2e3d7",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Am Boden des Archivraums sind Wassermelder installiert, die an eine Alarmierungsanlage gekoppelt sind. Die Leitungen sind, wo möglich, mit einer sekundären Abdichtung oder Auffangwannen versehen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Wassermelder werden an strategischen Tiefpunkten platziert. Die Alarmierung erfolgt per E-Mail oder SMS an die Haustechnik. Die Reaktionspläne werden regelmäßig geübt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer testet die Funktion der Wassermelder (z.B. durch Befeuchten) und die Alarmierungskette. Die bauliche Umsetzung der sekundären Abdichtung wird begutachtet. Die Protokolle der Übungen werden eingesehen. Automatisiert kann der Status der Wassermelder über ein angebundenes System abgefragt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A6-m5",
                    "uuid": "8fca0fc1-702d-4708-b2c3-408b4ac5f507",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein automatisches Absperrventil, das mit den Wassermeldern gekoppelt ist, ist am Eintrittspunkt der wasserführenden Leitungen in den Bereich des Archivs installiert. Die Alarmierung erfolgt an eine 24/7 besetzte Stelle. Die Reaktionspläne sind detailliert und werden mindestens jährlich unter realistischen Bedingungen geübt."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Magnetventil wird so installiert, dass es im Alarmfall die Wasserzufuhr für den betreffenden Bereich unterbricht. Die Anbindung an die ständig besetzte Stelle (z.B. Wachdienst) ist vertraglich geregelt. Die Übungen umfassen auch die Evakuierung von Medien aus den gefährdeten Bereichen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die gesamte Wirkkette vom Auslösen des Sensors über das Schließen des Ventils bis zur Alarmierung der besetzten Stelle durch einen simulierten Alarm. Die Dokumentation der jährlichen Übungen wird detailliert geprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "8534bb77-3355-457b-8a77-d885347c7079",
                "control-id": "GEB.3.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.6.A8-m2",
                    "uuid": "95ce3aec-a8af-4938-9edd-1c5a50953be8",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Tür des Archivs ist eine Vollholztür mit einem Sicherheitsschließblech und einem Schloss mit Aufbohrschutz. Eventuell vorhandene Fenster sind abschließbar und nicht im Erdgeschoss."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Standardkomponenten aus dem Baumarkt oder Fachhandel verwendet, die eine grundlegende Erhöhung der Sicherheit gegenüber Standardtüren bieten, aber keine zertifizierte Widerstandsklasse aufweisen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer führt eine visuelle Inspektion der Tür, des Schlosses, des Schließblechs und der Fenster durch, um die grundlegenden Sicherheitsmerkmale zu bewerten."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A8-m3",
                    "uuid": "c757de14-90cc-4d55-8c3c-2839147e73d5",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Sicherungsmaßnahmen wie Fenster, Türen und Wände SOLLTEN bezüglich Einbruch, Brand und Rauch gleichwertig und angemessen sein. Abhängig vom Schutzbedarf SOLLTE eine geeignete Widerstandsklasse gemäß der DIN EN 1627 erfüllt werden. Alle Sicherheitstüren und -fenster SOLLTEN regelmäßig daraufhin überprüft werden, ob sie noch entsprechend funktionieren. Der komplette Raum SOLLTE einen dem Schutzbedarf genügenden mechanischen Widerstand aufweisen, der keinesfalls unter RC3 (gemäß DIN EN 1627) liegt."
                      },
                      {
                        "name": "guidance",
                        "value": "Für den Raum wird basierend auf dem Schutzbedarf die Widerstandsklasse RC3 als Ziel definiert. Es werden Türen und Fenster beschafft und eingebaut, die nach DIN EN 1627 für diese Klasse zertifiziert sind. Die Wände werden auf eine entsprechende Widerstandsfähigkeit geprüft oder ertüchtigt. Es gibt einen Plan für die regelmäßige Inspektion der Schließmechanismen und Beschläge."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Zertifikate und Einbauanleitungen für die Türen und Fenster, um die Konformität mit RC3 zu verifizieren. Die Inspektionsprotokolle der Sicherheitskomponenten werden geprüft. Ein automatisiertes Verfahren ist hier nicht anwendbar, es erfordert eine physische Inspektion und Dokumentenprüfung."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A8-m4",
                    "uuid": "f4be8726-b459-44a2-8feb-a7efd2ccadeb",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Komponenten des Raumes (Türen, Fenster, Wände, Decke, Boden) sind nachweislich nach der Widerstandsklasse RC4 gemäß DIN EN 1627 zertifiziert. Zusätzlich sind alle Öffnungen mit Einbruchmeldesensoren (z.B. Magnetkontakte, Glasbruchsensoren) ausgestattet, die Teil einer Einbruchmeldeanlage sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden zertifizierte RC4-Elemente von einem Fachbetrieb eingebaut. Die Einbruchmeldeanlage ist nach VdS-Klasse A oder B zertifiziert. Die Sensoren werden regelmäßig auf ihre Funktion geprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Zertifikate für die RC4-Komponenten und die Einbruchmeldeanlage. Die Funktion der Sensoren wird durch Tests (z.B. Öffnen der Tür im scharfgeschalteten Zustand) verifiziert. Die Protokolle der regelmäßigen Anlagenwartung werden eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A8-m5",
                    "uuid": "5def7556-95f8-463d-aeb3-2a60f53155c9",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Archivraum ist als zertifiziertes Raum-in-Raum-System (modularer Wertschutzraum) mit einer Widerstandsklasse von RC5 oder höher ausgeführt. Alle Öffnungen werden nicht nur durch Öffnungs- und Glasbruchsensoren, sondern zusätzlich durch Körperschallsensoren an Wänden und Decke überwacht. Die Einbruchmeldeanlage hat eine VdS-Klasse C Zertifizierung."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Planung und der Aufbau des Wertschutzraums erfolgen durch ein spezialisiertes, zertifiziertes Unternehmen. Die Anbindung der hochsensiblen Sensorik an die Einbruchmeldezentrale ist redundant ausgelegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die vollständige Zertifizierungsdokumentation des Raum-in-Raum-Systems und der VdS-Klasse-C-Anlage. Die Prüfprotokolle des Errichters und die regelmäßigen Wartungsberichte werden detailliert analysiert. Ein Penetrationstest durch einen externen Dienstleister kann zur Validierung der Gesamtsicherheit beauftragt werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c97d40dc-08fb-4d6e-8a84-724985fd28c5",
                "control-id": "GEB.5.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.6.A2-m1",
                    "uuid": "b00c58cc-8070-4073-9d2b-2380275eea51",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zutritt zum Archivraum wird durch ein einfaches Standardschloss gesichert. Eine Liste der Schlüsselbesitzer existiert, wird aber nicht regelmäßig aktualisiert oder auf Notwendigkeit geprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein einfacher Zylinderschloss-Schlüssel wird an eine größere Gruppe von Mitarbeitenden ausgegeben. Es gibt keine physische Verstärkung der Tür oder des Rahmens."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer inspiziert den Schließmechanismus und fordert die Schlüsselliste an. Durch Befragungen wird die Aktualität der Liste und der Bedarf der Schlüsselbesitzer stichprobenartig überprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A2-m2",
                    "uuid": "6f314ee6-32e5-4625-a8b8-c0ab5578899f",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist ein Sicherheitsschloss installiert. Der Zutritt ist auf eine definierte Personengruppe beschränkt und in einer Richtlinie festgelegt, es findet jedoch keine Protokollierung der Zutritte statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Schließzylinder mit Sicherungskarte wird verwendet, um unautorisierte Schlüsselkopien zu verhindern. Die Richtlinie wird den berechtigten Personen zur Kenntnis gegeben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert den Typ des Schlosses und die Existenz der Zutrittsrichtlinie. Die Liste der berechtigten Personen wird mit den tatsächlichen Schlüssel- oder Karteninhabern abgeglichen."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A2-m3",
                    "uuid": "f127b2bd-139b-4df1-9eb9-68cc92aa2038",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zutritt zum Datenträgerarchiv DARF NUR für befugte Personen möglich sein. Der Zutritt MUSS auf ein Mindestmaß an Mitarbeitenden reduziert sein. Daher MUSS der Zutritt geregelt und kontrolliert werden. Für die Zutrittskontrolle MUSS ein Konzept entwickelt werden. Die darin festgelegten Maßnahmen für die Zutrittskontrolle SOLLTEN regelmäßig daraufhin überprüft werden, ob sie noch wirksam sind. Der komplette Raum MUSS einen dem Schutzbedarf genügenden mechanischen Widerstand aufweisen, der keinesfalls unter RC2 (gemäß DIN EN 1627) liegen darf."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Zutrittskontrollkonzept wird erstellt und verabschiedet. Darin werden die berechtigten Rollen definiert und das Need-to-know-Prinzip angewendet. Die Widerstandsklasse RC2 wird für Türen, Fenster und Wände sichergestellt und durch Herstellererklärungen nachgewiesen. Regelmäßige Überprüfungen der Berechtigungen werden durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Zutrittskontrollkonzept und die Liste der Berechtigten. Es werden die Nachweise für die erreichte Widerstandsklasse (z. B. Zertifikate für Türen) geprüft. Die Protokolle der Berechtigungsreviews werden eingesehen. Ein automatisierter Audit kann die konfigurierten Berechtigungen in einem elektronischen Zutrittskontrollsystem mit den Vorgaben aus dem Konzept abgleichen."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A2-m4",
                    "uuid": "67fcd9a9-e915-4a72-a94c-bdaf04336c17",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird ein elektronisches Zutrittskontrollsystem (z. B. Kartenleser) eingesetzt, das alle Zutrittsversuche (sowohl erfolgreich als auch fehlgeschlagen) protokolliert. Die Protokolle werden regelmäßig, mindestens monatlich, auf Anomalien überprüft. Die mechanische Widerstandsfähigkeit des Raumes wird auf RC3 erhöht."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein System wie Salto oder SimonsVoss wird implementiert. Die Protokolldaten werden an ein zentrales SIEM-System zur Auswertung weitergeleitet. Die Überprüfung der Protokolle wird dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Konfiguration des Zutrittskontrollsystems und lässt sich die Protokolle der letzten vier Wochen zeigen. Es wird geprüft, ob die dokumentierten Überprüfungen stattgefunden haben. Die Nachweise für die RC3-Klasse werden geprüft. Automatisiert können SIEM-Regeln geprüft werden, die auf anomale Zutrittsversuche reagieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A2-m5",
                    "uuid": "445520fe-22af-49c9-bf5e-5eb3a3afc5e3",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für den Zutritt wird ein Zwei-Faktor-Authentifizierungssystem (z. B. Karte und PIN oder Biometrie) verwendet. Das Zutrittskontrollsystem ist mit einer Videoüberwachung gekoppelt, die bei jedem Zutrittsversuch eine Aufzeichnung startet. Eine Einbruchmeldeanlage mit Aufschaltung auf einen Wachdienst sichert den Raum außerhalb der Geschäftszeiten."
                      },
                      {
                        "name": "guidance",
                        "value": "Biometrische Lesegeräte werden mit Kartenlesern kombiniert. Die Kameras sind so positioniert, dass sie den Eingangsbereich vollständig erfassen. Der Vertrag mit dem Wachdienst enthält klare Anweisungen für den Alarmfall. Die mechanische Widerstandsfähigkeit ist mindestens RC4."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer testet die Zwei-Faktor-Authentifizierung. Es wird die Kopplung zwischen Zutrittssystem und Videoaufzeichnung geprüft. Die Alarmierungskette zum Wachdienst wird verifiziert (z. B. durch einen Testalarm). Die Zertifizierung der Einbruchmeldeanlage (z. B. VdS-Klasse) und die Nachweise für die RC4-Klasse werden geprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "cfcfa790-cc12-4fff-b919-a70291c7f02f",
                "control-id": "GEB.6.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.6.A4-m1",
                    "uuid": "7957a0ee-adda-4189-a4d0-26878ce3606b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Mitarbeitende werden mündlich daran erinnert, die Tür beim Verlassen abzuschließen. Es gibt keine formellen Regeln oder regelmäßige Kontrollen."
                      },
                      {
                        "name": "guidance",
                        "value": "Diese Maßnahme verlässt sich ausschließlich auf das Verantwortungsbewusstsein einzelner Personen. Oft bleibt die Tür während der Arbeitszeit unverschlossen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer führt unangekündigte Begehungen durch, um zu prüfen, ob die Tür verschlossen ist. Mitarbeitende werden nach den geltenden Anweisungen befragt."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A4-m2",
                    "uuid": "bc2a1d93-e2b1-46b2-b097-86afb24996e2",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt eine schriftliche Anweisung, dass Türen und eventuell vorhandene Fenster beim Verlassen des Raumes zu schließen und zu verriegeln sind. Die Einhaltung wird bei allgemeinen Kontrollgängen stichprobenartig überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Aushang an der Tür erinnert an die Schließpflicht. Die Anweisung ist Teil der allgemeinen Sicherheitsrichtlinien."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die schriftliche Anweisung und prüft, ob diese den Mitarbeitenden bekannt ist. Die Ergebnisse der Kontrollgänge werden eingesehen, falls vorhanden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A4-m3",
                    "uuid": "4e8b8b1f-25fb-4a37-95dc-c31170ef74c1",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In einem Datenträgerarchiv SOLLTEN, wenn möglich, keine Fenster vorhanden sein. Gibt es dennoch Fenster, MÜSSEN diese beim Verlassen des Datenträgerarchivs geschlossen werden. Ebenso MUSS beim Verlassen die Tür verschlossen werden. Auch Brand- und Rauchschutztüren MÜSSEN geschlossen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Schließpflicht ist formal in der Benutzungsordnung für das Archiv verankert und wird allen zutrittsberechtigten Personen nachweislich zur Kenntnis gebracht. Die Abwesenheit von Fenstern wird als Planungsanforderung für neue Archive definiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz der Benutzungsordnung und die Nachweise über die Kenntnisnahme durch die Mitarbeitenden. Bei einer Begehung wird der Zustand von Türen und Fenstern geprüft. Planungsunterlagen für neue Archive werden auf die Anforderung (keine Fenster) geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A4-m4",
                    "uuid": "c2eadcbe-f2a1-412e-8986-dac2b614284e",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es sind selbstschließende und selbstverriegelnde Türen installiert. Sensoren an Fenstern und Türen melden deren Status (offen/geschlossen) an ein zentrales Überwachungssystem."
                      },
                      {
                        "name": "guidance",
                        "value": "Türschließer und Motorschlösser werden installiert. Magnetkontakte werden an Türen und Fenstern angebracht und mit der Einbruchmelde- oder Gebäudeleittechnik verbunden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer testet die Funktion der selbstschließenden/selbstverriegelnden Tür. Der Status der Sensoren wird im Überwachungssystem verifiziert, indem Türen und Fenster geöffnet und geschlossen werden. Automatisiert kann der Status der Sensoren periodisch abgefragt und mit den erwarteten Zuständen (z.B. nachts immer geschlossen) abgeglichen werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A4-m5",
                    "uuid": "3c0ca9e9-e668-4e56-9220-21546dc3bc25",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Tür- und Fensterstatus ist vollständig in das Sicherheitssystem des Gebäudes integriert. Ein Alarm wird automatisch ausgelöst, wenn der Raum außerhalb der Geschäftszeiten oder für einen längeren Zeitraum ungesichert bleibt. Die Scharfschaltung der Alarmanlage ist nur bei ordnungsgemäß geschlossenen Türen und Fenstern möglich."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Logik für die Alarmierung wird in der Einbruchmeldezentrale konfiguriert (Zwangsläufigkeit). Die Alarmierung erfolgt an eine ständig besetzte Stelle (Wachdienst)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer testet das Systemverhalten, indem versucht wird, die Alarmanlage bei geöffneter Tür scharf zu schalten. Ein Testalarm wird ausgelöst, um die gesamte Meldekette zu überprüfen. Die Konfiguration der Einbruchmeldezentrale wird eingesehen und auf Korrektheit geprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "7bd1dbed-0e7a-46d7-9af1-5eee34407f2d",
                "control-id": "GEB.9.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.6.A5-m1",
                    "uuid": "7ca6a208-ef88-4ba9-b334-8e7649867695",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Nur einige besonders sensible Datenträger werden in einem abschließbaren Büroschrank aufbewahrt. Der Großteil der Medien lagert auf offenen Regalen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt keine klare Regelung, welche Datenträger gesondert gesichert werden müssen; die Entscheidung liegt im Ermessen der Mitarbeitenden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer führt eine Sichtprüfung der Lagermethoden durch und befragt Mitarbeitende nach den Kriterien für die gesonderte Lagerung."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A5-m2",
                    "uuid": "5b03f9bb-a282-46b0-a015-31ee2ac3bf6f",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Datenträger und Medien werden in standardmäßigen, abschließbaren Büroschränken aus Stahlblech gelagert."
                      },
                      {
                        "name": "guidance",
                        "value": "Standard-Aktenschränke werden verwendet, die einen Basisschutz vor unbefugtem Zugriff, aber keinen zertifizierten Einbruch- oder Feuerschutz bieten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert durch eine Begehung, dass alle Datenträger in verschlossenen Schränken untergebracht sind und prüft stichprobenartig, ob diese auch tatsächlich abgeschlossen sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A5-m3",
                    "uuid": "f5d4fce5-56b8-40a3-bbb8-c6281c94206e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Datenträger und Medien in Datenträgerarchiven SOLLTEN in geeigneten Schutzschränken gelagert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Basierend auf einer Schutzbedarfsanalyse werden Schutzschränke mit einer definierten Widerstandsklasse gegen Einbruch (z.B. nach EN 1143-1) beschafft und verwendet. Die Auswahlkriterien sind dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Dokumentation zur Schutzbedarfsanalyse und die Auswahlentscheidung für die Schränke. Vor Ort wird geprüft, ob die beschafften Schränke verwendet werden und die entsprechenden Typenschilder mit Zertifizierungen vorhanden sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A5-m4",
                    "uuid": "8662a38d-3104-4663-9ded-a6ada9270b68",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden Schutzschränke mit zertifiziertem Feuerschutz (z.B. S 60 DIS oder S 120 DIS nach EN 1047-1) für digitale Datenträger verwendet. Der Zugriff auf die Schränke ist ebenfalls geregelt und wird protokolliert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Schränke sind speziell für die Lagerung von elektronischen Medien ausgelegt und zertifiziert. Der Zugriff kann über separate elektronische Schlösser erfolgen, deren Protokolle regelmäßig ausgewertet werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Zertifizierung des Feuerschutzes anhand der Typenschilder. Sofern vorhanden, werden die Zugriffsprotokolle der Schrankschlösser eingesehen und auf Plausibilität geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A5-m5",
                    "uuid": "f41e815e-8dc0-4721-902d-9153231d0623",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden hochsichere Wertschutzschränke verwendet, die sowohl einen hohen Einbruchschutz (z.B. Widerstandsgrad III nach EN 1143-1) als auch einen zertifizierten Feuerschutz bieten. Zusätzlich sind die Schränke klimatisiert oder enthalten Trockenmittel, um eine optimale Luftfeuchtigkeit für die Langzeitlagerung zu gewährleisten."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Schränke sind fest im Gebäude verankert. Der Zugriff erfordert eine Zwei-Faktor-Authentifizierung. Die Klimadaten innerhalb der Schränke werden permanent überwacht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Zertifikate für Einbruch- und Feuerschutz sowie die Nachweise zur fachgerechten Verankerung. Die Funktion der Zugriffskontrolle und der Klimaüberwachung wird getestet. Die Protokolldaten der Klimaüberwachung können automatisiert ausgewertet werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c754e3f8-8a3b-42b0-802f-85a82ab73e57",
                "control-id": "GEB.9.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.6.A3-m1",
                    "uuid": "db25d72b-bf98-4fa9-adee-afe11d687a51",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Raum wird gelegentlich im Rahmen der allgemeinen Büroreinigung gesäubert. Ein Rauchverbot ist in der allgemeinen Hausordnung erwähnt, wird aber für das Archiv nicht explizit durchgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt keine spezifischen Reinigungsanweisungen oder -materialien für den Archivraum. Die Datenträger lagern auf offenen Regalen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer führt eine Sichtprüfung des Raumes auf Sauberkeit durch. Es wird geprüft, ob es spezifische Anweisungen zum Schutz vor Verschmutzung gibt."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A3-m2",
                    "uuid": "6955ede7-b674-4066-a930-2c2023fdba53",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existieren regelmäßige Reinigungspläne für das Archiv. Ein striktes Rauch-, Ess- und Trinkverbot ist durch Schilder am Eingang gekennzeichnet und wird im Allgemeinen befolgt. Datenträger werden in einfachen Kunststoffboxen gelagert, um sie vor direktem Staub zu schützen."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Reinigungsplan sieht eine wöchentliche Trockenreinigung vor. Die Boxen sind nicht versiegelt, bieten aber einen grundlegenden Schutz."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet den Reinigungsplan und prüft die Kennzeichnung des Raumes. Die Lagerung der Datenträger in Boxen wird stichprobenartig kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A3-m3",
                    "uuid": "9ae3a90a-f2d0-46fb-8b83-8e326c511e0e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS sichergestellt werden, dass die Datenträger im Datenträgerarchiv ausreichend vor Staub und Verschmutzung geschützt sind. Die Anforderungen dafür MÜSSEN bereits in der Planungsphase analysiert werden. Es MUSS in Datenträgerarchiven ein striktes Rauchverbot eingehalten werden."
                      },
                      {
                        "name": "guidance",
                        "value": "In einer Richtlinie für das Datenträgerarchiv werden Maßnahmen zum Schutz vor Verschmutzung festgelegt. Dies umfasst die Art der Lagerung (z.B. in geschlossenen Schränken), Reinigungsverfahren (z.B. Verwendung von staubbindenden Tüchern) und ein striktes Verbot von Essen, Trinken und Rauchen, welches aktiv kommuniziert wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die entsprechende Richtlinie und die Planungsdokumente. Durch eine Inspektion vor Ort wird die Umsetzung der Maßnahmen (saubere, geschlossene Schränke, keine Anzeichen von Verunreinigung) überprüft. Die Einhaltung des Rauchverbots wird verifiziert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A3-m4",
                    "uuid": "357ac8c7-9aa0-4bb3-b5d9-adf1af8d35ba",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Archivraum ist mit einem dedizierten Luftfiltersystem ausgestattet, um Schwebstoffe zu kontrollieren. Datenträger werden in versiegelten, antistatischen Spezialbehältern aufbewahrt. Der Raum wird in einem leichten Überdruck zum Rest des Gebäudes gehalten."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Lüftungsanlage mit Filtern der Klasse F7 oder höher wird installiert. Die Behälter für die Datenträger sind speziell für die Langzeitarchivierung zertifiziert. Der Überdruck wird durch die Lüftungsanlage erzeugt und regelmäßig geprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Spezifikation der Lüftungs- und Filteranlage sowie die Zertifikate der Lagerbehälter. Die Wartungsprotokolle der Anlage werden geprüft. Der Überdruck kann mit einem Manometer gemessen werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A3-m5",
                    "uuid": "6dd6baf6-5390-4db9-a581-55ec2bcf5001",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Archiv ist als Reinraumumgebung mit Partikelschleuse, positivem Luftdruck und einem HEPA-Filtersystem (High-Efficiency Particulate Air) ausgelegt. Die Umgebungsparameter, einschließlich der Partikelkonzentration in der Luft, werden kontinuierlich überwacht und protokolliert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die bauliche Umsetzung erfolgt nach Reinraumstandards. Spezielle Reinraumkleidung (Kittel, Überschuhe) ist vor dem Betreten anzulegen. Die Überwachungssensoren sind an ein zentrales Managementsystem gekoppelt, das bei Abweichungen alarmiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Bau- und Planungsunterlagen des Reinraums. Die Protokolle der Umgebungsüberwachung werden analysiert. Die Einhaltung der Verhaltensregeln (z.B. Nutzung der Schleuse) wird beobachtet. Automatisiert können die Sensordaten aus dem Managementsystem ausgewertet werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "553fbba2-4c14-41cf-9c9f-9c95b98e97ed",
                "control-id": "GEB.9.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.6.A7-m1",
                    "uuid": "1b9aa698-e2e1-46c7-9b55-0e4693cf2fdd",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Im Raum ist ein Thermometer angebracht. Die Werte werden gelegentlich abgelesen, es gibt jedoch keine definierten Sollwerte oder systematische Protokollierung."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein einfaches Haushalts-Thermometer wird verwendet. Eine Regelung des Klimas findet nicht statt, es wird lediglich der Ist-Zustand passiv beobachtet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer führt eine Sichtprüfung durch und befragt die Verantwortlichen nach den Vorgaben für Temperatur und Luftfeuchtigkeit."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A7-m2",
                    "uuid": "cc3d57f5-de29-4eff-8832-2033d6090553",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine einfache Klimaanlage ist installiert, um die Temperatur im Sommer zu regulieren. Die Temperatur und Luftfeuchtigkeit werden täglich manuell in einer Liste protokolliert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Split-Klimagerät wird verwendet. Die Protokollierung erfolgt auf Papier. Die Luftfeuchtigkeit wird nicht aktiv geregelt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die manuell geführten Protokolllisten auf Vollständigkeit und Plausibilität und inspiziert die Klimaanlage."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A7-m3",
                    "uuid": "2a1a4c4e-052c-4309-97b9-98dec3b24de3",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE sichergestellt werden, dass die zulässigen Höchst- und Tiefstwerte für Temperatur und Luftfeuchtigkeit sowie der Schwebstoffanteil in der Raumluft im Datenträgerarchiv eingehalten werden. Die Werte von Lufttemperatur und -feuchte SOLLTEN mehrmals im Jahr für die Dauer von einer Woche aufgezeichnet und dokumentiert werden. Dabei festgestellte Abweichungen vom Sollwert SOLLTEN zeitnah behoben werden. Die eingesetzten Klimageräte SOLLTEN regelmäßig gewartet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Sollwerte für Klima und Reinheit werden basierend auf den Empfehlungen der Hersteller der Speichermedien definiert. Für die periodische Aufzeichnung werden Datenlogger eingesetzt. Es existiert ein Wartungsvertrag für die Klimageräte."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Dokumentation der definierten Sollwerte. Die Protokolle der Datenlogger und die Wartungsnachweise der Klimageräte werden geprüft. Es wird verifiziert, ob auf protokollierte Abweichungen reagiert wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A7-m4",
                    "uuid": "0bd509a0-002f-435d-ba08-3ce711536d2c",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein permanentes Umgebungsmonitoring-System ist installiert, das Temperatur und Luftfeuchtigkeit kontinuierlich aufzeichnet. Das System versendet automatisch Warnungen per E-Mail oder SMS, wenn vordefinierte Schwellenwerte über- oder unterschritten werden. Es sind redundante Klimageräte vorhanden."
                      },
                      {
                        "name": "guidance",
                        "value": "Sensoren sind an mehreren Stellen im Raum verteilt, um Hot-Spots zu erkennen. Die Alarmierungsschwellen sind etwas enger als die maximal zulässigen Werte, um eine frühzeitige Reaktion zu ermöglichen. Die redundanten Klimageräte arbeiten im Last-Wechsel-Betrieb."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die aufgezeichneten Klimadaten auf Trends und Grenzwertverletzungen. Die Konfiguration der Alarmierung wird geprüft und durch einen Test verifiziert. Die Funktion der redundanten Klimageräte wird überprüft. Automatisiert können die Messwerte und Alarme aus dem Monitoring-System ausgelesen und ausgewertet werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.6.A7-m5",
                    "uuid": "9514c9ef-8ff3-424e-ae62-6fa2d7f09e65",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Umgebungsmonitoring-System ist vollständig in das Gebäudeleitsystem integriert. Die Klimaregelung ist vollautomatisiert, mit redundanten Einheiten, die ein sofortiges Failover ermöglichen. Historische Daten werden analysiert, um den Wartungsbedarf vorherzusagen und den Energieverbrauch zu optimieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Präzisionsklimageräte, die sowohl Temperatur als auch Luftfeuchtigkeit exakt regeln können, sind im Einsatz. Die Analyse der Klimadaten erfolgt durch spezialisierte Software, die Anomalien erkennt, bevor sie zu Grenzwertverletzungen führen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Berichte der Trendanalyse. Die Failover-Funktion der Klimageräte wird durch einen simulierten Ausfall einer Einheit getestet. Die Integration in das Gebäudeleitsystem und die dort hinterlegten Automatisierungsregeln werden geprüft."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}