{
  "component-definition": {
    "uuid": "f03aae11-8d4b-49fd-8b08-4b3f8a871ba4",
    "metadata": {
      "title": "APP.5.2 Microsoft Exchange und Outlook - Benutzerdefiniert",
      "last-modified": "2025-11-22T12:46:08.424533+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "1e723c7f-90b3-4e94-94b0-97560bace504",
        "type": "software",
        "title": "APP.5.2 Microsoft Exchange und Outlook",
        "description": "This component represents the implementation of all controls for Baustein APP.5.2.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Microsoft Exchange Server (im Folgenden „Exchange“) ist eine Groupware-Lösung für mittlere bis große Institutionen. Mit ihr können elektronisch Nachrichten übermittelt werden und sie verfügt über weitere Dienste, um Workflows zu unterstützen. Nachrichten, wie E-Mails, können mit Exchange zentral verwaltet, zugestellt, gefiltert und versendet werden. Ebenso können typische Groupware-Anwendungen, wie Notizen, Kontaktlisten, Kalender und Aufgabenlisten angeboten und verwaltet werden. Um die Funktionen von Exchange nutzen zu können, ist neben dem Server-Dienst eine zusätzliche Client-Software oder ein Webbrowser nötig.<BR>Microsoft Outlook (im Folgenden „Outlook“) ist ein Client für Exchange, der durch die Installation des Office-Pakets von Microsoft oder durch Integration in die Betriebssysteme von mobilen Geräten direkt zur Verfügung gestellt wird. Darüber hinaus ermöglicht die Webanwendung „Outlook im Web“ (ehemals „Outlook Web App“) über den Browser z. B. auf E-Mails, Kontakte und den Kalender zuzugreifen. Diese Funktion ist in Exchange bereits enthalten.<BR>Die Kombination aus Exchange-Servern und Outlook-Clients wird in diesem Baustein als Exchange-System bezeichnet."
          },
          {
            "name": "Zielsetzung",
            "value": "Das Ziel dieses Bausteins ist es, über typische Gefährdungen für Exchange und Outlook zu informieren sowie aufzuzeigen, wie Exchange und Outlook sicher in Institutionen eingesetzt werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Bausteine ist auf alle Exchange-Systeme im Informationsverbund anzuwenden.<BR>Allgemeine Anforderungen an die Sicherheit von E-Mail-Systemen sind im Baustein APP.5.3 Allgemeiner E-Mail-Client und -Server zu finden. Er ist zusätzlich auf jedes E-Mail-System anzuwenden, das auf Exchange bzw. Outlook basiert.<BR>Der Baustein enthält spezifische Gefährdungen und Anforderungen für Exchange-Systeme. Spezifische Anforderungen an Serverplattformen und Betriebssysteme sind nicht Bestandteil des Bausteins. Diese sind in den Bausteinen SYS.1.1 Allgemeiner Server sowie SYS.2.1 Allgemeiner Client und in den jeweiligen betriebssystemspezifischen Bausteinen zu finden."
          },
          {
            "name": "2.1. Fehlende oder unzureichende Regelungen für Exchange und Outlook",
            "value": "Übergreifende Regelungen und Vorgaben für Exchange und Outlook sind notwendig, damit die Sicherheit der Informationen, die mit Exchange und Outlook verarbeitet werden, gewährleistet wird. Beispielsweise können Daten verloren gehen, ungewollt verändert oder gelöscht werden, wenn Exchange fehlerhaft und ungeregelt in das Active Directory eingebunden wird. Ähnliches gilt, wenn Postfachdatenbanken ungeregelt depubliziert werden und Exchange unzureichend in der Sicherheitsrichtlinie berücksichtigt wird. Gleiches gilt, wenn die Outlook-Clients ungeregelt auf die Exchange-Server zugreifen können."
          },
          {
            "name": "2.2. Fehlerhafte Migration von Exchange",
            "value": "Exchange-Systeme werden in der Praxis häufiger migriert als neu installiert. Um auf eine neue Version des Exchange Servers zu migrieren, muss in einigen Fällen das Betriebssystem auf eine neuere Version aktualisiert werden. Neue Versionen der Betriebssysteme stellen ihrerseits oft Anforderungen an das bestehende Domänenkonzept und die existierenden Verzeichnisdienste.<BR>Wenn die Migration nicht sorgfältig geplant und durchgeführt wird, kann die interne Kommunikation über Exchange in der Institution massiv gestört werden, was in der Folge die Produktivität verringern könnte. Während der Migration können Probleme bei der Konfiguration auftreten, indem sich z. B. die Konfigurationseinstellungen für die unterschiedlichen Versionen oder die Möglichkeiten zur Anbindung an Verzeichnisdienste geändert haben. Des Weiteren können fehlerhafte Protokolleinstellungen zu Unregelmäßigkeiten bei der Informationsübermittlung, Authentisierung und Verschlüsselung führen."
          },
          {
            "name": "2.3. Unzulässiger Browserzugriff auf Exchange",
            "value": "Mit Exchange können Anwendende über einem Browser auf das eigene E-Mail-Konto zugreifen. Hierzu werden die Internet Information Services (IIS) verwendet, die Bestandteil des Windows-Betriebssystems sind. Wenn diese Funktion unsachgemäß geplant und fehlerhaft konfiguriert wird, kann unter Umständen unkontrolliert von außen auf das interne Netz zugegriffen werden.<BR>Wenn über das Internet mit einem Browser auf die E-Mails zugegriffen werden soll, birgt dies ein großes Gefahrenpotenzial. Ohne direkten Zugriff auf das Netz der Institution könnten Angreifende auf die E-Mails zugreifen und so unter anderem E-Mail-Adressen und -Inhalte ausspähen, E-Mail-Funktionen missbrauchen, Spam-Mails verschicken sowie Zugang zu institutionsinternen Informationen erhalten."
          },
          {
            "name": "2.4. Unerlaubte Anbindung anderer Systeme an Exchange",
            "value": "Exchange-Systeme sind eng mit dem Betriebssystem Windows verzahnt und arbeiten durch sogenannte Konnektoren (auch Connectors genannt) mit Fremdsystemen zusammen. Mithilfe der Konnektoren ist es anderen E-Mail-Systemen möglich, über bestimmte Protokolle (z. B. POP3) E-Mails von Exchange-Servern abzurufen.<BR>Wenn bei der Installation oder einer Migration von Exchange die Konnektoren nicht mit berücksichtigt werden, können die vorhandenen Konnektoren inkompatibel zu der migrierten Exchange-Version sein. Hierdurch können E-Mails verloren gehen oder ungewollt verändert werden. Außerhalb des homogenen Microsoft-Umfelds sind Sicherheitseinstellungen, die sich auf das Exchange-System beziehen, ungültig.<BR>Wenn verschiedene Teilsysteme separat administriert werden, können stets Inkonsistenzen auftreten. Unsachgemäß angebundene Fremdsysteme können zudem zur Folge haben, dass Daten verloren gehen oder das Exchange-System blockiert wird."
          },
          {
            "name": "2.5. Fehlerhafte Administration von Zugangs- und Zugriffsrechten unter Exchange und Outlook",
            "value": "Werden Zugangsrechte zu einem Outlook-Client bzw. auf innerhalb von Exchange und Outlook gespeicherte Daten fehlerhaft angelegt und administriert, können Sicherheitslücken entstehen. Dies ist beispielsweise der Fall, wenn über die notwendigen Rechte hinaus zusätzliche Rechte vergeben werden und dadurch unberechtigte Personen auf vertrauliche Informationen zugreifen können."
          },
          {
            "name": "2.6. Fehlerhafte Konfiguration von Exchange",
            "value": "Eine häufige Ursache für erfolgreiche Angriffe auf Dienste wie Exchange sind fehlerhaft konfigurierte Exchange-Systeme. Da ein Exchange-System sehr komplex ist, können durch diverse Konfigurationseinstellungen und durch die sich gegenseitig beeinflussenden Parameter zahlreiche Sicherheitsprobleme entstehen. Die möglichen Fehlkonfigurationen erstrecken sich von der Installation und dem Betrieb der Exchange-Komponenten auf ungeeigneten IT-Systemen über nicht getätigte Verschlüsselungen und unzureichende Zugriffsbeschränkungen auf Exchange-Servern bis hin zur fehlerhaften Rechtevergabe bei der Erzeugung oder Initialisierung einer Exchange-Datenbank."
          },
          {
            "name": "2.7. Fehlerhafte Konfiguration von Outlook",
            "value": "Der E-Mail-Client Outlook ist ein wichtiger Teil des Exchange-Systems. Für die Gesamtsicherheit des Exchange-Systems ist es wichtig, dass die Clients korrekt konfiguriert sind. Schon das ausgewählte Kommunikationsprotokoll kann spezielle Sicherheitsprobleme nach sich ziehen. Ebenso könnten private Schlüssel kompromittiert werden, mit denen E-Mails verschlüsselt und signiert werden. Wird auf Netzebene verschlüsselt, z. B. durch IPSec oder TLS, kann dieser Verschlüsselungsmechanismus bei einem fehlerhaft konfigurierten Client unwirksam werden. Durch Fehlkonfiguration können Sicherheitsprobleme entstehen, z. B. der Verlust der Vertraulichkeit durch unbefugten Zugriff."
          },
          {
            "name": "2.8. Fehlfunktionen und Missbrauch selbst entwickelter Makros sowie Programmierschnittstellen unter Outlook",
            "value": "Viele Softwareherstellende sehen in ihren Tools und Anwendungen Programmierschnittstellen vor, sogenannte Application Programming Interfaces (APIs). Diese erlauben es, bestimmte Funktionen auch aus anderen Programmen heraus zu nutzen oder den Funktionsumfang der Anwendung zu erweitern. Solche Funktionen in Outlook können missbraucht werden, um Schadsoftware zu verbreiten. Zu den Schadsoftwarevarianten zählen z. B. bösartige Tools und Makros, die direkt Outlook und die damit verbundenen E-Mail-Funktionen ausnutzen, um Informationen abzugreifen, zu verändern oder zu löschen. Makros wiederum können dazu genutzt werden, Nachrichten, Termine oder Aufgaben weiterzuleiten oder zu verschieben. Dabei können Fehler in Makros ein erhöhtes Risiko darstellen. Indexfehler innerhalb von Makros können zu falschen Ergebnissen und zu möglicherweise unwirtschaftlichen Entscheidungen in der Institution führen. Spezifische Folgen können unnötige Kosten oder ein automatisierter Datenabfluss sein."
          }
        ],
        "control-implementations": [
          {
            "uuid": "6d24cf75-70a2-4e7b-ae6b-1cb3dde56e39",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Kompendien/Grundschutz%2B%2B-Kompendium/profile/e-mail_profile.json",
            "description": "Implementation for all controls in Baustein APP.5.2",
            "implemented-requirements": [
              {
                "uuid": "a88974a0-34bb-43a8-954f-179ed1a1ac2b",
                "control-id": "ARCH.8.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a11-m3",
                    "uuid": "eab44d12-7086-43a6-bc79-633c1d8cf1e2",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution verfügt über einen sekundären Mail-Exchanger (MX) mit niedrigerer Priorität bei einem externen Anbieter. Dieser nimmt E-Mails an, falls der primäre Server nicht erreichbar ist, und stellt sie später zu."
                      },
                      {
                        "name": "guidance",
                        "value": "Im DNS sind zwei MX-Records mit unterschiedlichen Prioritäten eingetragen. Der zweite MX-Record verweist auf einen Backup-MX-Dienst. Dies stellt nur die Redundanz des E-Mail-Empfangs sicher, nicht des Versands oder des Postfachzugriffs."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die MX-Records der Domain. Es wird getestet (z.B. durch temporäres Blockieren des primären Servers in einer Firewall), ob der sekundäre MX die E-Mails korrekt annimmt."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a11-m4",
                    "uuid": "90873761-f1a5-4abe-bc56-9bddf5bdcb10",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE redundante E-Mail-Server betreiben. Die redundanten E-Mail-Server SOLLTEN mit geeigneter Priorität in den MX-Records der betroffenen Domains hinterlegt werden. Es SOLLTE festgelegt werden, wie E-Mails zwischen den E-Mail-Servern synchronisiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden mindestens zwei vollwertige E-Mail-Server in einem Cluster-Setup betrieben (z.B. Aktiv/Passiv oder Aktiv/Aktiv), idealerweise an getrennten Standorten. Die Postfachdatenbanken und Konfigurationen werden in kurzen Intervallen oder in Echtzeit zwischen den Servern repliziert. Ein Load Balancer oder DNS-Failover wird für den Client-Zugriff verwendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Cluster-Konzept und die Replikationseinstellungen. Es wird ein geplanter Failover-Test durchgeführt, um zu überprüfen, ob der zweite Server nahtlos übernimmt und die Daten aktuell sind."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "31715795-a601-41b1-bb7a-c84c8f3aeb7e",
                "control-id": "DET.4.17",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a12-m3",
                    "uuid": "d5c8cf33-39c4-4568-8116-b552b17633dd",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der IT-Betrieb überprüft bei Problemen mit dem E-Mail-Versand manuell, ob die IP-Adressen der E-Mail-Server auf gängigen öffentlichen Block-Listen (RBLs) aufgeführt sind."
                      },
                      {
                        "name": "guidance",
                        "value": "IT-Administratoren nutzen bei Bedarf Web-basierte Tools (z.B. MXToolbox), um die Reputation der eigenen IP-Adressen zu prüfen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer befragt die Administratoren nach ihrem Vorgehen, wenn Benutzer über nicht zustellbare E-Mails berichten. Es gibt keine proaktive Überwachung."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a12-m4",
                    "uuid": "a8dbc906-15c1-44ee-96ce-d26aabfa8456",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der IT-Betrieb SOLLTE regelmäßig überprüfen, ob die E-Mail-Server der Institution auf öffentlichen Spam- oder Block-Listen aufgeführt sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein automatisiertes Monitoring-System oder ein externer Dienst wird genutzt, um die IP-Adressen der Mail-Server täglich gegen eine kuratierte Liste von wichtigen Block-Listen zu prüfen. Bei einem positiven Eintrag wird eine Benachrichtigung an die IT-Abteilung gesendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Konfiguration des Monitoring-Tools und die Benachrichtigungsprotokolle der letzten Monate. Es wird geprüft, ob ein definierter Prozess für den Fall eines Listings (Ursachenanalyse, De-Listing-Antrag) existiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "26e5e264-1475-4db1-8df9-779f279eefb9",
                "control-id": "KONF.10.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a1-m1",
                    "uuid": "9e1796db-d745-4ddb-9584-552f1efb33ad",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Konfiguration für E-Mail-Clients ist nur für einzelne, als kritisch eingestufte Benutzer oder Systeme umgesetzt. Es gibt keine einheitliche Vorgabe für die gesamte Institution."
                      },
                      {
                        "name": "guidance",
                        "value": "Typischerweise werden manuelle Konfigurationsanleitungen per E-Mail an wenige Mitarbeiter versendet. Es findet keine Überprüfung der Umsetzung statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch Stichproben fest, dass nur ein kleiner Teil der E-Mail-Clients eine wie auch immer geartete Sicherheitskonfiguration aufweist. Es kann kein Konfigurationsdokument vorgelegt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a1-m2",
                    "uuid": "b3e0bc8b-b6df-4b3f-84de-525694fe7ef0",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine standardisierte Basiskonfiguration wird auf allen E-Mail-Clients ausgerollt. Diese Konfiguration kann jedoch von den Benutzern leicht geändert werden. Die Überprüfung von Anhängen auf Schadsoftware ist aktiviert, aber weitergehende Schutzmaßnahmen wie die Deaktivierung von aktiven Inhalten sind nicht konsequent umgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Konfiguration erfolgt oft über die Standardeinstellungen des E-Mail-Client-Installers oder ein einfaches Skript. Es gibt keine Mechanismen, die Benutzer an der Änderung der Einstellungen hindern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass auf allen Clients eine Konfiguration vorhanden ist. Bei einer Stichprobe wird jedoch festgestellt, dass Benutzer die sicherheitsrelevanten Einstellungen (z.B. HTML-Anzeige) selbstständig geändert haben."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a1-m3",
                    "uuid": "632b3e57-efc4-4439-8bc5-2d4753bc5882",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution MUSS eine dokumentierte, sichere Konfiguration für die E-Mail-Clients vorgeben und diese vorkonfiguriert zur Verfügung stellen. Dateianhänge MÜSSEN vor dem Öffnen auf Schadsoftware überprüft werden. E-Mail-Clients MÜSSEN so konfiguriert sein, dass sie HTML-Code und andere aktive Inhalte nicht automatisch interpretieren. E-Mail-Filterregeln und automatische Weiterleitungen MÜSSEN auf notwendige Anwendungsfälle beschränkt werden. Für die Kommunikation mit E-Mail-Servern über nicht vertrauenswürdige Netze MUSS eine sichere Transportverschlüsselung eingesetzt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die sichere Konfiguration wird zentral über ein Client-Management-System (z.B. GPOs in Active Directory) verteilt und durchgesetzt. Die Konfiguration beinhaltet explizit die Deaktivierung der automatischen HTML-Anzeige und die Konfiguration der Vorschaufunktion, sodass keine Dateien automatisch interpretiert werden. Die Überprüfung von Anhängen erfolgt durch eine lokale Antiviren-Software oder eine serverseitige Lösung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich das Konfigurationsdokument für E-Mail-Clients vorlegen und überprüft die Einstellungen im zentralen Verwaltungswerkzeug. Anhand von Test-Clients wird verifiziert, dass aktive Inhalte blockiert werden und eine Transportverschlüsselung (z.B. TLS) für die Serverkommunikation erzwungen wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a1-m4",
                    "uuid": "c0a54277-33a9-4f89-8be0-b087f273dbfa",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE sicherstellen, dass sicherheitsrelevante Teile der Konfiguration nicht von Benutzenden geändert werden können. Ist dies technisch nicht umsetzbar, MUSS die Institution die Benutzer explizit und nachweislich darauf hinweisen, dass die Konfiguration nicht geändert werden darf. Vorschaufunktionen für Dateianhänge sind so konfiguriert, dass sie Dateien unter keinen Umständen automatisch interpretieren oder ausführen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Konfigurationseinstellungen werden durch technische Mittel (z.B. Client Management Software) gesperrt. Benutzer erhalten nur Leserechte auf die relevanten Konfigurationsdateien oder Registry-Einträge. Regelmäßige Scans überprüfen die Konformität der Clients."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer versucht als normaler Benutzer, sicherheitsrelevante Einstellungen wie die Deaktivierung der HTML-Anzeige oder die Transportverschlüsselung zu ändern. Es wird verifiziert, dass diese Versuche fehlschlagen. Alternativ wird die Konfiguration des Client-Management-Systems zur Sperrung der Einstellungen geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a1-m5",
                    "uuid": "feae650c-a30b-4ad4-8125-58d54ab8a704",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Konfiguration der E-Mail-Clients wird durch ein zentrales Managementsystem nicht nur erzwungen, sondern auch kontinuierlich überwacht. Jede Abweichung von der definierten Sicherheitsbaseline führt zu einem automatisierten Alarm und, falls möglich, zu einer sofortigen automatischen Korrektur der Konfiguration. Die Sicherheitsrichtlinien für E-Mail-Clients sind in das allgemeine Endpoint-Security-Konzept integriert."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Endpoint Detection and Response (EDR) oder Mobile Device Management (MDM) Lösung wird eingesetzt, um die Konfiguration in Echtzeit zu überwachen. Konfigurations-Baselines sind als Code (Configuration as Code) definiert und versioniert. Alle sicherheitsrelevanten Ereignisse des E-Mail-Clients werden an ein zentrales SIEM-System weitergeleitet und korreliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Logs des EDR/MDM-Systems auf Konformitätsprüfungen und automatische Korrekturmaßnahmen. Es wird ein Testfall durchgeführt, bei dem eine Konfiguration manuell (mit administrativen Rechten) geändert wird, um die Reaktionszeit und den Erfolg der automatischen Korrektur zu validieren. Die Integration in das SIEM wird anhand von Test-Ereignissen verifiziert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "8eda1b2b-a032-4d5a-a54a-5323208db6ef",
                "control-id": "KONF.13.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a4-m3",
                    "uuid": "9a449f54-24ab-4907-8a66-995da337d054",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der IT-Betrieb MUSS sicherstellen, dass auf E-Mail-Servern eingehende und ausgehende E-Mails, insbesondere deren Anhänge, auf Spam-Merkmale und schädliche Inhalte überprüft werden. Die Einführung und Nutzung von E-Mail-Filterprogrammen MUSS mit den Datenschutzbeauftragten und der Personalvertretung abgestimmt sein. Die Institution MUSS festlegen, wie mit verschlüsselten E-Mails zu verfahren ist, wenn diese nicht durch das Virenschutzprogramm entschlüsselt werden können."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein zentrales E-Mail-Security-Gateway oder eine auf dem Mailserver installierte Software scannt den gesamten ein- und ausgehenden E-Mail-Verkehr. Es gibt eine dokumentierte Richtlinie, die in Abstimmung mit dem Datenschutzbeauftragten erstellt wurde und die z.B. das Vorgehen bei verschlüsselten Anhängen (z.B. Quarantäne und manuelle Freigabe) beschreibt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Konfiguration des Spam- und Virenschutzes zeigen. Es wird die dokumentierte Abstimmung mit dem Datenschutzbeauftragten und der Personalvertretung eingesehen. Die Richtlinie zum Umgang mit verschlüsselten, nicht scannbaren E-Mails wird geprüft. Eine Test-E-Mail mit einem (harmlosen) Test-Virus (z.B. EICAR) wird blockiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a4-m4",
                    "uuid": "8937bd42-288b-4112-aa44-b68c95bbe439",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Spam- und Virenschutz wird um fortschrittliche Funktionen wie Sandboxing und URL-Umschreibung erweitert. Anhänge mit unbekanntem oder potenziell gefährlichem Inhalt werden in einer isolierten Umgebung ausgeführt und analysiert, bevor sie zugestellt werden. Links in E-Mails werden zur Klickzeit auf Bösartigkeit überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Die eingesetzte E-Mail-Security-Lösung verfügt über ein lizenziertes Advanced Threat Protection (ATP)-Modul. Dieses Modul ist für alle eingehenden E-Mails aktiviert. Die Benutzer werden darüber informiert, dass Links in E-Mails möglicherweise anders aussehen, da sie durch den Schutzdienst umgeschrieben werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration des ATP-Moduls. Eine Test-E-Mail mit einem Link zu einer bekannten Malware-Testseite wird versendet, und es wird verifiziert, dass der Klick auf den Link blockiert wird. Eine weitere Test-E-Mail mit einem harmlosen, aber unbekannten ausführbaren Anhang wird in die Quarantäne der Sandbox verschoben."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "25fba9fb-0aa7-4fee-989c-444648600bed",
                "control-id": "KONF.13.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a9-m3",
                    "uuid": "dc5062e2-aebc-492c-93c5-6b39e97fdcea",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die E-Mail-Server der Institution SOLLTEN eingehende E-Mails mittels Sender Policy Framework (SPF) und DomainKeys Identified Mail (DKIM) überprüfen. Die Institution SOLLTE selbst DKIM und SPF einsetzen, um von ihr versendete E-Mails zu authentisieren. Der SPF-Eintrag SOLLTE den Softfail-Parameter (~all) nur zu Testzwecken verwenden."
                      },
                      {
                        "name": "guidance",
                        "value": "Der E-Mail-Server ist so konfiguriert, dass er SPF- und DKIM-Prüfungen für eingehende E-Mails durchführt und die Ergebnisse im E-Mail-Header vermerkt. Für die eigene Domain ist ein SPF-Record mit allen sendeberechtigten Servern und einem Softfail-Eintrag (~all) im DNS veröffentlicht. Ein DKIM-Schlüssel ist generiert und der öffentliche Teil im DNS hinterlegt; der Server signiert ausgehende Mails."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die DNS-Einträge (SPF, DKIM) der Domain mit öffentlichen Tools. Durch das Senden einer Test-E-Mail von und an die Institution wird in den Headern verifiziert, dass ausgehende Mails signiert und eingehende Mails geprüft werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a9-m4",
                    "uuid": "db59559b-f915-4b5c-aa62-374aee43bb9c",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der SPF-Eintrag SOLLTE den \"-all\" (Hardfail) Parameter enthalten. Die Institution SOLLTE DMARC nutzen. DMARC-Einträge SOLLTEN vorgeben, dass E-Mails im Fehlerfall abgewiesen werden (`p=reject`). DMARC-Reporte SOLLTEN regelmäßig ausgewertet werden. Die E-Mail-Kommunikation SOLLTE über MTA-STS abgesichert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Der SPF-Eintrag wird auf `-all` verschärft. Ein DMARC-Eintrag wird im DNS veröffentlicht, zunächst mit `p=none`, dann `p=quarantine` und schließlich `p=reject`. DMARC-Analyse-Tools werden genutzt, um die eingehenden Berichte auszuwerten. Eine MTA-STS-Richtlinie wird auf einem Webserver bereitgestellt und im DNS verankert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die DNS-Einträge für SPF (`-all`) und DMARC (`p=reject`). Es werden die Prozesse und Tools zur Auswertung der DMARC-Berichte geprüft. Die korrekte Konfiguration von MTA-STS wird mit Online-Tools validiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a9-m5",
                    "uuid": "cf068d62-a70a-4c36-b196-85c996c8af46",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE zusätzlich zu SPF, DKIM, DMARC und MTA-STS die E-Mail-Kommunikation über DANE absichern, um die Authentizität des TLS-Zertifikats des Zielservers zu validieren. Die Auswertung von DMARC-Berichten ist automatisiert, um Spoofing-Angriffe in Echtzeit zu erkennen und darauf zu reagieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Voraussetzung für DANE ist der Einsatz von DNSSEC für die Domain der Institution. Entsprechende TLSA-Records werden im DNS veröffentlicht. Der Mailserver ist so konfiguriert, dass er DANE-Einträge bei ausgehenden Verbindungen validiert. Die DMARC-Berichte fließen in ein SIEM-System ein, das bei Anomalien (z.B. hohes Volumen an fehlgeschlagenen Authentifizierungen) Alarme auslöst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die korrekte Implementierung von DNSSEC und die dazugehörigen TLSA-Records für DANE mit öffentlichen Test-Tools. Die Konfiguration des Mailservers zur DANE-Validierung wird geprüft. Im SIEM-System wird die korrekte Verarbeitung und Alarmierung bei DMARC-Anomalien kontrolliert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c6ba2ad5-2949-43a2-8014-870ed2b2d750",
                "control-id": "KONF.13.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a13-m4",
                    "uuid": "e7f26f77-b636-44da-9ec2-12daf0000999",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE TLS-Reporting einsetzen, um Berichte über die erfolgreiche oder fehlgeschlagene TLS-Verschlüsselung bei der E-Mail-Zustellung zu erhalten. Es SOLLTE festgelegt werden, ob TLS-Reports an andere Institutionen versendet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein DNS-Eintrag für TLS-RPT wird veröffentlicht, der auf einen Endpunkt verweist, der die Berichte entgegennimmt. Ein Dienst (intern oder extern) wird genutzt, um die eingehenden JSON-Berichte zu aggregieren und auszuwerten. Dies hilft, Probleme mit der Transportverschlüsselung proaktiv zu erkennen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert den TLS-RPT-Eintrag im DNS. Es werden die gesammelten Berichte und die daraus abgeleiteten Maßnahmen eingesehen. Die Konfiguration des Mailservers zum Versand eigener TLS-Reports wird überprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "67d421e6-124e-447f-a6d4-dcaa14b03022",
                "control-id": "KONF.14.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a2-m1",
                    "uuid": "8e3d67b3-526b-4e50-b78e-51947c6ce3fb",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der E-Mail-Server ist mit den Standardeinstellungen installiert. Es gibt keine spezifische Härtung oder Konfiguration, um ihn als Open Relay zu verhindern oder DoS-Angriffe abzuwehren."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Server wurde nach einer einfachen Anleitung aus dem Internet aufgesetzt. Sicherheitsaspekte wie Transportverschlüsselung oder Zugriffsbeschränkungen wurden nicht berücksichtigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Ein externer Test zeigt, dass der Server als Open Relay missbraucht werden kann. Eine Port-Scan-Analyse zeigt unverschlüsselte E-Mail-Protokolle wie SMTP (Port 25) ohne STARTTLS."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a2-m2",
                    "uuid": "c962bc07-70ac-4e87-a15d-20307738be61",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der E-Mail-Server bietet eine sichere Transportverschlüsselung (TLS) an, erzwingt diese jedoch nicht. Unverschlüsselte Verbindungen sind weiterhin möglich. Der Server ist grundlegend so konfiguriert, dass er nicht als Open Relay fungiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein gültiges TLS-Zertifikat ist auf dem Server installiert. Die Konfiguration erlaubt jedoch sowohl verschlüsselte (z.B. SMTPS Port 465, IMAPS Port 993) als auch unverschlüsselte Verbindungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass eine verschlüsselte Verbindung zum Server aufgebaut werden kann. Ein nachfolgender Test zeigt jedoch, dass auch eine unverschlüsselte Verbindung akzeptiert wird. Der Open-Relay-Test ist negativ."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a2-m3",
                    "uuid": "74e57382-353f-4764-8caa-e5f5cc81da36",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für den E-Mail-Empfang über nicht vertrauenswürdige Netze MUSS der E-Mail-Server eine sichere Transportverschlüsselung anbieten. Der IT-Betrieb MUSS den Server so konfigurieren, dass E-Mail-Clients nur über eine sichere Transportverschlüsselung auf Postfächer zugreifen können. Der IT-Betrieb MUSS den Server so einstellen, dass er nicht als Spam-Relay missbraucht werden kann. Es MUSS eine geeignete Größenbeschränkung für Postfächer eingerichtet und dokumentiert werden, und der IT-Betrieb MUSS Schutzmechanismen gegen DoS-Attacken ergreifen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Serverkonfiguration erzwingt TLS für Client-Verbindungen (z.B. über SMTPS, IMAPS, POP3S oder STARTTLS mit obligatorischer Verschlüsselung). Der Empfang von unverschlüsselten E-Mails von anderen Servern wird noch toleriert, aber protokolliert. Als DoS-Schutz sind Ratenbegrenzungen (Rate Limiting) für Verbindungen und Nachrichten pro Zeiteinheit konfiguriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Serverkonfiguration, um sicherzustellen, dass unverschlüsselte Client-Logins deaktiviert sind. Es wird die Dokumentation für die Postfachgrößen und die DoS-Schutzmaßnahmen geprüft. Ein Test-Client kann sich ohne TLS nicht verbinden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a2-m4",
                    "uuid": "43f955ce-361b-4add-b4be-586fd894174d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Empfang von E-Mails über unverschlüsselte Verbindungen SOLLTE deaktiviert werden. Beim Versand von E-Mails an andere Server SOLLTE eine sichere Transportverschlüsselung genutzt werden, und der Versand über unsichere Verbindungen SOLLTE deaktiviert werden (opportunistic TLS mit erzwungener Verschlüsselung, wo möglich)."
                      },
                      {
                        "name": "guidance",
                        "value": "Der E-Mail-Server ist so konfiguriert, dass er bei der Kommunikation mit anderen Servern TLS erzwingt (z.B. über `smtp_tls_security_level = encrypt` in Postfix). Für wichtige Kommunikationspartner, die kein TLS anbieten, werden Ausnahmeregeln definiert und dokumentiert. Der unverschlüsselte Empfang von E-Mails wird gänzlich abgelehnt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Serverkonfigurationsdateien bezüglich der TLS-Richtlinien für ausgehenden und eingehenden Server-zu-Server-Verkehr. E-Mail-Header von Testnachrichten werden analysiert, um die Verwendung von TLS zu bestätigen. Es wird geprüft, ob eine E-Mail von einem Test-Server, der kein TLS anbietet, abgewiesen wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a2-m5",
                    "uuid": "8967d6f7-6a12-4d99-982f-a38f4a59356d",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die E-Mail-Kommunikation wird durch den Einsatz von DANE und MTA-STS umfassend abgesichert. Dies verhindert Man-in-the-Middle-Angriffe durch Downgrading der Verschlüsselung. Es werden nur aktuelle und starke Verschlüsselungsprotokolle und Cipher-Suiten zugelassen. Die Serverkonfiguration wird regelmäßig automatisiert auf Einhaltung der Sicherheitsrichtlinie überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "DNSSEC ist für die Domains der Institution aktiviert. TLSA-Records für DANE werden im DNS veröffentlicht. Eine MTA-STS-Richtlinie wird per HTTPS bereitgestellt und die entsprechenden DNS-Einträge werden gesetzt. Die Serverkonfiguration wird mittels spezialisierter Tools (z.B. `testssl.sh`, Qualys SSL Labs) regelmäßig geprüft und die Ergebnisse werden zur Nachbesserung genutzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die korrekte Konfiguration von DNSSEC, DANE (TLSA-Records) und MTA-STS (HTTPS-Policy und DNS-Records) mit öffentlich verfügbaren Online-Tools. Die Serverkonfiguration wird auf die ausschließliche Verwendung starker Cipher-Suiten und Protokolle (z.B. TLS 1.2, TLS 1.3) überprüft. Automatisierte Konfigurations-Audit-Berichte werden eingesehen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "4feeef8e-9748-4764-9536-b5b2c117d56e",
                "control-id": "KONF.14.1.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a10-m3",
                    "uuid": "51f57ec0-6b87-475c-bfd9-c86ca9b84f0c",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für den Austausch von E-Mails mit besonders hohem Schutzbedarf werden Ende-zu-Ende-Verschlüsselung (E2EE) und digitale Signaturen auf individueller Basis eingesetzt. Die Benutzer sind geschult, die entsprechenden Werkzeuge (z.B. S/MIME, PGP) zu verwenden, wenn dies erforderlich ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine Richtlinie, die definiert, wann E2EE zu verwenden ist. Einzelne Benutzer oder Abteilungen erhalten die notwendigen Zertifikate oder Schlüssel und werden in deren Anwendung geschult. Die Nutzung ist freiwillig bzw. anlassbezogen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Richtlinie zur E2EE. Es wird durch Interviews mit Schlüsselpersonen verifiziert, ob und wie E2EE in der Praxis für sensible Kommunikation eingesetzt wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a10-m4",
                    "uuid": "8795a2f6-62f0-4b4b-bedd-fa38ec28b84e",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE eine Ende-zu-Ende-Verschlüsselung sowie digitale Signaturen für E-Mails einsetzen. Es SOLLTEN nur Protokolle (z.B. S/MIME, OpenPGP) genutzt werden, die dem aktuellen Stand der Technik entsprechen. Die Schlüssel- und Zertifikatsverwaltung wird zentralisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein zentrales Gateway oder eine Public-Key-Infrastruktur (PKI) wird zur Verwaltung von Schlüsseln und Zertifikaten für S/MIME oder OpenPGP eingesetzt. Die E2EE-Funktionalität ist in die E-Mail-Clients aller relevanten Mitarbeiter integriert und vorkonfiguriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration der zentralen Schlüsselverwaltung. Es wird verifiziert, dass die eingesetzten Protokolle und Algorithmen dem Stand der Technik entsprechen (z.B. keine veralteten Hash- oder Verschlüsselungsalgorithmen). Stichprobenartig wird die korrekte Konfiguration der Clients geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a10-m5",
                    "uuid": "4f12bd15-fe09-4dbb-a759-8392107bd3e8",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Nutzung von Ende-zu-Ende-Verschlüsselung und digitalen Signaturen wird basierend auf Inhalts- oder Empfängerrichtlinien automatisch erzwungen. E-Mails, die bestimmte Kriterien erfüllen (z.B. Versand an externe Partner, enthaltene Schlüsselwörter), werden automatisch signiert und verschlüsselt, ohne dass ein Benutzereingriff erforderlich ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein E-Mail-Gateway mit Richtlinien-basierter Verschlüsselung wird eingesetzt. Dieses Gateway verwaltet die Schlüssel und wendet die Verschlüsselung transparent an. Alternativ werden Client-Plugins verwendet, die eine richtlinienbasierte Verschlüsselung erzwingen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration der Verschlüsselungsrichtlinien auf dem Gateway. Es werden Test-E-Mails versendet, die die definierten Kriterien erfüllen, um zu validieren, dass die automatische Verschlüsselung und Signatur korrekt angewendet wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "cb84aa40-73d3-4e4e-8b20-4cad2458bdf4",
                "control-id": "NOT.4.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a3-m3",
                    "uuid": "0d0dc664-fcc5-455a-9151-1058ca947ada",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der IT-Betrieb MUSS die Daten der E-Mail-Server und -Clients regelmäßig sichern. Dafür MUSS die Institution regeln, wie die gesendeten und empfangenen E-Mails der E-Mail-Clients sowie die E-Mails auf den Servern gesichert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es existiert ein dokumentiertes Datensicherungskonzept, das explizit die E-Mail-Server umfasst. Die Sicherung der Serverdaten erfolgt automatisiert und regelmäßig (z.B. täglich). Für lokal auf Clients gespeicherte E-Mails (z.B. in PST-Dateien) gibt es eine klare Anweisung an die Benutzer, diese auf Netzlaufwerke zu verschieben, die ebenfalls gesichert werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Datensicherungskonzept und die Backup-Protokolle des E-Mail-Servers. Es wird die Richtlinie für die Sicherung von clientseitigen E-Mails eingesehen. Die erfolgreiche Durchführung der Server-Backups wird stichprobenartig überprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a3-m4",
                    "uuid": "46d7b984-d6a6-41c5-aa4f-80ddc1e64c29",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE bei der Archivierung beachten, dass E-Mails möglicherweise nur lokal auf Clients gespeichert sind. Das Datensicherungskonzept wird um ein Archivierungskonzept erweitert, das gesetzliche und regulatorische Aufbewahrungsfristen berücksichtigt. Es werden regelmäßig Wiederherstellungstests durchgeführt, um die Integrität der Sicherungen zu überprüfen."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine dedizierte E-Mail-Archivierungslösung wird eingesetzt, die alle ein- und ausgehenden E-Mails revisionssicher speichert. Dies reduziert die Notwendigkeit, clientseitige Archive zu sichern. Das Backup-Konzept wird um jährliche, protokollierte Wiederherstellungstests für das E-Mail-System ergänzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das E-Mail-Archivierungskonzept und überprüft dessen Konformität mit den relevanten Aufbewahrungspflichten. Die Protokolle der durchgeführten Wiederherstellungstests werden eingesehen. Es wird geprüft, ob die Archivierungslösung korrekt funktioniert (z.B. durch Suche nach einer Test-E-Mail im Archiv)."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}