{
  "component-definition": {
    "uuid": "5236ef9e-9f41-4304-9482-d49b95b1d725",
    "metadata": {
      "title": "SYS.2.2.3 Clients unter Windows - Benutzerdefiniert",
      "last-modified": "2025-11-14T22:08:57.566825+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "a20edfa4-e307-4512-875e-5454f5400a98",
        "type": "hardware",
        "title": "SYS.2.2.3 Clients unter Windows",
        "description": "This component represents the implementation of all controls for Baustein SYS.2.2.3.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Mit Windows 10 hat Microsoft sein Client-Betriebssystem Windows an eine neue Unternehmensstrategie angepasst. Verändert hat sich insbesondere auch die grundlegende Philosophie, weg vom bisherigen Prinzip des „lokalen Betriebssystems“ hin zu einer Dienstleistung („Windows as a Service“). Das bedeutet, dass das Betriebssystem neben den bisherigen Funktionen auch darüber hinausgehende, insbesondere cloudbasierte, Anwendungen enthält und deswegen auf eine enge Anbindung an die Server-Infrastruktur von Microsoft angewiesen ist. Wichtige neue Aspekte im Vergleich zu den bisherigen Windows-Versionen sind vor allem der tief verankerte und teilweise nicht beeinflussbare Datenaustausch zwischen den Clients und der Herstellerinfrastruktur sowie die zunehmende Auslagerung von sicherheitskritischen Kernbestandteilen einer Windows-Infrastruktur (z. B. Authentisierung) in die Cloud.<BR>Mit Windows 11 wurde im Oktober 2021 eine Nachfolgeversion veröffentlicht. Diese enthält neue Funktionen, hat eine überarbeitete Bedienoberfläche und im Vergleich zu Windows 10 deutlich erhöhte Systemvoraussetzungen. Insbesondere setzt Windows 11 offiziell eine 64-Bit-fähige CPU, UEFI SecureBoot sowie ein TPM 2.0 voraus. Windows 11 ist trotz des Versionssprungs jedoch keine komplette Neuentwicklung, sondern basiert auf Windows 10. Dieser Baustein ist daher sowohl für Windows 10 als auch für Windows 11 anwendbar."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist der Schutz von Informationen, die durch und auf Windows-Clients mit Windows 10 oder 11 verarbeitet werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein SYS.2.2.3 Clients unter Windows ist für alle Clients anzuwenden, auf denen das Betriebssystem Microsoft Windows 10 oder 11 eingesetzt wird.<BR>Dieser Baustein enthält spezifische Anforderungen, die zum sicheren Betrieb von Clients unter dem Betriebssystem Windows zusätzlich zu den Anforderungen aus dem Baustein SYS.2.1 Allgemeiner Client zu beachten und zu erfüllen sind. Für Anwendungsprogramme, die auf den Windows-Clients verwendet werden, sind die Anforderungen der entsprechenden Bausteine zu erfüllen, beispielsweise APP.1.1 Office-Produkte oder APP.1.2 Webbrowser. Beim Einsatz in einer Windows-Domäne sind die Anforderungen der entsprechenden Bausteine wie APP.2.2 Active Directory Domain Services zu erfüllen."
          },
          {
            "name": "2.1. Schadprogramme auf Windows-Clients",
            "value": "Aufgrund der hohen Verbreitung von Windows-Betriebssystemen und der zwischen den Systemgenerationen oftmals vorhandenen Abwärtskompatibilität zu älteren Versionen ist die Gefährdung durch Schadprogramme und unbefugtes Eindringen in IT-Systeme für Windows vergleichsweise hoch."
          },
          {
            "name": "2.2. Integrierte Cloud-Funktionen",
            "value": "Windows beinhaltet zahlreiche Funktionen, mit denen Daten unter Nutzung der Dienste von Microsoft abgelegt und synchronisiert werden („Cloud-Dienste“). Dadurch besteht die Gefahr, diese unbewusst, oder zumindest unbedacht, auch für möglicherweise institutionskritische oder personenbezogene Daten zu nutzen. Außerdem können Benutzende gegen die Datenschutzgesetze verstoßen, wenn Daten bei Dritten, in der Regel im Ausland, gespeichert werden. Meldet sich eine Person mit bereits aktiviertem Microsoft-Account an ein neues Gerät an, werden automatisch die von ihm genutzten Microsoft-Cloud-Dienste eingerichtet. So können Daten der Institution ungewollt auf die privaten Geräte der Mitarbeitenden synchronisiert werden. Als weiteres Beispiel bietet Windows als Standardeinstellung die Möglichkeit, den Bitlocker-Recovery-Schlüssel direkt über den Microsoft-Account in der Cloud zu sichern und somit schutzbedürftige kryptografische Geheimnisse in die Hände Dritter zu geben."
          },
          {
            "name": "2.3. Beeinträchtigung von Software-Funktionen durch Kompatibilitätsprobleme",
            "value": "Software, die auf Vorgängerversionen eines Betriebssystems erfolgreich betrieben werden konnte, muss nicht auch grundsätzlich mit der aktuellen Version von Windows zusammenarbeiten. Mögliche Ursachen sind neue Sicherheitsmerkmale oder Betriebssystemeigenschaften sowie der Wegfall von Funktionen oder Diensten. In der Folge kann die Software nicht oder nur eingeschränkt verwendet werden. Beispiele für aktivierte Sicherheitsmerkmale, die bei neuen Windows-Versionen die Ursache für mögliche Kompatibilitätsprobleme sein können, sind die Benutzerkontensteuerung (UAC) oder, bei 64-Bit-Versionen des Betriebssystems, Kernel Patch Guard. Außerdem könnten signierte Treiber notwendig sein, die möglicherweise für ältere Geräte nicht mehr zur Verfügung stehen."
          },
          {
            "name": "2.4. Telemetrie-Funktionen von Windows",
            "value": "Windows sendet standardmäßig sogenannte Diagnosedaten an den Hersteller Microsoft. Zusätzlich kann Microsoft über den in Windows integrierten Telemetrie-Dienst gezielt Informationen von einem Client abfragen. Im Telemetrie-Level „Full“ bzw. „Vollständig“, der in den Windows-Editionen Home und Pro der Standard-Level ist, schließt dies beispielsweise den Zugriff auf die Registry des Clients sowie die Ausführung von bestimmten Diagnosetools auf dem Client mit ein. Es besteht die Gefahr, dass die Diagnose- bzw. Telemetriedaten schützenswerte Informationen enthalten, die auf diesem Weg an Dritte gelangen können."
          },
          {
            "name": "2.5. Eingeschränkte Forensik bei der Nutzung des Virtual Secure Mode (VSM)",
            "value": "Durch die Nutzung des Virtual Secure Mode (VSM) werden forensische Untersuchungen, z. B. zur Sicherheitsvorfallbehandlung, eingeschränkt bzw. erschwert. Prozesse, die durch den Secure Kernel bzw. dem Isolated User Mode (IUM) geschützt werden, sind nicht mehr zugänglich. Beispielsweise können Speicherabbilder dieser Prozesse aufgrund kryptografischer Maßnahmen nicht ausgewertet werden."
          }
        ],
        "control-implementations": [
          {
            "uuid": "ac4b08fd-2c7c-458d-b906-ead969748150",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/endgerte_profile.json",
            "description": "Implementation for all controls in Baustein SYS.2.2.3",
            "implemented-requirements": [
              {
                "uuid": "710e0e10-2d89-4386-a465-96fff350bb17",
                "control-id": "KONF.7.15",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SENS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.2.2.A3-m1",
                    "uuid": "40600d3b-c7d8-43a9-95a9-d6fd0ac3a661",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Nutzung von öffentlichen Hotspots ist weder explizit erlaubt noch verboten und wird nicht durch technische oder organisatorische Maßnahmen reguliert. Mitarbeitende nutzen Hotspots nach eigenem Ermessen, oft ohne VPN-Verbindung für den Zugriff auf Unternehmensdaten."
                      },
                      {
                        "name": "guidance",
                        "value": "Mitarbeitende verbinden sich beispielsweise im Hotel oder am Flughafen direkt mit dem öffentlichen WLAN, um E-Mails abzurufen oder auf Cloud-Dienste zuzugreifen, wobei die Daten ungeschützt übertragen werden können."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer SOLLTE durch Interviews mit reisenden Mitarbeitenden deren Vorgehensweise bei der Nutzung öffentlicher WLANs erfragen. Es SOLLTE geprüft werden, ob es eine klare Regelung und eine technische Erzwingung (z.B. Always-On-VPN) für die Nutzung von Hotspots gibt. Das Fehlen von beidem deutet auf diesen Reifegrad hin."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.2.A3-m2",
                    "uuid": "3f003061-f846-47f2-9b59-f90349210945",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert die grundlegende Anweisung, für den Zugriff auf interne Ressourcen aus öffentlichen WLANs ein VPN zu verwenden. Andere Aspekte der Hotspot-Sicherheit, wie die Deaktivierung der automatischen Anmeldung oder das Löschen bekannter Netzwerke, werden nicht adressiert. Die Einhaltung der VPN-Nutzung wird nicht kontrolliert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein VPN-Client ist auf den Laptops installiert, aber die Benutzer entscheiden selbst, wann sie ihn aktivieren. Oft wird er nur für den Zugriff auf das Intranet, nicht aber für den allgemeinen Internetverkehr oder Cloud-Dienste genutzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer SOLLTE die VPN-Client-Konfiguration auf Split-Tunneling überprüfen. Es SOLLTE durch Befragung und Einsicht in die WLAN-Richtlinie geprüft werden, ob weitere Sicherheitsmaßnahmen für Hotspots (außer VPN) definiert und kommuniziert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.2.A3-m3",
                    "uuid": "ac313a18-a0a7-4100-aab9-8db31c88e18e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wenn die Nutzung von Hotspots erlaubt ist, MUSS sichergestellt werden, dass jede(r) Benutzende seine/ihre Sicherheitsanforderungen kennt und entsprechend handelt. Sensible Daten DÜRFEN NUR übertragen werden, wenn eine geeignete Verschlüsselung auf dem Client aktiviert ist. Der Zugriff auf interne Ressourcen der Institution über öffentlich zugängliche WLANs DÜRFEN die Benutzenden NUR über ein Virtual Private Network (VPN) durchführen. Wird die WLAN-Schnittstelle längere Zeit nicht genutzt, MUSS sie deaktiviert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Organisation stellt allen Mitarbeitenden, die Hotspots nutzen dürfen, eine VPN-Lösung zur Verfügung und schult sie in deren Anwendung. Die Anforderungen sind klar in der WLAN-Nutzungsrichtlinie (siehe A1) definiert. Die Deaktivierung der Schnittstelle kann durch die Benutzer manuell erfolgen, unterstützt durch regelmäßige Erinnerungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer SOLLTE die Konfiguration von Clients stichprobenartig überprüfen, die für die Hotspot-Nutzung vorgesehen sind. Es ist zu verifizieren, ob ein VPN-Client installiert und konfiguriert ist. Durch Befragung der Nutzenden SOLLTE deren Kenntnis der Sicherheitsregeln für Hotspots ermittelt werden. Es SOLLTE geprüft werden, ob die VPN-Verbindung so konfiguriert ist, dass der gesamte Verkehr getunnelt wird (kein Split-Tunneling)."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.2.A3-m4",
                    "uuid": "e8624580-7827-4dfb-a976-19856226a2a7",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Aufbauend auf der definierten Basisabsicherung (Level 3) SOLLTE die Verbindung zwischen Hotspot und Client kryptografisch nach Stand der Technik (z.B. mittels WPA3, falls vom Hotspot unterstützt, ansonsten durch das VPN abgedeckt) abgesichert sein. Die automatische Anmeldung an WLANs SOLLTE deaktiviert werden. WLANs, die nur sporadisch genutzt werden, SOLLTEN aus der Historie bekannter Netzwerke gelöscht werden. Es SOLLTE sichergestellt sein, dass sich keine Benutzenden mit administrativen Berechtigungen von ihren Clients aus an externen WLANs anmelden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Deaktivierung der automatischen Anmeldung wird über eine Konfigurationsrichtlinie (z.B. GPO oder MDM-Profil) auf den Clients durchgesetzt. Die Benutzenden werden angeleitet und regelmäßig daran erinnert, nicht mehr benötigte WLAN-Profile zu entfernen. Die Nutzung von administrativen Konten in unsicheren Netzen wird durch Richtlinien verboten und stichprobenartig kontrolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer SOLLTE die Client-Konfiguration überprüfen, um sicherzustellen, dass die automatische Verbindung zu WLANs deaktiviert ist. Auf Windows kann dies mit `netsh wlan show profile name=\"PROFILE_NAME\"` geprüft werden, wo der 'Connection mode' auf 'Manual' stehen sollte. Es SOLLTE die Liste der bekannten Netzwerke auf veraltete Hotspot-Einträge geprüft werden. Es SOLLTE durch Interviews und Log-Analyse (falls möglich) verifiziert werden, dass keine administrativen Anmeldungen aus externen Netzen erfolgen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.2.A3-m5",
                    "uuid": "f64b202a-8661-4d93-9b4d-ac717acbb000",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Absicherung der Hotspot-Nutzung ist vollständig automatisiert. Eine 'Always-On' VPN-Verbindung wird technisch erzwungen, sobald der Client eine Netzwerkverbindung außerhalb definierter, vertrauenswürdiger Unternehmensnetze aufbaut. Die Client-Firewall ist so konfiguriert, dass sie jeglichen nicht-VPN-getunnelten Verkehr blockiert. Die Nutzung von Konten mit separaten, restriktiven Berechtigungen für die Nutzung in externen Netzen wird technisch durchgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine moderne VPN-Lösung mit 'Always-On' und 'Trusted Network Detection' wird eingesetzt. Diese erkennt automatisch, ob sich der Client in einem sicheren (Unternehmens-) oder unsicheren (Hotspot-) Netz befindet und baut den Tunnel entsprechend auf. Die Client-Konfiguration wird über ein MDM-System zentral verwaltet und kann nicht vom Benutzer geändert werden. Separate Benutzerkonten mit stark eingeschränkten Rechten werden für die Arbeit unterwegs verwendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer SOLLTE die Konfiguration der 'Always-On' VPN-Lösung und der zugehörigen Firewall-Regeln auf einem Client verifizieren. Es SOLLTE versucht werden, bei aktiver Verbindung zu einem externen Test-WLAN eine Verbindung zu einem Internetdienst aufzubauen, ohne dass der VPN-Tunnel aktiv ist; dies muss fehlschlagen. Es SOLLTE geprüft werden, welche Benutzerkonten auf den mobilen Geräten eingerichtet sind und welche Rechte diese besitzen."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}