{
  "component-definition": {
    "uuid": "11241d30-867a-44db-85c2-bd2ad1ea1667",
    "metadata": {
      "title": "NET.3.3 Externe Netzanschlüsse - Benutzerdefiniert",
      "last-modified": "2025-11-14T22:09:00.421752+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "9b524911-7570-4d5d-9d70-85a1f60c371b",
        "type": "interconnection",
        "title": "NET.3.3 Externe Netzanschlüsse",
        "description": "This component represents the implementation of all controls for Baustein NET.3.3.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Mithilfe von Virtuellen Privaten Netzen (VPNs) können schutzbedürftige Daten über nicht-vertrauenswürdige Netze, wie das Internet, übertragen werden. Ein VPN ist ein virtuelles Netz, das innerhalb eines anderen Netzes betrieben wird, jedoch logisch von diesem Netz getrennt ist. Das VPN nutzt das Netz hierbei lediglich als Transportmedium, ist aber selber unabhängig von der Struktur und dem Aufbau des verwendeten Netzes. VPNs können mithilfe kryptografischer Verfahren die Integrität und Vertraulichkeit von Daten schützen. VPNs ermöglichen auch dann die sichere Authentisierung der Kommunikationspunkte, wenn mehrere Netze oder IT-Systeme über gemietete Leitungen oder öffentliche Netze miteinander verbunden sind."
          },
          {
            "name": "Zielsetzung",
            "value": "Der Baustein definiert Anforderungen, mit denen sich ein VPN zielgerichtet und sicher planen, umsetzen und betreiben lässt."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der vorliegende Baustein ist für jede Zugriffsmöglichkeit auf das Netz der Institution über einen VPN-Endpunkt anzuwenden.<BR>Der Baustein geht nicht auf Grundlagen für sichere Netze und deren Aufbau ein (siehe dazu NET.1.1 Netzarchitektur und -design). Auch deckt dieser Baustein nicht alle mit dem Betrieb eines VPN zusammenhängenden Prozesse ab. VPNs sollten grundsätzlich im Rahmen der Bausteine ORP.4 Identitäts- und Berechtigungsmanagement, OPS.1.1.3 Patch- und Änderungsmanagement, OPS.1.2.5 Fernwartung, OPS.1.1.2 Ordnungsgemäße IT-Administration sowie CON.1 Kryptokonzept mit berücksichtigt werden.<BR>Empfehlungen, wie die Betriebssysteme der VPN-Endpunkte konfiguriert werden können, sind ebenfalls nicht Bestandteil dieses Bausteins. Entsprechende Anforderungen sind im Baustein SYS.1.1 Allgemeiner Server beziehungsweise SYS.2.1 Allgemeiner Client sowie in den jeweiligen betriebssystemspezifischen Bausteinen des IT-Grundschutz-Kompendiums zu finden."
          },
          {
            "name": "2.1. Fehlende oder unzureichende Planung des VPN-Einsatzes",
            "value": "Bei einem nicht sorgfältig geplanten, aufgebauten oder konfigurierten VPN können Sicherheitslücken entstehen, die alle IT-Systeme betreffen könnten, die mit dem VPN verbunden sind. Angreifenden kann es so möglich sein, auf vertrauliche Informationen der Institution zuzugreifen.<BR>So ist es durch eine unzureichende VPN-Planung beispielsweise möglich, dass die Benutzenden nicht ordnungsgemäß geschult wurden. Dadurch könnten sie das VPN in einer unsicheren Umgebung benutzen oder sich von unsicheren Clients aus einwählen. Dies ermöglicht es Angreifenden eventuell, auf das gesamte Institutionsnetz zuzugreifen.<BR>Auch wenn die regelmäßige Kontrolle der Zugriffe auf das VPN unzureichend geplant wurde, könnten Angriffe nicht rechtzeitig erkannt werden. Somit kann nicht zeitnah reagiert werden und Angreifende unbemerkt Daten stehlen oder ganze Prozesse sabotieren."
          },
          {
            "name": "2.2. Unsichere VPN-Dienstleistende",
            "value": "Hat eine Institution seine VPN-Dienstleistenden nicht sorgfältig ausgewählt, könnte dadurch das gesamte Netz der Institution unsicher werden. So könnte beispielsweise ein von den Dienstleistenden unsicher angebotener VPN-Zugang für Angriffe genutzt werden, um gezielt Informationen zu stehlen."
          },
          {
            "name": "2.3. Unsichere Konfiguration der VPN-Clients für den Fernzugriff",
            "value": "Wird ein VPN-Client nicht sicher konfiguriert, könnten die Benutzenden dessen Sicherheitsmechanismen falsch oder gar nicht benutzen. Auch verändern sie eventuell die Konfiguration des VPN-Clients. Ebenso ist es durch eine unsichere Konfiguration möglich, dass von den Benutzenden installierte Software auch die Sicherheit des VPN-Clients gefährdet."
          },
          {
            "name": "2.4. Unsichere Standard-Einstellungen auf VPN-Komponenten",
            "value": "In der Standard-Einstellung sind VPN-Komponenten meist ohne oder nur mit unzureichenden Sicherheitsmechanismen vorkonfiguriert. Oft wird mehr auf Nutzungsfreundlichkeit und problemlose Integration in bestehende IT-Systeme als auf Sicherheit geachtet. Werden VPN-Komponenten nicht oder nur mangelhaft an die konkreten Sicherheitsbedürfnisse der Institution angepasst, können Schwachstellen und somit gefährliche Angriffspunkte entstehen. Werden beispielsweise werksseitig voreingestellte Passwörter nicht geändert, könnte das gesamte VPN und damit das interne Netz der Institution angegriffen werden."
          }
        ],
        "control-implementations": [
          {
            "uuid": "ea49ec99-a28f-4dba-98ca-e274073cf007",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/externe_netzanschlsse_profile.json",
            "description": "Implementation for all controls in Baustein NET.3.3",
            "implemented-requirements": [
              {
                "uuid": "8b3be5b0-3874-4603-a614-4da05abab923",
                "control-id": "ARCH.2.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.3.A13-m1",
                    "uuid": "31afb44a-c232-477d-ac14-a21e31d6bd7b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die VPN-Komponente ist ein separates Gerät, das den Verkehr uninspiziert an das interne Netz weiterleitet ('tromboning') oder vor der Firewall platziert ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein eigenständiges VPN-Gateway wird im Rechenzentrum aufgestellt und direkt mit dem Core-Switch verbunden. Der gesamte vom VPN kommende Verkehr wird ohne Inspektion durch die zentrale Firewall ins interne Netz geroutet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den Netzwerkplan und die Routing-Tabellen und stellt fest, dass der Datenverkehr vom VPN-Gateway nicht durch die Firewall geleitet und gefiltert wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A13-m3",
                    "uuid": "98da82ae-d32d-4e75-9372-daa8343cf986",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die VPN-Komponenten SOLLTEN in die Firewall integriert werden. Dies SOLLTE dokumentiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die VPN-Terminierung wird als Funktion auf der zentralen Perimeter-Firewall aktiviert. Der entschlüsselte Verkehr von VPN-Clients wird somit automatisch von denselben Firewall-Regeln und -Policies inspiziert wie der restliche Verkehr. Die Konfiguration ist im Firewall-Konzept dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert anhand der Konfiguration der Firewall, dass die VPN-Funktionalität auf dem Gerät aktiv ist und dass der entschlüsselte VPN-Verkehr durch das Regelwerk der Firewall verarbeitet wird. Er prüft, ob diese Konfiguration im Firewall-Konzept dokumentiert ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A13-m4",
                    "uuid": "0b0045c9-e599-4db7-aff4-8400d17eedf4",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Firewall-Richtlinie für den VPN-Verkehr ist spezifisch gehärtet und logisch von anderen Regelwerken getrennt. Das Logging für diesen Verkehr ist erweitert, um eine detaillierte Überwachung zu ermöglichen."
                      },
                      {
                        "name": "guidance",
                        "value": "Für den VPN-Verkehr wird eine eigene Zone oder ein eigenes Policy-Paket auf der Firewall erstellt. Es gelten hier strengere Regeln als für den internen Verkehr. Alle erlaubten und blockierten Verbindungsversuche aus dem VPN werden detailliert geloggt und an ein zentrales Log-Management-System gesendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das Firewall-Regelwerk und bestätigt die Existenz eines separaten, gehärteten Regelwerks für VPN-Verkehr. Er überprüft die Logging-Konfiguration der Firewall und verifiziert im Log-Management-System das Vorhandensein der detaillierten VPN-Verkehrslogs."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A13-m5",
                    "uuid": "1ccd92d0-9ae3-4a15-b924-6afff280cfa0",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die integrierte VPN/Firewall-Lösung ist eine Next-Generation Firewall (NGFW), die auf dem gesamten entschlüsselten VPN-Verkehr Deep Packet Inspection (DPI), Intrusion Prevention (IPS) und Antimalware-Scans durchführt. Die Konfiguration wird als Code verwaltet und automatisch getestet."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine NGFW terminiert die VPN-Tunnel. Für den gesamten Datenverkehr aus dem VPN sind IPS, Application Control und Antivirus-Profile aktiviert. Jegliche Malware oder unzulässige Anwendungsnutzung (z.B. BitTorrent) wird blockiert und gemeldet. Die Firewall-Konfiguration wird in einem Git-Repository verwaltet und Änderungen werden über eine CI/CD-Pipeline validiert und ausgerollt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration der NGFW und stellt sicher, dass die Sicherheitsprofile (IPS, AV etc.) für den VPN-Verkehr aktiv sind. Er kann versuchen, eine Test-Malware (z.B. EICAR-Testdatei) über eine VPN-Verbindung zu übertragen und verifiziert, dass diese von der Firewall blockiert wird. Er führt ein Review der Konfigurations-Pipeline durch."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ed6b176b-beb7-40b2-ba64-dce1a64dbabc",
                "control-id": "ARCH.4.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.3.A12-m1",
                    "uuid": "bc79f997-2d60-49bf-a5bf-2a66d03c300e",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "VPN-Benutzerkonten werden lokal auf der VPN-Appliance verwaltet. Es existiert kein zentrales Verzeichnis, und es werden Sammelkonten verwendet."
                      },
                      {
                        "name": "guidance",
                        "value": "Auf dem VPN-Gateway werden lokale Benutzer 'entwickler', 'vertrieb' und 'gast' angelegt, deren Passwörter an die jeweiligen Teams weitergegeben werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer inspiziert die Benutzerdatenbank auf dem VPN-Gateway und stellt fest, dass lokale, nicht-personalisierte Konten verwendet werden, was eine Nachvollziehbarkeit von Aktionen unmöglich macht."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A12-m3",
                    "uuid": "f1f6b18f-9036-49a0-856b-12cd915416cb",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für Fernzugriff-VPNs MUSS eine zentrale und konsistente Konten- und Zugriffsverwaltung gewährleistet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Das VPN-Gateway ist an das zentrale Active Directory (AD) angebunden. Die Authentifizierung erfolgt über die personalisierten AD-Konten der Benutzer. Der Zugriff wird über die Mitgliedschaft in spezifischen AD-Gruppen (z.B. 'VPN-Users') gesteuert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration des VPN-Gateways, um sicherzustellen, dass es zur Authentifizierung an ein zentrales Verzeichnis angebunden ist. Er prüft die Konfiguration der Zugriffsgruppen im Verzeichnisdienst und stellt sicher, dass keine lokalen Benutzer auf dem Gateway konfiguriert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A12-m4",
                    "uuid": "8b950fae-46d7-4dc2-8320-28d462965f2b",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein Role-Based Access Control (RBAC)-Modell ist für den VPN-Zugriff implementiert. Unterschiedliche Rollen erhalten Zugriff auf unterschiedliche Ressourcen. Die Berechtigungen werden regelmäßig im Rahmen eines Rezertifizierungsprozesses überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Active Directory gibt es die Gruppen 'VPN-Sales' und 'VPN-Dev'. Mitglieder von 'VPN-Sales' erhalten über das VPN nur Zugriff auf das CRM-System, während Mitglieder von 'VPN-Dev' auf die Entwicklungsumgebung zugreifen können. Die Mitgliedschaft in diesen Gruppen wird halbjährlich von den Abteilungsleitern überprüft und bestätigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das definierte RBAC-Modell und dessen Umsetzung über Gruppen im Verzeichnisdienst und Policies auf dem VPN-Gateway. Er lässt sich die Protokolle der letzten Berechtigungs-Rezertifizierungen zeigen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A12-m5",
                    "uuid": "70714433-5285-4196-93cf-45731835cbbd",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der gesamte Prozess der Konten- und Zugriffsverwaltung ist in eine Identity Governance and Administration (IGA)-Lösung integriert. Der Zugriff wird dynamisch auf Basis von Attributen (Attribute-Based Access Control, ABAC) und Kontext gewährt, um just-in-time und least-privilege-Zugriff sicherzustellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein IGA-Tool steuert den VPN-Zugriff. Ein Entwickler erhält nur dann Zugriff auf ein bestimmtes Produktionssystem, wenn er der richtigen Rolle angehört, sich während eines genehmigten Wartungsfensters anmeldet UND ein gültiges Ticket für diese Aufgabe hat. Nach Abschluss der Aufgabe wird der Zugriff automatisch wieder entzogen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration der ABAC-Policies im IGA-System. Er testet verschiedene Zugriffsszenarien mit unterschiedlichen Attributen (z.B. mit und ohne gültiges Ticket), um die korrekte Funktion der dynamischen und Just-in-Time-Zugriffssteuerung zu verifizieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "6c85a83b-aa85-431d-8779-9551bd5d0426",
                "control-id": "ARCH.5.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.3.A11-m2",
                    "uuid": "c3448c8d-3eef-4673-9e4d-d820b5845968",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "VPN-Verbindungen von externen Netzen werden auf ein bestimmtes Subnetz beschränkt, jedoch ohne weitere Einschränkung auf spezifische Dienste oder Ports."
                      },
                      {
                        "name": "guidance",
                        "value": "Einem externen Dienstleister wird per VPN Zugriff auf das gesamte Entwicklungsnetz (10.1.2.0/24) gewährt, damit er 'alle benötigten Server erreichen kann'. Eine Einschränkung auf z.B. nur den RDP-Port des spezifischen Servers findet nicht statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Firewall-Regeln für den externen VPN-Zugang und stellt fest, dass der Zugriff auf ein ganzes Subnetz mit 'any' als Dienst/Port gewährt wird, anstatt den Zugriff auf die tatsächlich benötigten Systeme und Dienste zu beschränken."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A11-m3",
                    "uuid": "76c744f0-932f-4445-906a-089a6a51b6cb",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS sichergestellt werden, dass VPN-Verbindungen NUR zwischen den dafür vorgesehenen IT-Systemen und Diensten aufgebaut werden. Die dabei eingesetzten Tunnel-Protokolle MÜSSEN für den Einsatz geeignet sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Firewall-Regeln für den VPN-Zugang eines externen Dienstleisters werden nach dem Least-Privilege-Prinzip konfiguriert. Erlaubt ist nur der Zugriff von seiner festen Quell-IP auf die IP-Adresse des zu wartenden Servers auf TCP-Port 3389 (RDP). Als Tunnelprotokoll wird IPsec mit IKEv2 und starken, aktuellen Algorithmen verwendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Firewall-Regeln und verifiziert, dass diese den Zugriff auf die spezifisch freigegebenen Systeme und Dienste beschränken. Er überprüft die Konfiguration des VPN-Tunnels auf die Verwendung von als sicher eingestuften Protokollen und Algorithmen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A11-m4",
                    "uuid": "af8c6714-ed02-404f-a0cd-9eeafcd0cc02",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Firewall-Regeln für VPN-Verbindungen werden regelmäßig, mindestens halbjährlich, auf ihre Notwendigkeit und Korrektheit überprüft. Die Auswahl der Tunnelprotokolle wird durch das zentrale Kryptokonzept erzwungen und ihre Konfiguration wird automatisiert auf Konformität geprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle sechs Monate findet ein Firewall-Rule-Review statt, bei dem der verantwortliche Techniker die Notwendigkeit jeder Regel für externe VPN-Zugänge schriftlich bestätigen muss. Ein Compliance-Skript prüft wöchentlich, ob alle aktiven VPN-Tunnel die im Kryptokonzept vorgeschriebenen Chiffren verwenden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Protokolle der halbjährlichen Firewall-Rule-Reviews zeigen. Er analysiert das Compliance-Skript für die Tunnelprotokolle und dessen Ausführungsprotokolle, um die kontinuierliche Überprüfung zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A11-m5",
                    "uuid": "4ed49de1-2b13-43a5-8ebe-736826bfafc2",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird eine Mikrosegmentierung umgesetzt. Der Zugriff von externen Netzen wird pro Sitzung und pro Anwendung auf Basis des Benutzer- und Gerätekontexts dynamisch gewährt (Zero Trust Network Access). Die Sicherheit der Tunnelprotokolle wird kontinuierlich gegen neue Schwachstellen überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine ZTNA-Lösung wird eingesetzt. Wenn ein externer Benutzer eine Verbindung anfordert, wird sein Gerät auf Konformität geprüft. Anschließend wird nur für die Dauer der Sitzung ein direkter, verschlüsselter Tunnel zur spezifisch angeforderten Anwendung aufgebaut, ohne dem Benutzer Zugriff auf das restliche Netzwerk zu gewähren. Ein abonnementbasierter Threat-Intelligence-Feed informiert über neue Schwachstellen in den verwendeten VPN-Protokollen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der ZTNA-Lösung und der dynamischen Zugriffs-Policies. Er testet den Zugriff mit verschiedenen Benutzerkontexten und von verschiedenen Gerätezuständen, um die korrekte Funktion der Mikrosegmentierung zu verifizieren. Er überprüft den Prozess zur Verarbeitung von Threat-Intelligence-Informationen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "9ce1ebea-ddf3-4079-a749-8f768adac80c",
                "control-id": "ARCH.5.1.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.3.A4-m1",
                    "uuid": "fb0ead40-0f57-449e-9827-aa42d6f3b36b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "VPN-Komponenten werden mit den Standardeinstellungen des Herstellers betrieben. Es gibt keine definierte oder dokumentierte Sicherheitskonfiguration."
                      },
                      {
                        "name": "guidance",
                        "value": "Nach der Installation der VPN-Software wird der 'Quick Start'-Assistent durchlaufen, ohne sicherheitsrelevante Voreinstellungen wie schwache Verschlüsselungsalgorithmen oder Standardpasswörter zu ändern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die aktuelle Konfiguration einer VPN-Komponente mit der Standardkonfiguration aus dem Handbuch des Herstellers und stellt fest, dass keine Härtungsmaßnahmen vorgenommen wurden. Standardpasswörter können z.B. mit `ssh admin@vpn-gateway` und dem Passwort 'admin' getestet werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A4-m3",
                    "uuid": "22a49a3c-dbd1-4a73-a8b9-59281a6d5cae",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für alle VPN-Komponenten MUSS eine sichere Konfiguration festgelegt werden. Diese SOLLTE geeignet dokumentiert werden. Auch MUSS die für die Administration zuständige Person regelmäßig kontrollieren, ob die Konfiguration noch sicher ist und sie eventuell für alle IT-Systeme anpassen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein Konfigurationsstandard für das VPN erstellt, der u.a. starke Chiffren (z.B. AES-256-GCM), sichere Schlüsselaustauschverfahren und die Deaktivierung unsicherer Protokolle vorschreibt. Dieser Standard wird dokumentiert. Der VPN-Administrator prüft vierteljährlich manuell die Konfiguration auf Abweichungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das Dokument mit dem Konfigurationsstandard an. Er lässt sich die Protokolle der regelmäßigen manuellen Kontrollen zeigen und vergleicht die Live-Konfiguration einer Komponente stichprobenartig mit dem Standard."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A4-m4",
                    "uuid": "ce84fa1d-1904-4c27-b5bd-61ae2da9194d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Konfigurationsstandards sind verbindlich und werden in einem Versionierungssystem (z.B. Git) verwaltet. Die Überprüfung der Konfiguration auf Konformität erfolgt automatisiert durch Skripte oder Compliance-Tools, wobei Abweichungen eine Benachrichtigung auslösen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Konfigurations-Templates werden in einem Git-Repository gespeichert. Ein nächtlich laufendes Skript verbindet sich mit den VPN-Komponenten, exportiert deren Konfiguration und vergleicht sie mit dem genehmigten Template aus dem Repository. Unterschiede werden per E-Mail an das Sicherheitsteam gemeldet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das Konfigurations-Compliance-Skript. Er lässt sich die Alarmierungsprotokolle der letzten Monate zeigen und überprüft, wie auf gemeldete Abweichungen reagiert wurde. Ein automatisierter Test könnte lauten: `run-compliance-check.sh --target vpn-gateway-01`."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A4-m5",
                    "uuid": "1a2175fd-a5ad-459a-ab8a-4b0c68f2b383",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Konfiguration der VPN-Komponenten wird vollständig über ein Konfigurationsmanagementsystem (z.B. Ansible, Puppet) verwaltet (Configuration as Code). Jede Abweichung vom definierten Soll-Zustand wird automatisch erkannt und sofort korrigiert (Self-Healing)."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Ansible-Server ist dafür verantwortlich, den Zustand aller VPN-Komponenten durchzusetzen. Ändert ein Administrator manuell eine Einstellung an einem Gateway, wird diese Änderung bei der nächsten Ausführung des Ansible-Playbooks (z.B. alle 15 Minuten) automatisch auf den im Git-Repository definierten Wert zurückgesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration des Konfigurationsmanagement-Tools und die dazugehörigen Code-Repositories. Er kann eine absichtliche, nicht autorisierte Änderung an einer Test-Komponente vornehmen und beobachten, ob diese wie erwartet automatisch korrigiert wird, indem er die Logs des Tools in Echtzeit verfolgt."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c98dee25-4ec7-41c4-836e-247ac019c39c",
                "control-id": "ARCH.5.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BES",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.3.A9-m2",
                    "uuid": "0b6975d0-f166-4968-993c-80b8607196eb",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Produktauswahl basiert auf wenigen, grundlegenden Funktionsanforderungen wie z.B. 'unterstützt mobile Clients' oder 'kann Site-to-Site'."
                      },
                      {
                        "name": "guidance",
                        "value": "Das IT-Team wählt eine bekannte Open-Source-VPN-Lösung aus, weil sie als flexibel gilt und mobile Clients unterstützt, ohne eine detaillierte Gegenüberstellung mit anderen kommerziellen oder Open-Source-Produkten durchzuführen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt in Interviews fest, dass die Produktauswahl auf allgemeinen Annahmen und nicht auf einer strukturierten Analyse der spezifischen institutionellen Anforderungen beruhte."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A9-m3",
                    "uuid": "88da3352-53aa-47ff-971f-e3f56158b4cc",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei der Auswahl von VPN-Produkten MÜSSEN die Anforderungen der Institutionen an die Vernetzung unterschiedlicher Standorte und die Anbindung von mobilen Mitarbeitenden oder Telearbeitsplätzen berücksichtigt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Basierend auf der Anforderungsanalyse (A6) wird ein Anforderungskatalog für das VPN-Produkt erstellt. Dieser enthält Kriterien wie die maximale Anzahl gleichzeitiger Tunnel, Unterstützung für Site-to-Site- und Remote-Access-Szenarien sowie Kompatibilität mit den eingesetzten Authentisierungssystemen. Drei Produkte werden anhand dieses Katalogs bewertet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert den Anforderungskatalog und die Dokumentation der Produktbewertung an. Er überprüft, ob die Auswahlentscheidung nachvollziehbar auf den Ergebnissen der Bewertung und den Anforderungen aus der Anforderungsanalyse basiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A9-m4",
                    "uuid": "de96abf0-ec3a-4c2d-88d8-8a0939d2c926",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Im Rahmen der Produktauswahl wird eine formale Evaluation (Proof of Concept, PoC) der Top-Kandidaten in einer Testumgebung durchgeführt. Sicherheitszertifizierungen des Produkts (z.B. nach Common Criteria) sind ein wesentliches Auswahlkriterium."
                      },
                      {
                        "name": "guidance",
                        "value": "Die zwei besten Produkte aus der Vorauswahl werden für einen vierwöchigen PoC in einer isolierten Testumgebung installiert. Eine Gruppe von Testbenutzern prüft die Funktionalität und Benutzerfreundlichkeit. Die IT-Sicherheit prüft die Konfigurationsmöglichkeiten und Härtbarkeit. Nur Produkte mit einer gültigen BSI-Zertifizierung oder vergleichbar kommen in die engere Wahl."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Dokumentation des PoC, inklusive Testplan, Testergebnissen und Abschlussbericht. Er überprüft, ob die Forderung nach Sicherheitszertifikaten im Auswahlprozess berücksichtigt und nachgewiesen wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A9-m5",
                    "uuid": "ada29343-75cf-4fc6-b142-6a439bd46462",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Produktauswahl ist Teil einer strategischen Technologie-Roadmap und orientiert sich an modernen Sicherheitsarchitekturen. Die ausgewählte Lösung unterstützt native Konzepte für Zero Trust Network Access (ZTNA), ist hochgradig skalierbar und lässt sich vollständig über APIs automatisieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Auswahlentscheidung fällt auf eine moderne ZTNA/SASE-Lösung, da diese strategisch besser zur geplanten Cloud-Migration und dem 'Work-from-Anywhere'-Ansatz passt als eine klassische VPN-Appliance. Ein entscheidendes Kriterium ist die Existenz einer gut dokumentierten REST-API zur vollständigen Integration in die bestehenden Automatisierungswerkzeuge."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer gleicht die Auswahlentscheidung mit der dokumentierten IT-Strategie und Technologie-Roadmap ab. Er lässt sich die API-Dokumentation zeigen und prüft stichprobenartig, ob die Automatisierungsszenarien (z.B. User-Provisioning per API) wie geplant umgesetzt wurden oder umsetzbar sind."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "fd48667a-8502-46f2-b3e9-8304308c921e",
                "control-id": "ARCH.6.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.3.A7-m3",
                    "uuid": "c0df3abe-1225-413b-b2f0-42327de10dc7",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die technischen Aspekte eines VPN MÜSSEN sorgfältig geplant werden. So MÜSSEN für das VPN die Verschlüsselungsverfahren, VPN-Endpunkte, erlaubten Zugangsprotokolle, Dienste und Ressourcen festgelegt werden. Zudem MÜSSEN die Teilnetze definiert werden, die über das VPN erreichbar sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Auf Basis der Anforderungsanalyse (A6) wird ein technisches Konzept erstellt. Es legt fest: Verschlüsselung mit IPsec (IKEv2), VPN-Gateway auf der zentralen Firewall, erlaubte Protokolle sind HTTPS und RDP, Zugriff nur auf das Server-VLAN, nicht aber auf das Client-VLAN."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das technische VPN-Konzept an. Er überprüft die Konfiguration des VPN-Gateways und der Firewall-Regeln und vergleicht sie mit den Vorgaben im Konzept, um die korrekte Umsetzung der definierten Protokolle, Ressourcen und Teilnetze zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A7-m4",
                    "uuid": "4d1def16-4697-4d5a-a17e-1ebb9033a4e2",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der technische Plan umfasst Redundanz- und Failover-Szenarien sowie Performance-Betrachtungen. Die Auswahl der kryptografischen Verfahren orientiert sich verbindlich am zentralen Kryptokonzept der Institution (gemäß CON.1)."
                      },
                      {
                        "name": "guidance",
                        "value": "Das technische Konzept beschreibt einen hochverfügbaren VPN-Cluster mit zwei Gateways an unterschiedlichen Standorten. Die Auswahl der Chiffren und Schlüssellängen ist direkt aus dem übergreifenden Kryptokonzept abgeleitet und begründet. Es enthält eine Kapazitätsplanung für 500 gleichzeitige Benutzer."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das technische Konzept auf die Beschreibung von Redundanz und die Kapazitätsplanung. Er vergleicht die im Konzept festgelegten kryptografischen Verfahren mit den Vorgaben des zentralen Kryptokonzepts und prüft deren korrekte Implementierung auf den Gateways."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A7-m5",
                    "uuid": "4b3a897a-b921-4b97-93d3-66496660f54d",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die technische Planung ist als automatisierter Deployment-Blueprint (Infrastructure as Code) umgesetzt. Die Netzwerksegmentierung erfolgt dynamisch (Mikrosegmentierung) auf Basis der Identität und des Kontexts des Benutzers und Endgeräts (Zero Trust-Ansatz)."
                      },
                      {
                        "name": "guidance",
                        "value": "Anstatt eines Textdokuments besteht der technische Plan aus einem Satz von Terraform-Skripten und Ansible-Playbooks. Je nach Benutzerrolle und Zustand des Endgeräts (z.B. Patchlevel, aktivierte Festplattenverschlüsselung) werden bei der Einwahl dynamisch nur die Firewall-Regeln für die exakt benötigten Anwendungen freigeschaltet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer führt ein Review des IaC-Codes durch. Er testet die dynamische Segmentierung, indem er sich mit unterschiedlichen Benutzerrollen und von Endgeräten mit verschiedenem Sicherheitsstatus (z.B. ein konformes und ein nicht-konformes Gerät) einwählt und prüft, ob die Netzwerkzugriffe wie erwartet dynamisch eingeschränkt werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "da146530-b9fb-4c30-b98f-b26ef501cc3f",
                "control-id": "ARCH.9.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Assessment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ISGA",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.3.A6-m3",
                    "uuid": "da1f5fba-f085-457f-aa2c-c97193eb79b1",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Anforderungsanalyse MUSS durchgeführt werden, um für das jeweilige VPN die Einsatzszenarien zu bestimmen und daraus Anforderungen an die benötigten Hard- und Software-Komponenten ableiten zu können. In der Anforderungsanalyse MÜSSEN folgende Punkte betrachtet werden: Geschäftsprozesse bzw. Fachaufgaben, Zugriffswege, Identifikations- und Authentisierungsverfahren, Benutzende und ihre Berechtigungen, Zuständigkeiten sowie Meldewege."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor der Auswahl einer VPN-Lösung werden Workshops mit den relevanten Fachabteilungen (z.B. Vertrieb, Entwicklung) durchgeführt, um deren Anforderungen zu erfassen. Die Ergebnisse werden in einem Anforderungsdokument festgehalten, das die Use Cases (z.B. 'Außendienstmitarbeiter greift auf CRM zu', 'Entwickler benötigt Zugriff auf Testsysteme'), die benötigten Bandbreiten und die Sicherheitsanforderungen (z.B. 'Zwei-Faktor-Authentisierung ist Pflicht') detailliert beschreibt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das Anforderungsdokument für das VPN an und prüft, ob alle geforderten Aspekte (Geschäftsprozesse, Zugriffswege etc.) behandelt werden. Er führt Interviews mit Stakeholdern, um zu verifizieren, dass deren Anforderungen im Dokument korrekt widergespiegelt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A6-m4",
                    "uuid": "71a0131a-920f-4400-ac4c-2ac3490af61d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anforderungsanalyse ist ein formaler, dokumentierter Prozess, der bei jeder wesentlichen Änderung der Netz- oder Geschäftsprozesse wiederholt wird. Die Ergebnisse werden von den Prozessverantwortlichen und der IT-Sicherheit formal abgenommen und unterzeichnet."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Anforderungsdokument wird versioniert und nach der Finalisierung von den Leitern der beteiligten Fachabteilungen sowie dem CISO unterzeichnet. Bei der Einführung eines neuen ERP-Systems wird der Prozess der Anforderungsanalyse erneut durchlaufen, um die Auswirkungen auf das VPN zu bewerten und das Konzept anzupassen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die versionierten Anforderungsdokumente und die zugehörigen, unterzeichneten Freigabeprotokolle. Er prüft die Change-Management-Protokolle auf wesentliche Änderungen und verifiziert, ob daraufhin eine Aktualisierung der VPN-Anforderungsanalyse stattgefunden hat."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A6-m5",
                    "uuid": "d3836a5b-db66-4716-abb9-cb4f7e0738c1",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anforderungsanalyse ist Teil eines kontinuierlichen Service-Design-Prozesses und in das Enterprise Architecture Management (EAM) integriert. Die erfassten Anforderungen informieren dynamisch über Policy-Engines die Konfiguration des VPN, um eine kontinuierliche Ausrichtung an den Geschäftsanforderungen sicherzustellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Geschäftsprozesse und deren Anforderungen an den Fernzugriff sind im EAM-Tool modelliert. Eine Änderung im Modell (z.B. ein neuer Prozess benötigt Zugriff auf eine bestimmte Anwendung) löst einen automatisierten Workflow aus, der eine entsprechende Anpassung der VPN-Policy vorschlägt, die nach Genehmigung automatisch ausgerollt wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Modelle im EAM-Tool und die Konfiguration der Policy-Engine. Er verfolgt einen Anforderungsänderungsprozess von der Modellierung im EAM-Tool bis hin zur automatisierten Anpassung der VPN-Konfiguration, um die durchgängige Integration zu verifizieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "473eca7d-7491-4063-a58a-ca67d62a070e",
                "control-id": "DET.4.10",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "REAL",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.3.A10-m2",
                    "uuid": "8db5c94f-5ebb-4124-944f-3939a2ac8def",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert eine einfache Betriebsanleitung oder Checkliste, die sich auf grundlegende Aufgaben wie das Einspielen von Patches und die Überprüfung der Systemverfügbarkeit konzentriert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine Wiki-Seite für den VPN-Betrieb, auf der steht: 'Monatlich nach Updates suchen und installieren' und 'Täglich prüfen, ob das Gateway online ist'."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Betriebsanleitung und vergleicht sie mit den Logs des Systems, um festzustellen, ob die wenigen definierten Aufgaben (z.B. Patching) regelmäßig durchgeführt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A10-m3",
                    "uuid": "b5f2b6c9-9be4-482e-9f64-c2538d4740de",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für VPNs MUSS ein Betriebskonzept erstellt werden. Darin MÜSSEN die Aspekte Qualitätsmanagement, Überwachung, Wartung, Schulung und Autorisierung beachtet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein formales VPN-Betriebskonzept wird erstellt. Es beschreibt: Wie die Performance überwacht wird (Qualitätsmanagement), welche Events geloggt und ausgewertet werden (Überwachung), den Prozess für Patch- und Änderungsmanagement (Wartung), wie neue Administratoren eingewiesen werden (Schulung) und den Prozess zur Genehmigung von Konfigurationsänderungen (Autorisierung)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das Betriebskonzept an und überprüft, ob alle geforderten Aspekte darin behandelt werden. Anhand von Systemlogs, Tickets und Schulungsnachweisen verifiziert er stichprobenartig, ob die im Konzept beschriebenen Prozesse in der Praxis gelebt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A10-m4",
                    "uuid": "f5ae0928-6883-41b3-8c0d-32e5ae5780cf",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Betriebskonzept enthält definierte Key Performance Indicators (KPIs) für Sicherheit und Verfügbarkeit. Die Überwachung ist proaktiv und generiert Alarme bei Anomalien im Nutzerverhalten oder bei Performance-Engpässen."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Betriebskonzept sind KPIs wie 'maximale CPU-Last < 80%' und 'keine erfolgreichen Logins von blockierten IP-Adressen' definiert. Das Monitoring-System alarmiert das Team, wenn die CPU-Last 80% übersteigt oder wenn sich ein Benutzer innerhalb von 30 Minuten von zwei verschiedenen Kontinenten aus anzumelden versucht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Betriebskonzept auf die Definition von KPIs. Er analysiert die Konfiguration des Monitoring-Systems auf die Umsetzung der proaktiven Alarmierungsregeln und prüft die Bearbeitung der generierten Alarme im Ticketsystem."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.3.A10-m5",
                    "uuid": "c72b72ab-3b82-4ab1-a179-7ab7f17bd4a1",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Betrieb ist hochgradig automatisiert, inklusive automatisiertem Patching und Konfigurationsmanagement. Ein dediziertes Team oder eine Rolle ist für die kontinuierliche Verbesserung des VPN-Dienstes (CSI) verantwortlich. Das Betriebskonzept wird mindestens vierteljährlich auf Basis von Betriebsdaten und neuen Bedrohungsinformationen überprüft und angepasst."
                      },
                      {
                        "name": "guidance",
                        "value": "Sicherheits-Patches für das VPN-System werden automatisch in einer Testumgebung ausgerollt und geprüft. Bei Erfolg erfolgt der Rollout in der Produktion im nächsten Wartungsfenster automatisch. Das VPN-Team trifft sich monatlich, um Betriebs-KPIs, Benutzerfeedback und aktuelle Sicherheitswarnungen zu besprechen und daraus Maßnahmen zur Verbesserung abzuleiten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der Automatisierungswerkzeuge für Patching und Konfigurationsmanagement. Er sichtet die Protokolle der CSI-Meetings und prüft, ob die dort beschlossenen Maßnahmen nachverfolgt und umgesetzt wurden. Er verifiziert die Revisionshistorie des Betriebskonzepts auf regelmäßige Aktualisierungen."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}