{
  "component-definition": {
    "uuid": "a8b40d51-6760-4add-b927-bb028b22e3b9",
    "metadata": {
      "title": "INF.1 Gebäude - Benutzerdefiniert",
      "last-modified": "2025-11-14T22:09:00.914057+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "03aef1a2-b399-49b4-85cb-4e98842f8eb0",
        "type": "physical",
        "title": "INF.1 Gebäude",
        "description": "This component represents the implementation of all controls for Baustein INF.1.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Ein Gebäude umschließt alle stationären Arbeitsplätze, die verarbeiteten Informationen sowie die aufgestellte Informationstechnik. Es gewährleistet somit einen Schutz vor äußeren Einflüssen. Daher ist nicht nur das Bauwerk an sich zu betrachten, also Wände, Decken, Böden, Dach, Fenster sowie Türen, sondern auch alle gebäudeweiten Infrastruktur- und Versorgungseinrichtungen wie Strom, Wasser, Gas, Heizung und Kühlung.<BR>Betrachtet wird ein Gebäude, das von einer oder mehreren Organisationseinheiten einer Institution genutzt wird. Diese können unterschiedliche Sicherheitsansprüche haben. Zudem muss in alle Überlegungen einfließen, dass ein Gebäude fast immer auch von institutionsfremden Personen, wie Besuch, Kundschaft oder Liefernden, betreten wird. Wenn ein Gebäude von verschiedenen Parteien genutzt wird, dann müssen Gestaltung und Ausstattung des Gebäudes und das Nutzungskonzept für das Gebäude zueinander passen. Es soll eine optimale Umgebung für die dort tätigen Menschen sichergestellt werden. Unberechtigte sollen dort keinen Zutritt erhalten, wo sie die Sicherheit beeinträchtigen könnten. Die im Gebäude installierte Technik soll zudem sicher und effizient betrieben werden können."
          },
          {
            "name": "Zielsetzung",
            "value": "In diesem Baustein wird beschrieben, welche Anforderungen zu erfüllen sind, um ein Gebäude aus Sicht der Informationssicherheit optimal zu schützen. Die sich aus den Anforderungen ergebenden Maßnahmen hängen von der Art und Größe der Institution sowie Art und Größe des Gebäudes ab. Anforderungen aus diesem Baustein können auch auf große Liegenschaften mit mehreren Gebäuden oder auf die Nutzung einzelner Gebäudeteile in Mehrparteienhäusern übertragen werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein INF.1 Allgemeines Gebäude ist für jedes Gebäude einmal anzuwenden.<BR>Dieser Baustein betrachtet technische und nicht-technische Sicherheitsaspekte bei der Planung und Nutzung von typischen Gebäuden für Unternehmen und Behörden. Dabei wird der gesamte Lebenszyklus von Gebäuden aus Sicht der Informationssicherheit betrachtet, beginnend von der Erstellung eines Anforderungskataloges, über die Konzeption, Einrichtung, Nutzung bis hin zu Umbauten oder dem Auszug."
          },
          {
            "name": "2.1. Feuer",
            "value": "Gebäude und Einrichtung können durch ein Feuer schwer beschädigt, Menschen schwer verletzt oder getötet werden. Neben den direkt durch das Feuer verursachten Schäden müssen auch die Folgeschäden betrachtet werden. So dauert die Wiederinbetriebnahme durch Brand beschädigter Bereiche in der Regel Wochen oder gar Monate. Eine sehr große Gefahr bei einem Feuer ist der giftige Brandrauch. Die meisten Personenschäden entstehen daher durch Rauchvergiftungen. Aber auch an Einrichtungen und IT-Systemen kann Brandrauch schwere Schäden anrichten.<BR>Wenn PVC verbrennt, entstehen etwa Chlorgase, die zusammen mit der Luftfeuchtigkeit und dem Löschwasser Salzsäure bilden. Werden die Salzsäuredämpfe über die Klimaanlage verteilt, können auf diese Weise auch Schäden an empfindlichen elektronischen Geräten entstehen, die in einem vom Brandort weit entfernten Teil des Gebäudes stehen."
          },
          {
            "name": "2.2. Blitz",
            "value": "Während eines Gewitters sind Blitzeinschläge die größte Gefahr für Gebäude und Informationstechnik. Blitze erreichen bei Spannungen von mehreren 100.000 Volt Ströme bis zu 200.000 Ampere. Diese enorme elektrische Energie wird innerhalb von 50 bis 100 Mikrosekunden freigesetzt und abgebaut. Ein Blitz mit diesen Werten, der in einem Abstand von etwa zwei Kilometern einschlägt, verursacht auf elektrischen Leitungen im Gebäude immer noch Spannungsspitzen, die zur Zerstörung empfindlicher elektronischer Geräte führen können. Diese indirekten Schäden nehmen zu, je näher am Gebäude der Blitz einschlägt.<BR>Schlägt der Blitz direkt in ein Gebäude ein, können durch die dynamische Energie des Blitzes große Schäden verursacht werden. Dies können zum Beispiel Beschädigungen an Dach und Fassade sowie Schäden durch auftretende Brände oder Überspannungsschäden an elektrischen Geräten sein."
          },
          {
            "name": "2.3. Wasser",
            "value": "Wasser kann von außen, beispielsweise durch Regen, Hochwasser oder Überschwemmungen, oder von innen, etwa durch defekte wasserführende Leitungen, Schäden an einem Gebäude und seinen Einrichtungen verursachen."
          },
          {
            "name": "2.4. Elementarschäden und Naturkatastrophen",
            "value": "Je nach Standort ist ein Gebäude den Risiken durch Elementarschäden und Naturkatastrophen unterschiedlich stark ausgesetzt. Ursachen für Naturkatastrophen können seismische, klimatische oder vulkanische Phänomene sein, wie beispielsweise Erdbeben, Hochwasser, Erdrutsche, Tsunamis, Lawinen oder Vulkanausbrüche. Beispiele für extreme meteorologische Phänomene sind Unwetter, Orkane oder Starkregen."
          },
          {
            "name": "2.5. Umfeld-Gefährdungen",
            "value": "Gebäude können auch durch Ereignisse in der unmittelbaren Umgebung beschädigt werden, beispielsweise wenn giftige Substanzen austreten. Durch Rettungsarbeiten, Straßensperrungen oder Evakuierungen kann es auch möglich sein, dass das Gebäude nur noch eingeschränkt oder nicht mehr genutzt werden kann."
          },
          {
            "name": "2.6. Unbefugter Zutritt",
            "value": "Wenn Unbefugte in ein Gebäude oder einzelne Räume gelangen, kann dies verschiedene andere Gefährdungen nach sich ziehen. Unbefugte Personen können einerseits durch vorsätzliche Handlungen wie Diebstahl oder Manipulation von Informationen, IT-Systemen oder IT-Komponenten, andererseits aber auch durch unbeabsichtigtes Fehlverhalten, z. B. aufgrund mangelnder Fachkenntnisse, Schäden verursachen.<BR>Dabei können nicht offensichtliche Manipulationen weit höhere Schäden verursachen als direkte Zerstörung. Schon durch das unbefugte Eindringen können Sachschäden entstehen. Fenster und Türen werden gewaltsam geöffnet und dabei beschädigt. Diese zu reparieren oder zu ersetzen, beansprucht in der Regel Zeit und finanzielle Mittel, in der diese ihre Schutzfunktion nicht oder nur eingeschränkt bereitstellen."
          },
          {
            "name": "2.7. Verstoß gegen Gesetze oder Regelungen",
            "value": "Wird ein Gebäude errichtet, sind viele Gesetze und Vorgaben zu beachten, die beispielsweise den Brandschutz oder andere Aspekte der baulichen Sicherheit betreffen. Wenn gegen diese Gesetze verstoßen wird, fällt dies unter Umständen lange nicht auf, kann aber katastrophale Folgen nach sich ziehen, etwa wenn Brandschotten nicht bestimmungsgemäß eingebaut wurden."
          },
          {
            "name": "2.8. Unzureichende Brandschottungen",
            "value": "Jedes Gebäude, in dem IT betrieben wird, ist von einer Vielzahl von Kabeln und Leitungen durchzogen, wie beispielsweise Frisch- und Abwasserleitungen, Heizungsrohre oder Leitungen zur Energieversorgung oder Datenübertragung. Es ist dabei unvermeidlich, dass solche Rohr- und Kabeltrassen Brandschutzwände und Geschossdecken queren müssen. Wenn an solchen Stellen keine geeigneten Brandschotten eingebaut sind, können sich darüber unter Umständen Brände und Rauch unkontrolliert ausbreiten.<BR>Die hohe Dynamik der IT macht es auch im Leitungsnetz immer wieder erforderlich, dass Kabel auch über Brandschotten hinweg nachverlegt werden müssen. In welcher Form dies korrekt erfolgen kann, ist unmittelbar von dem vorhandenen Schott abhängig und kann sehr unterschiedlich sein. Werden Änderungen an einem Brandschott nicht nach den Vorgaben des jeweiligen Unternehmens, das das Schott herstellt, ausgeführt, kann es im Fall eines Brandes versagen. Der Brand könnte sich dann in Bereiche ausweiten, die eigentlich durch das Schott geschützt wären."
          },
          {
            "name": "2.9. Ausfall der Stromversorgung",
            "value": "Bei einem Stromausfall können ganze Gebäude oder Teile davon unbenutzbar werden. Von der Stromversorgung sind nicht nur die offensichtlichen, direkten Stromverbraucher wie IT oder Beleuchtung abhängig. Auch alle Infrastruktureinrichtungen sind heute direkt oder indirekt vom Strom abhängig, z. B. Aufzüge, Klimatechnik, Gefahrenmeldeanlagen, Sicherheitsschleusen, automatische Türschließanlagen, Sprinkler- oder Telefonnebenstellenanlagen. Selbst die Wasserversorgung ist in Hoch- oder Tiefgeschossen aufgrund der erforderlichen Pumpen auf Strom angewiesen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "a575e06c-099d-43a3-805a-9440c58a1286",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/gebude_profile.json",
            "description": "Implementation for all controls in Baustein INF.1",
            "implemented-requirements": [
              {
                "uuid": "da13a496-0ab9-4a90-9690-46e1e76fb631",
                "control-id": "GEB.1.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A9-m1",
                    "uuid": "0dd46e4e-dd89-41bd-9666-a9c8b391543b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existieren nur einzelne, unverbundene Anweisungen zur Gebäudenutzung, wie z.B. eine separate Brandschutzordnung. Ein übergreifendes Konzept fehlt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine Brandschutzordnung und eine separate Anweisung zur Schlüsselrückgabe, aber keine Dokumentation, wie diese Aspekte zusammenspielen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sammelt alle vorhandenen Regelungsdokumente zur Gebäudenutzung und stellt fest, dass kein integriertes, übergreifendes Konzept existiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A9-m2",
                    "uuid": "8666d2d0-8fa8-4a0e-8d34-cc44c2fba492",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt ein grundlegendes Dokument, das als Sicherheitskonzept für die Gebäudenutzung bezeichnet wird. Es ist jedoch nicht mit dem Gesamtsicherheitskonzept der Institution abgestimmt und wird nicht regelmäßig aktualisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Dokument wurde bei Einzug in das Gebäude erstellt, das grundlegende Regeln festlegt. Es berücksichtigt jedoch nicht die spezifischen Schutzbedarfe der inzwischen eingezogenen Abteilungen oder die allgemeinen IT-Sicherheitsrichtlinien."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das vorhandene Konzept und vergleicht es mit dem Gesamtsicherheitskonzept (falls vorhanden). Es wird das Erstellungsdatum geprüft und festgestellt, ob seitdem Aktualisierungen stattgefunden haben."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A9-m3",
                    "uuid": "507aba5a-aa00-4db2-bf02-d91cac6b4bad",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE ein Sicherheitskonzept für die Gebäudenutzung geben. Das Sicherheitskonzept für das Gebäude SOLLTE mit dem Gesamtsicherheitskonzept der Institution abgestimmt sein. Es SOLLTE dokumentiert und regelmäßig aktualisiert werden. Es MUSS ein IT-bezogenes Brandschutzkonzept erstellt und umgesetzt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein formales Sicherheitskonzept für die Gebäudenutzung wird erstellt und gepflegt. Es referenziert das übergeordnete ISMS-Framework und enthält spezifische Regelungen zur physischen Sicherheit. Ein separates, detailliertes IT-Brandschutzkonzept, das auf die spezifischen Risiken in Serverräumen eingeht, ist Teil dieses Konzepts."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz, Vollständigkeit und Abstimmung des Gebäudesicherheitskonzepts mit dem Gesamtsicherheitskonzept. Insbesondere wird das IT-Brandschutzkonzept auf seine Angemessenheit und Umsetzung geprüft. Die Revisionshistorie des Dokuments wird auf regelmäßige Aktualisierungen kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A9-m4",
                    "uuid": "43a23566-0574-4cf8-9d8d-c268bae305f2",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Schützenswerte Räume oder Gebäudeteile SOLLTEN nicht in exponierten oder besonders gefährdeten Bereichen untergebracht sein. Das Gebäudesicherheitskonzept wird mindestens jährlich oder bei signifikanten Änderungen überprüft und angepasst."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei der Raumplanung wird aktiv darauf geachtet, Serverräume nicht im Erdgeschoss mit großen Fenstern oder im Keller (Hochwassergefahr) zu platzieren. Ein formaler Review-Prozess für das Sicherheitskonzept ist etabliert und wird protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bewertet die Lage der schützenswerten Räume anhand von Gebäudeplänen und einer Begehung im Hinblick auf bekannte Gefährdungen (z.B. Einbruch, Wasser, Einsicht). Die Protokolle des jährlichen Reviews des Sicherheitskonzepts werden geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A9-m5",
                    "uuid": "9a9bfefc-b77d-41a3-aca7-d92c883d5aee",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Sicherheitskonzept für die Gebäudenutzung basiert auf einer detaillierten, quantitativen Risikoanalyse. Es ist vollständig in ein GRC-Tool integriert, das die Abhängigkeiten zwischen physischen Zonen, IT-Assets und Geschäftsprozessen abbildet. Änderungen an einem Element lösen automatisch eine Neubewertung der Risiken für abhängige Elemente aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Standortwahl und die Positionierung von schützenswerten Bereichen basieren auf einer formalen Standortrisikoanalyse, die Gefährdungen wie Hochwasser, Erdbeben oder Kriminalitätsrate einbezieht. Das GRC-Tool visualisiert die Auswirkungen eines Ausfalls einer physischen Zone (z.B. Serverraum) auf die Geschäftsprozesse."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die im GRC-Tool hinterlegten Risikoanalysen und Abhängigkeitsmodelle. Es wird geprüft, ob die Entscheidungen zur Raumplanung nachvollziehbar auf diesen Analysen basieren. Die automatische Neubewertung von Risiken wird durch simulierte Änderungen im Tool getestet. Automatisierte Prüfung: `check_grc_config --asset-type 'building_zone' --verify 'risk_assessment_quantitative,bcm_linkage_complete'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "8ded5f29-abfe-4845-bd6d-6d2f9c686228",
                "control-id": "GEB.1.3.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BES",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A30-m1",
                    "uuid": "cc1968e9-2d6f-42da-ba0d-60930b3efbf3",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Auswahl eines Gebäudes erfolgt ohne Berücksichtigung von Sicherheitsanforderungen. Die Eignung wird nicht geprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Gebäude wird angemietet, und erst danach wird festgestellt, dass die Elektroinstallation für den Betrieb der IT unzureichend ist."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fragt nach der Checkliste oder dem Kriterienkatalog für die Gebäudeauswahl und stellt fest, dass Sicherheitsaspekte nicht enthalten waren."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A30-m2",
                    "uuid": "b374caef-a7e9-4ba5-b533-7c7f36351140",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei der Auswahl werden grundlegende Sicherheitsaspekte wie ein solider Gesamteindruck berücksichtigt. Eine detaillierte Prüfung anhand einer Checkliste findet jedoch nicht statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Man achtet darauf, dass das Gebäude nicht heruntergekommen aussieht. Ob aber z.B. die Brandschotts korrekt verbaut sind oder eine ausreichende Stromversorgung für das geplante RZ vorhanden ist, wird nicht systematisch geprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bewertet, ob die Gebäudeauswahl auf einer systematischen Prüfung der sicherheitsrelevanten Eigenschaften beruhte oder eher auf subjektiven Eindrücken."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A30-m3",
                    "uuid": "dbe5ab9b-cf4a-4f8e-97d0-124d7f221e05",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei der Auswahl eines geeigneten Gebäudes SOLLTE geprüft werden, ob alle für die spätere Nutzung relevanten Sicherheitsanforderungen umgesetzt werden können. Für jedes Gebäude SOLLTEN im Vorfeld die vorhandenen Gefährdungen und die erforderlichen Schäden vorbeugenden oder reduzierenden Maßnahmen dokumentiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor der Anmietung oder dem Kauf eines Gebäudes wird eine Due-Diligence-Prüfung im Hinblick auf die Informationssicherheit durchgeführt. Anhand einer umfassenden Checkliste werden Aspekte wie baulicher Zustand, Brandschutz, Einbruchschutz, Elektroversorgung etc. bewertet. Das Ergebnis ist ein Bericht, der den Ist-Zustand, die Lücken zu den eigenen Anforderungen (Soll) und den geschätzten Aufwand zur Schließung der Lücken dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet den Due-Diligence-Bericht für das Gebäude. Es wird bewertet, ob die Prüfung umfassend war und ob die Ergebnisse die Auswahlentscheidung und die Budgetplanung für notwendige Ertüchtigungen nachvollziehbar beeinflusst haben."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A30-m4",
                    "uuid": "69e2cb80-fef2-4072-b938-1560ad2a4bbb",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Prüfung des Gebäudes wird durch ein interdisziplinäres Team aus eigenen Fachleuten (Bau, IT, Sicherheit) und bei Bedarf durch externe Sachverständige (z.B. für Brandschutz, Statik) durchgeführt."
                      },
                      {
                        "name": "guidance",
                        "value": "Für die Begehung des potenziellen Gebäudes wird ein Team gebildet, das alle relevanten Kompetenzen abdeckt. Für kritische Aspekte, die intern nicht bewertet werden können, werden Gutachten von externen Spezialisten eingeholt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Zusammensetzung des Bewertungsteams und sichtet die externen Gutachten. Es wird bewertet, ob die Expertise für eine fundierte Entscheidung ausreichend war."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A30-m5",
                    "uuid": "64e9bb19-81ce-445c-b1ad-550662025228",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Auswahl des Gebäudes ist vollständig in den Prozess der Standortauswahl integriert. Die Ergebnisse der Standortrisikoanalyse und der Gebäude-Due-Diligence werden kombiniert, um eine Gesamtrisikobewertung für die potenziellen Optionen zu erstellen und die beste Alternative objektiv auszuwählen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein Scoring-Modell verwendet, das verschiedene Kriterien (Wirtschaftlichkeit, Funktionalität, Sicherheit, Standortrisiken) gewichtet und zu einer Gesamtbewertung für jedes in Frage kommende Gebäude führt. Die Entscheidung wird auf Basis dieser objektiven Bewertung getroffen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das verwendete Scoring-Modell, einschließlich der Kriterien und ihrer Gewichtung. Es wird geprüft, ob der Auswahlprozess transparent, objektiv und nachvollziehbar dokumentiert ist."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "f7c6485d-a3f3-4842-9812-37ed291922bd",
                "control-id": "GEB.1.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A25-m1",
                    "uuid": "039f4602-5439-4cce-a1db-541f789ee2a1",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Standortauswahl erfolgt ausschließlich nach wirtschaftlichen Kriterien wie Mietpreis und Verkehrsanbindung. Umfeldbedingungen und Naturgefahren werden nicht berücksichtigt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Gebäude wird in einem bekannten Überschwemmungsgebiet angemietet, weil die Miete günstig ist. Die potenziellen Risiken werden ignoriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fragt nach den Kriterien für die Standortauswahl und stellt fest, dass Sicherheitsaspekte keine Rolle gespielt haben."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A25-m2",
                    "uuid": "cb855922-15ce-4464-8f16-2c8538a11aa8",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Offensichtliche Gefährdungen wie die Lage in einem Hochwassergebiet werden bei der Standortauswahl vermieden. Eine systematische Analyse aller potenziellen Umfeldgefährdungen findet jedoch nicht statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Man prüft auf einer Hochwasserkarte, ob der Standort gefährdet ist. Andere Risiken wie die Nähe zu Chemiebetrieben, Flugrouten oder die lokale Kriminalitätsrate werden nicht untersucht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bewertet, welche Umfeldgefahren bei der Standortauswahl berücksichtigt wurden und welche nicht. Es wird festgestellt, dass die Analyse nur oberflächlich war."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A25-m3",
                    "uuid": "5d211a01-b964-4628-9328-69cfe4af7b52",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei Planung und Auswahl des Gebäudestandortes SOLLTE geprüft werden, welche Umfeldbedingungen Einfluss auf die Informationssicherheit haben könnten. Es SOLLTE eine Übersicht über standortbedingte Gefährdungen geben."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor der Auswahl eines neuen Standortes wird eine formale Standortrisikoanalyse durchgeführt. Diese berücksichtigt Naturgefahren (Hochwasser, Sturm, Erdbeben), umgebungsbedingte Gefahren (z.B. Nähe zu Industrieanlagen, Flughäfen, Bahntrassen) und soziale Faktoren (z.B. Kriminalität, politische Instabilität). Die Ergebnisse werden dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Standortrisikoanalyse und bewertet ihre Vollständigkeit und Methodik. Es wird geprüft, ob die Ergebnisse der Analyse die Standortentscheidung nachvollziehbar beeinflusst haben."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A25-m4",
                    "uuid": "48c3d28f-bda2-4f7b-81fe-392fb46fb065",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Diesen Gefährdungen SOLLTE mit zusätzlichen kompensierenden Maßnahmen entgegengewirkt werden. Die Analyse wird durch externe Experten oder spezialisierte Dienstleister unterstützt."
                      },
                      {
                        "name": "guidance",
                        "value": "Wenn ein Standort trotz bekannter Risiken (z.B. Hochwassergefahr) gewählt werden muss, werden gezielte Gegenmaßnahmen geplant und budgetiert (z.B. Verzicht auf Nutzung des Kellers, Installation von mobilen Flutschutzwänden). Für die Analyse werden Geodaten-Dienstleister und Sicherheitsberater beauftragt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bewertet die geplanten und umgesetzten Kompensationsmaßnahmen auf ihre Angemessenheit und Wirksamkeit. Die Berichte der externen Dienstleister werden geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A25-m5",
                    "uuid": "56fdeb8f-da3a-44ba-872d-4a070d0087b8",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Standortrisikoanalyse ist ein kontinuierlicher Prozess, der auch für bestehende Standorte regelmäßig wiederholt wird, um veränderte Umfeldbedingungen (z.B. durch neue Bauprojekte in der Nachbarschaft oder klimatische Veränderungen) zu erkennen. Die Ergebnisse fließen direkt in das Business Continuity Management (BCM) und die Anpassung der Sicherheitsmaßnahmen ein."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle zwei Jahre wird die Standortrisikobewertung für alle wichtigen Standorte aktualisiert. Dazu werden aktuelle Daten zu Naturgefahren und Kriminalitätsstatistiken beschafft. Wird eine erhöhte Gefahr festgestellt, werden die Notfallpläne und die baulichen Schutzmaßnahmen entsprechend angepasst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass der Prozess zur regelmäßigen Neubewertung der Standortrisiken etabliert ist und durchgeführt wird. Es wird geprüft, ob die Ergebnisse der Neubewertung nachweislich zu Anpassungen im BCM und bei den Sicherheitskonzepten geführt haben."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "7144a703-9e5e-4edf-b106-0699f78e7a23",
                "control-id": "GEB.1.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DOCS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A15-m1",
                    "uuid": "c3fa4aec-c2a1-4496-822c-4189a41e0649",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es sind keine oder nur sehr alte, unvollständige Lagepläne der Versorgungsleitungen (Strom, Wasser, Gas) vorhanden."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Notfall (z.B. Wasserrohrbruch) muss der Hauptabsperrhahn lange gesucht werden, da niemand seinen genauen Standort kennt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fragt nach den Plänen der Versorgungsleitungen. Das Fehlen oder der offensichtlich veraltete Zustand wird dokumentiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A15-m2",
                    "uuid": "1bf36c2a-dfaa-4383-98e0-7a542b6f02cd",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existieren Lagepläne vom Zeitpunkt der Errichtung des Gebäudes. Nachträgliche Änderungen wurden jedoch nicht in die Pläne eingetragen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die originalen Baupläne sind in Papierform archiviert. Umbauten der letzten 20 Jahre sind nicht dokumentiert. Die Pläne sind nur an einer zentralen Stelle verfügbar und im Notfall nicht schnell genug zur Hand."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die vorhandenen Pläne stichprobenartig mit den sichtbaren Installationen und stellt fest, dass diese nicht mehr aktuell sind. Es wird geprüft, wie schnell die Pläne im Bedarfsfall verfügbar wären."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A15-m3",
                    "uuid": "f2ee863b-fe94-45f7-bd0e-6bb13bb584c1",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTEN aktuelle Lagepläne aller Versorgungsleitungen existieren. Es SOLLTE geregelt sein, wer die Lagepläne aller Versorgungsleitungen führt und aktualisiert. Die Pläne SOLLTEN so aufbewahrt werden, dass sie im Bedarfsfall schnell verfügbar sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt einen definierten Prozess, der vorschreibt, dass nach jeder Änderung an den Versorgungsleitungen die entsprechenden Pläne (z.B. CAD-Pläne) aktualisiert werden müssen. Die Haustechnik ist für die Pflege der Pläne verantwortlich. Die Pläne sind sowohl digital als auch als Ausdruck an einem definierten, zugänglichen Ort (z.B. im Büro der Haustechnik) hinterlegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich den Prozess zur Aktualisierung der Lagepläne erläutern. Es wird geprüft, ob die Pläne nach kürzlich durchgeführten Umbauten tatsächlich aktualisiert wurden. Die Verfügbarkeit der Pläne im Notfall wird bewertet."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A15-m4",
                    "uuid": "1dfbc805-a4e9-4513-a01a-4a5baf470b78",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Pläne SOLLTEN so aufbewahrt werden, dass ausschließlich berechtigte Personen darauf zugreifen können. Die Pläne sind versioniert und Änderungen werden nachvollziehbar dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die digitalen Lagepläne werden in einem Dokumentenmanagementsystem (DMS) mit Zugriffsbeschränkungen verwaltet. Jede Änderung erzeugt eine neue Version. Die Hauptabsperreinrichtungen für alle Medien sind vor Ort deutlich und dauerhaft gekennzeichnet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Zugriffsberechtigungen auf die Pläne im DMS. Die Versionshistorie wird auf Nachvollziehbarkeit geprüft. Bei einer Begehung wird die Kennzeichnung der Absperreinrichtungen verifiziert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A15-m5",
                    "uuid": "6f74b9e2-9148-43ad-b83c-e40cdc95dd2a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Lagepläne sind Teil eines digitalen Zwillings (Building Information Model, BIM) des Gebäudes. Im Notfall können Einsatzkräfte über ein mobiles Endgerät auf die Pläne zugreifen und sich die Lage von Absperrventilen oder Schaltern direkt vor Ort anzeigen lassen."
                      },
                      {
                        "name": "guidance",
                        "value": "Das BIM-Modell wird kontinuierlich gepflegt. Die Feuerwehr hat einen gesicherten digitalen Zugang zu den für sie relevanten Planausschnitten. Sensoren an den Absperreinrichtungen melden deren Zustand (offen/geschlossen) an das System."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Aktualität und den Detaillierungsgrad des BIM-Modells. Der Prozess für den Zugriff durch externe Einsatzkräfte wird geprüft. Es wird getestet, ob die von den Sensoren gemeldeten Zustände mit der Realität übereinstimmen. Automatisierte Prüfung: `check_bim_model --verify 'all_utilities_mapped,fire_dept_access_configured'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "fc19f307-1ada-4e66-b490-f1b9f76c47e6",
                "control-id": "GEB.10.1.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A2-m1",
                    "uuid": "b7f3e771-ab57-4a54-ab67-65f460991679",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Aufteilung der Stromkreise folgt keiner klaren Logik. Kritische und unkritische Verbraucher sind oft am selben Stromkreis angeschlossen. Eine Überprüfung der Auslegung findet nicht statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Beispielsweise hängt die Kaffeemaschine in der Teeküche an derselben Sicherung wie die Server im Nebenraum. Die Absicherung der Stromkreise ist oft überdimensioniert, um Auslösungen zu vermeiden, was die Brandgefahr erhöht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer inspiziert stichprobenartig die Sicherungskästen und versucht, die Zuordnung von Verbrauchern zu Stromkreisen nachzuvollziehen. Offensichtliche Fehlplanungen, wie die gemeinsame Absicherung von IT und Haushaltsgeräten, werden dokumentiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A2-m2",
                    "uuid": "a23975ae-20a2-421d-b2a3-e7af32d03427",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Stromkreise sind bei der ursprünglichen Installation grundlegend nach Bereichen (z.B. Büros, Serverraum) aufgeteilt worden. Eine regelmäßige Überprüfung oder Anpassung an neue Bedürfnisse erfolgt jedoch nicht."
                      },
                      {
                        "name": "guidance",
                        "value": "Die ursprüngliche Planung ist vorhanden, aber über die Jahre wurden neue Verbraucher ohne Überprüfung der Stromkreislast hinzugefügt. Die Dokumentation (Schaltpläne) ist veraltet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die aktuellen Gegebenheiten mit den ursprünglichen Installationsplänen. Es wird geprüft, ob nachträgliche Änderungen die ursprüngliche Auslegung überlasten könnten, ohne dass eine formale Überprüfung stattgefunden hat."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A2-m3",
                    "uuid": "86e2b85b-f817-4376-b29b-b9ddada26ec9",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS regelmäßig überprüft werden, ob die Absicherung und Auslegung der Stromkreise noch den tatsächlichen Bedürfnissen genügen."
                      },
                      {
                        "name": "guidance",
                        "value": "Mindestens einmal jährlich oder bei größeren Änderungen der Elektroinstallation (z.B. Anschluss neuer IT-Racks) wird eine Überprüfung durch eine Elektrofachkraft durchgeführt. Die Ergebnisse werden dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Dokumentation der regelmäßigen Überprüfungen der Stromkreise. Es wird verifiziert, dass die Überprüfungen stattgefunden haben und dass festgestellte Mängel behoben wurden. Es wird geprüft, ob die Intervalle angemessen sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A2-m4",
                    "uuid": "5d61291e-654a-4131-8f31-9e41de529817",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Stromkreise sind logisch nach Schutzbedarf und Funktion getrennt (z.B. separate Kreise für IT, allgemeine Verbraucher, Sicherheitstechnik). Die Auslegung der Stromkreise ist detailliert dokumentiert und die Pläne sind stets aktuell."
                      },
                      {
                        "name": "guidance",
                        "value": "Für kritische IT-Systeme werden dedizierte Stromkreise verwendet, die an einer unterbrechungsfreien Stromversorgung (USV) angeschlossen sind. Die Dokumentation ist digital verfügbar und wird über ein Konfigurationsmanagement-System (CMS) verwaltet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die logische Trennung der Stromkreise anhand der aktuellen Schaltpläne und durch eine physische Inspektion. Es wird geprüft, ob die Dokumentation im CMS aktuell ist und ob Änderungen nach einem definierten Prozess erfolgen."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A2-m5",
                    "uuid": "f1710ad4-0fc6-4a4a-b952-aaf2adda7610",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Auslastung und der Zustand der Stromkreise werden durch ein intelligentes Power-Monitoring-System kontinuierlich überwacht. Abweichungen vom Normalzustand und sich anbahnende Überlastungen werden automatisch gemeldet, um proaktive Wartung zu ermöglichen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden intelligente Power Distribution Units (PDUs) und smarte Sicherungen eingesetzt, die ihre Daten an ein zentrales Gebäudeleitsystem oder ein DCIM (Data Center Infrastructure Management) senden. Schwellenwerte für Alarme sind definiert und mit dem Incident-Management-Prozess gekoppelt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Logs und Alarmmeldungen des Power-Monitoring-Systems. Es wird geprüft, ob die Schwellenwerte sinnvoll konfiguriert sind und ob auf Alarme angemessen reagiert wird. Automatisierte Prüfung: Ein Skript fragt die API des DCIM-Systems ab und vergleicht die gemessene Last mit den dokumentierten Grenzwerten: `check_pdu_load --all --threshold 80%`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e368f564-e308-46d9-9546-f6155ebfe7e6",
                "control-id": "GEB.11.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "LAW",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A3-m1",
                    "uuid": "a166e64a-6827-4ba7-a21b-917045917c93",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Brandschutzvorschriften werden nur reaktiv umgesetzt, oft erst nach Beanstandungen durch Behörden. Fluchtwege sind gelegentlich durch abgestellte Gegenstände blockiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Bewusstsein für Brandschutz ist bei den Mitarbeitenden gering. Es gibt keine benannte Person, die sich aktiv um das Thema kümmert. Feuerlöscher sind zwar vorhanden, aber ihre Standorte sind nicht allen bekannt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer führt eine unangemeldete Begehung durch und prüft, ob Flucht- und Rettungswege frei sind. Es wird stichprobenartig kontrolliert, ob Brandschutztüren offen verkeilt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A3-m2",
                    "uuid": "a3914af5-702c-455b-b83e-dcd52200ed67",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die grundlegenden Brandschutzvorschriften werden eingehalten. Fluchtwege sind ausgeschildert und werden in der Regel freigehalten. Es gibt eine Person, die neben anderen Aufgaben auch für den Brandschutz zuständig ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Person aus der Haustechnik ist als Brandschutzhelfer benannt. Regelmäßige Kontrollen finden statt, werden aber nicht immer dokumentiert. Unnötige Brandlasten werden bei offensichtlicher Erkennung entfernt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Ausschilderung der Fluchtwege und die Freihaltung. Es wird die Benennung der für den Brandschutz zuständigen Person und deren grundlegende Qualifikation (z.B. Brandschutzhelfer-Schulung) verifiziert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A3-m3",
                    "uuid": "53a5fddf-587c-4a8b-8d5b-407c102f40ab",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die bestehenden Brandschutzvorschriften sowie die Auflagen der Bauaufsicht MÜSSEN eingehalten werden. Die Fluchtwege MÜSSEN vorschriftsmäßig ausgeschildert und freigehalten werden. Es MUSS regelmäßig kontrolliert werden, dass die Fluchtwege benutzbar und frei von Hindernissen sind. Unnötige Brandlasten MÜSSEN vermieden werden. Es MUSS eine Brandschutzbeauftragte oder einen Brandschutzbeauftragten oder eine mit dem Aufgabengebiet betraute Person geben. Diese Person MUSS geeignet geschult sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein Brandschutzbeauftragter formell bestellt. Regelmäßige, dokumentierte Begehungen (z.B. monatlich) werden durchgeführt, um die Einhaltung der Vorschriften zu kontrollieren. Mitarbeiter werden jährlich über das richtige Verhalten im Brandfall und die Bedeutung freier Fluchtwege unterwiesen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Bestellungsurkunde und die Schulungsnachweise des Brandschutzbeauftragten. Die Protokolle der regelmäßigen Kontrollen werden eingesehen. Es wird geprüft, ob festgestellte Mängel nachverfolgt und behoben werden. Die Flucht- und Rettungspläne werden auf Aktualität und Korrektheit geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A3-m4",
                    "uuid": "f6ee6fc1-9ebb-478d-9661-296229c5d0fb",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei der Brandschutzplanung SOLLTE die örtliche Feuerwehr hinzugezogen werden, um sicherzustellen, dass das Gebäude in einer Gefahrensituation schnell geräumt werden kann. Alle Brandschutzmaßnahmen werden in einem Brandschutzkonzept dokumentiert, das regelmäßig überprüft wird."
                      },
                      {
                        "name": "guidance",
                        "value": "Es finden regelmäßige Abstimmungsgespräche mit der lokalen Feuerwehr statt, um z.B. die Zufahrtswege und die Standorte der Löschwasserentnahmestellen abzugleichen. Das Brandschutzkonzept ist Teil des übergeordneten Gebäudesicherheitskonzepts."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Protokolle der Abstimmungsgespräche mit der Feuerwehr. Das Brandschutzkonzept wird daraufhin geprüft, ob es umfassend und aktuell ist und ob es die spezifischen Gegebenheiten des Gebäudes und seiner Nutzung berücksichtigt. Es wird geprüft, ob die Feuerwehrlaufkarten aktuell sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A3-m5",
                    "uuid": "c88e8655-6f58-4f1f-b972-a3954ea9022e",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Einhaltung der Brandschutzvorschriften wird durch technische Systeme, wie z.B. an die Gebäudeleittechnik gekoppelte Kamerasysteme zur Überwachung der Fluchtwege, unterstützt. Abweichungen, wie blockierte Türen, lösen automatisch einen Alarm beim Sicherheitsdienst aus. Regelmäßige, unangekündigte Evakuierungsübungen werden durchgeführt und deren Ergebnisse zur Optimierung der Pläne genutzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Videoanalyse-Software erkennt automatisch Objekte, die in Fluchtwegen abgestellt werden. Die Ergebnisse von Evakuierungsübungen werden systematisch ausgewertet (z.B. Zeitmessung, Befragung der Mitarbeiter) und fließen in die kontinuierliche Verbesserung des Brandschutzkonzepts ein."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration und die Alarm-Logs des technischen Überwachungssystems. Die Dokumentation und die Auswertung der Evakuierungsübungen werden geprüft. Es wird bewertet, ob ein echter kontinuierlicher Verbesserungsprozess im Brandschutz etabliert ist. Automatisierte Prüfung: `check_cctv_rules --zone 'escape_route' --verify 'obstruction_detection_active'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "9d8c9e27-a1f3-4b14-9b8f-5eb4b03cb089",
                "control-id": "GEB.11.1.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A8-m1",
                    "uuid": "44c5dead-8306-413d-81d4-d7b14db646d5",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt kein explizites Rauchverbot in der Nähe von IT-Systemen oder Archiven. Das Rauchen wird geduldet."
                      },
                      {
                        "name": "guidance",
                        "value": "Mitarbeiter rauchen an ihren Arbeitsplätzen, auch wenn dort Computer stehen. Aschenbecher sind in Büroräumen vorhanden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch eine Begehung und Beobachtung fest, ob in schutzbedürftigen Bereichen geraucht wird oder Anzeichen dafür (z.B. Aschenbecher, Zigarettengeruch) vorhanden sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A8-m2",
                    "uuid": "2a92ea9e-d282-4c33-9d68-f5f38d27803c",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt ein allgemeines Rauchverbot im Gebäude, jedoch ohne spezifischen Fokus auf IT-Bereiche. Ausgewiesene Raucherzonen sind vorhanden, aber deren Lage wird nicht unter Sicherheitsaspekten bewertet."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Raucherbereich befindet sich direkt neben dem offenen Fenster des Serverraums, wodurch Rauch eindringen kann. Die Einhaltung des Rauchverbots wird nicht aktiv kontrolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Existenz des allgemeinen Rauchverbots und die Lage der ausgewiesenen Raucherzonen in Bezug auf schutzbedürftige Bereiche. Es wird geprüft, ob die Einrichtung von Raucherzonen zu einer Umgehung von Zutrittskontrollen führt (z.B. offen gehaltene Notausgänge)."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A8-m3",
                    "uuid": "033cbff0-cb45-4520-aeb9-1890fa8a05a3",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für Räume mit IT oder Datenträgern, in denen Brände oder Verschmutzungen zu hohen Schäden führen können, wie Serverräume, Datenträger- oder Belegarchive, MUSS ein Rauchverbot erlassen werden. Es MUSS regelmäßig kontrolliert werden, dass bei der Einrichtung oder Duldung von Raucherzonen der Zutrittsschutz nicht umgangen wird."
                      },
                      {
                        "name": "guidance",
                        "value": "In der Hausordnung ist ein explizites Rauchverbot für alle technischen Betriebsräume, Serverräume und Archive festgelegt. An den Türen dieser Räume sind entsprechende Piktogramme angebracht. Die Standorte von Raucherzonen werden so gewählt, dass keine Beeinträchtigung von Schutzzielen (z.B. durch Umgehung der Zutrittskontrolle oder Raucheintritt) erfolgt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Hausordnung und überprüft die Kennzeichnung der betroffenen Räume. Bei einer Begehung wird die Lage der Raucherzonen bewertet und geprüft, ob dadurch Sicherheitsmaßnahmen (insbesondere Zutrittskontrolle) unterlaufen werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A8-m4",
                    "uuid": "794b9b79-e936-4fa1-a2b9-988540e394d6",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Rauchverbot erstreckt sich auf das gesamte Gebäude und gilt auch für E-Zigaretten. Raucherzonen sind ausschließlich außerhalb des Gebäudes an definierten Orten eingerichtet, die mit sicheren Aschenbechern ausgestattet sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Regelung ist klar an alle Mitarbeitenden kommuniziert. Die Einhaltung wird im Rahmen der regelmäßigen Sicherheitsbegehungen überprüft. Die Aschenbecher im Außenbereich werden regelmäßig geleert, um Brandgefahren zu minimieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die umfassende Regelung und deren Kommunikation. Es wird geprüft, ob die externen Raucherzonen sicher gestaltet sind und keine neue Gefährdung (z.B. Brandgefahr durch volle Aschenbecher) darstellen."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A8-m5",
                    "uuid": "94b664f3-f3eb-429e-8f8a-8c72165142dd",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In Hochsicherheitsbereichen (z.B. Rechenzentren) sind Rauchdetektoren installiert, die auch auf die Partikel von E-Zigaretten reagieren und bei einer Verletzung des Rauchverbots einen stillen Alarm an den Sicherheitsdienst auslösen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden spezielle Multisensor-Melder oder Partikelzähler eingesetzt. Die Prozedur für den Sicherheitsdienst im Falle eines solchen Alarms ist klar definiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die technischen Spezifikationen der installierten Melder und die Konfiguration der Alarmierung. Die Wirksamkeit kann durch einen Test mit einem Prüfaerosol verifiziert werden. Die Dienstanweisung für den Sicherheitsdienst wird geprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "6794b030-da4b-4d9f-a810-9d1767f98c2e",
                "control-id": "GEB.11.1.6",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A4-m1",
                    "uuid": "98dcdf24-dfd1-40f3-aad0-33d9f763686d",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es sind nur einzelne, batteriebetriebene Rauchmelder in wenigen Räumen installiert, die nicht den gesetzlichen Mindestanforderungen entsprechen."
                      },
                      {
                        "name": "guidance",
                        "value": "Oft werden nur Rauchmelder aus dem Baumarkt verwendet. Eine regelmäßige Prüfung der Funktion oder der Batterien findet nicht statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch eine Begehung fest, in welchen Bereichen Rauchmelder vorhanden sind und ob eine systematische Ausstattung fehlt. Es wird stichprobenartig die Funktion eines Melders durch Drücken des Testknopfes geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A4-m2",
                    "uuid": "31655348-3893-44e3-860f-d319a937db26",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Gebäude sind entsprechend der gesetzlichen Mindestanforderungen mit Rauchmeldern ausgestattet. Diese alarmieren jedoch nur lokal und sind nicht vernetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "In allen vorgeschriebenen Bereichen sind Rauchmelder installiert. Die regelmäßige Wartung (z.B. Batteriewechsel) wird durch die Haustechnik durchgeführt, aber nicht immer lückenlos dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die Ausstattung mit den gesetzlichen Vorgaben (z.B. Landesbauordnung). Es wird geprüft, ob es einen Wartungsplan gibt und ob dieser grundlegend eingehalten wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A4-m3",
                    "uuid": "d1c07d6f-cb3e-4be4-ae99-51585e42d2fd",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Gebäude MÜSSEN entsprechend der Auflagen in der Baugenehmigung und dem Brandschutzkonzept folgend mit einer ausreichenden Anzahl von Rauchmeldern ausgestattet sein. Ist eine lokale Alarmierung am Ort des Melders nicht ausreichend, MÜSSEN alle Melder auf eine Brandmeldezentrale (BMZ) aufgeschaltet werden. Bei Rauchdetektion MUSS eine Alarmierung im Gebäude ausgelöst werden. Es MUSS sichergestellt sein, dass alle im Gebäude anwesenden Personen diese wahrnehmen können. Die Funktionsfähigkeit aller Rauchmelder sowie aller sonstigen Komponenten einer Brandmeldeanlage (BMA) MUSS regelmäßig überprüft werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine zertifizierte Brandmeldeanlage (BMA) mit einer Brandmeldezentrale (BMZ) ist installiert. Die regelmäßige Wartung wird durch einen Fachbetrieb durchgeführt und in einem Prüfbuch dokumentiert. Die Alarmierung erfolgt akustisch (Sirenen) und ggf. optisch (Blitzleuchten)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Brandschutzkonzept, die Baugenehmigung und das Prüfbuch der BMA. Es wird verifiziert, dass die Wartungsintervalle eingehalten werden und die Anlage normgerecht ist. Bei einem Testalarm wird geprüft, ob die Alarmierung im gesamten Gebäude wahrnehmbar ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A4-m4",
                    "uuid": "b8871822-d99b-45dc-8c5e-3c8985a6ee7b",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Brandmeldeanlage ist bei einer ständig besetzten Stelle (z.B. Pforte, Sicherheitsdienst) oder direkt bei der Feuerwehr aufgeschaltet. In schutzbedürftigen Bereichen wie Serverräumen werden anstelle von einfachen Rauchmeldern Rauchansaugsysteme (RAS) zur Frühesterkennung eingesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Aufschaltung zur Feuerwehr ist vertraglich geregelt. Die Installation von Rauchansaugsystemen ermöglicht die Detektion von Schwelbränden, bevor offene Flammen und Rauch entstehen. Die Empfindlichkeit der Systeme ist an den Schutzbedarf angepasst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet den Vertrag über die Aufschaltung der BMA. Es wird die Konfiguration und die Funktionsfähigkeit der Frühesterkennungssysteme (z.B. RAS) geprüft. Es wird verifiziert, dass das Personal der besetzten Stelle für den Umgang mit Brandmeldungen geschult ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A4-m5",
                    "uuid": "75b80d1f-8891-4623-b809-e4491fe601c0",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Brandmeldeanlage ist vollständig in die Gebäudeleittechnik integriert. Im Alarmfall werden automatisch Maßnahmen eingeleitet, wie das Abschalten der Lüftung, das Öffnen von Rauch- und Wärmeabzugsanlagen (RWA) und das Ansteuern der Fluchtwegsteuerung, um eine sichere Evakuierung zu gewährleisten. Die Meldertypen sind spezifisch auf die Umgebungsrisiken (z.B. thermische Melder in Küchen, Multisensormelder in IT-Räumen) ausgelegt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es sind komplexe Brandfallsteuermatrizen definiert, die das Zusammenspiel der verschiedenen technischen Systeme im Brandfall regeln. Diese Matrizen werden regelmäßig getestet (Vollprobentest). Die Auswahl der Melder erfolgte auf Basis einer detaillierten Brandrisikoanalyse."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Brandfallsteuermatrix auf Logik und Vollständigkeit. Die Protokolle der regelmäßigen Vollprobentests werden geprüft. Es wird verifiziert, dass die automatisierten Ansteuerungen (Lüftung, RWA, Türen) im Testfall korrekt funktioniert haben. Automatisierte Prüfung: `check_bms_integration --trigger 'fire_alarm_zone_5' --verify 'hvac_shutdown,rwa_open'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e9ceae3e-cf85-402d-a3d6-4558eaf4c5e7",
                "control-id": "GEB.11.1.8",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Audit",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "PERF",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A18-m1",
                    "uuid": "e02db034-d191-4db7-a9ac-5ba8a144e7cc",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Brandschutzbegehungen finden nicht statt, oder nur reaktiv nach einem Vorfall oder einer behördlichen Anordnung."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Thema Brandschutz wird nur relevant, wenn die Feuerwehr zur Inspektion kommt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fragt nach Protokollen von Brandschutzbegehungen und stellt fest, dass keine regelmäßigen Begehungen durchgeführt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A18-m2",
                    "uuid": "1cc6a7eb-8a3e-472e-a79d-0336a7cf6191",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Brandschutzbegehungen finden unregelmäßig und ohne feste Checkliste statt. Festgestellte Mängel werden nicht systematisch nachverfolgt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Haustechnik geht gelegentlich durchs Haus und schaut nach dem Rechten. Wenn ein Mangel auffällt (z.B. ein blockierter Feuerlöscher), wird er behoben, aber es gibt keine Dokumentation oder Nachverfolgung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bittet um Nachweise für durchgeführte Begehungen. Es wird bewertet, ob die Begehungen systematisch und umfassend sind und ob ein Prozess zur Mängelbeseitigung existiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A18-m3",
                    "uuid": "5dbd5fc7-5118-4028-9908-316be9f22827",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Brandschutzbegehungen SOLLTEN regelmäßig, d. h. mindestens ein- bis zweimal im Jahr, stattfinden. Bei Brandschutzbegehungen festgestellte Mängel SOLLTEN unverzüglich behoben werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Brandschutzbeauftragte führt mindestens halbjährlich eine formale Brandschutzbegehung anhand einer standardisierten Checkliste durch. Die Ergebnisse, einschließlich der festgestellten Mängel, werden protokolliert. Für jeden Mangel werden eine verantwortliche Person und eine Frist zur Behebung festgelegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Protokolle der Brandschutzbegehungen der letzten zwei Jahre. Es wird geprüft, ob die Begehungen regelmäßig stattfinden, ob sie systematisch sind und ob die festgestellten Mängel nachweislich und fristgerecht behoben wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A18-m4",
                    "uuid": "01ce5d33-0faf-41fc-889c-c7cb819144e1",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "An den Brandschutzbegehungen nehmen neben dem Brandschutzbeauftragten auch Vertreter der IT, der Verwaltung und des Betriebsrats teil. Die Ergebnisse werden der Geschäftsleitung berichtet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Begehung wird als interdisziplinäres Team durchgeführt, um verschiedene Perspektiven einzubeziehen. Die Ergebnisse werden in einem Management-Bericht zusammengefasst, der den Status des Brandschutzes bewertet und notwendige Investitionen aufzeigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Teilnehmerlisten der Begehungen und die Management-Berichte. Es wird bewertet, ob die Begehung als effektives Instrument zur Steuerung und Verbesserung des Brandschutzes genutzt wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A18-m5",
                    "uuid": "a96cb3d2-2e61-4bc4-8cb1-58ee3996fadd",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Brandschutzbegehungen werden mit einer mobilen App durchgeführt, die eine geführte Prüfung anhand von Checklisten ermöglicht und die Ergebnisse (inkl. Fotos) direkt in ein zentrales Mängelmanagement-System überträgt. Die Behebung der Mängel wird automatisch nachverfolgt und eskalieret."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Brandschutzbeauftragte nutzt ein Tablet mit einer speziellen Software. Festgestellte Mängel werden als Ticket im Mängelmanagement-System angelegt und der zuständigen Abteilung zugewiesen. Das System überwacht die Bearbeitungsfristen und sendet Erinnerungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den Workflow im Mängelmanagement-System. Es wird der gesamte Lebenszyklus einiger Mängel von der Erfassung bis zur Behebung nachvollzogen. Die Wirksamkeit der automatisierten Nachverfolgung und Eskalation wird bewertet. Automatisierte Prüfung: `check_ticket_system --category 'fire_safety' --verify 'all_tickets_closed_or_in_progress'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "02f57a58-7a30-46b4-98ec-b2769382a1ec",
                "control-id": "GEB.11.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A24-m1",
                    "uuid": "b2a146c9-9b23-44f2-8583-36d0faad4863",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt keine Maßnahmen zur selbsttätigen Entwässerung in von Wasser gefährdeten Bereichen."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Keller, in dem sich auch das Archiv befindet, gibt es keinen Bodenablauf oder eine Hebeanlage."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt bei einer Begehung von gefährdeten Bereichen (Keller, unter Wasserleitungen) fest, dass keine Entwässerungseinrichtungen vorhanden sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A24-m2",
                    "uuid": "0ae66fa8-5ae3-430a-a234-3f768c338be8",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es sind passive Entwässerungseinrichtungen wie Bodenabläufe vorhanden. Aktive Systeme wie Pumpen fehlen jedoch oder werden nicht gewartet."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Serverraum im Keller gibt es einen Bodenablauf. Eine Pumpe für den Fall, dass der Abwasserkanal überlastet ist (Rückstau), existiert nicht. Die Funktion des Ablaufs wird nie geprüft und er könnte verstopft sein."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Existenz und den Zustand von passiven Entwässerungseinrichtungen. Es wird nach Wartungsnachweisen für eventuell vorhandene Pumpen gefragt."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A24-m3",
                    "uuid": "c2be898b-de21-4ceb-b17c-08ff932aba19",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle von Wasser gefährdeten Bereiche SOLLTEN mit einer selbsttätigen Entwässerung ausgestattet sein. Es SOLLTE regelmäßig geprüft werden, ob die aktiven und passiven Entwässerungseinrichtungen noch funktionieren."
                      },
                      {
                        "name": "guidance",
                        "value": "In Kellerräumen mit schützenswerten Gütern (IT, Archiv) sind Bodenabläufe und redundante Hebeanlagen (Pumpen) installiert. Die Funktion der Pumpen und die Durchgängigkeit der Abläufe werden jährlich im Rahmen eines Wartungsplans geprüft und protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet den Wartungsplan und die Protokolle für die Entwässerungssysteme. Es wird geprüft, ob die Wartung regelmäßig erfolgt und ob die Systeme für die potenziell anfallende Wassermenge ausreichend dimensioniert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A24-m4",
                    "uuid": "76e4237d-619b-43e9-9aee-e59fd1723b03",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zur Entwässerung sind in kritischen Bereichen Wassermelder installiert, die bei einem Wassereinbruch frühzeitig einen Alarm auslösen."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Doppelboden des Serverraums sind Wassersensoren ausgelegt. Diese sind an die Gefahrenmeldeanlage angeschlossen und melden einen Alarm an die Haustechnik und den ISB."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Positionierung und Funktion der Wassermelder. Ein Test (z.B. mit einem feuchten Tuch) verifiziert die korrekte Alarmauslösung und -weiterleitung."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A24-m5",
                    "uuid": "58ca47c1-ab9b-4be6-b6f9-06ef492ed2e0",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das System ist vollständig automatisiert. Bei Detektion von Wasser wird nicht nur ein Alarm ausgelöst, sondern es werden auch automatisch Gegenmaßnahmen eingeleitet, wie das Schließen von Hauptwasserabsperrventilen und das Starten von Pumpen. Die Pumpen sind an die Notstromversorgung angeschlossen."
                      },
                      {
                        "name": "guidance",
                        "value": "Wassermelder, motorisierte Absperrventile und Pumpen sind in die Gebäudeleittechnik integriert. Es ist eine Steuerungslogik implementiert, die bei einem Alarm im Serverraum automatisch das Hauptventil für diesen Gebäudeteil schließt. Die Stromversorgung der Pumpen ist über die USV des Rechenzentrums sichergestellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Steuerungslogik in der Gebäudeleittechnik. Die Funktion der automatischen Gegenmaßnahmen wird im Rahmen eines geplanten Tests überprüft. Die Anbindung der Pumpen an die Notstromversorgung wird verifiziert. Automatisierte Prüfung: `check_bms_rule --trigger 'water_detected_dc1' --verify 'main_valve_closed,pumps_active'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "f5603c57-1e26-47ea-9121-4f6ded0f91b1",
                "control-id": "GEB.11.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A14-m1",
                    "uuid": "38b1f92e-468f-45d2-866d-a201fbb49420",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es sind keine oder nur rudimentäre Blitzschutzmaßnahmen vorhanden. Ein Blitzschutzkonzept fehlt."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Gebäude hat eventuell eine alte Fangeinrichtung auf dem Dach, aber es gibt keinen inneren Blitzschutz (Überspannungsschutz)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch eine Sichtprüfung des Gebäudes und der Elektroverteilung sowie durch Befragung der Verantwortlichen fest, dass ein umfassendes Blitzschutzsystem fehlt."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A14-m2",
                    "uuid": "a330c3d5-1cc8-4a94-9b99-84e19fb284c3",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein äußerer Blitzschutz (Fangeinrichtungen, Ableiter) ist vorhanden. Ein innerer Blitzschutz ist jedoch nur lückenhaft oder gar nicht umgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Blitzschutzanlage auf dem Dach wird gewartet, aber in den Unterverteilungen für die IT fehlt ein Feinschutz gegen Überspannungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Wartungsprotokolle für den äußeren Blitzschutz und prüft die Elektroverteilungen auf das Vorhandensein von Überspannungsschutzgeräten (SPDs) der Typen 1, 2 und 3."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A14-m3",
                    "uuid": "fd891fa5-b2d2-4ec4-852b-fe58d11e9781",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE eine Blitzschutzanlage nach geltender Norm installiert sein. Es SOLLTE ein umfassendes Blitz- und Überspannungsschutzkonzept vorhanden sein. Die Blitzschutzanlage SOLLTE regelmäßig geprüft und gewartet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Blitzschutzanlage, bestehend aus äußerem Blitzschutz (Fangeinrichtungen, Ableitungen) und innerem Blitzschutz (Überspannungsschutz an allen ins Gebäude führenden Leitungen), ist gemäß der Normenreihe DIN EN 62305 (VDE 0185-305) installiert. Ein Blitzschutzkonzept dokumentiert die gewählte Schutzklasse und die umgesetzten Maßnahmen. Die Anlage wird regelmäßig durch eine Blitzschutz-Fachkraft geprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Blitzschutzkonzept und die Prüfprotokolle der Blitzschutzanlage. Es wird verifiziert, ob die Prüfungen fristgerecht und durch qualifiziertes Personal erfolgen und ob die Anlage den Normvorgaben entspricht."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A14-m4",
                    "uuid": "b4af926a-95d1-499c-932b-5886e03d9efa",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Fangeinrichtungen bei Gebäuden mit umfangreicher IT-Ausstattung SOLLTEN mindestens der Schutzklasse II gemäß DIN EN 62305 Blitzschutz entsprechen. Alle eingeführten metallischen Leitungen (Strom, Daten, Wasser) sind in den Potentialausgleich einbezogen."
                      },
                      {
                        "name": "guidance",
                        "value": "Für das Gebäude wurde eine Risikoanalyse nach DIN EN 62305-2 durchgeführt, die zu der Entscheidung für die höhere Schutzklasse II geführt hat. Die Umsetzung des Potentialausgleichs ist detailliert geplant und bei der Abnahme messtechnisch überprüft worden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Risikoanalyse und prüft, ob die daraus abgeleitete Schutzklasse korrekt umgesetzt wurde. Die Messprotokolle des Potentialausgleichs werden kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A14-m5",
                    "uuid": "0a811eb9-e9be-454d-8248-8144ebee3df8",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zustand der Blitz- und Überspannungsschutzkomponenten wird kontinuierlich überwacht. Sensoren melden das Auslösen oder die Alterung von Überspannungsschutzgeräten (SPDs) an ein zentrales Managementsystem, um einen sofortigen Austausch zu ermöglichen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden fernmeldefähige SPDs eingesetzt, die ihren Status an die Gebäudeleittechnik oder ein DCIM-System melden. Dies stellt sicher, dass ein unbemerkter Ausfall des Schutzes verhindert wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der Überwachung im Managementsystem. Die Alarmierungskette bei einer Statusänderung eines SPD wird geprüft. Ein Test kann durch die Simulation eines Ausfalls am SPD ausgelöst werden. Automatisierte Prüfung: `check_bms_device --type 'spd' --verify 'status_ok,remote_monitoring_active'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c5e3cb5d-7dc2-4725-b817-a4d980258ae0",
                "control-id": "GEB.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A35-m1",
                    "uuid": "7c34e210-80a1-47db-b997-541d9d06235b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt keinen Perimeterschutz. Die Grundstücksgrenze ist nicht gesichert."
                      },
                      {
                        "name": "guidance",
                        "value": "Jeder kann das Grundstück ungehindert betreten und sich bis an das Gebäude heranbewegen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt bei einer Begehung fest, dass keine Maßnahmen zur Sicherung des Grundstücks (Umfriedung, Beleuchtung etc.) vorhanden sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A35-m2",
                    "uuid": "ead8e8f2-eeba-49db-94b7-b9b870441bbd",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine einfache Umfriedung (z.B. ein niedriger Zaun oder eine Hecke) ist vorhanden, um die Grundstücksgrenze zu markieren. Sie bietet jedoch keinen nennenswerten Schutz gegen ein Überwinden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein 1,20 m hoher Maschendrahtzaun umschließt das Grundstück. Es gibt keine Maßnahmen zur Detektion eines Übersteigens."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bewertet die Höhe und Beschaffenheit der Umfriedung im Hinblick auf ihre Schutzwirkung. Es wird geprüft, ob es offensichtliche Schwachstellen gibt."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A35-m3",
                    "uuid": "e0586e9a-789c-47b1-974b-7aafe499d217",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Abhängig vom Schutzbedarf des Gebäudes und abhängig vom Gelände SOLLTE dieses über einen Perimeterschutz verfügen. Hierbei SOLLTEN mindestens eine äußere Umschließung oder Umfriedung sowie Sicherungsmaßnahmen gegen unbeabsichtigtes und beabsichtigtes gewaltloses Überwinden der Grundstücksgrenze betrachtet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine solide Umfriedung (z.B. ein mindestens 2 Meter hoher Stabgitterzaun) ist installiert. Die Umfriedung ist so gestaltet, dass sie ein einfaches Überklettern erschwert (z.B. durch Zackenleiste). Tore und Zufahrten sind im Normalfall geschlossen und werden nur bei Bedarf geöffnet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bewertet die Konzeption und den Zustand der Umfriedung. Es wird geprüft, ob die Maßnahmen zur Erschwerung des Überwindens wirksam sind und ob die Regelungen für Tore und Zufahrten eingehalten werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A35-m4",
                    "uuid": "42edf37b-74cb-4c4a-ac18-09dbf2ee4840",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTEN Maßnahmen zur Erschwerung des beabsichtigten gewaltsamen Überwindens der Grundstücksgrenze sowie Freigelände-Sicherungsmaßnahmen (z.B. Personen- und Fahrzeugdetektion, Videoüberwachung) betrachtet und umgesetzt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Umfriedung ist zusätzlich mit einem Unterkriechschutz versehen. Das Freigelände wird nachts beleuchtet. An kritischen Abschnitten des Perimeters sind Bewegungsmelder und/oder Videokameras installiert, die bei einer Annäherung an den Zaun einen Alarm bei einem Sicherheitsdienst auslösen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Wirksamkeit der zusätzlichen Sicherungsmaßnahmen. Die Ausleuchtung des Geländes und die Konfiguration und Funktion der Detektionssysteme (Bewegungsmelder, Kameras) werden kontrolliert. Ein Test der Alarmauslösung wird durchgeführt."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A35-m5",
                    "uuid": "c9f069f7-2ce1-4d86-9ce2-f3694aac54cc",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Perimeterschutz ist ein mehrstufiges, intelligentes System. Eine Kombination aus verschiedenen Detektionstechnologien (z.B. Zaun-Detektionssystem, Infrarotlichtschranken, Videoanalyse, Bodensensoren) sorgt für eine hochzuverlässige Detektion mit geringer Falschalarmrate. Im Alarmfall werden automatisch Gegenmaßnahmen wie das Einschalten von Flutlicht und die Aufschaltung von Lautsprecherdurchsagen ausgelöst. Alle Ereignisse werden zur Beweissicherung aufgezeichnet."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein am Zaun montiertes Sensorsystem detektiert Kletter- oder Durchschneideversuche. Intelligente Videoanalyse unterscheidet zwischen Menschen, Fahrzeugen und Tieren. Im Alarmfall verfolgt eine PTZ-Kamera (Pan-Tilt-Zoom) den Eindringling automatisch. Die Ereignisdaten werden an ein zentrales Gefahrenmanagementsystem gemeldet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das Zusammenspiel der verschiedenen Detektions- und Reaktionssysteme. Die Konfiguration der intelligenten Videoanalyse wird geprüft. Die Wirksamkeit des Gesamtsystems wird durch verschiedene, realitätsnahe Angriffsszenarien (z.B. Kletterversuch an einer uneinsehbaren Stelle) getestet. Automatisierte Prüfung: `check_perimeter_security_system --verify 'multi_sensor_fusion_active,ptz_autotracking_enabled,automated_response_configured'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ad287e2b-4aa6-475c-8cd2-5cb428625b40",
                "control-id": "GEB.2.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A16-m1",
                    "uuid": "509229f2-3516-4241-8a3f-ef9f5d5d9c2f",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "An Türen von schutzwürdigen Bereichen hängen große Schilder, die deren Funktion verraten (z.B. 'Serverraum', 'Archiv')."
                      },
                      {
                        "name": "guidance",
                        "value": "An der Tür zum Serverraum hängt ein Schild 'Serverraum - Zutritt nur für IT-Personal', was Angreifern ein klares Ziel bietet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt bei einer Begehung fest, ob schutzwürdige Bereiche auffällig gekennzeichnet sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A16-m2",
                    "uuid": "ccf107e8-7db1-4cca-89a2-19f9313dd7ce",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird versucht, direkte Lagehinweise zu vermeiden, aber die Funktion der Räume ist durch andere Merkmale (z.B. laute Lüftergeräusche, besondere Türen) leicht zu erraten."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Schild 'Serverraum' wurde entfernt, aber die massive Stahltür und die lauten Klimageräte verraten den Raum weiterhin. Der Raum ist von außen leicht einsehbar."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bewertet, ob schutzwürdige Bereiche auch ohne direkte Beschilderung durch bauliche oder betriebliche Merkmale leicht zu identifizieren sind. Die Einsehbarkeit von außen wird geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A16-m3",
                    "uuid": "880cae01-948d-4211-b270-3a334dfc8fcc",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Lagehinweise auf schutzwürdige Bereiche SOLLTEN vermieden werden. Schutzwürdige Gebäudebereiche SOLLTEN von außen nicht leicht einsehbar sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Schutzwürdige Räume werden neutral oder mit Code-Bezeichnungen (z.B. 'Technikraum T.01') beschildert. Fenster von schutzwürdigen Räumen im Erdgeschoss werden mit Sichtschutzfolie versehen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Beschilderung von schutzwürdigen Bereichen auf Neutralität. Die Wirksamkeit von Sichtschutzmaßnahmen wird bei einer Außenbegehung geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A16-m4",
                    "uuid": "e151ba20-7133-4cd6-ba1e-16a2d78da624",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei der Planung von Gebäuden oder Umbauten wird aktiv darauf geachtet, schutzwürdige Bereiche ohne Außenfenster und nicht an öffentlich zugänglichen Fluren zu positionieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Serverräume werden bevorzugt im Gebäudekern geplant. Die Wegführung für Besucher wird so gestaltet, dass sie nicht an den Türen zu schutzwürdigen Bereichen vorbeiführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Gebäudepläne und die geplante Wegführung. Es wird bewertet, ob das Prinzip 'Security by Design' im Hinblick auf die Positionierung sensibler Bereiche angewendet wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A16-m5",
                    "uuid": "f2c8c6d6-a7ee-4448-8045-1033e0fd5101",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Schutzwürdige Bereiche sind baulich so gestaltet, dass sie sich nicht von normalen Büroräumen unterscheiden. Es werden Maßnahmen zur Schalldämmung ergriffen, um eine akustische Ortung (z.B. durch Lüftergeräusche) zu verhindern."
                      },
                      {
                        "name": "guidance",
                        "value": "Serverräume haben dieselben Türen wie Büroräume. Die Klimatisierung ist so ausgelegt und schallgedämmt, dass sie außerhalb des Raumes nicht zu hören ist. Die Abwärme wird unauffällig abgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer versucht bei einer Begehung, schutzwürdige Bereiche anhand äußerer Merkmale (Optik, Akustik) zu identifizieren. Die Effektivität der Tarnungs- und Dämmmaßnahmen wird bewertet."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "75c606be-fd15-4372-9ec1-549c72c7c680",
                "control-id": "GEB.3.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A26-m1",
                    "uuid": "7a62c439-0807-4667-8f25-b33b0202bb98",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt keinen Empfang oder Sicherheitsdienst. Besucher können das Gebäude unkontrolliert betreten."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Eingangstür steht tagsüber offen. Fremde Personen werden von den Mitarbeitern nicht angesprochen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch eine Begehung und einen Test (Social Engineering) fest, dass ein unkontrollierter Zutritt für Fremde möglich ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A26-m2",
                    "uuid": "f3a67de2-c67f-4bc0-8adb-c944c5e77635",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt einen Empfang, dessen Hauptaufgabe jedoch nicht die Sicherheitskontrolle ist. Die Aufgaben sind nicht klar dokumentiert. Besucher werden nicht immer begleitet."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Empfangspersonal ist hauptsächlich für die Telefonzentrale und Postverteilung zuständig. Besucher melden sich an, werden aber oft nur mündlich an ihr Ziel verwiesen, ohne dass der Angerufene sie abholt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer befragt das Empfangspersonal zu seinen Sicherheitsaufgaben und stellt fest, dass diese unklar sind. Es wird beobachtet, wie mit Besuchern umgegangen wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A26-m3",
                    "uuid": "cc9d1d55-b201-4a86-8237-ff0e7c0a4e9c",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Aufgaben des Pforten- oder Sicherheitsdienstes SOLLTEN klar dokumentiert sein. Der Pfortendienst SOLLTE alle Personenbewegungen an der Pforte und an allen anderen Eingängen beobachten und, je nach Sicherheitskonzept, kontrollieren. Besuchende SOLLTEN zu den Besuchten begleitet oder an der Pforte abgeholt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine schriftliche Dienstanweisung für den Pfortendienst, die die Prozesse zur Besucheranmeldung, Ausweiskontrolle und Begleitung regelt. Alle Besucher werden in einer Liste erfasst und erhalten einen Besucherausweis. Es ist klar geregelt, dass Besucher im nicht-öffentlichen Bereich immer begleitet werden müssen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Dienstanweisung für den Pfortendienst. Die Besucherlisten werden auf Vollständigkeit geprüft. Durch Beobachtung und Testbesuche wird verifiziert, ob der Prozess zur Begleitung von Besuchern eingehalten wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A26-m4",
                    "uuid": "51846b68-f674-44e4-a3b9-a4f22a3997a7",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Mitarbeitenden und Besuchenden SOLLTEN sich bei dem Pfortendienst ausweisen können. Der Pfortendienst SOLLTE rechtzeitig darüber informiert werden, wenn sich Zutrittsberechtigungen ändern."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle Mitarbeiter tragen sichtbar einen Dienstausweis. Besucher müssen einen amtlichen Lichtbildausweis vorlegen, der mit der Anmeldung abgeglichen wird. Es gibt einen Prozess, der sicherstellt, dass der Pfortendienst bei Ein- und Austritten von Mitarbeitern umgehend eine aktualisierte Mitarbeiterliste erhält."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft, ob die Mitarbeiter ihre Ausweise tragen und ob bei Besuchern eine Ausweiskontrolle stattfindet. Es wird der Prozess zur Aktualisierung der Mitarbeiterinformationen für den Pfortendienst geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A26-m5",
                    "uuid": "8f4a21a1-9c9e-4220-8752-3c941401430c",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein digitales Besuchermanagement-System wird eingesetzt. Besucher müssen sich vorab online registrieren und werden nach Genehmigung durch den Gastgeber automatisch im System freigeschaltet. Der Pfortendienst überwacht die Monitore der Gefahrenmeldeanlagen (EMA, BMA) und der Videoüberwachung und leitet im Alarmfall definierte Maßnahmen ein."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Besuchermanagement-System druckt bei Ankunft einen Ausweis mit Barcode, der ggf. für definierte Türen freigeschaltet ist. Der Pfortendienst ist als Interventionsstelle für alle Sicherheitsalarme qualifiziert und geschult. Die Alarmpläne sind direkt am Arbeitsplatz verfügbar."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den Prozess im digitalen Besuchermanagement-System von der Voranmeldung bis zum Check-out. Es wird die Qualifikation des Pfortendienstes als Interventionsstelle geprüft und die Alarmpläne werden gesichtet. Durch einen Testalarm wird die Reaktion des Dienstes beobachtet."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "09b1773b-5eaf-4be7-9fd4-10515e3d7926",
                "control-id": "GEB.3.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A7-m1",
                    "uuid": "7139a84b-be0b-465a-9da0-1f824b6ac8ad",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt keine formale Zutrittsregelung. Türen zu schutzbedürftigen Bereichen sind oft unverschlossen. Fremde Personen können sich weitgehend unkontrolliert im Gebäude bewegen."
                      },
                      {
                        "name": "guidance",
                        "value": "Jeder hat einen Schlüssel für die Eingangstür. Türen zu Serverräumen oder Archiven werden nicht konsequent abgeschlossen. Besucher werden nicht angemeldet oder begleitet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer führt eine Begehung durch und prüft, ob er ohne Berechtigung Zugang zu sensiblen Bereichen erlangen kann. Es wird festgestellt, ob es eine Regelung für den Umgang mit Besuchern gibt."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A7-m2",
                    "uuid": "eac691b4-5853-4ce7-846a-2adf31e8ac00",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert eine einfache Zutrittsregelung, die besagt, dass Türen zu schutzbedürftigen Bereichen abgeschlossen sein müssen. Eine differenzierte Vergabe von Zutrittsberechtigungen gibt es nicht."
                      },
                      {
                        "name": "guidance",
                        "value": "Die meisten Mitarbeiter haben Schlüssel für fast alle Bereiche. Die Schlüsselverwaltung ist dezentral und undokumentiert. Die Anzahl der Zutrittsberechtigten wird nicht auf ein Mindestmaß reduziert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer befragt Verantwortliche nach der Zutrittsregelung und der Schlüsselverwaltung. Es wird geprüft, ob das Prinzip des 'Need-to-Know' bei der Vergabe von Schlüsseln angewendet wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A7-m3",
                    "uuid": "cc113fa2-f782-4db7-af27-e026101e4bb4",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zutritt zu schutzbedürftigen Gebäudeteilen und Räumen MUSS geregelt und kontrolliert werden. Es SOLLTE ein Konzept für die Zutrittskontrolle existieren. Die Zahl der zutrittsberechtigten Personen SOLLTE für jeden Bereich auf ein Mindestmaß reduziert werden. Alle erteilten Zutrittsberechtigungen SOLLTEN dokumentiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist ein Zutrittskontrollkonzept vorhanden, das verschiedene Sicherheitszonen und die dazugehörigen Berechtigungsgruppen definiert. Die Vergabe von Berechtigungen erfolgt nach einem dokumentierten Genehmigungsprozess. Die Berechtigungen werden in einer Liste oder einem System (z.B. bei einer elektronischen Zutrittskontrolle) verwaltet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Zutrittskontrollkonzept. Es wird die Dokumentation der vergebenen Berechtigungen geprüft. Stichprobenartig wird kontrolliert, ob die Vergabe von Berechtigungen dem 'Need-to-Know'-Prinzip folgt und ob die entsprechenden Genehmigungen vorliegen."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A7-m4",
                    "uuid": "682dca62-9753-4c35-962b-078b4b556612",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Weitere Personen DÜRFEN erst Zutritt erhalten, nachdem geprüft wurde, ob dies notwendig ist. Die Zutrittskontrollmaßnahmen MÜSSEN regelmäßig auf ihre Wirksamkeit überprüft werden. Zutrittskontrollen SOLLTEN auch während Umzügen soweit wie möglich vorhanden sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist ein Prozess für die Vergabe temporärer Berechtigungen für Besucher und Dienstleister etabliert. Mindestens einmal jährlich wird ein 'Recertification'-Prozess durchgeführt, bei dem alle bestehenden Zutrittsberechtigungen von den jeweiligen Vorgesetzten überprüft und bestätigt werden müssen. Bei Umzügen werden mobile oder provisorische Zutrittskontrolllösungen eingesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Protokolle des 'Recertification'-Prozesses. Es wird geprüft, ob der Prozess für Fremdpersonal eingehalten wird (z.B. durch Einsicht in Besucherlisten und temporäre Berechtigungen). Es wird verifiziert, dass es Pläne für die Aufrechterhaltung der Zutrittskontrolle bei Sonderereignissen wie Umzügen gibt."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A7-m5",
                    "uuid": "1c3216a3-da56-44b1-a48e-067c0275bbad",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist ein elektronisches Zutrittskontrollsystem (ZKS) im Einsatz, das alle Zutrittsversuche (berechtigt und unberechtigt) protokolliert. Die Protokolle werden automatisiert auf Anomalien (z.B. Zutrittsversuche außerhalb der Geschäftszeiten) überwacht. In Hochsicherheitsbereichen wird eine Zwei-Faktor-Authentisierung (z.B. Karte und PIN oder Biometrie) für den Zutritt gefordert."
                      },
                      {
                        "name": "guidance",
                        "value": "Das ZKS ist mit dem Personalverwaltungssystem gekoppelt, sodass Berechtigungen bei einem Austritt eines Mitarbeiters automatisch entzogen werden. Ein SIEM-System (Security Information and Event Management) analysiert die Logs des ZKS und korreliert sie mit anderen Ereignissen. Für Serverräume ist beispielsweise die Eingabe einer PIN zusätzlich zur RFID-Karte erforderlich."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration und die Logs des ZKS. Es werden die Regeln im SIEM-System zur Erkennung von Anomalien geprüft. Die Wirksamkeit der Zwei-Faktor-Authentisierung wird vor Ort getestet. Automatisierte Prüfung: `check_access_control_system --verify 'auto_revocation_enabled' --zone 'high_security' --check '2fa_required'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "bc597745-53da-45e6-9adc-9eb27ae8fb77",
                "control-id": "GEB.3.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A22-m1",
                    "uuid": "ee9e569c-49b4-4f62-8402-2745a6bd4266",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Türen und Fenster haben keine zertifizierte Widerstandsklasse und bieten nur minimalen Schutz gegen Einbruch."
                      },
                      {
                        "name": "guidance",
                        "value": "Es sind Standard-Wohnungsbautüren und -fenster ohne besondere Sicherheitsmerkmale verbaut."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch Sichtprüfung und Einsicht in die Bauunterlagen fest, dass keine klassifizierten Sicherheitsbauteile verwendet wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A22-m2",
                    "uuid": "f17092b2-3810-4827-b9a1-37e5ba88bdd6",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "An einigen besonders kritischen Stellen, wie der Haupteingangstür, wurden Bauteile mit einer grundlegenden Widerstandsklasse (z.B. RC 2) eingesetzt. Ein durchgängiges Konzept fehlt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Tür zum Serverraum ist eine RC 2 Tür, aber sie befindet sich neben einem ungesicherten Standardfenster, das einen alternativen Angriffspunkt darstellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bewertet die Gleichwertigkeit der Sicherungsmaßnahmen in einem Bereich und stellt fest, dass Schwachstellen die Wirkung einzelner guter Maßnahmen aufheben."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A22-m3",
                    "uuid": "09282578-2a3c-4960-928e-95a650a68b0a",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Türen und Fenster SOLLTEN anhand der Schutzziele des zu sichernden Bereichs und des Schutzbedarfs der Institution in der passenden Klassifizierung nach den einschlägigen Normen ausgewählt werden. Alle raumumschließenden Sicherungsmaßnahmen durch Fenster, Türen und Wände SOLLTEN in Bezug auf Einbruch, Brand und Rauch gleichwertig und angemessen sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Für jede Sicherheitszone wird auf Basis einer Risikoanalyse eine erforderliche Widerstandsklasse (z.B. RC 2 für Büros, RC 3 für Serverräume) und Feuerwiderstandsklasse (z.B. T30) definiert. Bei der Beschaffung wird auf zertifizierte Produkte geachtet und sichergestellt, dass alle Umschließungsflächen (Wand, Tür, Fenster) ein gleichwertiges Schutzniveau bieten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Risikoanalyse und die daraus abgeleiteten Anforderungen an Türen und Fenster. Es wird geprüft, ob die eingebauten Komponenten die geforderten Zertifizierungen aufweisen und ob das Prinzip des gleichwertigen Widerstands eingehalten wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A22-m4",
                    "uuid": "96fd59fc-c38c-496a-9dfa-caeccd738415",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE regelmäßig überprüft werden, dass die Sicherheitstüren und -fenster funktionstüchtig sind. Dies beinhaltet die Prüfung der Schlösser, Schließer und der Dichtungen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Wartungsplan sieht die jährliche Überprüfung aller klassifizierten Türen und Fenster durch eine Fachfirma vor. Die Prüfung umfasst mechanische Teile, Schließfunktionen und bei Brandschutztüren auch die Feststellanlagen. Die Wartung wird protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Wartungsverträge und -protokolle. Es wird stichprobenartig die Funktion einer Sicherheitstür (z.B. korrekter Sitz, Schließverhalten) vor Ort geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A22-m5",
                    "uuid": "e8f41c0e-0e8a-4544-9c3d-07b53bb02258",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Sicherheitstüren sind mit Sensoren ausgestattet, die den Zustand (offen, geschlossen, verriegelt, blockiert) an eine zentrale Managementkonsole (EMA oder Gebäudeleittechnik) melden. Jede Abweichung vom Soll-Zustand (z.B. eine zu lange offenstehende Brandschutztür) löst einen Alarm aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Riegelkontakte, Magnetkontakte und Türschließer sind mit der EMA vernetzt. In der EMA sind Regeln definiert, z.B. 'Alarm auslösen, wenn Tür zum Serverraum länger als 60 Sekunden offen ist'. Der Zustand aller Sicherheitstüren wird auf einem Dashboard visualisiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der Türüberwachung in der EMA. Die Funktion wird durch praktische Tests (z.B. absichtliches Offenhalten einer Tür) verifiziert. Die Protokolle des Systems werden auf relevante Ereignisse und die darauf folgenden Reaktionen geprüft. Automatisierte Prüfung: `check_ema_config --asset_type 'security_door' --verify 'state_monitoring_active,alarm_on_tamper_enabled'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "64c3b616-dd20-433c-9466-3a11cc023328",
                "control-id": "GEB.3.6",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A27-m1",
                    "uuid": "bce3f747-a0af-4284-961e-fb063583f148",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt keine spezifischen Maßnahmen zum Einbruchschutz, außer den standardmäßig verbauten Schlössern an Türen und Fenstern."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Fenster im Erdgeschoss haben keine Pilzkopfverriegelungen. Die Eingangstür hat ein einfaches Schloss ohne besonderen Schutz."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bewertet bei einer Begehung die vorhandenen mechanischen Sicherungen an potenziellen Eintrittspunkten (Türen, Fenster, Kellerfenster) und stellt deren unzureichenden Zustand fest."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A27-m2",
                    "uuid": "28d6ffe0-aa04-40c1-92c6-bf213e08695b",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wurden punktuell Maßnahmen zum Einbruchschutz umgesetzt, z.B. an der Haupteingangstür. Ein durchgängiges Konzept für das gesamte Gebäude fehlt jedoch."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Vordertür wurde mit einem Sicherheitsschloss nachgerüstet, aber die leicht erreichbaren Fenster im Erdgeschoss sind weiterhin ungesichert. Es gibt keine Einbruchmeldeanlage."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bewertet, ob der Einbruchschutz an verschiedenen Stellen des Gebäudes ein stark unterschiedliches und insgesamt lückenhaftes Niveau aufweist."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A27-m3",
                    "uuid": "76b86f11-89fc-4f09-ae46-c354f25cf7ba",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTEN ausreichende und den örtlichen Gegebenheiten angepasste Maßnahmen zum Einbruchschutz umgesetzt werden. Bei der Planung, der Umsetzung und im Betrieb SOLLTE beim Einbruchschutz darauf geachtet werden, dass er gleichwertig und durchgängig ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Auf Basis einer einfachen Risikoanalyse werden mechanische Sicherungen an allen leicht erreichbaren Öffnungen (Türen, Fenster) nachgerüstet (z.B. gemäß Widerstandsklasse RC 2). Es wird darauf geachtet, dass keine einfachen Schwachstellen (z.B. ungesicherte Kellerfenster) verbleiben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, ob ein durchgängiges Schutzniveau an allen potenziellen Einbruchstellen realisiert wurde. Es wird geprüft, ob die umgesetzten Maßnahmen den anerkannten Standards (z.B. RC-Klassen) entsprechen."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A27-m4",
                    "uuid": "4c82b610-6b36-41cb-b946-558c32d02c35",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Einbruchschutz SOLLTE regelmäßig durch eine fachkundige Person begutachtet werden. Die Regelungen zum Einbruchschutz SOLLTEN den Mitarbeitenden bekannt sein. Zusätzlich zu mechanischen Sicherungen ist eine Einbruchmeldeanlage (EMA) installiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle zwei Jahre wird eine Begutachtung des Einbruchschutzes durch einen externen Sicherheitsexperten oder die Kriminalpolizeiliche Beratungsstelle durchgeführt. Eine EMA sichert die Außenhaut des Gebäudes und wird bei Abwesenheit aktiviert. Mitarbeiter werden über die Verhaltensregeln (Fenster schließen, EMA aktivieren) informiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Berichte der externen Begutachtungen und prüft, ob die Empfehlungen umgesetzt wurden. Die Funktionsfähigkeit der EMA wird geprüft. Es wird verifiziert, dass die Mitarbeiter über die Regelungen informiert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A27-m5",
                    "uuid": "e29c8752-392c-43a2-81ec-6ab0fc405246",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein integriertes Sicherheitskonzept kombiniert mechanische Sicherungen (z.B. RC 3), eine VdS-zertifizierte Einbruchmeldeanlage mit Aufschaltung auf einen Wachdienst und Videoüberwachung an kritischen Punkten. Einbruchsversuche werden nicht nur gemeldet, sondern auch videotechnisch aufgezeichnet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die EMA ist mit der Videoüberwachung gekoppelt, sodass bei einem Alarm automatisch die relevanten Kamerabilder aufgezeichnet und an den Wachdienst übertragen werden. Dies ermöglicht eine schnelle Lagebeurteilung und Täteridentifikation. Die EMA wird jährlich durch eine zertifizierte Fachfirma gewartet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das VdS-Attest der EMA und den Vertrag mit dem Wachdienst. Die Wartungsprotokolle werden geprüft. Es wird getestet, ob im Alarmfall die korrekte Aufzeichnung und Übertragung der Videobilder erfolgt. Automatisierte Prüfung: `check_alarm_system --asset 'EMA' --verify 'vds_certified,video_integration_active'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "70e7926b-888e-4758-b94e-66f615112538",
                "control-id": "GEB.5.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A23-m1",
                    "uuid": "e306cb8a-c16d-4345-ba91-429d4d8da84d",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt keine definierte Zonenstruktur. Räume mit hohem und niedrigem Schutzbedarf sind vermischt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Serverraum befindet sich direkt neben dem öffentlichen Empfangsbereich. Vertrauliche Akten lagern in einem frei zugänglichen Büroraum."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch Analyse des Raumplans und eine Begehung fest, dass keine logische Gliederung nach Schutzbedarf existiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A23-m2",
                    "uuid": "22c457f4-79dd-4577-ac6f-4dcf7b9be357",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt eine grobe Einteilung in einen öffentlichen und einen nicht-öffentlichen Bereich. Innerhalb des nicht-öffentlichen Bereichs gibt es jedoch keine weitere Unterteilung."
                      },
                      {
                        "name": "guidance",
                        "value": "Besucher haben nur zum Empfangsbereich Zutritt. Dahinter haben aber alle Mitarbeiter Zugang zu allen Bereichen, unabhängig vom individuellen Schutzbedarf der Räume (z.B. Personalbüro, Serverraum)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das Zutrittskontrollkonzept und stellt fest, dass es keine ausreichende Granularität aufweist, um verschiedene Schutzbedarfe innerhalb des internen Bereichs abzubilden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A23-m3",
                    "uuid": "7234f3f8-d4d4-481e-b5e2-5443e68e2382",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Räume ähnlichen Schutzbedarfs SOLLTEN in Zonen zusammengefasst werden, um vergleichbare Risiken einheitlich behandeln und Kosten für erforderliche Sicherheitsmaßnahmen reduzieren zu können."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Zonenkonzept (z.B. nach dem Zwiebelschalenmodell) wird erstellt und dokumentiert. Es definiert typischerweise Zonen wie 'Öffentlicher Bereich', 'Interner Bereich', 'Schutzzone' und 'Hochschutzzone'. Für jede Zone werden einheitliche Sicherheitsanforderungen (z.B. Zutrittskontrolle, Einbruchschutz) festgelegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Zonenkonzept und prüft, ob die Zusammenfassung von Räumen zu Zonen logisch und nachvollziehbar ist. Es wird kontrolliert, ob die für eine Zone definierten Sicherheitsmaßnahmen konsistent auf alle Räume dieser Zone angewendet werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A23-m4",
                    "uuid": "6feb703d-7393-4b47-a858-c735dceb3d79",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Zonenkonzept wird bereits bei der Planung von Neu- oder Umbauten berücksichtigt, um eine optimale räumliche Anordnung zu erreichen. Die Übergänge zwischen den Zonen sind als kontrollierte Sicherheitsschleusen ausgebildet."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei der Raumplanung wird darauf geachtet, dass Zonen mit hohem Schutzbedarf im Inneren des Gebäudes liegen und nur über Zonen mit niedrigerem Schutzbedarf erreichbar sind. Der Übergang von der internen Zone zur Schutzzone (z.B. Serverraum-Vorraum) wird durch eine Vereinzelungsanlage oder eine Zwei-Türen-Schleuse realisiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Gebäudepläne und bewertet, ob das Zonenkonzept optimal umgesetzt ist. Die Ausgestaltung und Funktion der Zonenübergänge (Schleusen) wird vor Ort geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A23-m5",
                    "uuid": "65dd110b-206d-4143-ab3f-627c016e1082",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Zonenkonzept ist dynamisch und an die jeweiligen Risiken und Prozesse gekoppelt. Zutrittsberechtigungen für Zonen sind nicht nur an Personen, sondern auch an bestimmte Zeiten und Bedingungen (z.B. Freigabe durch eine zweite Person) geknüpft. Die Einhaltung der Zonenregeln wird automatisiert überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Zutritt zum Rechenzentrum ist nur während der Servicezeiten und nach vorheriger Anmeldung im Ticketsystem möglich (bedingter Zutritt). Der Zutritt erfordert die gleichzeitige Anwesenheit und Authentisierung von zwei berechtigten Personen (Vier-Augen-Prinzip). Videoanalyse überwacht, ob Personen unerlaubt Zonen betreten (Tailgating)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der erweiterten Zutrittsregeln (bedingter Zutritt, Vier-Augen-Prinzip) im Zutrittskontrollsystem. Die Wirksamkeit der Anti-Tailgating-Maßnahmen wird getestet. Die Logs werden auf Regelverstöße und die darauf folgenden Alarme geprüft. Automatisierte Prüfung: `check_access_control_system --zone 'data_center' --verify '4_eyes_principle_active,conditional_access_enabled'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "61c18576-3162-4594-b3aa-85e1c0b0c295",
                "control-id": "GEB.5.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A13-m1",
                    "uuid": "884d4b9e-9d15-4b91-9ffb-0d4bf727f70f",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Verteilerschränke (Strom, Netzwerk) sind oft unverschlossen und für jedermann zugänglich. Es gibt keine Regelung für den Zutritt."
                      },
                      {
                        "name": "guidance",
                        "value": "Netzwerkverteiler stehen in frei zugänglichen Fluren. Die Türen der Schränke sind nicht abgeschlossen. Jeder Mitarbeiter kann Patchkabel umstecken."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert bei einer Begehung den physischen Zustand und die Zugänglichkeit von Verteilerschränken. Es wird festgestellt, ob diese ungesichert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A13-m2",
                    "uuid": "5dbe7f20-cc1d-4c27-b420-4a9f90ef7baf",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die meisten Verteilerschränke sind abgeschlossen. Der Kreis der Personen mit Schlüssel ist jedoch sehr groß und nicht klar definiert oder dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Haustechnik und die IT-Abteilung haben Schlüssel für die Verteilerschränke, aber es ist nicht dokumentiert, welcher Mitarbeiter welchen Schlüssel hat. Ein schneller Zutritt im Bedarfsfall ist nicht immer gewährleistet, da unklar ist, wer gerade verfügbar ist."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fragt nach der Regelung für den Zutritt zu Verteilern und wer im Besitz von Schlüsseln ist. Es wird bewertet, ob der Kreis der Berechtigten zu groß ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A13-m3",
                    "uuid": "e2c0903a-b61a-43a8-b92a-cb40ee1b34bb",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zutritt zu den Verteilern aller Versorgungseinrichtungen in einem Gebäude SOLLTE auf einen engen Kreis von Berechtigten beschränkt sein. Der Zutritt SOLLTE im Bedarfsfall schnell möglich sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Zutritt zu Verteilerräumen und -schränken ist geregelt. Nur definierte Rollen (z.B. Netzwerkadministratoren, Elektriker) erhalten die entsprechenden Schlüssel oder Berechtigungen. Die Liste der Berechtigten ist dokumentiert und wird aktuell gehalten. Es ist sichergestellt (z.B. durch Schlüsselhinterlegung), dass auch außerhalb der normalen Arbeitszeiten ein schneller Zutritt möglich ist."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Liste der zutrittsberechtigten Personen für Verteiler und prüft, ob diese auf das notwendige Minimum beschränkt ist. Es wird der Prozess für den Notfallzutritt geprüft (z.B. durch Einsicht in die Regelung zur Schlüsselhinterlegung)."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A13-m4",
                    "uuid": "80fa2e13-dec6-47b5-9960-0bd0b9e7fbad",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zutritt zu Verteilern wird protokolliert. Bei elektronischen Schließsystemen erfolgt dies automatisch, bei mechanischen Schlüsseln durch Eintrag in ein Logbuch."
                      },
                      {
                        "name": "guidance",
                        "value": "Verteilerräume sind an das elektronische Zutrittskontrollsystem angeschlossen. Jeder Zutritt wird mit Zeitstempel und Person aufgezeichnet. Für Schränke mit mechanischen Schlüsseln liegt ein Logbuch aus, in das sich jeder eintragen muss."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Protokolle des Zutrittskontrollsystems bzw. die Logbücher. Es wird geprüft, ob die Protokollierung lückenlos erfolgt und ob die Einträge plausibel sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A13-m5",
                    "uuid": "4702de86-6239-4fa6-b9f1-af7e3c766d59",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zutritt zu kritischen Verteilern wird zusätzlich durch Videoüberwachung überwacht. Unautorisierte Öffnungsversuche der Schränke (z.B. durch Aufbohren) werden durch Sensoren erkannt und lösen einen Alarm aus."
                      },
                      {
                        "name": "guidance",
                        "value": "In den Hauptverteilerräumen sind Kameras installiert, deren Aufzeichnungen bei einem Zutrittsereignis markiert werden. Die Türen der Verteilerschränke sind mit Öffnungs- und Vibrationssensoren ausgestattet, die an die Einbruchmeldeanlage gekoppelt sind."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration der Videoüberwachung und der Alarmsensorik. Die Alarmierungskette bei einem unautorisierten Öffnungsversuch wird getestet. Automatisierte Prüfung: `check_alarm_system --asset 'distributor_cabinet_1' --verify 'vibration_sensor_active,alarm_to_soc_enabled'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "23b14002-1c13-4d5b-b08e-da2e7101efda",
                "control-id": "GEB.8.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.1.A12-m1",
                    "uuid": "02652767-66c2-4af4-9c80-05545bc90f6d",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt keine zentrale Schlüsselverwaltung. Schlüssel werden bei Bedarf nachgemacht und die Ausgabe wird nicht dokumentiert. Es ist unklar, wer welche Schlüssel besitzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Mitarbeiter geben Schlüssel direkt an Kollegen weiter. Bei Verlust eines Schlüssels erfolgt keine Meldung oder Maßnahme."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch Befragung fest, dass es keinen Überblick über die ausgegebenen Schlüssel gibt und kein Prozess für die Ausgabe und Rücknahme existiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A12-m2",
                    "uuid": "b553cdf1-d3d6-4991-a687-cbc79064f08f",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt eine einfache Liste, in der die Ausgabe von Schlüsseln notiert wird. Es gibt jedoch keinen Schließplan und Reserveschlüssel werden unsicher aufbewahrt."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Excel-Liste wird geführt, aber nicht immer konsequent gepflegt. Ein Ersatzschlüssel für den Serverraum hängt ungesichert am Schlüsselbrett im Sekretariat."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Schlüsselliste und vergleicht sie stichprobenartig mit den tatsächlich ausgegebenen Schlüsseln. Die Aufbewahrung von Reserveschlüsseln wird geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A12-m3",
                    "uuid": "b696256d-a22e-42a8-b3a5-47c08ac4129f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für alle Schlüssel des Gebäudes SOLLTE ein Schließplan vorliegen. Die Herstellung, Aufbewahrung, Verwaltung und Ausgabe von Schlüsseln SOLLTE zentral geregelt sein. Jede Schlüsselausgabe SOLLTE dokumentiert werden. Nicht ausgegebene Schlüssel SOLLTEN sicher aufbewahrt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es existiert ein aktueller Schließplan, der die Hierarchie der Schließanlage abbildet. Eine zentrale Stelle (z.B. Haustechnik, Verwaltung) ist für die Schlüsselverwaltung verantwortlich. Die Ausgabe erfolgt nur gegen Unterschrift und wird in einer Schlüsselverwaltungssoftware oder einer sorgfältig geführten Liste dokumentiert. Nicht benötigte Schlüssel werden in einem Tresor aufbewahrt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet den Schließplan und die Dokumentation der Schlüsselverwaltung. Es wird geprüft, ob die Prozesse für Ausgabe und Rücknahme eingehalten werden. Die sichere Aufbewahrung der nicht ausgegebenen Schlüssel wird kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A12-m4",
                    "uuid": "b50e6385-0e65-4f34-af79-844eee1ac3be",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Reserveschlüssel SOLLTEN vorgehalten und gesichert, aber für Notfälle griffbereit aufbewahrt werden. Die Dokumentation der Schlüsselausgabe wird regelmäßig, mindestens jährlich, daraufhin überprüft, ob die Empfänger die Schlüssel noch benötigen."
                      },
                      {
                        "name": "guidance",
                        "value": "Notfallschlüssel (z.B. für die Feuerwehr) werden in einem versiegelten Feuerwehrschlüsseldepot (FSD) hinterlegt. Einmal pro Jahr wird eine Revision der Schlüsselausgabeliste durchgeführt, bei der die Vorgesetzten die Notwendigkeit der Schlüssel für ihre Mitarbeiter bestätigen müssen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die sichere und vorschriftsmäßige Aufbewahrung der Notfallschlüssel. Die Protokolle der jährlichen Schlüsselrevision werden gesichtet und auf Vollständigkeit geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.1.A12-m5",
                    "uuid": "eb1c34cf-9743-4103-aeea-bd1aa6563a95",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Anstelle einer mechanischen Schließanlage wird ein elektronisches Zutrittskontrollsystem (ZKS) mit programmierbaren Schlüsseln (z.B. RFID-Karten) verwendet. Die Schlüsselverwaltung ist vollständig automatisiert und mit dem Personalverwaltungssystem gekoppelt. Bei Verlust eines Schlüssels kann dieser sofort elektronisch gesperrt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Schlüsselverwaltung ist ein Modul des ZKS. Berechtigungen werden rollenbasiert vergeben. Bei Austritt eines Mitarbeiters wird dessen Transponder automatisch vom HR-System gesperrt. Die Ausgabe von Transpondern wird im System protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des ZKS und die Anbindung an das HR-System. Es wird getestet, ob ein als verloren gemeldeter Transponder tatsächlich keinen Zutritt mehr gewährt. Die Protokolle der Berechtigungsvergabe werden geprüft. Automatisierte Prüfung: `check_access_control_system --verify 'hr_integration_active' --test_revocation 'user_xyz'`."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}