{
  "component-definition": {
    "uuid": "c8dc3e6f-4ac7-4127-a75d-f20191ad0f43",
    "metadata": {
      "title": "SYS.1.10 Benutzerdefiniert: Server unter OpenBSD - Benutzerdefiniert",
      "last-modified": "2025-11-22T12:46:09.347334+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "7bdd057e-8615-4faa-b924-3db3bd97e908",
        "type": "hardware",
        "title": "SYS.1.10 Benutzerdefiniert: Server unter OpenBSD",
        "description": "This component represents the implementation of all controls for Baustein SYS.1.10.",
        "props": [
          {
            "name": "Einleitung",
            "value": "OpenBSD ist ein freies, Unix-ähnliches Betriebssystem, das aus einer Abspaltung von NetBSD hervorging. Es ist international bekannt für seinen proaktiven Sicherheitsansatz, die hohe Qualität des Quellcodes und die vollständige Integration kryptografischer Funktionen. Das erklärte Ziel der Entwickler ist es, das sicherste verfügbare Mehrzweck-Betriebssystem zu sein. Diesem Ziel wird durch eine \"Secure by default\"-Philosophie, kontinuierliche Code-Audits und die Entwicklung innovativer Sicherheitsmechanismen wie pledge(2) und unveil(2) nachgegangen. Aufgrund dieser Eigenschaften wird OpenBSD häufig für sicherheitskritische Aufgaben eingesetzt, beispielsweise als Firewall, DNS-Server, VPN-Gateway oder als Plattform für Intrusion-Detection-Systeme. Die Architektur, die Werkzeuge (insbesondere die Packet Filter Firewall pf) und das Release-Modell unterscheiden sich signifikant von anderen Unix-Derivaten und erfordern daher spezifische Kenntnisse für eine sichere Konfiguration und den Betrieb."
          },
          {
            "name": "Zielsetzung",
            "value": "Dieser Baustein zeigt einen systematischen Weg für die Installation, den Betrieb und die Härtung von Servern auf Basis von OpenBSD auf. Ziel ist es, die im System integrierten, fortschrittlichen Sicherheitsfunktionen korrekt zu nutzen, um eine extrem robuste und widerstandsfähige Server-Plattform gemäß den Anforderungen des IT-Grundschutzes bereitzustellen."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein SYS.1.10 ist auf alle Serversysteme anzuwenden, auf denen das Betriebssystem OpenBSD eingesetzt wird. Er konkretisiert und ergänzt die allgemeinen Anforderungen aus SYS.1.1 Allgemeiner Server. Er ersetzt diesen nicht. Aufgrund des häufigen Einsatzes als Netzkomponente bestehen enge Bezüge zu Bausteinen der Schicht NET, insbesondere zu NET.3.2 Firewall."
          },
          {
            "name": "Umgehung der Sicherheitsmechanismen durch fehlerhafte Konfiguration",
            "value": "Obwohl OpenBSD standardmäßig sehr sicher konfiguriert ist, können Administratoren durch unsachgemäße Anpassungen die eingebauten Schutzmechanismen aushebeln. Beispiele sind übermäßig freizügige Regeln in der pf.conf, das Deaktivieren von Sicherheitsfunktionen in Drittanbieter-Software oder das fehlerhafte Erstellen eigener Skripte ohne Nutzung von pledge und unveil."
          },
          {
            "name": "Veraltete Systemversionen durch inkonsequentes Patching",
            "value": "Das OpenBSD-Projekt veröffentlicht alle sechs Monate eine neue Version und stellt für die jeweils aktuelle und die vorherige Version Sicherheitspatches über syspatch bereit. Werden diese Patches nicht zeitnah eingespielt oder die halbjährlichen Upgrades via sysupgrade versäumt, bleibt das System auf einem veralteten Stand und ist gegen neu entdeckte Schwachstellen ungeschützt."
          },
          {
            "name": "Unsichere Konfiguration von Diensten aus dem Ports-System",
            "value": "Während das Basissystem einem intensiven Audit unterliegt, gilt dies nicht im selben Maße für die Tausenden von Softwarepaketen, die über das Ports-System verfügbar sind. Die Installation und der Betrieb einer schlecht konfigurierten oder fehlerhaften Drittanbieter-Anwendung kann die hohe Sicherheit des Basissystems untergraben."
          },
          {
            "name": "Kompromittierung durch unsachgemäße Administration",
            "value": "Trotz der robusten technischen Absicherung bleibt der Faktor Mensch eine Schwachstelle. Die Verwendung des root-Kontos für alltägliche Arbeiten, die Nutzung schwacher Passwörter (obwohl SSH standardmäßig auf Schlüssel-Authentifizierung setzt) oder die unsachgemäße physische Absicherung des Servers können das System kompromittieren."
          }
        ],
        "control-implementations": [
          {
            "uuid": "0fd15381-72cb-4598-92b9-cb30243306ee",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Kompendien/Grundschutz%2B%2B-Kompendium/profile/hostsysteme_profile.json",
            "description": "Implementation for all controls in Baustein SYS.1.10",
            "implemented-requirements": [
              {
                "uuid": "5148445c-24c1-4ed2-84e8-fbabb77ae620",
                "control-id": "ARCH.2.2.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a8-m2",
                    "uuid": "819108a5-4cd6-4f72-b7cd-8c070bfff3e0",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Terminalserver wird in einem allgemeinen Server-Netzwerk platziert. Es gibt keine spezifische Segmentierung, die seiner besonderen Rolle als client-ähnliches System Rechnung trägt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Server wird in dasselbe VLAN wie die meisten anderen Anwendungsserver gestellt. Die Firewall-Regeln zwischen den Servern sind oft sehr freizügig, was dem Terminalserver potenziell weitreichenden Zugriff auf Backend-Systeme ermöglicht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den Netzwerkplan und die Firewall-Konfiguration und stellt fest, dass der Terminalserver im gleichen Segment wie kritische Backend-Server liegt und die Kommunikation zwischen ihnen kaum eingeschränkt ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a8-m3",
                    "uuid": "33cc6850-1eae-47d9-b4da-21a0921bef3c",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Terminalserver MUSS in einem dedizierten Netzsegment oder in einem Client-Netzsegment positioniert werden. Eine bestehende Netztrennung (z.B. zwischen Client- und Server-Netzen) DARF NICHT über einen Terminalserver umgangen werden können. Dies muss durch entsprechende Firewall-Regeln sichergestellt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für die Terminalserver wird ein eigenes VLAN (z.B. 'Terminal-Server-Zone') eingerichtet. Auf der Firewall werden Regeln erstellt, die die Kommunikation dieses Segments steuern. Insbesondere wird der Zugriff vom Terminalserver-Segment auf kritische Server-Segmente (z.B. Datenbank- oder Storage-Netze) auf die absolut notwendigen Ports und Protokolle beschränkt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft den Netzwerkplan und die Firewall-Konfiguration, um sicherzustellen, dass sich der Terminalserver in einem angemessenen Segment befindet. Die Firewall-Regeln, die den ausgehenden Verkehr vom Terminalserver-Segment regeln, werden analysiert, um zu verifizieren, dass keine Umgehung der Sicherheitszonen möglich ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a8-m4",
                    "uuid": "ab0f22d2-eab3-4224-aca4-138f44e6ae74",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Terminalserver wird in einer dedizierten DMZ-ähnlichen Zone platziert. Jeglicher Datenverkehr zu und von diesem Server, sowohl von Clients als auch zu Backend-Systemen, wird durch eine Firewall mit strengen 'Default-Deny'-Regeln kontrolliert und detailliert protokolliert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Terminalserver-Zone ist an der Firewall als eigene Schnittstelle konfiguriert. Jede benötigte Verbindung (z.B. zu einem bestimmten Applikationsserver auf Port TCP/1234) muss explizit durch eine eigene Firewall-Regel genehmigt werden. Alle anderen Verbindungen werden blockiert und geloggt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer führt eine detaillierte Überprüfung der Firewall-Regelsätze für die Terminalserver-Zone durch. Es wird geprüft, ob eine 'Any-Any-Allow'-Regel fehlt und ob alle Regeln nach dem Minimalprinzip erstellt wurden. Die Firewall-Logs werden auf blockierte Verbindungsversuche analysiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a8-m5",
                    "uuid": "a70e8fa3-408e-432c-bb26-7ef1471d5f8f",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Mikrosegmentierung wird eingesetzt, um jeden Terminalserver und potenziell sogar einzelne Anwendungen darauf voneinander zu isolieren. Die Kommunikationsrichtlinien werden auf der Ebene der Workloads durchgesetzt, unabhängig von ihrer Netzwerkadresse oder ihrem Standort, und folgen einem reinen Whitelist-Ansatz."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Mikrosegmentierungslösung (z.B. VMware NSX, Illumio) wird implementiert. Richtlinien werden basierend auf Metadaten (Labels) wie 'Anwendung: SAP', 'Umgebung: Produktion' definiert. Die Richtlinie 'SAP-App-Server dürfen nur über Port X mit SAP-DB-Servern kommunizieren' wird auf den virtuellen Netzwerkkarten der beteiligten VMs durchgesetzt, selbst wenn sie sich im selben Subnetz befinden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die definierten Mikrosegmentierungs-Richtlinien und deren Anwendung auf die Terminalserver-Workloads. Es wird die Visualisierung des erlaubten und blockierten Datenverkehrs in der Managementkonsole überprüft. Durch einen Portscan von einem Terminalserver aus wird verifiziert, dass nur die explizit erlaubten Ports auf Backend-Systemen erreichbar sind."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "7fc17921-398d-47fb-afbd-e6f80fb58269",
                "control-id": "ARCH.7.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a20-m3",
                    "uuid": "9e9c8fe8-3dc7-49ff-9d08-4be86f33a687",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Benutzenden von Terminalservern SOLLTEN anhand ähnlicher Berechtigungen und benötigter Anwendungen gruppiert werden. Ein Terminalserver SOLLTE NICHT mehreren Gruppen von Benutzenden zur Verfügung gestellt werden. Ist dies nicht möglich, SOLLTEN dedizierte Terminalserver pro Geschäftsprozess eingesetzt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden separate Terminalserver-Farmen (Silos) für verschiedene Benutzergruppen oder Sicherheitszonen aufgebaut. Beispielsweise gibt es eine Farm für die interne Verwaltung, eine für die Entwicklungsabteilung und eine weitere für externe Partner. Die Trennung erfolgt durch separate Server-VMs."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Architektur der Terminalserver-Umgebung und verifiziert, dass separate Server oder Farmen für die definierten Gruppen existieren. Es wird geprüft, welche Benutzergruppen auf welche Farm zugreifen dürfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a20-m4",
                    "uuid": "9edef612-8e8f-4101-afed-66010565ed3d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Trennung zwischen den verschiedenen Terminalserver-Farmen wird auf Netzwerkebene durchgesetzt. Firewall-Regeln verhindern jegliche direkte Kommunikation zwischen den Servern der unterschiedlichen Silos. Jedes Silo befindet sich in einem eigenen, dedizierten Netzsegment."
                      },
                      {
                        "name": "guidance",
                        "value": "Jede Terminalserver-Farm wird in einem eigenen VLAN platziert. Auf der zentralen Firewall werden Regeln konfiguriert, die jeglichen Datenverkehr zwischen diesen VLANs blockieren (deny inter-VLAN-routing), es sei denn, es gibt eine explizit genehmigte und dokumentierte Ausnahme."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Netzwerktopologie und die Firewall-Regeln zwischen den Terminalserver-Segmenten. Mit einem Portscanner wird von einem Server in Silo A versucht, einen Server in Silo B zu erreichen, um die Wirksamkeit der Trennung zu überprüfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a20-m5",
                    "uuid": "b46c328f-7b38-44a3-bc32-51e4507e57a2",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für Benutzergruppen mit besonders hohem Schutzbedarf oder widersprüchlichen Sicherheitsanforderungen (z.B. Administratoren von Sicherheitssystemen vs. externe Entwickler) werden physisch getrennte Terminalserver-Umgebungen mit eigener Infrastruktur (z.B. eigene Domänencontroller, eigene Gateways) betrieben."
                      },
                      {
                        "name": "guidance",
                        "value": "Für die Verwaltung von Tier-0-Systemen wird eine dedizierte 'Privileged Access Workstation (PAW)'-Umgebung aufgesetzt. Diese ist vollständig von der Standard-IT-Infrastruktur isoliert und hat keine Verbindung zum Internet. Externe Entwickler greifen auf eine separate, in einer DMZ gehärtete Umgebung zu, die keinerlei Verbindung zu internen Produktivsystemen hat."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Architekturdokumentation der verschiedenen, getrennten Umgebungen. Es wird die physische oder logische Trennung der Netzwerk- und Verwaltungsinfrastruktur verifiziert. Es wird geprüft, ob es Routing-Pfade oder gemeinsame Komponenten gibt, die die Trennung unterlaufen könnten."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "49f02c0b-cf88-4d4a-b02c-4a3a0f98d6eb",
                "control-id": "ASST.2.3.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a5-m2",
                    "uuid": "c1888d31-5e7a-4a8d-a7d4-f36094616286",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt Empfehlungen für die zu verwendende Terminal-Client-Software und deren Version. Die Nutzung von Thin Clients oder Fat Clients wird nicht explizit geregelt, und es gibt keine Vorgaben für das Betriebssystem oder die Hardware-Konfiguration der Clients."
                      },
                      {
                        "name": "guidance",
                        "value": "Das IT-Team stellt einen Link zum Download der empfohlenen Client-Software zur Verfügung. Es gibt keine technischen Kontrollen, die die Verwendung anderer Software oder älterer Versionen verhindern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fragt nach den Vorgaben für Client-Systeme und stellt fest, dass nur Empfehlungen für die Software existieren. Durch eine Stichprobe von Client-Systemen wird festgestellt, dass eine heterogene Landschaft von Software-Versionen und Betriebssystemen im Einsatz ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a5-m3",
                    "uuid": "608ae10e-33e5-4be3-9962-df68a2f8e44b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS festgelegt und dokumentiert werden, über welche Terminal-Client-Software auf den Terminalserver zugegriffen werden darf. Es MUSS festgelegt werden, auf welchen Clients (Thin/Fat Clients, Hardware-Konfiguration, Betriebssystem) diese Software ausgeführt werden darf. Weiterhin MUSS festgelegt werden, welche Software zusätzlich auf den Clients zugelassen ist und ob ein Client parallel auf verschiedene Terminalserver zugreifen darf."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Client-Standard wird definiert, der die erlaubten Hardwaremodelle, Betriebssystemversionen und die exakte Version der Terminal-Client-Software vorgibt. Diese Standards werden in einer Richtlinie dokumentiert. Für die Standard-Clients werden Images erstellt, die die erlaubte Softwarekonfiguration enthalten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Richtlinie für Client-Systeme an und verifiziert, dass alle in der Anforderung genannten Punkte (Software, Client-Typ, Hardware, OS, Zusatzsoftware, Parallelzugriff) geregelt sind. Anhand von Stichproben wird geprüft, ob die eingesetzten Clients der Richtlinie entsprechen. Ein automatischer Check kann mit einem Inventarisierungstool erfolgen, das `Get-WmiObject Win32_Product` oder `Get-ItemProperty HKLM:\\Software\\...` verwendet."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a5-m4",
                    "uuid": "59c39bff-eb89-4438-b2f2-c6d9ebe44455",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Einhaltung der Client-Standards wird durch ein zentrales Client-Management-System (Unified Endpoint Management) durchgesetzt. Nur autorisierte Software kann installiert werden, und die Konfiguration der Terminal-Client-Software wird zentral verwaltet und vorgegeben."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein System wie Microsoft Intune, VMware Workspace ONE oder Matrix42 wird verwendet, um Softwareverteilung, Konfigurationsmanagement und Patch-Management für alle Clients zu steuern. Die Konfiguration des Terminal-Clients (z.B. Serveradressen, Sicherheitseinstellungen) wird über das UEM-System verteilt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfigurationsprofile und Anwendungsrichtlinien im Client-Management-System. Es werden Berichte aus dem System analysiert, um die Compliance-Rate der Clients zu ermitteln."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a5-m5",
                    "uuid": "be8d0d77-463b-415b-9e54-02edf4ee0abd",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zugriff auf den Terminalserver wird durch eine technische Kontrolle (z.B. Network Access Control oder eine Funktion des Verbindungsgateways) an die Bedingung geknüpft, dass der Client die definierten Standards vollständig erfüllt (Device Posture Check). Clients, die nicht konform sind (z.B. veraltetes OS, fehlender Virenscanner, nicht autorisierte Software), erhalten keinen Zugriff."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine NAC-Lösung (z.B. Cisco ISE, Aruba ClearPass) oder die Conditional Access Policies eines Terminal-Gateways (z.B. Citrix Gateway, Azure AD Application Proxy) werden konfiguriert, um vor dem Verbindungsaufbau den Zustand des Clients zu überprüfen. Die Überprüfung umfasst Patch-Level, Antivirus-Status, Festplattenverschlüsselung und laufende Prozesse."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration der Device-Posture-Checks in der NAC- oder Gateway-Lösung. Es wird ein Test mit einem nicht-konformen Client durchgeführt, um zu verifizieren, dass der Zugriff blockiert wird. Die Logs des Systems werden auf blockierte Zugriffsversuche analysiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "3b238dac-4fb0-48a3-8156-8aae5d0ad1f7",
                "control-id": "BER.3.10",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a12-m2",
                    "uuid": "8eaf7dbd-87a1-4b13-8783-57c8611db213",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Inaktive Sitzungen werden nach einer gewissen Zeit automatisch getrennt (disconnect), aber nicht abgemeldet. Die Anwendungen des Benutzers laufen auf dem Server weiter."
                      },
                      {
                        "name": "guidance",
                        "value": "Über Gruppenrichtlinien wird nur der Timeout für das Trennen inaktiver Sitzungen konfiguriert. Dies schützt vor unbefugtem Zugriff auf einen ungesperrten Client, lässt aber potenziell ressourcenintensive Prozesse auf dem Server weiterlaufen und birgt das Risiko des Session Hijackings."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die GPOs für Sitzungs-Timeouts und stellt fest, dass nur der 'disconnect' Timeout gesetzt ist. Es wird eine Sitzung gestartet, gewartet, bis sie getrennt wird, und dann auf dem Server geprüft (z.B. mit dem Task-Manager), ob die Prozesse des Benutzers noch laufen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a12-m3",
                    "uuid": "f09edab4-a808-44c4-8d1a-49e824ccc13f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Inaktive Sitzungen SOLLTEN nach einem vordefinierten Zeitraum beendet (abgemeldet) werden. Der Zeitraum SOLLTE abhängig von der Benutzergruppe festgelegt werden. Benutzer SOLLTEN über die bevorstehende automatische Beendigung benachrichtigt werden. Der Benutzer SOLLTE automatisch vom Betriebssystem abgemeldet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Über Gruppenrichtlinien werden zwei Timeouts konfiguriert: Ein kürzerer für das Trennen der Sitzung (z.B. 30 Minuten Inaktivität) und ein längerer für das vollständige Abmelden der getrennten Sitzung (z.B. 60 Minuten nach dem Trennen). Die Windows-Standardbenachrichtigung wird verwendet, um den Benutzer zu warnen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die GPO-Einstellungen für Sitzungs-Timeouts (sowohl für 'disconnect' als auch für 'logoff'). Es wird verifiziert, dass die Abmeldung nach dem definierten Zeitraum tatsächlich erfolgt. Automatisiert können die relevanten Registry-Keys, die von den GPOs gesetzt werden, ausgelesen werden (`HKLM:\\SOFTWARE\\Policies\\Microsoft\\Windows NT\\Terminal Services`)."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a12-m4",
                    "uuid": "a816f9bc-1f27-43c7-871d-45c11347eff1",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden unterschiedliche Timeout-Richtlinien für verschiedene Benutzergruppen basierend auf deren Rolle und der Sensitivität der genutzten Daten angewendet. Privilegierte Benutzer oder Benutzer, die auf kritische Daten zugreifen, haben deutlich kürzere Inaktivitäts-Timeouts. Die Benachrichtigung ist anpassbar und gibt dem Benutzer ausreichend Zeit zu reagieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden mehrere GPOs mit unterschiedlichen Timeout-Einstellungen erstellt und über Sicherheitsgruppen-Filterung auf die jeweiligen Benutzergruppen angewendet. Zum Beispiel erhält die Gruppe 'Admins' einen Timeout von 15 Minuten, während die Gruppe 'Standardbenutzer' einen Timeout von 60 Minuten hat."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die verschiedenen GPOs und deren Verknüpfung mit den Benutzergruppen. Stichprobenartig wird für Benutzer aus verschiedenen Gruppen getestet, ob der korrekte Timeout angewendet wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a12-m5",
                    "uuid": "713d2e4f-259f-41a5-b1da-c7eb71fe09ef",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Timeout-Werte sind dynamisch und kontextabhängig. Das System berücksichtigt Faktoren wie den Netzwerkstandort des Clients (intern vs. extern), den Sicherheitsstatus des Geräts oder die Tageszeit, um das Risiko zu bewerten und den Timeout entsprechend anzupassen. Alle Abmeldeereignisse werden zentral protokolliert und auf Anomalien überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Skript, das durch den Taskplaner getriggert wird, oder eine erweiterte Funktion eines Terminalserver-Gateways wird verwendet, um die Sitzungen zu überwachen. Basierend auf den Sitzungsparametern (z.B. Client-IP-Adresse) wird dynamisch der passende Timeout für die Abmeldung gesetzt. Die Abmeldeereignisse werden an ein SIEM gesendet, das auf ungewöhnliche Muster prüft (z.B. hunderte Abmeldungen in kurzer Zeit)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das Skript oder die Konfiguration der Gateway-Richtlinien für die dynamischen Timeouts. Es wird getestet, ob eine Sitzung von einem als 'unsicher' klassifizierten Standort einen kürzeren Timeout erhält als eine Sitzung aus dem internen Netz. Die SIEM-Regeln zur Überwachung der Abmeldeereignisse werden überprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ed51777d-176f-442a-bdd9-440ce346492f",
                "control-id": "DET.3.1.9",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a13-m2",
                    "uuid": "b1916278-5b6b-4aa5-bb3b-158f76f2335d",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Protokollierung auf dem Terminalserver ist mit den Standardeinstellungen des Betriebssystems aktiviert. Die Protokolle werden lokal auf dem Server gespeichert und nicht zentral gesammelt oder regelmäßig ausgewertet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Windows-Ereignisanzeige enthält die Standardprotokolle. Diese werden nur bei akuten Problemen reaktiv durch einen Administrator eingesehen. Eine proaktive Überwachung findet nicht statt. Die Protokolle werden nach kurzer Zeit überschrieben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer öffnet die Ereignisanzeige auf dem Terminalserver und überprüft die Konfiguration der Protokollgröße und Aufbewahrungsrichtlinien. Es wird festgestellt, dass keine zentrale Protokollsammlung konfiguriert ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a13-m3",
                    "uuid": "7b5f1729-24e4-4ec5-8574-8601ac032aab",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE entschieden werden, welche Ereignisse an eine zentrale Protokollierungsinfrastruktur übermittelt werden. Hierbei SOLLTEN mindestens folgende spezifischen Ereignisse protokolliert werden: Anbindung von Peripheriegeräten der Clients, Aktionen auf dem Server durch Clients, die erweiterte Rechte benötigen, sowie Konfigurationsänderungen am Terminalserver-Dienst."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Überwachungsrichtlinien auf dem Terminalserver werden über GPOs so konfiguriert, dass die geforderten Ereignisse (z.B. durch Aktivierung der 'Audit PNP Activity' und erweiterter Prozessüberwachung) generiert werden. Ein Agent (z.B. Winlogbeat, NXLog) wird auf dem Server installiert, der diese Ereignisse an ein zentrales Log-Management-System (z.B. Graylog, ELK-Stack) weiterleitet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration der Überwachungsrichtlinien (Audit Policies) auf dem Terminalserver. Es wird verifiziert, dass ein Log-Forwarding-Agent installiert und korrekt konfiguriert ist. Im zentralen Log-Management-System wird stichprobenartig nach den geforderten Ereignistypen gesucht."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a13-m4",
                    "uuid": "71b5eb97-c633-4948-974e-83789e85800c",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die zentral gesammelten Protokolle werden durch automatisierte Regeln und Dashboards überwacht. Für kritische Ereignisse (z.B. eine Konfigurationsänderung am Terminalserver-Dienst) werden automatisch Alarme generiert, die den IT-Betrieb informieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Im zentralen Log-Management-System oder SIEM werden spezifische Dashboards für die Terminalserver-Überwachung erstellt. Korrelationsregeln werden definiert, die z.B. alarmieren, wenn ein normaler Benutzer versucht, eine administrative Aktion auszuführen, oder wenn ein USB-Gerät angeschlossen wird, das nicht auf der Whitelist steht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Dashboards und Alarmierungsregeln im Log-Management-System. Es wird geprüft, ob die Regeln die geforderten Ereignisse abdecken und ob es einen definierten Prozess zur Bearbeitung der Alarme gibt."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a13-m5",
                    "uuid": "2f32a37e-fb84-4b38-b1fa-d9406632b5be",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Protokolldaten werden in einem SIEM-System mit Verhaltensanalyse-Funktionen (UEBA) angereichert und korreliert. Das System erkennt automatisch anomales Verhalten, das auf einen Angriff hindeuten könnte (z.B. ein Benutzer meldet sich zu ungewöhnlichen Zeiten an, greift auf untypische Daten zu oder startet verdächtige Prozesse), und kann automatisierte Reaktionen auslösen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Terminalserver-Protokolle werden an ein SIEM mit UEBA-Modul (z.B. Splunk UBA, Microsoft Sentinel) gesendet. Das System lernt das normale Verhalten jedes Benutzers und jeder Entität und alarmiert bei signifikanten Abweichungen. Kritische Alarme können über SOAR-Playbooks eine automatische Reaktion auslösen, z.B. die sofortige Trennung der verdächtigen Sitzung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration des UEBA-Moduls und die erlernten Verhaltensbaselines. Es werden die vom System generierten Risiko-Scores für Benutzer und die ausgelösten Anomalie-Alarme analysiert. Es wird geprüft, ob SOAR-Playbooks für die automatisierte Reaktion konfiguriert sind."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "1ab7ddd7-0fa1-49cd-bbd4-d86d76437e6c",
                "control-id": "DET.4.14",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a14-m2",
                    "uuid": "321a773a-b375-46dc-8bca-daf74f537d99",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Terminalserver wird auf grundlegende Verfügbarkeit überwacht (z.B. durch einen Ping-Check). Eine detaillierte Überwachung von Leistungsparametern findet nicht statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein einfaches Monitoring-Tool prüft alle fünf Minuten, ob der Server auf einen Ping antwortet. Wenn nicht, wird eine E-Mail an den Administrator gesendet. CPU-, RAM- oder Netzwerkauslastung werden nicht erfasst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration des Monitoring-Tools und stellt fest, dass nur die Erreichbarkeit des Servers, aber keine Leistungsparameter überwacht werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a14-m3",
                    "uuid": "b374eb09-9700-45f4-87f2-baa14579880d",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Terminalserver SOLLTE zentral überwacht werden. Hierfür SOLLTEN mindestens die Auslastung der Server-Ressourcen, die Auslastung der Netzschnittstellen sowie die verfügbare Bandbreite und Latenz an den verbundenen Clients überwacht werden. Für das Monitoring SOLLTEN vorab Schwellwerte (Baselining) ermittelt und regelmäßig überprüft werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein zentrales Monitoring-System (z.B. Nagios, Zabbix, PRTG) wird eingesetzt, um die definierten Parameter (CPU, RAM, Netzwerk-I/O, Latenz) kontinuierlich zu erfassen. In einer anfänglichen Baselining-Phase werden die normalen Betriebswerte ermittelt. Darauf basierend werden Schwellwerte für Warnungen (z.B. CPU-Auslastung > 80%) und kritische Alarme (z.B. CPU > 95%) definiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Konfiguration der Überwachungs-Checks im Monitoring-System. Es wird überprüft, ob alle geforderten Parameter überwacht werden und ob sinnvolle, auf einem Baselining beruhende Schwellwerte definiert sind. Die Alarmierungskonfiguration wird ebenfalls geprüft. Automatisiert können die aktuellen Werte mit `Get-Counter` oder `vmstat` ausgelesen werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a14-m4",
                    "uuid": "fa0c17bf-5618-4c7c-ada3-8656732d702c",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Monitoring erfasst zusätzlich spezifische Metriken des Terminalserver-Dienstes, wie die Anzahl der aktiven und getrennten Sitzungen, die Latenz pro Sitzung und die von einzelnen Prozessen verursachte CPU-Last. Die Alarme werden automatisch in einem Ticketsystem erfasst."
                      },
                      {
                        "name": "guidance",
                        "value": "Spezifische Performance-Counter für die Remote Desktop Services werden in das Monitoring-System integriert. Die Alarme werden über eine API-Schnittstelle an das zentrale IT-Service-Management-Tool (z.B. Jira, ServiceNow) weitergeleitet, um eine nachverfolgbare Bearbeitung sicherzustellen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft, ob die terminalserver-spezifischen Metriken im Monitoring-System erfasst werden. Es wird die Integration mit dem Ticketsystem verifiziert, indem ein Test-Alarm ausgelöst und geprüft wird, ob ein entsprechendes Ticket erstellt wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a14-m5",
                    "uuid": "6129514a-7d70-45a2-84f8-17944b3d585a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein Application Performance Monitoring (APM)-Tool wird eingesetzt, das eine End-to-End-Sicht auf die Benutzererfahrung bietet. Es misst nicht nur die Server-Performance, sondern auch die tatsächlichen Antwortzeiten in der Anwendung, wie sie vom Benutzer wahrgenommen werden. Das System nutzt maschinelles Lernen, um anomale Leistungswerte und sich abzeichnende Probleme proaktiv zu erkennen."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine APM-Lösung wie Dynatrace oder AppDynamics wird implementiert. Sie überwacht die gesamte Service-Kette von der Benutzeraktion auf dem Client über den Terminalserver bis hin zu den Backend-Datenbanken. Anhand von KI-Algorithmen werden dynamische Baselines für tausende von Metriken erstellt und Abweichungen automatisch als Probleme mit Ursachenanalyse gemeldet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Service-Flow-Maps und die Dashboards zur Benutzererfahrung im APM-Tool. Es werden die automatisch erkannten Probleme und deren Ursachenanalysen überprüft. Es wird die Fähigkeit des Systems zur prädiktiven Warnung vor Kapazitätsengpässen analysiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "b8f357cd-dba4-426c-91e6-d9ea69817063",
                "control-id": "DET.4.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a19-m3",
                    "uuid": "57706044-0040-4eca-94a9-0ee8f983b635",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Terminalserver wird kontinuierlich darauf überwacht, ob die in SYS.1.9.A13 beschriebenen sicherheitsrelevanten Ereignisse auftreten. Der Server wird regelmäßig auf Schwachstellen überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Die in A13 definierten Protokolle werden an ein zentrales Log-Management-System gesendet. Dort werden einfache Alarme konfiguriert, z.B. bei der Anbindung eines Peripheriegeräts. Einmal im Monat wird ein authentifizierter Schwachstellenscan gegen den Terminalserver ausgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Alarmierungsregeln im Log-Management-System. Es werden die Berichte der letzten Schwachstellenscans angefordert und auf kritische, offene Schwachstellen geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a19-m4",
                    "uuid": "9ca29e62-e22f-42a4-92c7-de0d427baf63",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Terminalserver ist in ein Security Information and Event Management (SIEM)-System eingebunden. Die überwachten Ereignisse werden im SIEM hinsichtlich Anomalien und einfacher Angriffsmuster analysiert. Schwachstellenscans werden wöchentlich durchgeführt."
                      },
                      {
                        "name": "guidance",
                        "value": "Im SIEM werden Korrelationsregeln erstellt, die sicherheitsrelevante Ereignisse vom Terminalserver mit anderen Datenquellen (z.B. Firewall-Logs) verknüpfen. Es wird z.B. alarmiert, wenn ein Benutzerkonto innerhalb kurzer Zeit von vielen verschiedenen IP-Adressen Anmeldeversuche unternimmt. Die Ergebnisse der wöchentlichen Scans werden in einem Vulnerability-Management-Tool nachverfolgt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Korrelationsregeln und Dashboards im SIEM, die für den Terminalserver relevant sind. Es wird der Prozess zur Behebung der in den wöchentlichen Scans gefundenen Schwachstellen überprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a19-m5",
                    "uuid": "f7f6a3e0-f058-4b1f-9eac-c55be80680e3",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das SIEM analysiert die überwachten Ereignisse automatisiert hinsichtlich komplexer Anomalien und Angriffsmuster, idealerweise unter Nutzung von Machine Learning (UEBA). Die Ergebnisse der regelmäßigen Schwachstellenscans werden automatisch mit Bedrohungsinformationen angereichert und priorisiert. Ein Endpoint Detection and Response (EDR)-Agent ist auf dem Server aktiv."
                      },
                      {
                        "name": "guidance",
                        "value": "Das SIEM nutzt ein UEBA-Modul, um Abweichungen vom normalen Benutzerverhalten zu erkennen (z.B. Ausführung seltener Befehle, Zugriff auf ungewöhnliche Ressourcen). Ein EDR-Agent (z.B. Microsoft Defender for Endpoint) überwacht das System auf verdächtige Prozessaktivitäten und Taktiken, die von Scannern nicht erkannt werden, und kann verdächtige Prozesse automatisch beenden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration und die Alarme des UEBA- und EDR-Systems. Es wird analysiert, wie das System auf simulierte Angriffe (z.B. Ausführung eines Mimikatz-ähnlichen Tools) reagiert. Es wird geprüft, ob ein Prozess zur Bearbeitung der hoch-priorisierten Alarme etabliert ist."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "887137be-67fb-4f50-a5cb-bcd29ddd8017",
                "control-id": "KONF.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a4-m2",
                    "uuid": "8c09b0b2-2998-4375-b994-4796b6aae478",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Terminalserver wird mit den Standardeinstellungen installiert. Es werden nur die offensichtlichsten unsicheren Konfigurationen manuell angepasst, ohne einem dokumentierten Härtungsleitfaden zu folgen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Administrator installiert den Server und ändert möglicherweise das Administratorpasswort und aktiviert die Windows Firewall mit Standardregeln. Eine systematische Härtung findet nicht statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die Konfiguration des Servers mit einem anerkannten Härtungsstandard (z.B. CIS Benchmarks) und stellt zahlreiche Abweichungen und die Verwendung von Standardeinstellungen fest. Es wird das Fehlen einer internen Konfigurationsvorgabe festgestellt."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a4-m3",
                    "uuid": "7d11ca74-02bc-444c-8fd9-a045de6ebce4",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MÜSSEN dokumentierte Vorgaben für die sichere Konfiguration (Härtung) von Terminalservern erstellt werden. Dabei MÜSSEN Herstellerempfehlungen berücksichtigt werden. Die Vorgaben MÜSSEN vollständig umgesetzt und die Umsetzung dokumentiert werden. Die Konfigurationsvorgaben und deren Umsetzung MÜSSEN regelmäßig geprüft werden. Mindestens müssen Rollen und Berechtigungen, der Umfang der Protokollverschlüsselung, Authentisierungsfunktionen und die Möglichkeit zur Anzeige fremder Sitzungen berücksichtigt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein interner Härtungsleitfaden wird auf Basis von Herstellerdokumentationen und Best Practices (z.B. CIS, BSI) erstellt. Dieser Leitfaden wird als Checkliste bei jeder Serverinstallation abgearbeitet. Die Umsetzung wird über Gruppenrichtlinien (GPOs) oder Konfigurationsskripte sichergestellt. Die Konfiguration wird dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert den Härtungsleitfaden an und vergleicht ihn stichprobenartig mit der Konfiguration eines Terminalservers. Es wird geprüft, ob die Konfiguration dokumentiert ist und ob es einen Prozess zur regelmäßigen Überprüfung gibt. Ein automatischer Check könnte die angewandten GPOs auslesen: `gpresult /r`."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a4-m4",
                    "uuid": "9658ac68-b380-481b-a7f3-ca33ef1b0f92",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Einhaltung der Härtungsvorgaben wird regelmäßig und automatisiert mit einem Konfigurations-Scanner überprüft. Der Härtungsleitfaden wird mindestens jährlich und bei Bekanntwerden neuer Schwachstellen oder Angriffstechniken aktualisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Werkzeug wie der Microsoft Security Compliance Toolkit oder OpenSCAP wird eingesetzt, um die Serverkonfiguration automatisiert gegen die definierte Baseline zu prüfen. Abweichungen werden in einem Bericht erfasst und dem IT-Betrieb zur Behebung zugewiesen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Berichte des Konfigurations-Scanners und die Tickets, die zur Behebung von Abweichungen erstellt wurden. Es wird die Revisionshistorie des Härtungsleitfadens geprüft, um dessen Aktualität zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a4-m5",
                    "uuid": "f5e35e15-3923-4a0d-adf6-07597385abe6",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die sichere Konfiguration wird durch ein Desired State Configuration Management System durchgehend erzwungen. Jede manuelle oder unautorisierte Änderung, die von der Härtungs-Baseline abweicht, wird automatisch erkannt und in Echtzeit zurückgesetzt (Self-Healing)."
                      },
                      {
                        "name": "guidance",
                        "value": "Werkzeuge wie PowerShell DSC, Ansible oder Puppet werden verwendet, um den gewünschten Konfigurationszustand des Servers zu definieren und kontinuierlich durchzusetzen. Ein Agent auf dem Server überwacht den Zustand und korrigiert Abweichungen sofort. Alle Korrekturmaßnahmen werden zentral protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfigurationsdefinitionen (z.B. Ansible Playbooks, DSC-Konfigurationen). Um die Self-Healing-Fähigkeit zu testen, wird in einer Testumgebung eine Konfigurationsänderung manuell vorgenommen (z.B. Aktivierung eines unsicheren Dienstes) und verifiziert, dass diese Änderung innerhalb kurzer Zeit automatisch rückgängig gemacht wird. Die Protokolle des Konfigurationsmanagement-Systems werden auf entsprechende Einträge geprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "2fcf6b93-7e01-40cf-9bbf-564cbdc04b8a",
                "control-id": "KONF.2.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a17-m3",
                    "uuid": "4f78ed0c-73bd-43c4-8bdb-756c4af61ef7",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Jegliche Kommunikation zwischen Client und Terminalserver SOLLTE geeignet verschlüsselt werden. Dabei SOLLTEN sichere Protokolle gemäß BSI TR-02102 verwendet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Terminalserver wird so konfiguriert, dass er ausschließlich Verbindungen mit hoher Verschlüsselungsstufe (z.B. 128-Bit-TLS) akzeptiert. Veraltete oder unsichere Protokolle und Cipher-Suiten werden deaktiviert. Die Konfiguration orientiert sich an den aktuellen Empfehlungen der BSI TR-02102 'Kryptographische Verfahren: Empfehlungen und Schlüssellängen'."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des Terminalservers (z.B. über GPOs oder lokale Richtlinien) bezüglich der erzwungenen Verschlüsselungsstufe und der aktivierten Protokolle (z.B. TLS 1.2, TLS 1.3) und Cipher-Suiten. Ein automatischer Test kann mit Tools wie `testssl.sh` oder Qualys SSL Labs gegen das Verbindungsgateway durchgeführt werden, um die Konfiguration zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a17-m4",
                    "uuid": "2d769a37-5575-4281-a03f-9a5f06e791b0",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Konfiguration der Verschlüsselung wird automatisiert und regelmäßig auf Konformität mit den Vorgaben der BSI TR-02102 überprüft. Abweichungen werden alarmiert. Für die Server-Authentisierung werden ausschließlich Zertifikate aus einer vertrauenswürdigen, internen PKI verwendet."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Konfigurations-Scanner (wie in A4) wird mit einem Profil ausgestattet, das die Vorgaben der TR-02102 abbildet, und führt wöchentliche Scans durch. Die Terminalserver erhalten ihre Zertifikate automatisch über eine Auto-Enrollment-Funktion von einer internen Microsoft-CA."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Berichte des Konfigurations-Scanners. Es wird die Konfiguration der internen PKI und des Auto-Enrollments überprüft. Es wird verifiziert, dass die auf den Servern eingesetzten Zertifikate der internen Richtlinie entsprechen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a17-m5",
                    "uuid": "a5480080-c52e-417c-adb6-e17846781a18",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die für die Verschlüsselung verwendeten privaten Schlüssel der Terminalserver werden in einem Hardware-Sicherheitsmodul (HSM) geschützt. Die Einhaltung der Verschlüsselungsrichtlinien wird in Echtzeit überwacht, und Versuche, eine unsichere Verbindung aufzubauen, werden sofort blockiert und als Sicherheitsvorfall behandelt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Terminalserver sind so konfiguriert, dass sie für alle TLS-Operationen einen netzwerkbasierten oder lokalen HSM Key Storage Provider verwenden. Ein Intrusion Prevention System (IPS) im Netzwerk analysiert den TLS-Handshake von Verbindungsversuchen und blockiert solche, die veraltete Protokolle oder schwache Cipher-Suiten verwenden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration des Key Storage Providers auf dem Terminalserver und die Einbindung des HSMs. Die Signaturen und Regeln des IPS zur Erkennung von schwacher Kryptographie werden überprüft. Es wird ein Test mit einem Client durchgeführt, der absichtlich auf die Verwendung eines schwachen Protokolls (z.B. SSLv3) konfiguriert ist, um zu sehen, ob die Verbindung blockiert wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "28c56cd0-4493-493b-b1d6-f101bb4c7596",
                "control-id": "KONF.2.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a15-m2",
                    "uuid": "8bf47fb1-1f46-42d8-8860-5886032d7ca1",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Einige offensichtlich nicht benötigte Anwendungen und Dienste werden manuell deinstalliert oder deaktiviert. Eine systematische Überprüfung oder Beschränkung des Zugriffs auf Peripheriegeräte findet nicht statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Administrator entfernt nach der Installation des Betriebssystems einige Standard-Apps wie 'Spiele' oder 'Mail'. Peripheriegeräte wie USB-Sticks oder Drucker funktionieren ohne Einschränkungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Liste der installierten Programme und laufenden Dienste und stellt fest, dass immer noch viele nicht benötigte Komponenten vorhanden sind. Es wird getestet, ob der Zugriff auf lokale Client-Laufwerke oder USB-Sticks uneingeschränkt möglich ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a15-m3",
                    "uuid": "ec51e308-d619-45c3-a072-d213711205b7",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Nicht benötigte Anwendungen auf dem Terminalserver SOLLTEN entfernt oder deren Ausführung unterbunden werden. Der Zugriff aus einer Sitzung auf Peripheriegeräte SOLLTE auf die benötigten Geräte eingeschränkt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Als Teil des Server-Build-Prozesses wird ein Skript ausgeführt, das alle nicht für den Terminalserver-Betrieb erforderlichen Windows-Features und -Anwendungen entfernt. Über Gruppenrichtlinien wird die Umleitung von Peripheriegeräten gesteuert. Beispielsweise wird die Umleitung von Laufwerken und USB-Ports deaktiviert, während die Umleitung von Druckern und der Zwischenablage erlaubt bleibt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das Härtungsskript und die GPO-Einstellungen zur Gerätemobilisierung. Es wird auf dem Server überprüft, welche Anwendungen und Dienste aktiv sind. In einer Testsitzung wird verifiziert, dass der Zugriff auf die gesperrten Peripheriegeräte tatsächlich blockiert ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a15-m4",
                    "uuid": "b926046d-81a0-4c82-be75-ba13affc246d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird eine Application-Whitelisting-Lösung im Audit-Modus betrieben, um die tatsächlich genutzten Anwendungen zu identifizieren. Der Zugriff auf Peripheriegeräte wird granular gesteuert, sodass z.B. nur bestimmte, genehmigte USB-Geräte (anhand ihrer Seriennummer) verwendet werden können."
                      },
                      {
                        "name": "guidance",
                        "value": "Windows Defender Application Control oder AppLocker wird so konfiguriert, dass die Ausführung aller Programme protokolliert wird. Dies schafft eine Baseline für eine spätere Erzwingung. Eine Device-Control-Software eines Drittherstellers wird eingesetzt, um eine feingranulare Steuerung des USB-Ports zu ermöglichen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration der Application-Whitelisting-Lösung und die erfassten Protokolle. Die Richtlinien der Device-Control-Software werden analysiert. Es wird getestet, ob ein nicht genehmigter USB-Stick blockiert wird, während ein genehmigter funktioniert."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a15-m5",
                    "uuid": "6c4ecf69-5d88-45f7-9012-5520cfab99c4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Application Whitelisting wird im Erzwingungsmodus betrieben. Nur explizit genehmigte und signierte Anwendungen können ausgeführt werden. Jeglicher Versuch, andere Software auszuführen, wird blockiert und alarmiert. Der Zustand der Härtung wird kontinuierlich überwacht, und Abweichungen werden automatisch korrigiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die AppLocker- oder WDAC-Richtlinien sind im 'Enforce'-Modus aktiv. Die Liste der erlaubten Anwendungen wird streng verwaltet und ist Teil des Change-Management-Prozesses. Ein Desired State Configuration Management (wie in A4) stellt sicher, dass die Härtungseinstellungen (z.B. deaktivierte Dienste) permanent erhalten bleiben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass die Application-Whitelisting-Richtlinien im Erzwingungsmodus sind. Es wird versucht, eine nicht autorisierte portable Anwendung auszuführen, und geprüft, ob dies blockiert wird. Die Protokolle des DSC-Systems werden auf Konformitätsprüfungen und Korrekturen analysiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "076ba31e-bc1a-4300-ae5e-ab041327942c",
                "control-id": "KONF.4.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a10-m2",
                    "uuid": "145cbbe9-8557-4485-83e3-bace13f2485d",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die Anmeldung am Terminalserver werden lokale Benutzerkonten auf dem Server selbst verwaltet. Es gibt keine zentrale Verwaltung der Identitäten und Passwörter."
                      },
                      {
                        "name": "guidance",
                        "value": "Administratoren legen für jeden Benutzer ein Konto direkt in der Computerverwaltung des Terminalservers an. Passwörter müssen auf jedem Server separat geändert werden, und die Durchsetzung von Passwortrichtlinien ist inkonsistent."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer öffnet die lokale Benutzerverwaltung (lusrmgr.msc) auf dem Terminalserver und stellt die Existenz von lokalen Benutzerkonten fest. Es wird das Fehlen einer Anbindung an ein zentrales Verzeichnis geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a10-m3",
                    "uuid": "c6b387af-0eea-424c-a0db-eae4e98058cb",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die Benutzung von Terminalservern SOLLTE ein zentrales System zum Identitäts- und Berechtigungsmanagement eingesetzt werden. Alle Benutzerkonten und Gruppen werden zentral verwaltet."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Terminalserver wird als Mitgliedsserver in eine bestehende Active Directory-Domäne aufgenommen. Die Authentisierung erfolgt ausschließlich über Domänenkonten. Berechtigungen werden über Domänengruppen zugewiesen, die zentral verwaltet werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Domänenmitgliedschaft des Terminalservers. Es wird geprüft, ob die Anmeldeberechtigungen und andere wichtige Berechtigungen (z.B. Dateisystem) an Domänengruppen und nicht an lokale Konten oder einzelne Domänenbenutzer gebunden sind. Automatisiert kann die Domänenzugehörigkeit mit `(Get-WmiObject Win32_ComputerSystem).Domain` geprüft werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a10-m4",
                    "uuid": "af92232c-6e4e-49c2-a36b-9bb12225725b",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein dediziertes Identity and Access Management (IAM)-System wird verwendet, das über die Funktionen eines reinen Verzeichnisdienstes hinausgeht. Es bietet Funktionen wie Single Sign-On (SSO) zu den Terminalserver-Anwendungen und automatisierte Workflows für die Beantragung und Genehmigung von Zugriffen."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Terminalserver wird über einen Föderationsdienst (z.B. ADFS) oder einen Anwendungsproxy mit einer Cloud-IAM-Lösung (z.B. Azure AD) verbunden. Benutzer authentifizieren sich am IAM-System, das dann ein Ticket oder Token ausstellt, mit dem sich der Benutzer am Terminalserver anmeldet, ohne erneut ein Passwort eingeben zu müssen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des IAM-Systems und des Föderationsdienstes. Es wird der Workflow für die Beantragung und Genehmigung von Berechtigungen überprüft. Es wird getestet, ob der SSO-Prozess korrekt funktioniert."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a10-m5",
                    "uuid": "00a2feb4-6cd3-4623-96fb-05c6590bb743",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anbindung an das zentrale IAM-System erzwingt für alle Benutzer eine Multi-Faktor-Authentisierung (MFA). Der Zugriff für administrative Konten wird zusätzlich über eine Privileged Access Management (PAM)-Lösung gesteuert, die Passwörter verbirgt und Sitzungen aufzeichnet."
                      },
                      {
                        "name": "guidance",
                        "value": "Im IAM-System werden Conditional-Access-Richtlinien konfiguriert, die für den Zugriff auf den Terminalserver immer MFA erfordern. Administratoren können sich nicht mehr direkt am Server anmelden, sondern müssen ihre Verbindung über eine PAM-Lösung (z.B. CyberArk) aufbauen, die die Anmeldedaten automatisch einfügt und die Sitzung protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die MFA-Richtlinien im IAM-System. Es wird getestet, ob eine Anmeldung ohne zweiten Faktor fehlschlägt. Die Konfiguration der PAM-Lösung wird analysiert, und es wird geprüft, ob alle administrativen Konten über diese Lösung verwaltet werden und eine direkte Anmeldung blockiert ist."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "01550661-cb98-46e7-93fd-a47f63275c15",
                "control-id": "KONF.6.1.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a22-m3",
                    "uuid": "6fc53e43-63be-4a72-99f6-9d21719ab2cd",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Transfer von Anwendungsdaten zwischen dem Client und dem Terminalserver SOLLTE deaktiviert werden. Auch der Transfer der Zwischenablage SOLLTE deaktiviert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Über Gruppenrichtlinien oder Richtlinien des Verbindungsgateways werden die Funktionen 'Client-Laufwerksumleitung' und 'Zwischenablage-Umleitung' für alle Sitzungen deaktiviert. Benutzer können somit keine Dateien per Copy-Paste oder über zugeordnete Laufwerke zwischen ihrem lokalen Gerät und der Terminalserver-Sitzung verschieben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die entsprechenden Richtlinien (GPOs etc.) und verifiziert, dass die Umleitung von Laufwerken und der Zwischenablage deaktiviert ist. In einer Testsitzung wird versucht, eine Datei vom lokalen Desktop in die Sitzung zu kopieren, um die Wirksamkeit der Maßnahme zu überprüfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a22-m4",
                    "uuid": "29a7bdaa-e9d8-45ad-b956-965c7d62950f",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Richtlinien werden granular angewendet. Die Zwischenablage-Umleitung kann so konfiguriert werden, dass sie nur Text, aber keine Dateien oder Bilder erlaubt. Jegliche Versuche, gesperrte Transfer-Funktionen zu nutzen, werden zentral protokolliert und ausgewertet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Terminalserver-Protokoll-Richtlinien werden so verfeinert, dass die Zwischenablage nur in eine Richtung (z.B. vom Server zum Client) oder nur für bestimmte Datenformate (z.B. CF_TEXT) funktioniert. Die entsprechenden Audit-Einstellungen werden aktiviert, um fehlgeschlagene Umleitungsversuche in der Ereignisanzeige zu protokollieren und an ein SIEM weiterzuleiten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die granulare Konfiguration der Zwischenablage-Richtlinien. Es wird getestet, ob Text kopiert werden kann, während das Kopieren einer Datei blockiert wird. Die Protokolle im SIEM werden auf entsprechende Audit-Ereignisse analysiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a22-m5",
                    "uuid": "c43cdbe2-9c0a-4bb6-a46b-fbbe6732bc1d",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Data Loss Prevention (DLP)-Lösung ist integriert, die den Datenfluss über alle erlaubten Kanäle (z.B. erlaubte Zwischenablage, Drucken) inhaltlich überwacht. Versuche, sensible Informationen (z.B. Kreditkartennummern, Patientendaten) zu transferieren, werden erkannt und blockiert. Zusätzlich werden sichtbare Wasserzeichen in die Sitzungen eingeblend, um Screenshots zu entmutigen und zuzuordnen."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Host-basierte DLP-Lösung wird auf dem Terminalserver installiert oder eine netzwerkbasierte DLP-Lösung inspiziert den Datenverkehr des Gateways. Es werden DLP-Richtlinien definiert, die mittels regulärer Ausdrücke und Schlüsselwörtern nach sensiblen Datenmustern suchen. Die Wasserzeichenfunktion des Terminalserver-Protokolls wird aktiviert und so konfiguriert, dass sie Benutzername, IP-Adresse und Zeitstempel anzeigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration der DLP-Richtlinien und der Wasserzeichen. Es wird getestet, ob der Versuch, eine Datei mit fingierten sensiblen Daten zu kopieren oder zu drucken, von der DLP-Lösung blockiert wird. Es wird ein Screenshot einer Sitzung angefertigt und geprüft, ob das Wasserzeichen sichtbar und korrekt ist."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "04e003e8-665a-4517-95c0-6acac1f82f3a",
                "control-id": "KONF.6.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a11-m2",
                    "uuid": "483bdac2-6ffc-42e3-845a-24d5249ba5e5",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden servergespeicherte Profile (Roaming Profiles) verwendet, damit Benutzer an verschiedenen Servern dieselben Einstellungen haben. Es gibt jedoch keine spezifischen Sicherheitskonfigurationen oder Quotas für diese Profile."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Active Directory wird für jeden Benutzer ein Profilpfad zu einer Dateifreigabe eingetragen. Die Standardeinstellungen für Profile werden beibehalten, was zu großen Profilen ('bloated profiles') und langen Anmeldezeiten führen kann."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Benutzereigenschaften im Active Directory auf die Verwendung von servergespeicherten Profilen. Es wird die Konfiguration der Gruppenrichtlinien für Profile überprüft und festgestellt, dass keine Härtungsmaßnahmen oder Quotas definiert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a11-m3",
                    "uuid": "c518de9c-d98f-40f6-9c06-a30646b092ce",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Benutzende SOLLTEN ihre spezifischen Einstellungen (Benutzerprofile) NICHT derart ändern dürfen, dass die Informationssicherheit oder die Nutzung des Terminalservers eingeschränkt wird. Für die Benutzerprofile SOLLTE eine geeignete maximale Größe festgelegt werden. Wenn Verbünde aus Terminalservern eingesetzt werden, SOLLTEN die Benutzendenprofile zentral abgelegt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Mittels Gruppenrichtlinien (GPOs) werden Einstellungen für Benutzerprofile durchgesetzt. Insbesondere werden Änderungen an sicherheitsrelevanten Systembereichen (z.B. Registry-Teile, Systemsteuerungselemente) für normale Benutzer blockiert. Auf der Dateifreigabe für Profile werden Quotas eingerichtet, um die maximale Profilgröße zu begrenzen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Gruppenrichtlinien, die auf die Terminalserver und Benutzer angewendet werden, und sucht nach den entsprechenden Richtlinien zur Härtung von Benutzerprofilen. Die Konfiguration der Quotas auf dem Fileserver wird überprüft. Automatisiert können die GPO-Einstellungen mit `Get-GPOReport` ausgelesen werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a11-m4",
                    "uuid": "0cc28b1f-b947-41d4-8204-3262462000a6",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Lösung zur Virtualisierung von Benutzerprofilen (User Environment Virtualization) wird eingesetzt. Anstelle von klassischen Roaming Profiles werden nur die spezifischen Einstellungen der Benutzer bei An- und Abmeldung dynamisch geladen und gespeichert, was die Anmeldezeiten erheblich verkürzt und die Stabilität verbessert."
                      },
                      {
                        "name": "guidance",
                        "value": "Produkte wie Microsoft UE-V, Citrix Profile Management oder Ivanti User Workspace Manager werden implementiert. Es wird genau konfiguriert, welche Anwendungseinstellungen und Registry-Schlüssel im Profil des Benutzers gespeichert werden sollen, während der Rest des Profils bei Abmeldung verworfen wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration der UEV-Lösung. Es wird analysiert, welche Anwendungseinstellungen und Pfade für die Synchronisierung konfiguriert sind. Die Anmeldezeiten werden stichprobenartig gemessen und mit denen bei klassischen Roaming Profiles verglichen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a11-m5",
                    "uuid": "70d1a4d9-1188-4ca6-ab94-58b5de0cfc44",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Container-basierte Profillösungen werden verwendet, um das gesamte Benutzerprofil in einer VHD(X)-Datei zu kapseln, die bei der Anmeldung dynamisch gemountet wird. Dies bietet die beste Performance und Kompatibilität. Änderungen an Profilen, die die Sicherheit beeinträchtigen könnten, werden in Echtzeit überwacht und protokolliert."
                      },
                      {
                        "name": "guidance",
                        "value": "Microsoft FSLogix Profile Container wird implementiert und konfiguriert. Die Profil-Container werden auf einer hochverfügbaren und performanten Dateifreigabe gespeichert. Überwachungsregeln im SIEM werden erstellt, um verdächtige Änderungen innerhalb der gemounteten Profil-Container zu erkennen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die FSLogix-Konfiguration über GPOs. Es wird verifiziert, dass die Dateifreigabe für die Container hochverfügbar ist. Die SIEM-Regeln zur Überwachung von Profiländerungen werden analysiert. Es wird geprüft, ob bei der Anmeldung eines Benutzers der Profil-Container korrekt gemountet wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "5952fa67-3e4b-4a5d-bdc5-2d104a140255",
                "control-id": "KONF.6.4.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a3-m1",
                    "uuid": "9c419d38-b576-46cb-bda2-911871faa90b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Berechtigungen werden ad hoc auf Benutzerbasis vergeben. Es gibt kein definiertes Rollenkonzept. Oft werden Sammelkonten für Benutzergruppen verwendet, um den Verwaltungsaufwand zu reduzieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Wenn ein neuer Benutzer Zugriff benötigt, kopiert der Administrator die Berechtigungen eines bestehenden Benutzers. Es wird nicht systematisch geprüft, ob diese Berechtigungen dem Prinzip der geringsten Rechte entsprechen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Berechtigungsstruktur auf dem Terminalserver und stellt das Fehlen eines dokumentierten Rollenkonzepts fest. Durch Stichproben wird geprüft, ob Benutzer übermäßige Rechte besitzen und ob Sammelkonten verwendet werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a3-m2",
                    "uuid": "2173ba16-0bb8-4301-b2af-b3fbd41511c6",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt grundlegende Rollen wie 'Benutzer' und 'Administrator'. Alle regulären Benutzer erhalten dieselben, oft zu weitreichenden Berechtigungen. Die Nutzung von Sammelkonten wird vermieden, ist aber nicht explizit verboten."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Active Directory werden Gruppen wie 'TS-Users' und 'TS-Admins' erstellt und für die Zuweisung von Anmelderechten und grundlegenden Dateisystemberechtigungen verwendet. Eine feingranulare Steuerung pro Anwendung oder Funktion findet nicht statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Mitgliedschaften und Berechtigungen der eingerichteten Gruppen. Es wird verifiziert, dass keine Sammelkonten aktiv genutzt werden, stellt aber fest, dass die Berechtigungen innerhalb der 'TS-Users'-Gruppe nicht nach dem Need-to-know-Prinzip differenziert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a3-m3",
                    "uuid": "02ed8e2e-7861-42f4-b19a-5c9dd3d0b9f4",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS ein Rollen- und Berechtigungskonzept nach dem Prinzip der geringsten Rechte erstellt werden. Die Berechtigungen für folgende Tätigkeiten MÜSSEN mindestens festgelegt werden: Ausführen von Anwendungen in fremdem Kontext (z.B. 'root'), Zugriff auf betriebssystemspezifische Funktionen, Zugriff auf das Dateisystem des Servers und des Clients, Zugriff auf nachgelagerte Dienste sowie Datei- und Objekttransfer und Anbindung von Peripheriegeräten. Sammelkonten DÜRFEN NICHT verwendet werden, wenn es gegen interne Regelungen oder Lizenzbedingungen verstößt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein detailliertes Berechtigungskonzept wird dokumentiert, das verschiedene Benutzerrollen (z.B. 'Sachbearbeiter Finanzwesen', 'Controller', 'Administrator') definiert. Für jede Rolle werden die benötigten Zugriffe auf Anwendungen, Dateisysteme und Geräte präzise festgelegt. Die Umsetzung erfolgt durch granulare Sicherheitsgruppen und Richtlinien (z.B. GPOs)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das Rollen- und Berechtigungskonzept an und vergleicht es mit der technischen Umsetzung auf dem Terminalserver. Stichprobenartig wird für verschiedene Rollen geprüft, ob die Berechtigungen dem dokumentierten Konzept und dem Minimalprinzip entsprechen. Es wird verifiziert, dass keine unzulässigen Sammelkonten existieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a3-m4",
                    "uuid": "13a1d5be-297c-43ab-ac75-2b22ffbb76c1",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Rollen und Berechtigungen werden regelmäßig, mindestens halbjährlich, im Rahmen eines Re-Zertifizierungsprozesses überprüft. Die technische Trennung zwischen den Sitzungen verschiedener Benutzer wird durch zusätzliche Härtungsmaßnahmen sichergestellt, um eine unbefugte Kommunikation oder einen unbefugten Zugriff zwischen Sitzungen zu verhindern."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Identity-Management-System wird genutzt, um automatisierte Workflows für die Access-Reviews zu implementieren, bei denen die Vorgesetzten die Zugriffe ihrer Mitarbeiter bestätigen müssen. Spezifische Betriebssystem-Härtungseinstellungen werden angewendet, um die Sitzungsisolation zu verstärken."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Protokolle der letzten Access-Review-Kampagnen. Es wird die Konfiguration der Betriebssystem-Härtung zur Sitzungsisolation überprüft. Ein Test könnte darin bestehen, als Benutzer A zu versuchen, auf Prozesse oder Dateisystemobjekte von Benutzer B zuzugreifen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a3-m5",
                    "uuid": "04852573-d598-4300-a2fa-8b7a4e8b2636",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Rollen- und Berechtigungsmanagement ist vollständig in eine zentrale IAM-Lösung (Identity and Access Management) integriert. Privilegierte Zugriffe werden über eine PAM-Lösung (Privileged Access Management) gesteuert, die Just-in-Time-Berechtigungen ermöglicht und alle privilegierten Sitzungen aufzeichnet. Jegliche Versuche des unbefugten Zugriffs zwischen Sitzungen werden in Echtzeit erkannt und blockiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine IAM-Lösung wie Azure AD, Okta oder Keycloak verwaltet den gesamten Lebenszyklus von Identitäten und deren Zugriffen. Eine PAM-Lösung wie CyberArk oder Thycotic schleust administrative Verbindungen ein, verbirgt die Passwörter und zeichnet die Sitzungen als Video auf. Ein EDR-Agent (Endpoint Detection and Response) auf dem Server überwacht die Prozessinteraktionen und blockiert unzulässige Zugriffe."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration des IAM- und des PAM-Systems. Es werden die Sitzungsaufzeichnungen von privilegierten Zugriffen stichprobenartig gesichtet. Es wird verifiziert, dass administrative Anmeldungen nur über das PAM-System möglich sind. Automatisiert könnte geprüft werden, ob der EDR-Agent aktiv ist und seine Schutzfunktionen aktiviert sind: `Get-Service -Name EDRService | Select-Object -Property Status`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "8c18dc92-b087-4c16-a27e-a5db0eae01fe",
                "control-id": "KONF.7.15",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a7-m2",
                    "uuid": "cafce87d-83c5-4f18-9551-34907bf9ca04",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zugriff auf den Terminalserver ist auf das interne Netz beschränkt. Die Standard-Verschlüsselung des Terminalserver-Protokolls ist aktiviert, aber es wird keine zusätzliche Absicherung wie eine VPN-Kapselung oder eine strenge gegenseitige Authentisierung verwendet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Firewall erlaubt den Zugriff aus dem gesamten LAN. Die Verschlüsselungseinstellung im Terminalserver-Dienst ist auf einem Standardwert wie 'Client-kompatibel' belassen. Benutzer authentifizieren sich mit Passwort, der Client prüft aber nicht zwingend die Identität des Servers."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Firewall-Regeln und die Verschlüsselungseinstellungen des Terminalserver-Dienstes. Mit einem Netzwerk-Sniffer (z.B. Wireshark) wird stichprobenartig geprüft, ob die Kommunikation verschlüsselt ist, auch wenn die Stärke der Verschlüsselung nicht optimal sein mag."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a7-m3",
                    "uuid": "764fab7b-23ce-49ed-91ae-ab7d5f534b32",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS festgelegt werden, über welche Netze auf den Terminalserver zugegriffen werden darf. Es MUSS festgelegt werden, wie die Kommunikation abgesichert wird, inklusive der Verschlüsselung mit dem Terminalserver-Protokoll. Falls die Protokollverschlüsselung nicht ausreicht, MUSS die Kommunikation zusätzlich (z.B. per VPN) abgesichert werden. Bei Zugriff aus unzureichend vertrauenswürdigen Netzen MÜSSEN sich sowohl die Benutzenden als auch der Terminalserver authentisieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Firewall-Regeln werden so konfiguriert, dass der Zugriff nur aus definierten, vertrauenswürdigen Client-Netzen erlaubt ist. Der Terminalserver wird konfiguriert, eine hohe Verschlüsselungsstufe zu erzwingen. Dem Server wird ein Zertifikat von einer vertrauenswürdigen PKI zugewiesen, damit Clients seine Identität prüfen können (Server-Authentisierung)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Firewall-Regeln für den Zugriff auf den Terminalserver. Die Konfiguration des Terminalserver-Dienstes bezüglich Verschlüsselung und Authentisierung wird geprüft. Es wird verifiziert, dass der Server ein gültiges Zertifikat verwendet und Clients zur Prüfung dieses Zertifikats konfiguriert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a7-m4",
                    "uuid": "39c0836c-418d-4044-ab96-734d1c10ddd7",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der gesamte Zugriff auf den Terminalserver wird über ein dediziertes und gehärtetes Gateway (z.B. RDP-Gateway, Citrix ADC) geleitet. Dieses Gateway erzwingt eine starke Authentisierung der Benutzer (z.B. mit Zwei-Faktor-Authentisierung) und eine Überprüfung der Client-Konformität, bevor der Zugriff auf den eigentlichen Terminalserver erlaubt wird."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Microsoft RDP Gateway oder ein vergleichbares Produkt wird in einer DMZ installiert. Es wird mit einem RADIUS-Server für die Multi-Faktor-Authentisierung (MFA) integriert. Auf dem Gateway werden Richtlinien (Connection Authorization Policies, Resource Authorization Policies) definiert, die genau festlegen, welcher Benutzer von wo auf welchen Server zugreifen darf."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des Gateways, inklusive der Anbindung an die MFA-Lösung und der definierten Zugriffsrichtlinien. Es wird getestet, ob ein Zugriff ohne zweiten Faktor oder von einem nicht autorisierten Client blockiert wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a7-m5",
                    "uuid": "20d5d4ec-2c98-4c26-8137-a00fa0bc0178",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zugriff wird nach einem Zero-Trust-Modell verwaltet. Jede einzelne Zugriffsanfrage wird individuell authentisiert und autorisiert, basierend auf der Identität des Benutzers, dem Zustand des Endgeräts und dem Kontext. Die Netzwerkverbindung wird erst nach erfolgreicher Prüfung dynamisch und nur für die spezifische Sitzung aufgebaut (Just-in-Time Access)."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Zero Trust Network Access (ZTNA)-Lösung wird implementiert. Anstatt Clients in ein Netzwerk zu lassen, baut der ZTNA-Connector des Clients einen ausgehenden, verschlüsselten Tunnel zum nächstgelegenen ZTNA-PoP auf. Nach starker Authentisierung und Überprüfung der Gerätesicherheit stellt der ZTNA-Dienst eine direkte, gesicherte Verbindung zur angeforderten Anwendung auf dem Terminalserver her, ohne dem Client breiten Netzwerkzugriff zu gewähren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Zero-Trust-Zugriffsrichtlinien in der ZTNA-Managementkonsole. Es wird verifiziert, dass ein Benutzer nur auf die für ihn freigegebenen Anwendungen zugreifen kann und kein anderer Netzwerkzugriff möglich ist. Die Protokolle werden auf Zugriffsentscheidungen basierend auf Benutzer-, Geräte- und Kontext-Risiko analysiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "35fe7f00-36ee-4fbf-a28b-cd7df872806e",
                "control-id": "KONF.9.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.1.9-a21-m3",
                    "uuid": "8468fe45-e665-45c4-8a93-5ca142ac164d",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Terminalserver SOLLTE hochverfügbar betrieben werden. Dazu SOLLTEN der Terminalserver sowie dessen Netzanbindung redundant ausgelegt werden. Die verwendeten Terminalserver SOLLTEN im Verbund (Cluster) betrieben werden. Für die zugreifenden Clients SOLLTEN Ersatzgeräte bereitgehalten werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Mindestens zwei Terminalserver werden in einer Farm zusammengefasst und über einen Load Balancer oder einen Connection Broker betrieben. Jeder Server ist mit zwei Netzwerkkarten an zwei verschiedene Switches angeschlossen (NIC-Teaming). Im Lager werden einige vorkonfigurierte Ersatz-Clients vorgehalten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des Connection Brokers und der Serverfarm. Die Netzwerkkonfiguration der Server wird auf Redundanz geprüft. Es wird der Bestand an Ersatz-Clients kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a21-m4",
                    "uuid": "d0658263-4154-43d8-aff1-c902024b09ae",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle zentralen Komponenten der Terminalserver-Infrastruktur, einschließlich der Connection Broker, Lizenzserver und Gateways, sind redundant ausgelegt und verfügen über eine automatische Failover-Funktion. Die Server der Farm sind auf unterschiedliche physische Host-Systeme verteilt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Connection Broker werden im High-Availability-Modus betrieben, der eine SQL-Datenbank zur Synchronisierung des Zustands nutzt. Die Gateway-Appliances sind als HA-Paar konfiguriert. In der Virtualisierungsumgebung werden Anti-Affinitätsregeln erstellt, um sicherzustellen, dass die VMs der Terminalserver-Farm nicht auf demselben physischen Host laufen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die HA-Konfiguration der Broker, Gateways und der Virtualisierungsplattform. Es wird ein Failover-Test durchgeführt, indem eine aktive Komponente (z.B. ein Server oder Gateway) heruntergefahren und geprüft wird, ob die Sitzungen unterbrechungsfrei auf die redundante Komponente umgeschaltet werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.1.9-a21-m5",
                    "uuid": "3f36a0ca-b748-4eb9-a2b7-b3b9ca2c235c",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Terminalserver-Infrastruktur ist auf zwei geografisch getrennte Rechenzentren verteilt (Geo-Cluster). Im Falle eines Totalausfalls eines Standorts kann der Betrieb vollständig vom zweiten Standort übernommen werden. Der Failover-Prozess ist automatisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Active/Active- oder Active/Passive-Architektur wird über zwei Rechenzentren implementiert. Ein Global Server Load Balancing (GSLB)-System leitet die Benutzeranfragen an das jeweils verfügbare Rechenzentrum. Benutzerprofildaten und andere zentrale Konfigurationen werden zwischen den Standorten repliziert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die standortübergreifende Architektur und die Konfiguration des GSLB und der Datenreplikation. Es werden die Notfallhandbücher und die Protokolle der letzten Desaster-Recovery-Tests geprüft. Es wird verifiziert, dass ein Failover zwischen den Standorten die definierten RTO- und RPO-Ziele einhält."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}