{
  "component-definition": {
    "uuid": "ee255871-b28f-441b-b952-0706ba7f4914",
    "metadata": {
      "title": "SYS.4.5 IT-Produkte - Benutzerdefiniert",
      "last-modified": "2025-11-15T16:31:53.876732+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "963edb23-d666-4138-93d2-6d4fe2bcdb8f",
        "type": "hardware",
        "title": "SYS.4.5 IT-Produkte",
        "description": "This component represents the implementation of all controls for Baustein SYS.4.5.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Wechseldatenträger werden oft eingesetzt, um Daten zu transportieren, zu speichern oder um mobil auf sie zugreifen zu können. Zu Wechseldatenträgern gehören externe Festplatten, CD-ROMs, DVDs, Speicherkarten, Magnetbänder und USB-Sticks.<BR>Wechseldatenträger sind danach klassifizierbar, ob sie nur lesbar, einmalig beschreibbar oder wiederbeschreibbar sind. Unterschiede gibt es auch bei der Art der Datenspeicherung (analog oder digital) oder ihrer Bauform. So gibt es auswechselbare Datenträger (z. B. verbaute Festplatten) oder externe Datenspeicher (z. B. USB-Sticks)."
          },
          {
            "name": "Zielsetzung",
            "value": "In diesem Baustein wird aufgezeigt, wie Wechseldatenträger sicher genutzt werden können. Außerdem wird beschrieben, wie verhindert werden kann, dass über Wechseldatenträger unbeabsichtigt Informationen weitergegeben werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein SYS.4.5 Wechseldatenträger ist auf jeden Wechseldatenträger im Informationsverbund anzuwenden.<BR>Dieser Baustein beschäftigt sich mit den Sicherheitseigenschaften von Wechseldatenträgern. Der Schutz der IT-Systeme, an denen die Wechseldatenträger angeschlossen werden können, wird in dem vorliegenden Baustein nicht berücksichtigt. Empfehlungen hierzu sind in den Bausteinen SYS.1.1 Allgemeiner Server und SYS.2.1 Allgemeiner Client sowie den betriebssystemspezifischen Bausteinen zu finden.<BR>Wechseldatenträger speichern Daten elektronisch, magnetisch oder auf andere, nicht direkt wahrnehmbare Weise. Sie verarbeiten dabei selbst keine Daten. Die Anforderungen an solche Geräte, wie z. B. Smartphones und Tablets, werden im Baustein SYS.3.2.1 Allgemeine Smartphones und Tablets aufgeführt. Nicht zu den Wechseldatenträgern zählen auch Cloud-Speicher. Anforderungen an Cloud-Umgebungen sind im Baustein OPS.2.2 Cloud-Nutzung zu finden.<BR>Wechseldatenträger können bei persönlichen Treffen oder auch per Versand ausgetauscht werden. Der sichere Austausch der eigentlichen Informationen wird in diesem Baustein nicht betrachtet. Dazu sind die Anforderungen des Bausteins CON.9 Informationsaustausch zu erfüllen."
          },
          {
            "name": "Sorglosigkeit im Umgang mit Informationen",
            "value": "Häufig gibt es in Institutionen zwar organisatorische Regelungen und technische Sicherheitsverfahren für Wechseldatenträger, diese werden jedoch oft durch einen sorglosen Umgang mit den Wechseldatenträgern umgangen. So kommt es etwa vor, dass Wechseldatenträger während einer Pause unbeaufsichtigt im Besprechungsraum zurück- oder auch im Zugabteil liegen gelassen werden."
          },
          {
            "name": "Unzureichende Kenntnis über Regelungen",
            "value": "Wenn die Regelungen für den korrekten Umgang mit Wechseldatenträgern nicht hinreichend bekannt sind, können sie sich auch nicht eingehalten werden. So können zahlreiche Gefährdungen hinsichtlich der Informationssicherheit eintreten, zum Beispiel, wenn nicht geprüfte USB-Sticks an die IT-Systeme der Institution angeschlossen werden."
          },
          {
            "name": "Diebstahl oder Verlust von Wechseldatenträgern",
            "value": "Bei Wechseldatenträgern ist das Risiko von Datenverlusten höher als bei stationären IT-Systemen. Ursachen für Datenverluste sind etwa Diebstahl oder verlorengegangene Geräte. Die auf den Wechseldatenträgern abgelegten Informationen sind in diesen Fällen oft unwiederbringlich verloren. Außerdem können die Informationen Externen in die Hände fallen."
          },
          {
            "name": "Defekte Datenträger",
            "value": "Wechseldatenträger sind aufgrund ihrer Größe und Anwendungsbereiche anfällig für Beschädigungen, Fehler oder Ausfälle. Ursache sind beispielsweise ständig wechselnde Einsatzumgebungen oder mechanische Einwirkungen."
          },
          {
            "name": "Beeinträchtigung durch wechselnde Einsatzumgebung",
            "value": "Wechseldatenträger werden in sehr unterschiedlichen Umgebungen eingesetzt und sind dadurch vielen Gefährdungen ausgesetzt. Dazu gehören beispielsweise schädigende Umwelteinflüsse wie zu hohe oder zu niedrige Temperaturen und Staub oder Feuchtigkeit. Hinzu kommen beispielsweise Transportschäden. Ein weiterer wichtiger Aspekt ist, dass Wechseldatenträger oft in Bereichen mit unterschiedlichem Sicherheitsniveau benutzt werden."
          },
          {
            "name": "Verbreitung von Schadsoftware",
            "value": "Wechseldatenträger werden oft benutzt, um Daten zwischen verschiedenen Geräten und dem Arbeitsplatzrechner auszutauschen. Schadsoftware könnte Daten auf den Wechseldatenträgern kompromittieren und sich so auf die Arbeitsplatzrechner übertragen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "405e0264-e4aa-498d-a9b3-97b8063a147d",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/it-produkte_profile.json",
            "description": "Implementation for all controls in Baustein SYS.4.5",
            "implemented-requirements": [
              {
                "uuid": "08ec2187-3b6f-4dc6-a9d6-902f0c7e1367",
                "control-id": "BES.4.8.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BES",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.4.5-a15-m3",
                    "uuid": "38736490-3b15-41eb-b0df-147b0fc3355a",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für den Einsatz mit schutzbedürftigen Daten werden ausschließlich Wechseldatenträger von etablierten und vertrauenswürdigen Herstellern beschafft. Es werden Modelle ausgewählt, die eine integrierte Hardware-Verschlüsselung anbieten."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Beschaffungsprozess gibt es eine Positivliste von Herstellern und Modellen, die für den Einsatz freigegeben sind. Diese Liste wird regelmäßig auf Basis von Marktrecherchen und Sicherheitsempfehlungen gepflegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Beschaffungsrichtlinie und die Positivliste. Anhand von Kaufbelegen und Inventarlisten wird stichprobenartig geprüft, ob nur freigegebene Modelle beschafft und eingesetzt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a15-m4",
                    "uuid": "c748d2e7-fdcf-4b22-9fec-1ca9a391f4cb",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE nur Wechseldatenträger verwenden, die zertifiziert sind. Die Zertifizierung SOLLTE insbesondere eine integere Datenerhaltung sowie möglicherweise vorhandene Verschlüsselungsverfahren umfassen. Es werden bevorzugt Datenträger mit einer Zertifizierung nach anerkannten Standards wie FIPS 140-2/-3 oder Common Criteria (CC) eingesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Beschaffungsrichtlinie fordert explizit eine Zertifizierung nach FIPS 140-2 Level 2 (oder höher) oder eine vergleichbare CC-Zertifizierung für alle neu anzuschaffenden Hardware-verschlüsselten Wechseldatenträger. Die Zertifikate der Produkte werden vor dem Kauf geprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert anhand der Beschaffungsunterlagen, dass die angeschafften Produkte über die geforderten Zertifikate verfügen. Die Gültigkeit der Zertifikate wird auf den Webseiten der zertifizierenden Stellen (z.B. NIST, BSI) überprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a15-m5",
                    "uuid": "0622329f-07e8-412e-bf90-8cb2c51167c4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden ausschließlich Wechseldatenträger eingesetzt, die eine BSI-Zulassung für den Einsatz mit Verschlusssachen besitzen oder eine äquivalente, anerkannte nationale Zertifizierung aufweisen. Die Konformität der gelieferten Geräte mit dem zertifizierten Muster wird bei der Warenannahme überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Beschaffung ist auf eine kleine Auswahl von Modellen mit BSI-Zulassung beschränkt. Die Lieferkette wird gesichert, um Manipulationen (Supply-Chain-Angriffe) zu verhindern. Bei der Annahme wird die exakte Modell- und Firmware-Version mit den Zulassungsdokumenten abgeglichen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Zulassungsdokumente und die Prozesse zur Sicherung der Lieferkette und der Warenannahme. Es wird physisch verifiziert, dass die im Einsatz befindlichen Geräte exakt den zugelassenen Modellen entsprechen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "59415d1b-0cd0-44fb-b1fa-8f9606e99744",
                "control-id": "BES.7.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "TEST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.4.5-a16-m3",
                    "uuid": "fbdca02a-95d6-421e-94cd-ce4cd5cdfae1",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist ein dediziertes, vom produktiven Netzwerk getrenntes IT-System (Scan-Station) eingerichtet. Alle Wechseldatenträger aus unbekannten oder nicht vertrauenswürdigen Quellen MÜSSEN an dieser Station auf Schadsoftware überprüft werden, bevor ihre Daten weiterverwendet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Standard-PC wird als Scan-Station verwendet. Er ist nicht Mitglied der Domäne und befindet sich in einem separaten VLAN ohne Routing ins produktive Netz. Er ist mit einer aktuellen Antivirensoftware ausgestattet. Eine Arbeitsanweisung regelt die verpflichtende Nutzung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz und die Netzwerkisolation der Scan-Station. Die Aktualität der Antivirensoftware und die Bekanntheit der Arbeitsanweisung bei den Mitarbeitern werden geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a16-m4",
                    "uuid": "8cca7613-e1ef-4238-9b06-98d785c76311",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE dedizierte IT-Systeme als Datenschleuse verwenden, bei denen Daten von einem Wechseldatenträger auf einen anderen übertragen werden und dabei auf Schadsoftware untersucht werden. Die Datenschleuse ist ein gehärtetes System und nutzt mehrere unterschiedliche Scan-Engines (Multi-Scanner), um die Erkennungsrate zu erhöhen. Der Datentransfer ins interne Netz ist nur über einen kontrollierten Weg möglich."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Datenschleuse ist ein physikalisch oder logisch (Air Gap) getrenntes System. Sie ist mit spezieller Kiosk-Software ausgestattet, die einen geführten Prozess zum Scannen und kontrollierten Transfer der Daten erzwingt. Der Transfer erfolgt z.B. auf einen internen, freigegebenen Wechseldatenträger oder über eine schreibgeschützte Netzwerkfreigabe."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Architektur und Härtung der Datenschleuse. Es wird die Konfiguration der Multi-Scanner-Lösung und des kontrollierten Transfermechanismus geprüft. Die Wirksamkeit wird durch einen Test mit verschiedenen Malware-Samples nachgewiesen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a16-m5",
                    "uuid": "65905654-535a-489c-9fed-ae32b9e6c39b",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Datenschleuse ist ein vollautomatisches System, das neben Virenscans auch eine dynamische Analyse in einer Sandbox und eine Inhaltsdesinfektion (Content Disarm and Reconstruction, CDR) durchführt. Jegliche aktive oder potenziell schädliche Inhalte werden vor dem Transfer ins interne Netz entfernt oder neutralisiert. Der Transfer ist nur über eine Daten-Diode oder einen vergleichbaren, streng unidirektionalen Mechanismus möglich."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine kommerzielle oder Open-Source-basierte Kiosklösung mit integrierter Sandbox und CDR-Technologie wird eingesetzt. Die Logs aller Scan-, Analyse- und Transfervorgänge werden zentral in einem SIEM gespeichert und überwacht. Die Daten-Diode stellt die physikalische Trennung der Netzwerke sicher."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die detaillierte Konfiguration der Sandbox- und CDR-Komponenten sowie der Daten-Diode. Es wird die Fähigkeit des Systems verifiziert, auch unbekannte (Zero-Day) Malware durch Verhaltensanalyse zu erkennen und zu blockieren. Die Log-Analyse im SIEM wird geprüft."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}