{
  "component-definition": {
    "uuid": "efdcd535-fbac-4df3-bf31-4c6339635195",
    "metadata": {
      "title": "SYS.4.5 IT-Produkte - Benutzerdefiniert",
      "last-modified": "2025-11-22T12:46:12.498073+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "ddc36a01-c968-4442-9efc-ab7c6092fea9",
        "type": "hardware",
        "title": "SYS.4.5 IT-Produkte",
        "description": "This component represents the implementation of all controls for Baustein SYS.4.5.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Wechseldatenträger werden oft eingesetzt, um Daten zu transportieren, zu speichern oder um mobil auf sie zugreifen zu können. Zu Wechseldatenträgern gehören externe Festplatten, CD-ROMs, DVDs, Speicherkarten, Magnetbänder und USB-Sticks.<BR>Wechseldatenträger sind danach klassifizierbar, ob sie nur lesbar, einmalig beschreibbar oder wiederbeschreibbar sind. Unterschiede gibt es auch bei der Art der Datenspeicherung (analog oder digital) oder ihrer Bauform. So gibt es auswechselbare Datenträger (z. B. verbaute Festplatten) oder externe Datenspeicher (z. B. USB-Sticks)."
          },
          {
            "name": "Zielsetzung",
            "value": "In diesem Baustein wird aufgezeigt, wie Wechseldatenträger sicher genutzt werden können. Außerdem wird beschrieben, wie verhindert werden kann, dass über Wechseldatenträger unbeabsichtigt Informationen weitergegeben werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein SYS.4.5 Wechseldatenträger ist auf jeden Wechseldatenträger im Informationsverbund anzuwenden.<BR>Dieser Baustein beschäftigt sich mit den Sicherheitseigenschaften von Wechseldatenträgern. Der Schutz der IT-Systeme, an denen die Wechseldatenträger angeschlossen werden können, wird in dem vorliegenden Baustein nicht berücksichtigt. Empfehlungen hierzu sind in den Bausteinen SYS.1.1 Allgemeiner Server und SYS.2.1 Allgemeiner Client sowie den betriebssystemspezifischen Bausteinen zu finden.<BR>Wechseldatenträger speichern Daten elektronisch, magnetisch oder auf andere, nicht direkt wahrnehmbare Weise. Sie verarbeiten dabei selbst keine Daten. Die Anforderungen an solche Geräte, wie z. B. Smartphones und Tablets, werden im Baustein SYS.3.2.1 Allgemeine Smartphones und Tablets aufgeführt. Nicht zu den Wechseldatenträgern zählen auch Cloud-Speicher. Anforderungen an Cloud-Umgebungen sind im Baustein OPS.2.2 Cloud-Nutzung zu finden.<BR>Wechseldatenträger können bei persönlichen Treffen oder auch per Versand ausgetauscht werden. Der sichere Austausch der eigentlichen Informationen wird in diesem Baustein nicht betrachtet. Dazu sind die Anforderungen des Bausteins CON.9 Informationsaustausch zu erfüllen."
          },
          {
            "name": "Sorglosigkeit im Umgang mit Informationen",
            "value": "Häufig gibt es in Institutionen zwar organisatorische Regelungen und technische Sicherheitsverfahren für Wechseldatenträger, diese werden jedoch oft durch einen sorglosen Umgang mit den Wechseldatenträgern umgangen. So kommt es etwa vor, dass Wechseldatenträger während einer Pause unbeaufsichtigt im Besprechungsraum zurück- oder auch im Zugabteil liegen gelassen werden."
          },
          {
            "name": "Unzureichende Kenntnis über Regelungen",
            "value": "Wenn die Regelungen für den korrekten Umgang mit Wechseldatenträgern nicht hinreichend bekannt sind, können sie sich auch nicht eingehalten werden. So können zahlreiche Gefährdungen hinsichtlich der Informationssicherheit eintreten, zum Beispiel, wenn nicht geprüfte USB-Sticks an die IT-Systeme der Institution angeschlossen werden."
          },
          {
            "name": "Diebstahl oder Verlust von Wechseldatenträgern",
            "value": "Bei Wechseldatenträgern ist das Risiko von Datenverlusten höher als bei stationären IT-Systemen. Ursachen für Datenverluste sind etwa Diebstahl oder verlorengegangene Geräte. Die auf den Wechseldatenträgern abgelegten Informationen sind in diesen Fällen oft unwiederbringlich verloren. Außerdem können die Informationen Externen in die Hände fallen."
          },
          {
            "name": "Defekte Datenträger",
            "value": "Wechseldatenträger sind aufgrund ihrer Größe und Anwendungsbereiche anfällig für Beschädigungen, Fehler oder Ausfälle. Ursache sind beispielsweise ständig wechselnde Einsatzumgebungen oder mechanische Einwirkungen."
          },
          {
            "name": "Beeinträchtigung durch wechselnde Einsatzumgebung",
            "value": "Wechseldatenträger werden in sehr unterschiedlichen Umgebungen eingesetzt und sind dadurch vielen Gefährdungen ausgesetzt. Dazu gehören beispielsweise schädigende Umwelteinflüsse wie zu hohe oder zu niedrige Temperaturen und Staub oder Feuchtigkeit. Hinzu kommen beispielsweise Transportschäden. Ein weiterer wichtiger Aspekt ist, dass Wechseldatenträger oft in Bereichen mit unterschiedlichem Sicherheitsniveau benutzt werden."
          },
          {
            "name": "Verbreitung von Schadsoftware",
            "value": "Wechseldatenträger werden oft benutzt, um Daten zwischen verschiedenen Geräten und dem Arbeitsplatzrechner auszutauschen. Schadsoftware könnte Daten auf den Wechseldatenträgern kompromittieren und sich so auf die Arbeitsplatzrechner übertragen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "06c70342-f5a9-4310-9993-4aa1a5f74aa9",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Kompendien/Grundschutz%2B%2B-Kompendium/profile/it-produkte_profile.json",
            "description": "Implementation for all controls in Baustein SYS.4.5",
            "implemented-requirements": [
              {
                "uuid": "9943d6bc-572c-4f24-ae1b-11f7c93296e2",
                "control-id": "BES.3.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ASST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.4.5-a17-m3",
                    "uuid": "308d5349-b5b3-4c04-9722-5872c17ed9a6",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Falls Wechseldatenträger verwendet werden, um Daten für lange Zeiträume zu speichern, MUSS die Institution sicherstellen, dass die verwendeten Wechseldatenträger dafür geeignet sind. Die Integrität der Daten SOLLTE regelmäßig überprüft werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für die Langzeitarchivierung werden nur Medien verwendet, die vom Hersteller für diesen Zweck spezifiziert sind (z.B. spezielle LTO-Bänder, M-DISC DVDs). Es wird ein Plan für regelmäßige Integritätsprüfungen (z.B. jährliches Einlesen und Vergleichen von Checksummen) erstellt und umgesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Richtlinie zur Langzeitarchivierung, die Spezifikationen der verwendeten Medien und die Protokolle der durchgeführten Integritätsprüfungen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a17-m4",
                    "uuid": "637b6b66-1c1f-40dc-aa20-f7d5f1d01909",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die Langzeitarchivierung wird eine Strategie zur Datenmigration umgesetzt. Diese sieht vor, die Daten in regelmäßigen Abständen (z.B. alle 5-7 Jahre) auf neue Datenträgergenerationen oder -technologien zu kopieren, um Medienalterung und technischer Obsoleszenz vorzubeugen. Es werden mindestens zwei Kopien der Archivdaten auf unterschiedlichen Medien an getrennten, sicheren Orten gelagert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein formaler Migrationsplan ist Teil des Archivierungskonzepts. Die Lagerungsorte erfüllen definierte Anforderungen an Brandschutz, Klimatisierung und Zutrittskontrolle. Die Integritätsprüfungen umfassen auch regelmäßige Tests der Wiederherstellbarkeit."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den Migrationsplan und die Dokumentation der Lagerungsorte. Die Protokolle der durchgeführten Migrationen und Wiederherstellungstests werden kontrolliert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "003b2a17-8035-469b-b075-250c8f6a45a3",
                "control-id": "BES.4.6.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ASST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.4.5-a14-m3",
                    "uuid": "17003bbc-d12b-48f0-9aab-cfd9a3c54efd",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Beim Versand von Wechseldatenträgern mit vertraulichen Informationen MUSS eine Versandart gewählt werden, die eine Nachverfolgung der Sendung erlaubt. Die Verpackung MUSS robust sein, um physische Schäden zu vermeiden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist in einer Richtlinie festgelegt, dass für den Versand solcher Datenträger nur Paketdienste mit Sendungsverfolgung (Tracking) genutzt werden dürfen. Es werden gepolsterte Versandtaschen oder Kartons verwendet. Die Trackingnummer wird dem Empfänger mitgeteilt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Versandrichtlinie und prüft anhand von Versandbelegen, ob nachverfolgbare Versandarten verwendet wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a14-m4",
                    "uuid": "f89d5c9d-edb8-42ac-8c06-5a20b7903d04",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution MUSS überprüfen, wie vertrauliche Informationen bei einem Versand angemessen geschützt werden können. Es MUSS eine sichere Versandverpackung für Wechseldatenträger verwendet werden, bei der Manipulationen sofort zu erkennen sind. Die Institution MUSS alle Beteiligten auf notwendige Versand- und Verpackungsarten hinweisen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden manipulationssichere Versandtaschen oder Kartons mit Sicherheitssiegeln verwendet. Die eindeutigen Nummern der Siegel werden vor dem Versand erfasst und dem Empfänger auf einem separaten Weg mitgeteilt. Der Empfänger ist angewiesen, die Unversehrtheit des Siegels bei Erhalt zu prüfen und Unregelmäßigkeiten sofort zu melden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer begutachtet die verwendeten Verpackungsmaterialien und Siegel. Anhand von Versandprotokollen wird der Prozess der Siegelnummern-Kommunikation und der Empfangsbestätigung inklusive Siegelprüfung kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a14-m5",
                    "uuid": "c4dcff57-6e91-4024-acc2-6eafa8eeca7b",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für den Versand von Wechseldatenträgern mit sehr hoch schutzbedürftigen Daten wird ein Werttransport- oder Kurierdienst mit einer durchgehenden, dokumentierten und versicherten Transportkette (Chain of Custody) eingesetzt. Alternativ erfolgt der Transport durch persönlich bekannte und überprüfte Boten."
                      },
                      {
                        "name": "guidance",
                        "value": "Es bestehen Verträge mit spezialisierten Sicherheitslogistik-Unternehmen. Der gesamte Transportweg wird lückenlos dokumentiert, jede Übergabe wird quittiert. Die Auswahl des Dienstleisters und des Verfahrens richtet sich nach einer vorangegangenen Risikobewertung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Verträge mit den Kurierdiensten und die für einen Versand erstellte Chain-of-Custody-Dokumentation. Es wird geprüft, ob die Auswahl der Versandart der Schutzbedarfsfeststellung der Daten entspricht."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ab9b098c-00dd-40b6-98a0-60b04fa3d901",
                "control-id": "BES.4.8.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BES",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.4.5-a15-m3",
                    "uuid": "ae90f44b-955c-4366-95d3-768d1c9b4447",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für den Einsatz mit schutzbedürftigen Daten werden ausschließlich Wechseldatenträger von etablierten und vertrauenswürdigen Herstellern beschafft. Es werden Modelle ausgewählt, die eine integrierte Hardware-Verschlüsselung anbieten."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Beschaffungsprozess gibt es eine Positivliste von Herstellern und Modellen, die für den Einsatz freigegeben sind. Diese Liste wird regelmäßig auf Basis von Marktrecherchen und Sicherheitsempfehlungen gepflegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Beschaffungsrichtlinie und die Positivliste. Anhand von Kaufbelegen und Inventarlisten wird stichprobenartig geprüft, ob nur freigegebene Modelle beschafft und eingesetzt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a15-m4",
                    "uuid": "13ac5686-9656-4292-9eed-21629f837416",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE nur Wechseldatenträger verwenden, die zertifiziert sind. Die Zertifizierung SOLLTE insbesondere eine integere Datenerhaltung sowie möglicherweise vorhandene Verschlüsselungsverfahren umfassen. Es werden bevorzugt Datenträger mit einer Zertifizierung nach anerkannten Standards wie FIPS 140-2/-3 oder Common Criteria (CC) eingesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Beschaffungsrichtlinie fordert explizit eine Zertifizierung nach FIPS 140-2 Level 2 (oder höher) oder eine vergleichbare CC-Zertifizierung für alle neu anzuschaffenden Hardware-verschlüsselten Wechseldatenträger. Die Zertifikate der Produkte werden vor dem Kauf geprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert anhand der Beschaffungsunterlagen, dass die angeschafften Produkte über die geforderten Zertifikate verfügen. Die Gültigkeit der Zertifikate wird auf den Webseiten der zertifizierenden Stellen (z.B. NIST, BSI) überprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a15-m5",
                    "uuid": "ac846fd7-7ee8-4209-b9f6-7751c614bc14",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden ausschließlich Wechseldatenträger eingesetzt, die eine BSI-Zulassung für den Einsatz mit Verschlusssachen besitzen oder eine äquivalente, anerkannte nationale Zertifizierung aufweisen. Die Konformität der gelieferten Geräte mit dem zertifizierten Muster wird bei der Warenannahme überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Beschaffung ist auf eine kleine Auswahl von Modellen mit BSI-Zulassung beschränkt. Die Lieferkette wird gesichert, um Manipulationen (Supply-Chain-Angriffe) zu verhindern. Bei der Annahme wird die exakte Modell- und Firmware-Version mit den Zulassungsdokumenten abgeglichen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Zulassungsdokumente und die Prozesse zur Sicherung der Lieferkette und der Warenannahme. Es wird physisch verifiziert, dass die im Einsatz befindlichen Geräte exakt den zugelassenen Modellen entsprechen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "60b181de-2ad3-413d-8f8e-b9039ddd4f4f",
                "control-id": "BES.5.10.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "REA",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.4.5-a2-m3",
                    "uuid": "b9a42449-d0a4-43aa-92da-acf1af3cdb62",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Benutzenden MÜSSEN umgehend melden, wenn ein Wechseldatenträger gestohlen oder verloren wurde oder der Verdacht einer Manipulation besteht. Die Benutzenden MÜSSEN bei ihrer Meldung angeben, welche Informationen auf dem Wechseldatenträger gespeichert sind. Hierfür MUSS es in der Institution klare Meldewege und Zuständigkeiten geben. Die Institution MUSS festlegen, wie Wechseldatenträger behandelt werden sollen, die nach einem Verlust wiedergefunden wurden. Wiedergefundene Wechseldatenträger DÜRFEN NICHT ohne vorherige Überprüfung auf Manipulation und Schadsoftware verwendet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein klar definierter Meldeprozess wird etabliert, z. B. über ein Ticket-System oder eine dedizierte E-Mail-Adresse des IT-Supports. Ein Standardverfahren für die Behandlung wiedergefundener Datenträger wird dokumentiert, das eine forensische Untersuchung auf einer isolierten Workstation vorsieht, bevor der Datenträger wieder freigegeben wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz und Bekanntheit des Meldeweges durch Einsicht in die Dokumentation und Interviews mit Mitarbeitern. Anhand von Beispielen (Testfälle oder vergangene Vorfälle) wird geprüft, ob der Prozess zur Behandlung wiedergefundener Datenträger eingehalten wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a2-m4",
                    "uuid": "7d7cf44d-ae7e-4515-ad22-3e6ce42277f2",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Meldeprozess für verlorene oder manipulierte Wechseldatenträger ist in das zentrale Incident-Response-Management integriert. Die Meldungen werden nach Kritikalität der potenziell kompromittierten Daten klassifiziert, um eine priorisierte Bearbeitung sicherzustellen. Es gibt einen dokumentierten Prozess, der auch die Einleitung von Maßnahmen wie Remote-Sperrung oder -Löschung vorsieht, falls technisch möglich."
                      },
                      {
                        "name": "guidance",
                        "value": "Meldungen werden über ein zentrales Incident-Management-Tool erfasst. Ein Playbook für den Verlust von Wechseldatenträgern definiert klare Eskalationspfade und Reaktionsmaßnahmen, abhängig von der Datenklassifikation. Die Inventarliste der Wechseldatenträger wird genutzt, um den potenziellen Schaden abzuschätzen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Incident-Response-Pläne und Playbooks bezüglich des Verlusts von Wechseldatenträgern. Anhand der Protokolle vergangener Vorfälle wird die korrekte Klassifizierung, Eskalation und Bearbeitung der Meldungen überprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a2-m5",
                    "uuid": "9906edef-936b-44fe-8e0e-2acd2c15a41b",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Prozess der Verlust- und Manipulationsmeldung ist weitgehend automatisiert. Die Meldung durch einen Benutzer löst automatisch Workflows aus, die z. B. den Zugriff des zugehörigen Datenträgers auf IT-Systeme blockieren, den Datenschutzbeauftragten informieren und je nach Kritikalität einen vordefinierten Incident-Response-Prozess starten. Wiedergefundene Datenträger werden in einer gesicherten forensischen Umgebung automatisiert auf Manipulationen und Schadsoftware analysiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Meldung erfolgt über ein Self-Service-Portal, das mit dem Asset-Management und dem SIEM-System gekoppelt ist. Automatisierte SOAR-Playbooks (Security Orchestration, Automation, and Response) führen die initialen Reaktionsschritte aus. Die Analyse wiedergefundener Medien erfolgt in einer Sandbox-Umgebung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der automatisierten Workflows im Incident-Management- oder SOAR-Tool. Es wird durch einen Testfall verifiziert, dass eine Meldung die korrekten automatischen Reaktionen auslöst und die forensische Analyseumgebung den definierten Standards entspricht."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "a32fbf2b-0107-4a39-afbd-7fe2581cf986",
                "control-id": "BES.5.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ASST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.4.5-a11-m3",
                    "uuid": "e7980b69-48fc-49f2-b78e-944c556b5c9d",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für vertrauliche Informationen auf Wechseldatenträgern MUSS ein Verfahren zum Schutz der Integrität eingesetzt werden. Hierfür werden Checksummen (z.B. SHA-256) für die zu schützenden Dateien oder Container erstellt. Die Checksummen werden auf einem separaten, sicheren Weg an den Empfänger übermittelt."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Arbeitsanweisung beschreibt, wie Benutzer mit einem Standard-Tool Checksummen für ihre Daten erstellen und wie diese zu übermitteln sind (z.B. per Telefon oder separater E-Mail). Der Empfänger wird angewiesen, die Checksumme nach Erhalt der Daten zu verifizieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Arbeitsanweisung und prüft durch Nachfrage bei den Benutzern, ob das Verfahren bekannt ist und angewendet wird. Anhand von Beispielen wird der Prozess nachvollzogen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a11-m4",
                    "uuid": "fe6571ca-0e2c-4dfd-b9b1-40a7d769d936",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zum Schutz der Integrität und Authentizität der Daten werden digitale Signaturen verwendet. Die Dateien oder Datencontainer auf dem Wechseldatenträger werden mit einem persönlichen oder abteilungsbezogenen Zertifikat signiert. Die Verfahren zum Schutz vor Veränderungen SOLLTEN dem aktuellen Stand der Technik entsprechen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Institution betreibt eine eigene Public-Key-Infrastruktur (PKI) oder nutzt einen vertrauenswürdigen externen Anbieter, um Zertifikate für die Benutzer auszustellen. Die Signaturerstellung und -prüfung ist in die verwendeten Anwendungen (z.B. Packprogramme, Dokumentensoftware) integriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Konfiguration der PKI und die Richtlinien zur Zertifikatsvergabe. Es wird stichprobenartig geprüft, ob ausge tauschte Daten korrekt digital signiert sind und ob die Signaturprüfung beim Empfänger ordnungsgemäß funktioniert."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a11-m5",
                    "uuid": "939264d6-f1e1-4ec1-b793-f21379ebe88d",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Prozess der Signaturerstellung und -prüfung ist vollständig automatisiert. Ein zentrales System signiert alle auf offizielle Wechseldatenträger geschriebenen Daten automatisch mit einem organisationsweiten Zertifikat. Beim Lesen der Daten auf einem anderen System der Institution wird die Signatur automatisch überprüft und bei einer Verletzung der Integrität wird der Zugriff verweigert und ein Alarm ausgelöst."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Endpoint-Protection-Lösung mit Gerätekontrolle übernimmt die automatische Signierung und Prüfung. Die privaten Schlüssel für die Signatur sind sicher in einem Hardware Security Module (HSM) gespeichert. Integritätsverletzungen werden an ein zentrales SIEM gemeldet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der Endpoint-Lösung und des HSM. Durch einen Test, bei dem eine Datei auf einem Wechseldatenträger nach dem Signieren manipuliert wird, wird verifiziert, dass der Zugriff beim erneuten Lesen blockiert und der Vorfall gemeldet wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "18416764-991b-48ed-8441-2a9fe609751d",
                "control-id": "BES.5.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SENS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.4.5-a1-m1",
                    "uuid": "5e61da9a-050e-4dc8-b708-7fc7d1ac2d4d",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Sensibilisierung der Mitarbeitenden zum sicheren Umgang mit Wechseldatenträgern erfolgt nur sporadisch, beispielsweise nach einem Sicherheitsvorfall, erreicht aber nicht alle relevanten Personen."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine einmalige E-Mail-Rundsendung oder ein Aushang am schwarzen Brett sind typische Beispiele für eine nur teilweise umgesetzte Sensibilisierung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch Stichproben bei Mitarbeitenden fest, dass keine regelmäßige und flächendeckende Sensibilisierung stattfindet und das Wissen über die korrekte Handhabung lückenhaft ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a1-m2",
                    "uuid": "da95cedf-2182-40ba-9ac2-71ce2a0ac5f3",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Mitarbeitenden werden im Rahmen der Einstellung grundlegend über den Umgang mit Wechseldatenträgern informiert. Die Information umfasst die wichtigsten Verbote, wie den Anschluss fremder USB-Sticks."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Sensibilisierung ist ein fester Bestandteil der Onboarding-Unterlagen für neue Mitarbeitende, wird aber später nicht wiederholt oder vertieft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert anhand der Einstellungsdokumentation, dass eine grundlegende Sensibilisierung für alle neuen Mitarbeitenden erfolgt."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a1-m3",
                    "uuid": "99005b00-16b0-43f3-918f-d35aa6c2615f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Benutzenden MÜSSEN für den sicheren Umgang mit Wechseldatenträgern sensibilisiert werden. Die Institution MUSS insbesondere darauf hinweisen, wie die Benutzenden mit Wechseldatenträgern umgehen sollten, um einem Verlust oder Diebstahl vorzubeugen und eine lange Lebensdauer zu gewährleisten. Die Institution MUSS die Benutzenden darüber informieren, dass sie keine Wechseldatenträger, die aus unbekannten Quellen stammen, an ihre IT-Systeme anschließen dürfen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Sensibilisierung wird durch regelmäßige, dokumentierte Schulungen (z. B. jährlich) oder durch gezielte Informationskampagnen umgesetzt. Die Inhalte basieren auf der geltenden Richtlinie für Wechseldatenträger."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Schulungsunterlagen und die Teilnahmelisten der Sensibilisierungsmaßnahmen. Durch Interviews mit Mitarbeitenden wird stichprobenartig überprüft, ob die Kernbotschaften verstanden wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a1-m4",
                    "uuid": "8144ee54-535c-4dc8-9cb3-678853d7a265",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Sensibilisierungsmaßnahmen sind zielgruppenspezifisch gestaltet. Mitarbeitende, die häufig sensible Daten auf Wechseldatenträgern transportieren, erhalten eine vertiefte Schulung. Die Wirksamkeit der Schulungen wird durch Wissenstests überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Neben allgemeinen Schulungen werden für bestimmte Rollen (z. B. Administratoren, Vertriebsaußendienst) spezielle Module angeboten, die auf deren spezifische Risiken eingehen. Die Ergebnisse der Wissenstests fließen in die Verbesserung der Schulungsinhalte ein."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Differenzierung der Schulungsinhalte nach Zielgruppen und prüft die Ergebnisse der durchgeführten Wissenstests sowie die daraus abgeleiteten Verbesserungsmaßnahmen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.4.5-a1-m5",
                    "uuid": "12252399-bee3-4d55-ab42-42653cd18cc0",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Sensibilisierung ist in ein kontinuierliches Security-Awareness-Programm integriert, das durch regelmäßige, realistische Phishing-Tests mit präparierten USB-Sticks (USB-Dropping) ergänzt wird. Die Ergebnisse werden analysiert und führen zu automatisierten, individuellen Nachschulungen."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Security-Awareness-Plattform wird genutzt, um die Kampagnen zu steuern, durchzuführen und auszuwerten. Mitarbeitende, die einen Test-USB-Stick anschließen, erhalten sofort eine aufklärende Information und werden automatisch für ein kurzes E-Learning-Modul gebucht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer begutachtet die Konzeption, Durchführung und die detaillierten Auswertungen der USB-Dropping-Kampagnen. Es wird verifiziert, dass die Ergebnisse nachweislich zur Verbesserung des Sicherheitsbewusstseins und zur Anpassung der Schulungsstrategie führen."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}