{
  "component-definition": {
    "uuid": "7789bef6-23a4-4038-9158-584fcf3441a1",
    "metadata": {
      "title": "SYS.4.4 Allgemeines IoT-Gerät - Benutzerdefiniert",
      "last-modified": "2025-11-15T16:31:53.768200+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "ddafb0e8-bc8b-4643-bf5a-98b38193ea35",
        "type": "hardware",
        "title": "SYS.4.4 Allgemeines IoT-Gerät",
        "description": "This component represents the implementation of all controls for Baustein SYS.4.4.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Geräte mit Funktionen aus dem Bereich Internet of Things (IoT) sind, im Gegensatz zu klassischen Endgeräten, vernetzte Geräte oder Gegenstände, die zusätzliche „smarte“ Funktionen besitzen. IoT-Geräte werden in der Regel drahtlos an Datennetze angeschlossen. Die meisten Geräte können auf Informationen im Internet zugreifen und darüber erreicht werden. Hierdurch können sie Auswirkungen auf die Informationssicherheit des gesamten Informationsverbunds haben.<BR><BR>IoT-Geräte, wie Smartwatches oder andere Wearables, können in Institutionen gelangen, indem sie durch Mitarbeitende oder Externe am Körper getragen werden. In vielen Institutionen werden aber auch IoT-Geräte beschafft und betrieben, darunter etwa Brand-, Gas- und andere Warnmelder, Kaffeemaschinen oder Elemente der Gebäudesteuerung wie Kameras und HVAC (Heating, Ventilation and Air Conditioning).<BR><BR>Generell kann zwischen direkt adressierbaren IoT-Geräten und IoT-Geräten, die eine zentrale Steuereinheit voraussetzen, unterschieden werden. Direkt adressierbare Geräte werden in der Regel mit einer eigenen IP-Adresse an das LAN angeschlossen oder haben einen eigenen direkten Netzanschluss, z. B. mittels Mobilfunk, und können autark agieren oder durch eine zentrale Steuereinheit verwaltet werden. Daneben gibt es IoT-Geräte, die ausschließlich direkt mit Steuereinheiten kommunizieren, z. B. über Funknetze wie Bluetooth oder ZigBee, und somit nicht direkt an bestehende Datennetze angeschlossen werden."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es, IoT-Geräte so abzusichern, dass über diese weder die Informationssicherheit der eigenen Institution noch die von Außenstehenden beeinträchtigt wird. Daher sollte sowohl ein unautorisierter Datenabfluss als auch die Manipulation der Geräte verhindert werden, speziell mit Blick auf Angriffe durch Dritte."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein SYS.4.4 Allgemeines IoT-Gerät ist auf jedes Gerät mit Funktionalitäten aus dem Bereich Internet of Things (IoT) anzuwenden.<BR><BR>Dieser Baustein beschäftigt sich allgemein mit IoT-Geräten und soll für ein großes Spektrum unterschiedlicher IoT-Geräte anwendbar sein. Auf dedizierte Sicherheitseigenschaften, etwa von Bedien- und Anzeigesystemen oder spezifischen Hard- und Software-Architekturen, wird nicht näher eingegangen.<BR><BR>Je nach Ausprägung der IoT-Geräte sind die Übergänge zu industriellen Steuerungssystemen (ICS-Systemen) oder eingebetteten Systemen fließend. Anforderungen an Geräte, die im Bereich Produktion und Fertigung eingesetzt werden, sind in den Bausteinen der Schicht IND Industrielle IT zu finden.<BR><BR>Eingebettete Systeme hingegen sind informationsverarbeitende Systeme, die in ein größeres System oder Produkt integriert sind, dort Steuerungs-, Regelungs- und Datenverarbeitungsaufgaben übernehmen und dabei oft nicht direkt von den Benutzenden wahrgenommen werden. Für diese Systeme ist der Baustein SYS.4.3 Eingebettete Systeme umzusetzen.<BR><BR>Anforderungen an die häufig im Zusammenhang mit IoT-Geräten eingesetzten Funkstrecken befinden sich in den Bausteinen der Schicht NET.2 Funknetze.<BR><BR>Die im betrachteten Informationsverbund eingesetzten IoT-Geräte sind im Identitäts- und Berechtigungsmanagement zu berücksichtigen. Hierfür ist der Baustein ORP.4 Identitäts- und Berechtigungsmanagement umzusetzen."
          },
          {
            "name": "2.1. Ausspähung über IoT-Geräte",
            "value": "Bei der Entwicklung von IoT-Geräten wird der Aspekt der Informationssicherheit typischerweise nicht oder nur nachrangig beachtet. Das sorgte in der Vergangenheit dafür, dass IoT-Geräte immer wieder dazu missbraucht wurden, um Informationen über die Benutzenden oder den Einsatzbereich zu sammeln. So sind immer wieder Vorfälle mit vernetzten bzw. IP-basierten Überwachungskameras eingetreten:<BR><BR>• 2021 wurden Überwachungskameras durch erneute Registrierung der Kamera-ID gehackt. Es konnte so die Steuerung übernommen werden.<BR>• 2022 wurden Videostreams von Babymonitoren durch eine fehlende Authentisierung bei einem Angriff auf andere Server umgeleitet. Aufgrund der fehlenden Authentisierung war es sogar möglich die Steuerung zu übernehmen.<BR><BR>Ende September 2016 wurde bekannt, dass einige Modelle von Überwachungskameras und Raumsensoren mit Hintertüren ausgestattet sind, die Spionage ermöglichen. Dies betraf insbesondere Überwachungskameras, die in Rechenzentren und Serverräumen eingesetzt wurden. Die Hintertüren ermöglichten offenbar, dass auf die Bild- und Videodaten der Kameras zugegriffen werden konnte und dass diese Daten auf Server im Internet kopiert werden konnten. Auf diese Weise konnten z. B. Kennwörter von Benutzenden oder Administrierenden kompromittiert werden oder Gerätekonfigurationen, Infrastrukturdetails und sonstige vertrauliche Informationen Dritten zugänglich werden. Dies erleichterte weitergehende Angriffe, indem die Gewohnheiten der Mitarbeitenden ausgenutzt wurden."
          },
          {
            "name": "2.2. Verwendung von UPnP",
            "value": "In LANs integrierte IoT-Geräte bauen oftmals selbstständig eine Verbindung zum Internet auf, indem sie Router im Netz per UPnP (Universal Plug and Play) so konfigurieren, dass eine Portweiterleitung entsteht. Die Geräte können dann nicht nur ins lokale Netz kommunizieren, sondern sind auch außerhalb des LANs sicht- und erreichbar. Wenn dann eine Schwachstelle im IoT-Gerät durch einen Angreifer ausgenutzt wird, könnte dieses Gerät Teil eines Botnetzes werden. Außerdem könnte weitere Schadsoftware in den Informationsverbund eingeschleust werden. Diese Sicherheitslücke kann zu einem späteren Zeitpunkt auch für weitere missbräuchliche Aktivitäten ausgenutzt werden."
          },
          {
            "name": "2.3. Übernahme in ein Botnetz",
            "value": "Wenn IoT-Geräte nicht regelmäßig gepatcht werden, bleiben bekannte Schwachstellen offen und können für umfangreiche Angriffe ausgenutzt werden. Ein Ziel eines Angriffs könnte sein, die IoT-Geräte in ein Botnetz zu integrieren. In diesem Fall könnten sie beispielsweise dazu missbraucht werden, um DDoS-Angriffe (Distributed Denial of Service) auszuführen und die Verfügbarkeit von Diensten einzuschränken.<BR><BR>Häufig werden dazu Botnetze benutzt, die zu großen Teilen aus IoT-Geräten bestehen. Mit der Schadsoftware \"Mirai\", die es bereits seit 2016 gibt, werden beispielsweise Webcams, Kameras, digitale Videorecorder, Router und Drucker in ein Botnetz integriert. Sie scannen dann selbstständig das Internet nach weiteren Geräten, um sie mit Schadsoftware zu infizieren und dem Botnetz hinzuzufügen. Zusätzlich gibt es auch weitere Varianten einer solchen Schadsoftware wie \"Mozi\" oder \"BotenaGo\", die 2019 und 2021 eine ähnliche Vorgehensweise anwendeten."
          }
        ],
        "control-implementations": [
          {
            "uuid": "f609de67-6231-41a7-a027-e47018d33922",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/it-systeme_profile.json",
            "description": "Implementation for all controls in Baustein SYS.4.4",
            "implemented-requirements": [
              {
                "uuid": "d67e53af-4cc9-4905-b17a-51ea050f0bfb",
                "control-id": "ARCH.2.2.11",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A18-m3",
                    "uuid": "3c9ac9f3-d27e-4d63-ba4c-9fa01a887b1f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Firewalls SOLLTEN ausschließlich über ein separates Managementnetz (Out-of-Band-Management) administriert werden. Eine eventuell vorhandene Administrationsschnittstelle über das eigentliche Datennetz (In-Band) SOLLTE deaktiviert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Firewall wird über ihre dedizierte Management-Schnittstelle an einen separaten Management-Switch angeschlossen. Der administrative Zugriff auf die Daten-Interfaces wird durch Firewall-Regeln unterbunden. Der Zugriff auf das Managementnetz ist auf wenige dedizierte Administrator-Workstations beschränkt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das Netzwerkdiagramm und die physische Verkabelung der Firewall. Er überprüft die Firewall-Konfiguration, um sicherzustellen, dass Management-Dienste (SSH, HTTPS) nur auf der Management-Schnittstelle lauschen und Zugriffe über die Daten-Interfaces blockiert werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A18-m4",
                    "uuid": "fd851aff-8575-45cd-974d-20036fc9b472",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Kommunikation im Managementnetz SOLLTE über Management-Firewalls auf wenige Managementprotokolle mit genau festgelegten Ursprüngen und Zielen beschränkt werden. Die verfügbaren Sicherheitsmechanismen der eingesetzten Managementprotokolle zur Authentisierung, Integritätssicherung und Verschlüsselung SOLLTEN aktiviert sein. Alle unsicheren Managementprotokolle SOLLTEN deaktiviert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Managementnetz selbst wird durch eine eigene, kleinere Firewall geschützt. Diese erlaubt beispielsweise nur SSH-Verbindungen von den Jump-Hosts zu den Management-Interfaces der Netzwerkkomponenten. Unsichere Protokolle wie SNMPv1/v2c sind blockiert, nur SNMPv3 mit Authentisierung und Verschlüsselung ist erlaubt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Konfiguration der Management-Firewall und überprüft das Regelwerk auf die Einhaltung des Prinzips der geringsten Rechte. Er verifiziert, dass nur sichere Protokollvarianten verwendet werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "7339e9a9-0adb-4f87-a0a6-068a15cdbef6",
                "control-id": "ARCH.5.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A16-m2",
                    "uuid": "8e61d0c1-daef-4a13-96f8-442157b7b365",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird eine einzelne Firewall-Komponente eingesetzt, die sowohl Paketfilterung als auch Proxy-Funktionen auf demselben System vereint. Es gibt keine architektonische Trennung zwischen den Filter- und den Anwendungsebenen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein einzelnes Unified Threat Management (UTM) oder Next-Generation Firewall (NGFW) Gerät wird am Perimeter platziert und führt alle Sicherheitsfunktionen aus."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Netzwerkarchitektur und stellt fest, ob eine einzelne Komponente für alle Firewall-Aufgaben zuständig ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A16-m3",
                    "uuid": "1650d290-ddc6-48b0-8d02-c8674efad6d9",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine „Paketfilter - Application-Level-Gateway - Paketfilter“-(P-A-P)-Struktur SOLLTE eingesetzt werden. Sie MUSS aus mehreren Komponenten mit jeweils dafür geeigneter Hard- und Software bestehen. Für die wichtigsten verwendeten Protokolle SOLLTEN Sicherheitsproxies auf Anwendungsschicht vorhanden sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Architektur besteht aus einem äußeren Paketfilter, einem Application-Level-Gateway (ALG) in einer Demilitarized Zone (DMZ) und einem inneren Paketfilter. Der äußere Filter lässt nur Verkehr zu den Proxies in der DMZ zu. Der innere Filter lässt nur Verkehr von den Proxies in das interne Netz zu. Direkter Verkehr von außen nach innen ist nicht möglich."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das Netzwerkdiagramm und die Konfigurationen des äußeren und inneren Paketfilters sowie des Application-Level-Gateways, um die korrekte Umsetzung der P-A-P-Architektur und der Datenflüsse zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A16-m4",
                    "uuid": "ce309812-23af-4563-b670-65db5134f696",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In der P-A-P-Struktur werden für alle wesentlichen Dienste (TCP/UDP) zumindest generische Sicherheitsproxies eingesetzt. Die Sicherheitsproxies SOLLTEN zudem innerhalb einer abgesicherten Laufzeitumgebung des Betriebssystems (z.B. Container, gehärtetes OS) ablaufen."
                      },
                      {
                        "name": "guidance",
                        "value": "Neben spezifischen Proxies (z.B. für HTTP, SMTP) werden generische SOCKS- oder TCP/UDP-Proxies für andere Protokolle verwendet. Die Proxy-Dienste laufen auf einem gehärteten Linux-System, bei dem alle nicht benötigten Dienste deaktiviert sind und das Betriebssystem durch Sicherheitsmechanismen wie AppArmor oder SELinux geschützt wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration der Application-Level-Gateways und stellt sicher, dass für ein breites Spektrum von Diensten Proxies verwendet werden. Er analysiert die Härtungsmaßnahmen des Betriebssystems, auf dem die Proxies laufen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A16-m5",
                    "uuid": "d01a7cea-49de-4313-adef-f11042b6d438",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Komponenten der P-A-P-Struktur (äußerer Paketfilter, ALG, innerer Paketfilter) werden von unterschiedlichen Herstellern bezogen (Herstellerdiversität), um die Ausnutzung einer einzelnen herstellerspezifischen Schwachstelle zu erschweren. Die Komponenten sind zudem hochverfügbar ausgelegt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der äußere Paketfilter ist von Hersteller A, die Application-Level-Gateways sind Open-Source-Lösungen auf gehärteten Systemen und der innere Paketfilter ist von Hersteller B. Jede dieser Ebenen ist als Cluster (z.B. Aktiv/Passiv oder Aktiv/Aktiv) implementiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Hersteller und Modelle der eingesetzten Firewall-Komponenten. Er überprüft die Konfiguration der Hochverfügbarkeits-Cluster auf jeder Ebene der P-A-P-Architektur."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "d2617797-4f4d-4dec-9faf-4b233b953b7a",
                "control-id": "ASST.5.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DOCS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A14-m3",
                    "uuid": "7739da6f-3f9f-45a2-804b-c6765481fed8",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die betrieblichen Aufgaben einer Firewall MÜSSEN nachvollziehbar dokumentiert werden. Es MÜSSEN alle Konfigurationsänderungen sowie sicherheitsrelevante Aufgaben dokumentiert werden, insbesondere Änderungen an den Systemdiensten und dem Regelwerk der Firewall. Die Dokumentation MUSS vor unbefugten Zugriffen geschützt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein Betriebshandbuch für die Firewall erstellt. Dieses Dokument beschreibt wiederkehrende Aufgaben wie Backup und Restore, Einspielen von Updates, Überprüfung der Logfiles und den Prozess für Regeländerungen. Alle Änderungen an der Konfiguration werden in einem Change-Log oder Ticketsystem erfasst. Die Dokumentation wird in einem System mit Zugriffsbeschränkungen (z.B. ein geschütztes Netzlaufwerk oder ein Wiki mit Berechtigungskonzept) abgelegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das Betriebshandbuch und die Change-Logs an. Er vergleicht eine Stichprobe der jüngsten Änderungen mit der dazugehörigen Dokumentation. Er überprüft die Zugriffsberechtigungen auf die Dokumentationsablage."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A14-m4",
                    "uuid": "988fb11e-bd86-41d5-91b6-f0d25046163d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Betriebsdokumentation wird regelmäßig, mindestens jährlich, auf Aktualität und Vollständigkeit überprüft und bei Bedarf überarbeitet. Die Dokumentation umfasst auch eine Netzwerk-Topologie, die die Einbindung der Firewall und die Datenflüsse darstellt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Überprüfung des Betriebshandbuchs ist Teil des jährlichen Review-Zyklus. Ein dediziertes Tool für die Netzwerk-Diagrammerstellung wird verwendet, um die Topologie aktuell zu halten. Die Dokumentation wird versioniert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Protokolle der letzten Überprüfungen der Betriebsdokumentation. Er vergleicht die dokumentierte Netzwerk-Topologie mit der tatsächlichen Konfiguration."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "168a6e99-c076-4422-9ebe-aff073ca729b",
                "control-id": "DET.3.1.9",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A9-m2",
                    "uuid": "2060ccc1-73ea-4f9b-8439-fc1f5e2b83cd",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Firewall protokolliert Ereignisse nur lokal. Die Protokolldateien werden nicht regelmäßig gesichert oder ausgewertet und nach kurzer Zeit überschrieben. Die Systemzeit ist nicht synchronisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Standard-Logging-Konfiguration wird beibehalten. Dies führt oft dazu, dass die lokale Festplatte oder der Speicher schnell vollläuft und ältere Logs verloren gehen. Eine Analyse findet nur reaktiv nach einem Vorfall statt, sofern die Daten noch vorhanden sind."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Logging-Konfiguration der Firewall, den Füllstand des Log-Speichers und die Aufbewahrungsdauer. Er vergleicht die Systemzeit der Firewall mit einer Referenzzeit."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A9-m3",
                    "uuid": "6dfc5d26-df7f-4689-9ae8-0eace8f895f1",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Firewall MUSS so konfiguriert werden, dass sie mindestens folgende sicherheitsrelevante Ereignisse protokolliert: abgewiesene Netzverbindungen, fehlgeschlagene Zugriffe auf System-Ressourcen, Fehlermeldungen der Firewall-Dienste, allgemeine Systemfehlermeldungen und Konfigurationsänderungen. Werden Sicherheitsproxies eingesetzt, MÜSSEN Sicherheitsverletzungen und Verstöße gegen Access-Control-Listen ebenfalls protokolliert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Firewall wird so konfiguriert, dass sie ihre Protokolldaten in Echtzeit an einen zentralen, gesicherten Syslog-Server sendet. Dies stellt sicher, dass die Logs auch nach einer Kompromittierung der Firewall selbst erhalten bleiben. Die Systemzeit der Firewall wird mit einem internen NTP-Server synchronisiert. Die Aufbewahrungsdauer der Logs wird gemäß den rechtlichen und betrieblichen Anforderungen festgelegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Logging-Konfiguration der Firewall und prüft auf dem zentralen Log-Server, ob die Daten ankommen. Er kontrolliert die NTP-Konfiguration und die Einstellungen zur Log-Rotation und -Archivierung auf dem Log-Server. Automatisierte Prüfung: `grep 'sshd' /var/log/auth.log` auf dem Syslog-Server, um zu sehen, ob die Logs ankommen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A9-m4",
                    "uuid": "cfb9f297-20cb-4035-a20c-f4821049f9f7",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die zentral gesammelten Protokolldaten der Firewall werden regelmäßig, mindestens wöchentlich, manuell oder mit einfachen Skripten auf auffällige Muster und sicherheitsrelevante Ereignisse überprüft. Es gibt definierte Schwellenwerte für bestimmte Ereignisse (z.B. hohe Anzahl abgewiesener Pakete), bei deren Überschreitung eine Benachrichtigung erfolgt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Protokolldaten werden in ein zentrales Log-Management-System eingespielt. Es werden einfache Korrelationsregeln und Dashboards erstellt, um einen Überblick zu erhalten. Ein Administrator ist dafür zuständig, die Berichte wöchentlich zu sichten und Auffälligkeiten zu untersuchen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Berichte und Dashboards des Log-Management-Systems. Er überprüft die Protokolle der wöchentlichen Auswertungen und fragt nach dem Prozess zur Untersuchung von Auffälligkeiten."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A9-m5",
                    "uuid": "fda0541b-debe-48d2-ad6a-9311c4af34b8",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Protokolldaten der Firewall werden in ein Security Information and Event Management (SIEM)-System integriert. Komplexe Korrelationsregeln analysieren die Daten in Echtzeit und in Korrelation mit Ereignissen von anderen Systemen (z.B. IDS, Server-Logs), um Angriffe und Anomalien automatisiert zu erkennen. Bei kritischen Ereignissen wird automatisch ein Incident-Response-Prozess ausgelöst."
                      },
                      {
                        "name": "guidance",
                        "value": "Das SIEM-System ist mit Threat-Intelligence-Feeds angereichert. Es werden Use Cases wie 'Erkennung von Brute-Force-Angriffen', 'Kommunikation mit bekannten C2-Servern' oder 'Anomalien im Datenverkehr' implementiert. Die Alarmierung ist in ein SOAR-Tool (Security Orchestration, Automation and Response) integriert, um erste Reaktionsschritte zu automatisieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der Korrelationsregeln im SIEM. Er lässt sich die Funktionsweise eines wichtigen Use Case demonstrieren und verfolgt den Weg eines Alarms von der Erkennung bis zur Reaktion, inklusive der automatisierten Schritte."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "21f60b2e-c14c-479e-8308-336771f2f98d",
                "control-id": "DET.4.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A23-m3",
                    "uuid": "de776b59-a401-4e36-84d2-db54ff06a3cb",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Firewalls SOLLTEN in ein geeignetes Systemüberwachungs- bzw. Monitoringkonzept eingebunden werden. Es SOLLTE ständig überwacht werden, ob die Firewall selbst sowie die darauf betriebenen Dienste korrekt funktionieren. Bei Fehlern oder wenn Grenzwerte überschritten werden, SOLLTE das Betriebspersonal alarmiert werden. Protokolldaten oder Statusmeldungen SOLLTEN NUR über sichere Kommunikationswege übertragen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Firewall wird in das zentrale Monitoring-System (z.B. Nagios, Zabbix, Prometheus) aufgenommen. Wichtige Metriken wie CPU-Auslastung, Speichernutzung, Anzahl der Verbindungen und Schnittstellenauslastung werden per SNMPv3 oder einem Agenten abgefragt. Schwellenwerte für Warnungen und kritische Alarme werden definiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Konfiguration im Monitoring-System, die sich auf die Firewall bezieht. Er überprüft die definierten Metriken, die Schwellenwerte und die konfigurierten Alarmierungswege."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A23-m4",
                    "uuid": "0e551cec-cbb4-4718-9ede-55ac8f62dd8f",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zur Basis-Überwachung werden automatische Alarmmeldungen generiert, die bei festgelegten sicherheitsrelevanten Ereignissen ausgelöst werden. Dies umfasst beispielsweise Alarme bei fehlgeschlagenen administrativen Anmeldeversuchen, bei Änderungen an der Konfiguration oder beim Ausfall einer Cluster-Komponente."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Monitoring-System wird mit dem Log-Management-System oder SIEM gekoppelt. Spezifische Log-Ereignisse (z.B. 'configuration changed' oder 'login failed') werden als Trigger für Alarme im Monitoring-System konfiguriert. Bei Cluster-Systemen wird der Failover-Prozess aktiv überwacht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der ereignisbasierten Alarmierung. Er lässt einen Test-Alarm auslösen (z.B. durch einen absichtlich falschen Login-Versuch), um die Funktionsfähigkeit der Kette zu überprüfen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "1c4980dd-0125-4e79-bc66-7bdc50b6471c",
                "control-id": "DET.5.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Audit",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "TEST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A24-m3",
                    "uuid": "f1ece049-279f-4e1f-a332-69a8eca179ca",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Firewall-Struktur SOLLTE regelmäßig auf bekannte Sicherheitsprobleme hin überprüft werden. Es SOLLTEN regelmäßige Penetrationstests und Revisionen durchgeführt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Mindestens einmal jährlich wird eine umfassende Revision der Firewall-Architektur, der Konfiguration und des Regelwerks durchgeführt. Zusätzlich werden in regelmäßigen Abständen (z.B. alle ein bis zwei Jahre) externe oder interne Penetrationstests beauftragt, um die Wirksamkeit der Firewall-Sicherheitsmaßnahmen aus Angreifersicht zu überprüfen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Berichte der letzten Firewall-Revisionen und Penetrationstests an. Er überprüft, ob die festgestellten Schwachstellen nachverfolgt und behoben wurden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c470c8be-073b-4e2e-b1d6-dca9aa422d18",
                "control-id": "KONF.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A4-m2",
                    "uuid": "8af561e3-3cbc-4368-9881-f014ee94da8e",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Firewall wird mit den Standardeinstellungen des Herstellers betrieben. Nicht benötigte Dienste sind möglicherweise aktiv. Konfigurationsänderungen werden nicht systematisch dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Firewall wird nach der Ersteinrichtung nicht weiter gehärtet. Standardpasswörter werden geändert, aber weitergehende Konfigurationen wie das Deaktivieren von Telnet-Zugängen oder ungenutzten Weboberflächen unterbleiben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer gleicht die Liste der aktiven Dienste auf der Firewall mit einer Liste der tatsächlich benötigten Dienste ab. Er fragt nach der Dokumentation der letzten Konfigurationsänderungen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A4-m3",
                    "uuid": "01baa7eb-5fc5-403a-bf6d-ed3122b86b4b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bevor eine Firewall eingesetzt wird, MUSS sie sicher konfiguriert werden. Alle Konfigurationsänderungen MÜSSEN nachvollziehbar dokumentiert sein. Die Integrität der Konfigurationsdateien MUSS geeignet geschützt werden. Zugangspasswörter MÜSSEN mithilfe eines zeitgemäßen kryptografischen Verfahrens abgesichert werden. Eine Firewall MUSS so konfiguriert sein, dass ausschließlich zwingend erforderliche Dienste verfügbar sind. Nicht benötigte (Auskunfts-)Dienste sowie nicht benötigte funktionale Erweiterungen MÜSSEN deaktiviert oder ganz deinstalliert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein dokumentierter Härtungsprozess befolgt, der auf Herstellerempfehlungen oder CIS-Benchmarks basiert. Alle nicht benötigten Management-Schnittstellen (z.B. Telnet, HTTP) und Dienste (z.B. SNMP mit public Community) werden deaktiviert. Konfigurationsänderungen werden über einen Change-Management-Prozess gesteuert und protokolliert. Backups der Konfiguration werden regelmäßig erstellt und sicher aufbewahrt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Dokumentation des Härtungsprozesses an und vergleicht diese mit der aktiven Konfiguration der Firewall. Er prüft die Change-Management-Protokolle und verifiziert die Konfiguration der Passwort-Speicherung und der aktiven Dienste."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A4-m4",
                    "uuid": "d9304847-375d-42b1-b4bc-83ffafac0256",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Integrität der Konfigurationsdateien und der Firewall-Software wird regelmäßig durch Überprüfung von kryptographischen Prüfsummen kontrolliert. Die Konfiguration wird automatisiert auf Abweichungen von einem definierten sicheren Grundzustand (Baseline) überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Konfigurationsmanagement-Tool (z.B. Ansible, Puppet) oder ein spezialisiertes Network Configuration Management (NCM) Tool wird verwendet, um eine Konfigurations-Baseline zu definieren und durchzusetzen. Tägliche oder wöchentliche Jobs prüfen die Live-Konfiguration gegen die Baseline und melden Abweichungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Konfiguration des Überwachungstools, die definierte Baseline und die Berichte über Konfigurationsabweichungen. Er prüft, wie auf gemeldete Abweichungen reagiert wird. An automated check could be `sudo debsums -c` on a Debian-based firewall system."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A4-m5",
                    "uuid": "2cfcf80e-20ac-4536-ab27-1b5444747178",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Jede Konfigurationsänderung wird automatisch auf Konformität mit der Sicherheitsrichtlinie und potenziellen negativen Sicherheitsauswirkungen (z.B. Erstellung von zu permissiven Regeln) geprüft, bevor sie angewendet wird. Änderungen, die gegen die Richtlinie verstoßen, werden automatisch blockiert oder erfordern eine Eskalationsgenehmigung. Das System kann im Falle einer unautorisierten Änderung automatisch zur letzten genehmigten Konfiguration zurückkehren."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Firewall-Automatisierungs- oder Orchestrierungsplattform wird eingesetzt, die einen 'Policy-as-Code'-Ansatz ermöglicht. Sicherheitsrichtlinien sind in einem maschinenlesbaren Format definiert. Ein CI/CD-Pipeline-Ansatz wird für die Ausrollung von Konfigurationsänderungen verwendet, inklusive automatischer Pre-Deployment-Checks."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die in Code definierten Sicherheitsrichtlinien und die Konfiguration der CI/CD-Pipeline. Er löst eine Test-Änderung aus, die gegen die Richtlinie verstößt, um zu verifizieren, dass der Prozess die Änderung korrekt blockiert oder meldet."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e71bc718-f171-49be-b702-4bb1a0f34af6",
                "control-id": "KONF.2.1.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A25-m3",
                    "uuid": "80545283-3113-425f-8dda-636ea8a310e0",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Um eine abgestürzte Firewall wiederherzustellen, SOLLTE sichergestellt werden, dass keine alten oder fehlerhaften Konfigurationen (unter anderem Access-Listen) benutzt werden. Dies SOLLTE auch gelten, wenn es bei einem Angriff gelingt, die Firewall neu zu starten."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein definierter Prozess für die Wiederherstellung der Firewall-Konfiguration etabliert. Nach einem Absturz oder Neustart wird die laufende Konfiguration manuell mit einer bekannten, als gut befundenen Referenzkonfiguration ('Golden Image') verglichen. Die Konfigurationsbackups werden versioniert und als 'gut' oder 'letzte bekannte funktionierende' markiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich den Wiederherstellungsprozess beschreiben und sichtet die Dokumentation dazu. Er überprüft das Backup-Management, insbesondere die Kennzeichnung und Versionierung der Konfigurationsdateien."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A25-m4",
                    "uuid": "9ebb78ca-dd30-4396-91ca-4d7473d4aa0a",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Integrität der aktiven Konfigurations- und Systemdateien auf der Firewall wird durch ein File Integrity Monitoring (FIM)-System überwacht. Bei jeder unautorisierten Änderung wird ein Alarm ausgelöst."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein FIM-Tool (z.B. AIDE, Tripwire) wird auf der Firewall installiert. Es wird eine Baseline der zu überwachenden Dateien erstellt. Das Tool prüft regelmäßig (z.B. stündlich), ob sich die Prüfsummen der Dateien geändert haben und sendet bei Abweichungen einen Alarm an das zentrale Monitoring- oder SIEM-System."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration des FIM-Tools, die Liste der überwachten Dateien und die definierte Baseline. Er löst eine Test-Änderung aus, um die Alarmierung zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A25-m5",
                    "uuid": "40929019-f5d7-4a1c-9cd8-ceda0d6bb322",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Firewall nutzt einen hardwarebasierten Vertrauensanker (z.B. Trusted Platform Module, TPM) und einen Secure-Boot-Prozess. Dadurch wird sichergestellt, dass nur eine signierte, unveränderte Version des Betriebssystems und der Konfiguration geladen werden kann. Jegliche Manipulation führt dazu, dass das System nicht startet oder in einen sicheren, isolierten Zustand wechselt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine Firewall-Appliance beschafft, die über ein TPM und Secure Boot verfügt. Der Secure-Boot-Prozess wird konfiguriert und aktiviert. Die Startkonfiguration wird kryptografisch an den Zustand des Systems gebunden (TPM-Sealing), sodass sie nur auf einem unveränderten System geladen werden kann."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert im BIOS/UEFI und im Betriebssystem der Firewall die Aktivierung von Secure Boot und die Nutzung des TPMs. Er prüft die Signaturen der System- und Konfigurationsdateien."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "36b500f1-af37-4b4a-92f1-285df3d42550",
                "control-id": "KONF.2.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A8-m3",
                    "uuid": "2eac7993-0791-4332-b80b-fb2e1382b29e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In den Einstellungen der Firewall MUSS das dynamische Routing deaktiviert sein, es sei denn, der Paketfilter wird entsprechend dem Baustein NET.3.1 Router und Switches als Perimeter-Router eingesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei der Grundkonfiguration der Firewall wird explizit geprüft, dass keine dynamischen Routing-Protokolle wie OSPF, BGP oder RIP aktiviert sind. Routen werden statisch konfiguriert. Falls dynamisches Routing zwingend erforderlich ist, wird dies dokumentiert, genehmigt und nach den Vorgaben für sicheres Routing in NET.3.1 konfiguriert (z.B. mit Authentisierung der Routing-Updates)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer untersucht die globale Konfiguration und die Prozessliste der Firewall, um sicherzustellen, dass keine Routing-Daemons aktiv sind. Er gleicht die Konfiguration mit der Dokumentation ab, falls dynamisches Routing ausnahmsweise erlaubt ist."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "6ad3e1d2-82ea-496a-8fff-84850d9257a7",
                "control-id": "KONF.2.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A7-m3",
                    "uuid": "712de826-3b5b-4d61-944d-f05649584c8b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS immer möglich sein, direkt auf die Firewall zugreifen zu können, sodass sie im Notfall auch dann lokal administriert werden kann, wenn das gesamte Netz ausfällt."
                      },
                      {
                        "name": "guidance",
                        "value": "Für die Firewall ist ein serieller Konsolenzugang (z.B. über RS-232) eingerichtet. Ein Laptop mit dem passenden Kabel und der nötigen Terminalsoftware wird an einem sicheren Ort für den Notfall bereitgehalten. Das Passwort für den Konsolenzugang ist sicher hinterlegt und für die zuständigen Administratoren im Notfall verfügbar."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich den physischen Zugang zur seriellen Konsole der Firewall zeigen. Er prüft die Verfügbarkeit des Notfall-Laptops und des Konsolenkabels. Er verifiziert den Prozess zum Zugriff auf das Notfallpasswort."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A7-m4",
                    "uuid": "6edfecc7-a38d-4b48-83dd-65d908bffd4e",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der serielle Konsolenzugang ist an einen sicheren Terminal- oder Konsolenserver angebunden. Dies ermöglicht einen Fernzugriff auf die Konsole über einen unabhängigen Kommunikationsweg (Out-of-Band), auch wenn die primären Netzwerkverbindungen der Firewall gestört sind. Der Zugriff auf den Konsolenserver ist durch starke Authentisierung geschützt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Konsolenserver mit eigenem Modem für eine Einwahlverbindung oder einer separaten Internetanbindung wird im Rechenzentrum installiert. Der Zugriff darauf erfordert Multi-Faktor-Authentisierung. Alle Zugriffe über den Konsolenserver werden protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration des Konsolenservers, die Schutzmaßnahmen für dessen Fernzugriff und die Protokollierung der Zugriffe. Er lässt sich den Prozess eines Notfallzugriffs über den Konsolenserver demonstrieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "d9c4e048-9b63-4ac8-b6b9-016abf0cbcb0",
                "control-id": "KONF.4.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A6-m2",
                    "uuid": "7003a93c-82d2-40ff-b95d-c719cf2cd2df",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Administration der Firewall erfolgt über das produktive Netz. Es werden unsichere Protokolle wie Telnet oder HTTP für die Verwaltung verwendet. Die Zugriffe sind nicht auf bestimmte Quell-IP-Adressen beschränkt."
                      },
                      {
                        "name": "guidance",
                        "value": "Administratoren verbinden sich von ihren normalen Arbeitsplatzrechnern aus über Telnet oder eine unverschlüsselte Weboberfläche mit der Firewall, um Konfigurationsänderungen vorzunehmen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Firewall-Konfiguration auf aktive unsichere Administrationsprotokolle. Er prüft die Zugriffsregeln für die Managementschnittstellen auf Einschränkungen der Quell-IP-Adressen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A6-m3",
                    "uuid": "df8a81a0-1c61-447d-8bd1-55b6d8d4d6c5",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Administrations- und Managementzugänge der Firewall MÜSSEN auf einzelne Quell-IP-Adressen bzw. -Adressbereiche eingeschränkt werden. Es MUSS sichergestellt sein, dass aus nicht vertrauenswürdigen Netzen heraus nicht auf die Administrationsschnittstellen zugegriffen werden kann. Um die Firewall zu administrieren bzw. zu überwachen, DÜRFEN NUR sichere Protokolle (z. B. SSH, HTTPS) eingesetzt werden. Für die Bedienschnittstellen MÜSSEN geeignete Zeitbeschränkungen vorgegeben werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine Management-Zone oder ein dediziertes VLAN für die Administration eingerichtet. Nur von dedizierten Admin-Workstations oder Jump-Hosts aus diesem Netz ist der Zugriff auf die Managementschnittstellen der Firewall erlaubt. Die Firewall-Regeln werden entsprechend konfiguriert. Unsichere Protokolle werden deaktiviert. Inaktive Sessions werden nach einer kurzen Zeit (z.B. 15 Minuten) automatisch beendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Firewall-Regeln, die den Zugriff auf die Management-Ports (z.B. TCP/22, TCP/443) schützen. Er prüft die Liste der erlaubten Quell-IPs und die Konfiguration der Session-Timeouts. Eine automatisierte Überprüfung kann durch einen Portscan der Managementschnittstelle aus einem nicht autorisierten Netz erfolgen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A6-m4",
                    "uuid": "df7a347c-af6a-45bf-8245-bc369974b72f",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Administration der Firewall erfolgt ausschließlich über ein dediziertes, physisch oder logisch getrenntes Administrationsnetz (Out-of-Band-Management). Für den administrativen Zugriff ist eine Zwei-Faktor-Authentisierung (2FA) erforderlich."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Firewall verfügt über eine dedizierte Management-Schnittstelle, die an einen separaten Switch angeschlossen ist. Der Zugriff auf dieses Netz ist stark reglementiert. Die Authentisierung an der Firewall ist an ein zentrales AAA-System (z.B. RADIUS, TACACS+) gekoppelt, das 2FA erzwingt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer inspiziert den physikalischen Netzwerkaufbau und die Konfiguration der Management-Schnittstelle. Er überprüft die Konfiguration der Anbindung an das AAA-System und verifiziert die Erzwingung von 2FA durch einen Test-Login."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "4fb005bd-5484-4f90-856b-151bbd25fa45",
                "control-id": "KONF.4.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A22-m3",
                    "uuid": "92c54ce1-3609-4042-bd51-a309a3439740",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Uhrzeit der Firewall SOLLTE mit einem Network-Time-Protocol (NTP)-Server synchronisiert werden. Die Firewall SOLLTE keine externe Zeitsynchronisation zulassen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Firewall wird so konfiguriert, dass sie ihre Zeit ausschließlich von vertrauenswürdigen, internen NTP-Servern (z.B. Stratum 2 oder 3) bezieht. Eingehende NTP-Anfragen aus dem Internet an die Firewall werden blockiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die NTP-Konfiguration der Firewall und stellt sicher, dass nur interne NTP-Server eingetragen sind. Er prüft die Firewall-Regeln auf die Blockade von eingehendem NTP-Verkehr. Eine automatisierte Überprüfung kann durch `ntpq -p` auf der Firewall-CLI erfolgen, um die synchronisierten Peers zu sehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A22-m4",
                    "uuid": "90517bb4-005f-4654-a2f3-50e746654232",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die NTP-Kommunikation zwischen der Firewall und den internen NTP-Servern wird durch Authentisierungsmechanismen (z.B. NTP Authentication mit symmetrischen Schlüsseln) gegen Manipulation geschützt."
                      },
                      {
                        "name": "guidance",
                        "value": "Auf den NTP-Servern und der Firewall werden übereinstimmende Schlüssel für die NTP-Authentisierung konfiguriert. Die Firewall wird angewiesen, nur authentisierte NTP-Antworten zu akzeptieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration der NTP-Authentisierung sowohl auf der Firewall als auch auf den konfigurierten NTP-Servern."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "2dae5eee-c492-453b-b702-eb0eb380710f",
                "control-id": "KONF.6.1.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A20-m3",
                    "uuid": "028b764d-cbe5-4ea2-89dd-36a056fc5cf8",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Protokolle HTTP, SMTP und DNS inklusive ihrer verschlüsselten Versionen SOLLTEN über protokollspezifische Sicherheitsproxies geleitet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Der gesamte Web-Traffic (HTTP/HTTPS) wird über einen expliziten Forward-Proxy oder einen transparenten Web-Proxy geleitet. E-Mails (SMTP) werden über ein Mail-Gateway (SMTP-Proxy) geschleust. DNS-Anfragen werden über einen DNS-Proxy oder -Forwarder auf der Firewall abgewickelt. Diese Proxies können die Protokolle validieren und Inhalte filtern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Firewall-Regeln, um sicherzustellen, dass direkter HTTP-, SMTP- und DNS-Verkehr aus dem internen Netz blockiert wird und der Verkehr stattdessen an die entsprechenden Proxy-Systeme umgeleitet wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "d66989e1-57f2-4207-8464-c06fd6103baf",
                "control-id": "KONF.7.15",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A2-m1",
                    "uuid": "18d7e1e3-44f7-4860-b8c4-abe9da0f4dd2",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Firewall-Regeln werden ad-hoc und ohne formale Dokumentation erstellt. Es wird oft ein 'Allow-Any'-Ansatz verfolgt, bei dem unspezifischer Verkehr zugelassen wird, um die Funktionalität schnell herzustellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein typisches Beispiel ist eine Regel wie `allow any any from internal to internet`, die ohne spezifische Port- oder Ziel-Einschränkungen konfiguriert wird. Dokumentation findet, wenn überhaupt, nur als Kommentar in der Regel selbst statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer inspiziert das Firewall-Regelwerk auf das Vorhandensein von breiten, unspezifischen 'Allow'-Regeln und befragt die Administratoren nach dem Prozess zur Erstellung und Dokumentation neuer Regeln."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A2-m2",
                    "uuid": "2167c9e1-8982-46a2-9990-96dbd982b2aa",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird grundsätzlich ein Allowlist-Ansatz (Default-Deny) verfolgt, aber die Regeln sind nicht immer ausreichend dokumentiert. Zuständigkeiten für die Regeländerung sind informell bekannt, aber nicht formal festgelegt."
                      },
                      {
                        "name": "guidance",
                        "value": "Am Ende des Regelwerks befindet sich eine 'deny all' Regel. Neue Regeln werden zwar spezifischer formuliert, aber der Grund für ihre Erstellung oder der Antragsteller werden nicht systematisch erfasst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz einer 'Default-Deny'-Regel am Ende des Regelwerks und bittet um die Dokumentation für eine Stichprobe von kürzlich hinzugefügten Regeln, um deren Vollständigkeit zu bewerten."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A2-m3",
                    "uuid": "5323a438-c06b-4849-b7c9-fba945df5b07",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die Firewall MÜSSEN eindeutige Regeln definiert werden, die festlegen, welche Kommunikationsverbindungen und Datenströme zugelassen werden. Alle anderen Verbindungen MÜSSEN durch die Firewall unterbunden werden (Allowlist-Ansatz). Es MÜSSEN Zuständige benannt werden, die Filterregeln entwerfen, umsetzen und testen. Zudem MUSS geklärt werden, wer Filterregeln verändern darf. Die getroffenen Entscheidungen sowie die relevanten Informationen und Entscheidungsgründe MÜSSEN dokumentiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Ticketsystem oder ein standardisiertes Antragsformular wird für die Beantragung neuer Firewall-Regeln verwendet. Jede Regel wird mit einer Ticketnummer, dem Antragsteller, dem Grund und einem Gültigkeitsdatum versehen. Änderungen am Regelwerk werden nach dem Vier-Augen-Prinzip durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Regelwerk und gleicht eine Stichprobe von Regeln mit der zugehörigen Dokumentation (z.B. Tickets) ab. Er überprüft die Prozessdokumentation für die Regeländerung und verifiziert die Einhaltung des Vier-Augen-Prinzips."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A2-m4",
                    "uuid": "31981476-b52f-4bb3-9868-363f3f851a48",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Firewall-Regelwerk wird regelmäßig, mindestens halbjährlich, auf nicht mehr benötigte, zu weite oder redundante Regeln überprüft. Für jede Regel ist ein 'Owner' (Verantwortlicher) und ein Ablaufdatum definiert. Vor Ablauf wird der Owner automatisch benachrichtigt, um die Regel zu verlängern oder zu löschen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Skripte oder spezialisierte Tools (z.B. Firewall Policy Analyzer) eingesetzt, um das Regelwerk zu analysieren und Berichte über ungenutzte oder 'shadowed' (verdeckte) Regeln zu erstellen. Die Verwaltung der Owner und Ablaufdaten erfolgt in einer zentralen Datenbank oder im Ticketsystem."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Berichte der letzten Regelwerk-Reviews an und überprüft, ob die identifizierten Probleme behoben wurden. Er prüft stichprobenartig, ob Regeln mit abgelaufenem Gültigkeitsdatum deaktiviert oder entfernt wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A2-m5",
                    "uuid": "4daf1227-c29d-478b-88e2-0ea4b3a01abc",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Prozess zur Beantragung, Genehmigung und Implementierung von Firewall-Regeln ist weitgehend automatisiert. Anhand von Applikations- und Risikoinformationen wird automatisiert ein Regelvorschlag generiert, der nach Genehmigung automatisch auf der Firewall ausgerollt wird. Kontinuierliche Analysen prüfen das Regelwerk auf Optimierungspotenzial und Konformität mit der Sicherheitsrichtlinie in Echtzeit."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine Firewall-Orchestrierungs- und Automatisierungsplattform eingesetzt. Diese ist mit dem CMDB und dem Ticketsystem integriert. Anträge werden über ein Self-Service-Portal gestellt, und die Plattform validiert den Antrag automatisch gegen Sicherheitsrichtlinien, bevor er zur Genehmigung weitergeleitet wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den konfigurierten Workflow in der Automatisierungsplattform, inklusive der Genehmigungsschritte und der automatischen Validierungsregeln. Er prüft die Audit-Logs der Plattform, um den Lebenszyklus einiger Regeln von der Anforderung bis zur Implementierung nachzuvollziehen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "a571f53c-c9cc-4573-96aa-1f664eed20d1",
                "control-id": "KONF.7.16",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A10-m3",
                    "uuid": "62efae8a-ce60-4995-9a91-8149604f171f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Am Paketfilter MÜSSEN Schutzmechanismen aktiviert sein, um IPv4- sowie IPv6-Fragmentierungsangriffe abzuwehren."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Firewall wird so konfiguriert, dass sie fragmentierte IP-Pakete vor der weiteren Verarbeitung wieder zusammensetzt (IP Reassembly). Dadurch wird sichergestellt, dass die Filterregeln auf das vollständige Paket angewendet werden und Angriffe, die durch überlappende Fragmente oder das Verstecken von Informationen in Fragmenten funktionieren, verhindert werden. Es werden Limits für die Anzahl gleichzeitig zu verarbeitender Fragmente gesetzt, um Ressourcenerschöpfungsangriffe zu mitigieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert in der Firewall-Konfiguration, dass die Funktion zum Wiederzusammensetzen von IP-Fragmenten aktiviert ist. Er überprüft die konfigurierten Limits und Schutzmechanismen gegen Fragment-Flooding."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "23b2bc8f-8b59-4f9b-8c40-fe99e0535c7e",
                "control-id": "KONF.7.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A19-m3",
                    "uuid": "e72dcd72-e8f0-4b68-8c8a-18e4683d9168",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Am Paketfilter, der Server-Dienste schützt, SOLLTE ein geeignetes Limit für halboffene und offene Verbindungen gesetzt werden (Schutz vor TCP SYN Flooding). Es SOLLTEN Rate Limits für UDP-Datenströme gesetzt werden. Am äußeren Paketfilter SOLLTE bei ausgehenden Verbindungen für TCP eine zufällige Generierung von Initial Sequence Numbers (ISN) aktiviert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Firewall wird mit SYN-Proxy- oder SYN-Cookie-Mechanismen konfiguriert, um die dahinterliegenden Server vor SYN-Floods zu schützen. Es werden pro Quell-IP oder global Ratenbegrenzungen für UDP-Pakete konfiguriert, um UDP-Floods zu mitigieren. Die Funktion zur Randomisierung der ISN wird aktiviert, um TCP-Session-Hijacking zu erschweren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert in der Firewall-Konfiguration die Aktivierung und die Parameter der Schutzmechanismen gegen SYN-Flooding, die UDP-Ratenbegrenzungen und die ISN-Randomisierung."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ae1fb0ea-0374-457e-a640-bbb4d14f8edc",
                "control-id": "KONF.9.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.2.A27-m3",
                    "uuid": "c61258a3-d141-4eee-ac5f-e39059a39e3d",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In einer mehrstufigen Firewall-Architektur (z.B. P-A-P) werden für alle Komponenten (äußerer Filter, innerer Filter) Produkte desselben Herstellers eingesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Dies wird oft aus Gründen der einfacheren Verwaltung und der günstigeren Lizenzierung getan. Die Administratoren müssen sich nur in ein System einarbeiten und können möglicherweise ein zentrales Management-Tool nutzen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer identifiziert die Hersteller und Modelle der eingesetzten Firewall-Komponenten in der mehrstufigen Architektur."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.2.A27-m5",
                    "uuid": "7090b52b-a8c2-4dea-84c4-27f8887b89f8",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In einer mehrstufigen Firewall-Architektur SOLLTEN unterschiedliche Betriebssysteme und -Produkte für die äußeren und inneren Firewalls eingesetzt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird bewusst eine Herstellerdiversität implementiert. Beispielsweise wird als äußerer Paketfilter ein Produkt von Hersteller A und als innerer Paketfilter ein Produkt von Hersteller B verwendet. Dies erhöht die Resilienz, da eine herstellerspezifische Schwachstelle (z.B. ein 0-Day-Exploit) nicht die gesamte Firewall-Architektur kompromittieren kann."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Hersteller und Modelle der Firewall-Komponenten auf den verschiedenen Stufen der Architektur und bestätigt, dass es sich um Produkte unterschiedlicher Hersteller handelt."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}