{
  "component-definition": {
    "uuid": "3f7b736a-aec7-40cc-8f69-245f1be975bd",
    "metadata": {
      "title": "SYS.3.3 Mobiltelefone - Benutzerdefiniert",
      "last-modified": "2025-11-22T12:46:12.004613+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "924e539a-7938-4c44-85db-bd926beeec19",
        "type": "hardware",
        "title": "SYS.3.3 Mobiltelefone",
        "description": "This component represents the implementation of all controls for Baustein SYS.3.3.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Die in diesem Baustein betrachteten Mobiltelefone, die auch „Feature-Phones“ oder „Dumbphones\" genannt werden, besitzen weniger Eigenschaften als ein Smartphone, bieten aber mehr Funktionen als nur die reine Telefonfunktion. So können diese Mobiltelefone zusätzlich mit einer Kamera für Videos und Fotos, einem Terminplaner, E-Mail-Programmen, Spielen, einem MP3-Player oder einem Radioempfänger ausgestattet sein. „Klassische“ Mobiltelefone verfügen in der Regel nicht über einen Touchscreen und ein Betriebssystem, auf das zusätzliche Apps installiert werden können. Diese fehlenden Funktionen unterscheidet das Mobiltelefon von einem Smartphone.<BR><BR>Mobiltelefone sind durch eine international eindeutige Seriennummer (International Mobile Equipment Identity, IMEI) gekennzeichnet. Die Identifizierung der Benutzenden des Mobiltelefons erfolgt durch die SIM-Karte, die bei Vertragsabschluss vom Mobilfunkanbietenden zugeteilt wird."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel des Bausteins ist es, typische Gefährdungen aufzuzeigen, die bei der Nutzung von Mobiltelefonen auftreten können, sowie Informationen abzusichern, die auf Mobiltelefonen gespeichert sind oder darüber übermittelt werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein SYS.3.3 Mobiltelefon ist auf alle Mobiltelefone anzuwenden, die für dienstliche Zwecke verwendet werden.<BR><BR>Dieser Baustein beschäftigt sich mit allgemeinen Aspekten von typischen Mobiltelefonen, mit Sicherheitsaspekten zur Telefonie und Nachrichtenübermittlung über das Mobilfunknetz und mit Sicherheitsaspekten zum Umgang mit den Geräten. Damit deckt dieser Baustein ein großes Spektrum unterschiedlicher Geräte ab, die an Mobilfunknetze angeschlossen werden können. Ergänzende Aspekte, die über die Kommunikation über ein Mobilfunknetz und den Umgang mit den Geräten hinausgehen, sind in weiteren Bausteinen des IT-Grundschutz-Kompendiums zu finden. So können Sicherheitsanforderungen zu Smartphones und den darauf genutzten Betriebssystemen ergänzend den Bausteinen der Schicht SYS.3.2 Tablet und Smartphone entnommen werden. Aspekte datenbasierter Telefonie werden im Baustein NET.4.2 VoIP behandelt. Verwendet das betrachtete Mobiltelefon VPNs, sollte zusätzlich der Baustein NET.3.3 VPN berücksichtigt werden. Für Smartphones oder Tablets ist der Baustein SYS.3.2.1 Allgemeine Smartphones und Tablets anzuwenden."
          },
          {
            "name": "Unzureichende Planung bei der Anschaffung von Mobiltelefonen",
            "value": "Werden in der Planungsphase relevante Eigenschaften der anzuschaffenden Mobiltelefone nicht ermittelt, könnten dringend benötigte Funktionen nicht verfügbar sein. Werden bestimmte Mobilfunkstandards nicht unterstützt, können die Geräte in bestimmten Ländern nicht verwendet werden. Im schlimmsten Fall entspricht der Funktionsumfang nicht dem Einsatzzweck, sodass diese Geräte überhaupt nicht eingesetzt werden können. Oft gibt es auch weitere Randbedingungen, die erfüllt werden müssen, damit die Geräte eingesetzt werden können. Hierzu gehören beispielsweise Sicherheitsfunktionen, die oft nicht auf den ersten Blick ersichtlich sind, aber zu Problemen bezüglich der Verfügbarkeit und Vertraulichkeit führen können, wenn sie verwendet werden."
          },
          {
            "name": "Verlust des Mobiltelefons",
            "value": "Da Mobiltelefone in der Regel klein sind und ständig transportiert werden, können sie leicht verloren gehen, vergessen oder gestohlen werden. Neben dem wirtschaftlichen Schaden wiegt der Verlust der Vertraulichkeit und Integrität der enthaltenen Daten besonders schwer. Denn über ein entwendetes Mobiltelefon könnten Angreifende auf institutionskritische Informationen der Institution zugreifen. Außerdem entstehen Kosten und Aufwände, um einen arbeitsfähigen Zustand wiederherzustellen."
          },
          {
            "name": "Sorglosigkeit im Umgang mit Informationen bei der Mobiltelefonie",
            "value": "Durch Unachtsamkeit und Sorglosigkeit der Mitarbeitenden bei der Mobiltelefonie können Dritte an schützenswerte Informationen gelangen. So können beispielsweise Informationen bei Telefongesprächen mitgehört oder aufgenommen sowie Nachrichten beim Verfassen mitgelesen werden."
          },
          {
            "name": "Unerlaubte private Nutzung des dienstlichen Mobiltelefons",
            "value": "Firmeneigene Mobiltelefone können unerlaubt für private Zwecke verwendet werden. Durch Unachtsamkeit und sorglosen Umgang können so Probleme bezüglich der Informationssicherheit der Institution entstehen, etwa wenn private und dienstliche Inhalte vermischt werden. Auf diese Weise könnten Unbefugte Kenntnis von Interna der Institution erlangen. Werden dienstliche Mobiltelefone privat genutzt, können außerdem zusätzliche Kosten für die Institution entstehen."
          },
          {
            "name": "Ausfall des Mobiltelefons",
            "value": "Der Ausfall eines Mobiltelefons kann mehrere Ursachen haben. So können Benutzende versäumt haben, den Akku des Gerätes aufzuladen, oder der Akku kann seine Fähigkeit, Energie zu speichern, verloren haben. Auch ist es möglich, dass Benutzende das Zugangspasswort oder die PIN vergessen haben und das Gerät nicht mehr nutzen können. So kann sich das Gerät bei mehrfach falscher Eingabe des Zugangscodes selbst sperren. Wird mit dem Telefon nicht sorgfältig umgegangen, kann es beschädigt werden, beispielsweise indem es herunterfällt. In allen genannten Fällen sind die Benutzenden anschließend nicht mehr erreichbar und können wiederum selbst niemanden über das Mobiltelefon erreichen."
          },
          {
            "name": "Auswertung von Verbindungsdaten bei der Nutzung von Mobiltelefonen",
            "value": "Aufgrund der Eigenschaften von mobiler Kommunikation kann nicht verhindert werden, dass die übertragenen Signale mit entsprechendem Aufwand unbefugt mitgehört und aufgezeichnet werden. Bei den meisten Funkdiensten müssen außerdem die mobilen Kommunikationsgeräte aus technischen Gründen geortet werden, um erreichbar zu sein. Somit können Standort-Informationen durch Netzbetreibende oder Dienstbetreibende verwendet werden, um Bewegungsprofile zu erstellen."
          },
          {
            "name": "Abhören von Raumgesprächen über Mobiltelefone",
            "value": "Mobiltelefone können dazu verwendet werden, unbemerkt Gespräche aufzuzeichnen oder abzuhören. In Besprechungen können über mitgebrachte Mobiltelefone Verbindungen zu unbefugten Mithörenden aufgebaut werden. Viele Mobiltelefone sind mit einer Freisprecheinrichtung ausgestattet, sodass problemlos Gespräche im gesamten Raum erfasst können. Bei vielen Geräten ist nicht sichtbar, ob sie eingeschaltet sind oder nicht. Somit kann nicht direkt erkannt werden, ob Gespräche aufgezeichnet oder abgehört werden."
          },
          {
            "name": "Einsatz veralteter Mobiltelefone",
            "value": "Da Smartphones vielfältiger als Mobiltelefone genutzt werden können, bieten viele herstellende Institutionen inzwischen ausschließlich Smartphones an. Damit übersteigt das Angebot an Smartphones deutlich das Angebot an Mobiltelefonen und es werden kaum noch Mobiltelefone produziert. Aufgrund des geringen Angebots werden zahlreiche Mobiltelefone aus Altbeständen verwendet. Altersschwache Komponenten wie Akkus werden oft durch Nachbauten von Drittanbietenden ersetzt, sodass diese Mobiltelefone weiterhin Jahrzehnte nach der Produktion eingesetzt werden können.<BR><BR>Oft sind auf diesen veralteten Mobiltelefonen Betriebssysteme installiert, die nicht mehr weiterentwickelt oder supported werden. Softwareschwachstellen können somit nicht mehr durch Updates beseitigt werden. Häufig gibt es die herstellenden Institutionen der Mobiltelefone nicht mehr, oder sie haben ihr Geschäftsfeld auf andere Märkte verlagert. Originales Zubehör und Ersatzteile können deshalb oft nicht mehr nachgekauft werden. Auch Drittherstellende bieten bei sehr alten Mobiltelefonen oft keine entsprechenden Produkte mehr an. Wenn Drittherstellende dennoch Ersatzteile anbieten, ist nicht gewährleistet, dass diese Komponenten die gleiche Qualität wie die originalen Teile besitzen. So sind beispielsweise nachgebaute Akkus oft weniger leistungsfähig als die Originale. In der Regel können diese Geräte auch oft nicht mehr repariert werden und bei Problemen gibt es kaum noch geeignete Ansprechpersonen, die helfen können."
          }
        ],
        "control-implementations": [
          {
            "uuid": "9f78205c-81b4-4db5-aaab-8c25db32e740",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Kompendien/Grundschutz%2B%2B-Kompendium/profile/mobiltelefone_profile.json",
            "description": "Implementation for all controls in Baustein SYS.3.3",
            "implemented-requirements": [
              {
                "uuid": "509b775e-0c9c-4577-8ada-765a8d58b6bd",
                "control-id": "ASST.6.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Improvement",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ASST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.3.3-a4-m1",
                    "uuid": "1be1b9a5-f289-4c35-a88d-d0bb7765adc1",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ausgediente Mobiltelefone werden eingesammelt und unsortiert in einer Kiste gelagert. Es gibt keinen definierten Prozess zur Löschung von Daten oder zur sicheren Entsorgung."
                      },
                      {
                        "name": "guidance",
                        "value": "Die gesammelten Geräte sind ungesichert und potenziell für jedermann im Lager zugänglich. Daten, insbesondere auf Speicherkarten, bleiben erhalten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor inspiziert den Lagerort der Altgeräte und stellt die mangelnde physische Sicherheit und das Fehlen eines Lösch- und Entsorgungsprozesses fest. Stichprobenartig wird ein Gerät eingeschaltet, um zu prüfen, ob noch Daten vorhanden sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a4-m2",
                    "uuid": "f5e2867a-483b-4f69-83ac-0c5106ca1d11",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Benutzer werden angewiesen, ihre Geräte auf Werkseinstellungen zurückzusetzen, bevor sie diese zurückgeben. Die zurückgegebenen Geräte werden in einem verschlossenen Schrank aufbewahrt, bis sie entsorgt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Anweisung zum Zurücksetzen ist Teil des Offboarding-Prozesses. Es gibt jedoch keine Überprüfung, ob die Löschung tatsächlich und vollständig erfolgt ist. Die Entsorgung erfolgt über den allgemeinen Elektroschrott ohne spezielle Sicherheitsmaßnahmen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Offboarding-Checkliste auf die Anweisung zum Zurücksetzen. Er inspiziert den Aufbewahrungsort und stellt fest, dass keine Überprüfung der Datenlöschung stattfindet. Der Entsorgungsweg wird als nicht sicher für potenziell datentragende Geräte bewertet."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a4-m3",
                    "uuid": "3c6bac70-be76-4e47-9a76-97430bf58dde",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Mobiltelefone MÜSSEN vor der Entsorgung auf den Werkszustand zurückgesetzt werden. Es MUSS überprüft werden, ob alle Daten, auch auf Speicherkarten, gelöscht wurden. Gesammelte Mobiltelefone und Speicherkarten MÜSSEN bis zur Entsorgung vor unberechtigtem Zugriff geschützt aufbewahrt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein IT-Mitarbeiter ist für den Aussonderungsprozess verantwortlich. Jedes zurückgegebene Gerät wird manuell auf Werkseinstellungen zurückgesetzt und die erfolgreiche Löschung wird auf einer Checkliste dokumentiert. Speicherkarten werden entnommen und separat sicher gelagert. Die Geräte werden in einem dedizierten, zugriffsgeschützten Bereich aufbewahrt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Prozessdokumentation und die ausgefüllten Checklisten zur Datenlöschung. Er inspiziert den sicheren Lagerort. Stichprobenartig werden Geräte aus dem Lager genommen und versucht, Daten wiederherzustellen, um die Wirksamkeit der Löschung zu überprüfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a4-m4",
                    "uuid": "5f4ce3be-6f48-4146-ad65-b52dee5a196b",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird sichergestellt, dass die Mobiltelefone und eventuell darin verwendete Speicherkarten ordnungsgemäß und nachweislich entsorgt werden. Hierfür wird ein zertifizierter Dienstleister für Datenvernichtung beauftragt. Der gesamte Prozess wird dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es besteht ein Vertrag mit einem nach ISO 21964 (ehemals DIN 66399) zertifizierten Entsorgungsunternehmen. Die Geräte werden in versiegelten Behältern übergeben. Der Dienstleister stellt ein Vernichtungszertifikat aus, das archiviert wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft den Vertrag mit dem Entsorgungsdienstleister und dessen Zertifizierung. Er sichtet die Übergabeprotokolle und die erhaltenen Vernichtungszertifikate, um eine lückenlose Nachweiskette sicherzustellen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a4-m5",
                    "uuid": "efe78b71-cc56-4d46-9f92-32dc132563cf",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der gesamte Lebenszyklus der Mobiltelefone wird in einem Asset-Management-System verfolgt. Der Aussonderungsprozess wird im System angestoßen, wobei die Datenlöschung durch eine zweite Person verifiziert (Vier-Augen-Prinzip) und im System bestätigt wird, bevor das Gerät zur physischen Zerstörung freigegeben wird. Speicherkarten werden grundsätzlich physisch zerstört (z.B. geschreddert)."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Asset-Management-System erzwingt die Einhaltung des Prozesses. Der Status jedes Geräts (z.B. 'in Nutzung', 'zurückgegeben', 'Löschung verifiziert', 'vernichtet') ist transparent nachverfolgbar. Die physische Zerstörung von Speicherkarten erfolgt intern mit einem geeigneten Schredder."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft den Workflow im Asset-Management-System und die dazugehörigen Protokolleinträge. Er verifiziert die Aufzeichnungen des Vier-Augen-Prinzips und prüft den Prozess der internen Zerstörung der Speicherkarten. Ein automatischer Audit kann regelmäßig Berichte aus dem Asset-Management-System generieren, um Geräte zu identifizieren, deren Aussonderungsprozess überfällig ist."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ffd0eddf-5388-44ee-8c3d-346a7e669552",
                "control-id": "GEB.6.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.3.3-a15-m3",
                    "uuid": "1143792b-9108-456b-a4d3-b85c93d2e776",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Damit vertrauliche Informationen nicht abgehört werden können, SOLLTE dafür gesorgt werden, dass keine Mobiltelefone zu vertraulichen Besprechungen und Gesprächen in die entsprechenden Räume mitgenommen werden. Dies wird als formale Richtlinie für ausgewiesene Sicherheitsbereiche und Besprechungsräume festgelegt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die betroffenen Räume sind klar gekennzeichnet. Die Regel ist Teil der Einladung zu vertraulichen Besprechungen. Die Teilnehmer werden zu Beginn der Besprechung vom Organisator an die Regel erinnert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Richtlinie und die Kennzeichnung der Räume. Er nimmt als stiller Beobachter an einer vertraulichen Besprechung teil, um zu sehen, ob die Regel kommuniziert und eingehalten wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a15-m4",
                    "uuid": "cd0e59a5-0db1-485a-aeb0-42f6d209f66b",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Verbot, Mobiltelefone mit in Sicherheitsbereiche zu nehmen, wird durch organisatorische Maßnahmen erzwungen. Vor den entsprechenden Räumen werden Schließfächer zur sicheren Aufbewahrung der Geräte bereitgestellt. Die Einhaltung der Regel wird aktiv kontrolliert."
                      },
                      {
                        "name": "guidance",
                        "value": "An den Eingängen zu den Sicherheitsbereichen sind Piktogramme und Schilder angebracht. Die Schließfächer sind für alle Mitarbeiter und Gäste zugänglich. Der Organisator einer Besprechung oder ein Sicherheitsmitarbeiter ist dafür verantwortlich, die Einhaltung vor Beginn der Besprechung sicherzustellen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor inspiziert die physischen Kontrollen (Schilder, Schließfächer). Er prüft die Prozessanweisungen für Besprechungsorganisatoren. Durch Beobachtung wird die konsequente Umsetzung der Kontrolle verifiziert."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a15-m5",
                    "uuid": "e31e6422-3683-4d68-bb07-e85e78ebb0e4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Falls erforderlich, SOLLTE das Mitführungsverbot durch den Einsatz von Mobilfunk-Detektoren an den Eingängen zu Hochsicherheitsbereichen technisch überprüft werden."
                      },
                      {
                        "name": "guidance",
                        "value": "An den Zugängen zu den definierten Hochsicherheitszonen sind fest installierte oder mobile Detektoren im Einsatz, die auf aktive oder passive Mobiltelefone reagieren. Der Einsatz ist rechtlich geprüft und wird durch Sicherheitspersonal überwacht. Personen, bei denen ein Gerät detektiert wird, wird der Zutritt verwehrt, bis das Gerät abgelegt wurde."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die rechtliche Grundlage und die Prozessdokumentation für den Einsatz der Detektoren. Er prüft die Funktionsfähigkeit der Detektoren und beobachtet das Vorgehen des Sicherheitspersonals bei einem Alarm. Ein automatischer Audit kann die Funktionsfähigkeit und Betriebsbereitschaft der Detektoren regelmäßig prüfen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "82f865f6-2be0-48ca-8225-d1e2b27ff18e",
                "control-id": "KONF.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GOV",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.3.3-a1-m1",
                    "uuid": "f0832c68-11a8-478c-81c9-88a858a7be66",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert lediglich ein Entwurf einer Sicherheitsrichtlinie für Mobiltelefone, der weder offiziell freigegeben noch an die Mitarbeitenden verteilt wurde. Die Richtlinie ist unvollständig und deckt nur grundlegende Aspekte wie die private Nutzung ab, während kritische Punkte wie der Umgang mit Verlusten fehlen."
                      },
                      {
                        "name": "guidance",
                        "value": "In dieser Phase wird typischerweise ein erster Entwurf in einem Textverarbeitungsdokument erstellt, oft als Reaktion auf einen spezifischen Vorfall. Es gibt keine formelle Überprüfung oder Genehmigung durch das Management oder die Informationssicherheit."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor stellt durch Befragung des ISB fest, ob eine Richtlinie existiert. Der Auditor prüft das Dokument auf seinen Status (z. B. „Entwurf“) und seinen Inhalt, um die Unvollständigkeit und das Fehlen eines Verteilungsprozesses zu bestätigen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a1-m2",
                    "uuid": "75e6b5d2-6aa2-4d23-a464-24a88de10a63",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Sicherheitsrichtlinie wurde erstellt und allen Mitarbeitenden bei der Ausgabe eines Mobiltelefons zur Verfügung gestellt. Sie deckt die wichtigsten Nutzungsregeln ab, wird jedoch nicht regelmäßig auf Einhaltung überprüft oder aktualisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Richtlinie wird als Standarddokument im Intranet veröffentlicht oder als Ausdruck bei der Geräteübergabe ausgehändigt. Die Kenntnisnahme wird möglicherweise durch eine Unterschrift bestätigt, es finden aber keine weiteren Maßnahmen zur Sicherstellung des Verständnisses statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft, ob eine offizielle Version der Richtlinie existiert und ob ein Prozess zur Verteilung an alle Mobiltelefon-Nutzer etabliert ist. Durch Stichproben bei den Nutzern wird verifiziert, ob diese die Richtlinie erhalten haben. Das Fehlen von Überprüfungs- und Aktualisierungsprozessen wird im Auditbericht vermerkt."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a1-m3",
                    "uuid": "7ac2eeb9-e411-402d-ba1c-6d7a771b73d6",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Im Hinblick auf die Nutzung und Kontrolle der Geräte MUSS eine Sicherheitsrichtlinie erstellt werden. Jeder benutzenden Person eines Mobiltelefons MUSS ein Exemplar der Sicherheitsrichtlinie ausgehändigt werden. Es MUSS regelmäßig überprüft werden, ob die Sicherheitsrichtlinie eingehalten wird."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Sicherheitsrichtlinie ist ein offizielles, vom Management genehmigtes Dokument. Die Aushändigung wird dokumentiert. Die regelmäßige Überprüfung kann durch jährliche Befragungen oder stichprobenartige technische Kontrollen erfolgen, deren Ergebnisse protokolliert werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Existenz, den Genehmigungsstatus und die Aktualität der Sicherheitsrichtlinie. Er verifiziert die Nachweise über die Verteilung an die Nutzer (z.B. Empfangsbestätigungen). Zudem werden Protokolle der regelmäßigen Überprüfungen eingesehen, um die Einhaltung des Prozesses zu bestätigen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a1-m4",
                    "uuid": "03bbeb81-0046-41cb-9ad3-ab776d59be91",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Sicherheitsrichtlinie ist integraler Bestandteil der Sicherheitsschulungen. Ihre Einhaltung wird aktiv durch regelmäßige, dokumentierte Stichproben überwacht. Die Richtlinie wird mindestens jährlich oder bei signifikanten Änderungen der Bedrohungslage oder Technologie überprüft und bei Bedarf aktualisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Inhalte der Richtlinie werden in die jährlichen Security-Awareness-Kampagnen und Onboarding-Prozesse integriert. Die Überprüfung der Einhaltung erfolgt durch den IT-Betrieb. Ein formaler Prozess zur Aktualisierung der Richtlinie, inklusive einer Überprüfung durch den ISB, ist etabliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Schulungsunterlagen auf Inhalte, die sich auf die Mobiltelefon-Richtlinie beziehen. Er sichtet die Protokolle der Stichproben-Kontrollen und die Dokumentation des Richtlinien-Review-Prozesses, um dessen Regelmäßigkeit und Gründlichkeit zu bewerten."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a1-m5",
                    "uuid": "1701ebbf-bc2b-4a2e-9709-dfc4455ff7d2",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Sicherheitsrichtlinie ist in einem GRC-Tool (Governance, Risk, Compliance) abgebildet und ihre Einhaltung wird, soweit technisch möglich, durch eine zentrale Verwaltungslösung (z.B. MDM/UEM für Smartphones) automatisiert erzwungen und überwacht. Ausnahmen von der Richtlinie erfordern einen formalen, dokumentierten Risikobewertungs- und Genehmigungsprozess."
                      },
                      {
                        "name": "guidance",
                        "value": "Richtlinienkonformität wird durch technische Profile sichergestellt, die auf die Geräte aufgespielt werden. Verstöße gegen die Richtlinie (z. B. Installation nicht genehmigter Apps, falls zutreffend) führen zu automatischen Alarmen oder Sanktionen. Der Prozess für Ausnahmeanträge ist im GRC-Tool implementiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die Konfiguration im GRC- und MDM/UEM-System, um die automatisierte Durchsetzung der Richtlinie zu verifizieren. Er prüft die Protokolle der automatisierten Überwachung sowie die Dokumentation der genehmigten Ausnahmen auf Vollständigkeit und Nachvollziehbarkeit. Ein automatischer Audit kann Konfigurationsdateien des MDM-Systems gegen einen vordefinierten 'Golden Standard' prüfen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "eb477465-e3f4-45d8-8bf1-20d3b72c46aa",
                "control-id": "KONF.2.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.3.3-a10-m2",
                    "uuid": "613ace65-f1ac-4701-9bdc-a243bd0f153d",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt eine allgemeine Regel, dass vertrauliche Informationen nicht über Mobiltelefone verarbeitet oder übertragen werden sollen. Es gibt jedoch keine genaue Definition, was als vertraulich gilt und welche Ausnahmen es gibt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Regel ist Teil der IT-Nutzungsrichtlinie, ist aber für die Benutzer schwer im Alltag umzusetzen, da sie zu unspezifisch ist."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor stellt bei der Prüfung der Richtlinie und in Interviews mit Benutzern fest, dass die Regel aufgrund ihrer mangelnden Spezifität zu Unsicherheit und inkonsistenter Anwendung führt."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a10-m3",
                    "uuid": "a533bc59-450a-42ae-9e84-d33a09177e2b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE geregelt sein, welche Daten über Mobiltelefone übertragen werden dürfen. Die dafür erlaubten Schnittstellen SOLLTEN festgelegt werden. Außerdem SOLLTE beschlossen werden, wie die Daten bei Bedarf zu verschlüsseln sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist eine einfache Datenklassifizierung (z.B. „öffentlich“, „intern“, „vertraulich“) definiert. Eine Richtlinie legt fest, welche Datenklassen über welche Kanäle (z.B. E-Mail, SMS) übertragen werden dürfen. Für die Übertragung von als „vertraulich“ eingestuften Daten wird eine Methode zur Verschlüsselung (z.B. passwortgeschützte ZIP-Archive) vorgegeben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Existenz der Datenklassifizierung und der zugehörigen Übertragungsrichtlinie. Er verifiziert, dass eine Methode zur Verschlüsselung definiert und den Benutzern bekannt ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a10-m4",
                    "uuid": "c2728583-12d5-478b-8091-14e92a32040b",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Regeln zur Datenübertragung sind detailliert und an eine mehrstufige Datenklassifizierungsrichtlinie gekoppelt. Es sind spezifische, genehmigte Anwendungen und Verfahren für die Übertragung von sensiblen Daten definiert (z.B. Nutzung eines sicheren Messengers, falls auf dem Gerät verfügbar). Die Benutzer werden in der Anwendung dieser Verfahren geschult."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Richtlinie ist praxisnah und gibt klare Handlungsanweisungen für verschiedene Szenarien. Beispielsweise darf die Personalabteilung bestimmte Daten mobil bearbeiten, aber nur über einen gesicherten Kanal. Die Schulungen beinhalten praktische Übungen zur Verschlüsselung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die detaillierte Richtlinie und die Schulungsunterlagen. In Interviews wird das Verständnis der Benutzer für die korrekte Handhabung verschiedener Datenklassen auf ihren Mobiltelefonen überprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "bda7d21e-da41-4ed2-8c18-9f74df191426",
                "control-id": "KONF.2.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.3.3-a8-m2",
                    "uuid": "4c8804b6-434b-4742-9ec3-e6df3f92f3fd",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Benutzer werden in einer Richtlinie darauf hingewiesen, nicht benötigte drahtlose Schnittstellen wie Bluetooth oder WLAN zu deaktivieren. Die Einhaltung wird nicht überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein entsprechender Passus ist Teil der allgemeinen Sicherheitsrichtlinie für Mobiltelefone. Es werden keine weiteren Maßnahmen ergriffen, um die Benutzer an diese Regel zu erinnern oder sie zu schulen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Richtlinie auf den entsprechenden Hinweis. Bei einer stichprobenartigen Inspektion von Geräten wird festgestellt, dass die Schnittstellen häufig dauerhaft aktiviert sind, was auf eine geringe Wirksamkeit der Maßnahme hindeutet."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a8-m3",
                    "uuid": "99b5bfc2-7978-4fbd-9f72-8028b5b99592",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Drahtlose Schnittstellen von Mobiltelefonen wie IrDA, WLAN oder Bluetooth SOLLTEN deaktiviert werden, solange sie nicht benötigt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Diese Regel wird den Benutzern im Rahmen der Sicherheitsschulung aktiv vermittelt. Es wird erklärt, warum dies wichtig ist (Reduzierung der Angriffsfläche, Stromsparen). Die Benutzer werden angeleitet, die Schnittstellen nur bei Bedarf zu aktivieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Schulungsunterlagen auf entsprechende Inhalte. Bei Interviews und stichprobenartigen Geräteprüfungen wird verifiziert, ob die Benutzer die Regel kennen, ihren Zweck verstehen und sie im Alltag mehrheitlich umsetzen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a8-m4",
                    "uuid": "9f7b1f6d-350c-46e0-9e99-300e472cac8b",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Richtlinie zum Deaktivieren ungenutzter Schnittstellen wird durch regelmäßige Erinnerungen im Rahmen von Awareness-Kampagnen verstärkt. Die Benutzer werden explizit über die Risiken der Verbindung mit unsicheren öffentlichen WLANs oder dem Koppeln mit unbekannten Bluetooth-Geräten geschult."
                      },
                      {
                        "name": "guidance",
                        "value": "In Newslettern oder am „Security Awareness Day“ wird das Thema regelmäßig aufgegriffen. Die Schulungen enthalten konkrete Beispiele für Angriffe über drahtlose Schnittstellen. Die Einhaltung wird bei Support-Anfragen stichprobenartig überprüft und der Nutzer freundlich daran erinnert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Materialien der Awareness-Kampagnen und die erweiterten Schulungsinhalte. Er befragt Mitarbeiter, um festzustellen, ob sie die spezifischen Risiken (z.B. „Man-in-the-Middle“-Angriffe im WLAN) kennen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "54521e9d-ac3f-457e-af87-a155434a0e78",
                "control-id": "KONF.3.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.3.3-a5-m2",
                    "uuid": "57052511-ba8b-46b0-b20b-1586a2cd42d1",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Verwendung einer SIM-Karten-PIN ist für alle Benutzer verpflichtend. Die Verwendung eines Geräte-Sperrcodes wird empfohlen, aber nicht erzwungen oder überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei der Ausgabe des Geräts wird der Benutzer angewiesen, die Standard-PIN der SIM-Karte zu ändern. Es gibt keine weiteren Konfigurationen oder Überprüfungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor befragt Benutzer stichprobenartig, ob sie eine SIM-PIN verwenden. Es wird festgestellt, dass keine Maßnahmen zur Durchsetzung eines Geräte-Sperrcodes existieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a5-m3",
                    "uuid": "cf7c6159-8ba7-47e1-a0db-0a0743c5fb4e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die verfügbaren Sicherheitsmechanismen SOLLTEN auf den Mobiltelefonen genutzt und vorkonfiguriert werden. Die SIM-Karte SOLLTE durch eine sichere PIN geschützt werden. Das Mobiltelefon SOLLTE durch einen Geräte-Code geschützt werden. Die Super-PIN/PUK SOLLTE nur im Rahmen der definierten Prozesse von den Zuständigen benutzt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor der Ausgabe werden die Mobiltelefone so konfiguriert, dass die Nutzung einer SIM-PIN und eines Geräte-Sperrcodes erzwungen wird. Die Benutzer werden bei der Übergabe angeleitet, sichere, nicht-triviale Codes zu setzen. Der PUK wird zentral und sicher vom IT-Betrieb verwaltet und nur nach einer Identitätsprüfung des Benutzers herausgegeben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft den Prozess der Geräteausgabe, um sicherzustellen, dass die Sicherheitsmechanismen konfiguriert werden. Er überprüft den Prozess zur Verwaltung und Herausgabe des PUK auf Sicherheit und Nachvollziehbarkeit. Bei der physischen Inspektion von Geräten wird geprüft, ob Sperrcodes aktiv sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a5-m4",
                    "uuid": "12fc660a-a92a-4c66-b2b5-0b39c603065f",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zur PIN- und Gerätecode-Pflicht wird, falls technisch möglich, das Gerät fest an die ausgegebene SIM-Karte gebunden (SIM-Lock). Es wird eine Richtlinie für die Komplexität der Geräte-Codes (Mindestlänge) durchgesetzt und die automatische Sperre des Bildschirms nach kurzer Inaktivität wird konfiguriert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die SIM-Lock-Funktion wird direkt beim Mobilfunkanbieter oder, falls vom Gerät unterstützt, manuell konfiguriert. Die Benutzer werden angewiesen, einen mindestens 6-stelligen Geräte-Code zu verwenden und die automatische Sperre auf maximal 1 Minute einzustellen. Dies wird bei der Ausgabe überprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft stichprobenartig die Konfiguration der Geräte auf die Aktivierung von SIM-Lock, die Einhaltung der Code-Länge und die Einstellung der automatischen Sperre. Die Prozessdokumentation zur Konfiguration wird eingesehen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "25e1ea7a-7ea8-4dbd-971f-6a4a8574fd92",
                "control-id": "KONF.3.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.3.3-a13-m3",
                    "uuid": "80fbb8e4-45e3-417e-ac54-0b96e691bd99",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In den Sicherheitsrichtlinien und Schulungen wird auf die Risiken der Standortermittlung durch das Mobilfunknetz und GPS hingewiesen. Für Geräte mit GPS-Funktion ist festgelegt, dass diese standardmäßig deaktiviert sein muss."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Benutzer werden angewiesen, die GPS-Funktion in den Geräteeinstellungen zu deaktivieren und nur bei Bedarf für Navigationszwecke zu aktivieren. Dies wird in der Sicherheitsschulung thematisiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Richtlinien und Schulungsunterlagen. Bei stichprobenartigen Geräte-Inspektionen wird die GPS-Einstellung überprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a13-m4",
                    "uuid": "1349703e-e33b-4648-aab8-987573803d91",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE geklärt werden, ob sich die Erstellung von Bewegungsprofilen durch Dritte negativ auswirken kann oder als Problem angesehen wird. Um eine Ortung über GPS zu verhindern, SOLLTE diese Funktion abgeschaltet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine spezifische Risikoanalyse für bestimmte Benutzergruppen (z.B. Führungskräfte, Geheimnisträger) durchgeführt, um die Gefährdung durch Bewegungsprofile zu bewerten. Basierend auf dem Ergebnis werden verbindliche Anweisungen zur Deaktivierung von GPS und ggf. weitere Verhaltensregeln erlassen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die durchgeführte Risikoanalyse und die daraus abgeleiteten Schutzmaßnahmen. Er verifiziert durch Interviews und technische Kontrollen, dass die Maßnahmen bei der betroffenen Benutzergruppe umgesetzt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a13-m5",
                    "uuid": "8635270c-fa4c-4776-80c9-fcf2d00cfea4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Falls eine Ortung über das Mobilfunknetz für bestimmte Situationen oder an bestimmten Orten zuverlässig verhindert werden soll, SOLLTE das Mobiltelefon vollständig abgeschaltet und der Akku entfernt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für den Aufenthalt in Hochsicherheitsbereichen oder bei vertraulichen Besprechungen ist eine verbindliche Anweisung erlassen, Mobiltelefone auszuschalten und den Akku zu entnehmen. Zur Aufbewahrung werden spezielle, abgeschirmte Taschen oder Schließfächer bereitgestellt. Die Regel gilt für alle Teilnehmer."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die entsprechende Richtlinie und die physischen Vorkehrungen (z.B. Schließfächer). Er beobachtet die Einhaltung der Regel bei Beginn einer als vertraulich eingestuften Besprechung."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c587a736-a1cc-431e-9949-abc54c44484c",
                "control-id": "KONF.3.6",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "REA",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.3.3-a2-m1",
                    "uuid": "1ee4b4b1-7521-4637-88ae-267643779d85",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Benutzer sind sich bewusst, dass ein verlorenes Telefon gemeldet werden sollte, aber es gibt keinen dokumentierten Prozess. Die Kontaktinformationen für die Sperrung der SIM-Karte sind nicht leicht verfügbar und müssen im Einzelfall recherchiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Verlustfall müssen die Benutzer selbst herausfinden, an wen sie sich wenden müssen, was zu erheblichen Verzögerungen bei der Sperrung der SIM-Karte führt. Es gibt keine zentrale Anlaufstelle."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor stellt durch Interviews mit Benutzern fest, ob sie wissen, wie sie im Verlustfall eines Geräts reagieren sollen. Das Fehlen eines dokumentierten Prozesses und zentral bereitgestellter Kontaktinformationen wird als Feststellung dokumentiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a2-m2",
                    "uuid": "e8547850-6d43-4365-95a9-f0958aaf5c17",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein einfacher Prozess für die Meldung eines verlorenen Geräts ist dokumentiert und im Intranet verfügbar. Die Benutzer wissen, an wen sie sich wenden müssen, um die SIM-Karte sperren zu lassen. Die Reaktion erfolgt jedoch nur während der regulären Geschäftszeiten."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Seite im Intranet listet die Telefonnummer des internen IT-Helpdesks als Ansprechpartner auf. Der Helpdesk hat die notwendigen Informationen, um die Sperrung beim Mobilfunkanbieter zu veranlassen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Dokumentation des Meldeprozesses im Intranet. Er verifiziert durch eine Test-Anfrage beim Helpdesk (außerhalb eines echten Notfalls), ob dieser auf den Prozess vorbereitet ist. Die beschränkte Erreichbarkeit wird im Auditbericht vermerkt."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a2-m3",
                    "uuid": "5e71efb3-75e8-4d2a-b4aa-49ef7b9e0557",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei Verlust eines Mobiltelefons MUSS die darin verwendete SIM-Karte zeitnah gesperrt werden. Alle notwendigen Informationen zur Sperrung von SIM-Karte und Mobiltelefon MÜSSEN für die zuständigen Stellen und die Benutzer unmittelbar griffbereit sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist eine zentrale Notfall-Hotline oder ein klar definierter Meldeweg etabliert, der den Benutzern bekannt ist. Die notwendigen Daten (z. B. Rufnummer, SIM-Kartennummer, Kundennummer beim Provider) werden zentral vorgehalten, um eine schnelle Sperrung zu ermöglichen. Die Informationen sind beispielsweise auf einer Notfallkarte oder in einem sicheren Online-Portal hinterlegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft, ob der definierte Meldeweg existiert und den Benutzern bekannt ist (z. B. durch Prüfung von Onboarding-Material). Er verifiziert stichprobenartig, ob die für eine Sperrung notwendigen Informationen zentral und griffbereit für die zuständige Stelle (z. B. IT-Helpdesk) verfügbar sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a2-m4",
                    "uuid": "9aaee9e5-9f9e-4c88-8956-65ddb56bd1f3",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Prozess zur Sperrung von SIM-Karten und Geräten wird durch einen 24/7 erreichbaren Service Desk sichergestellt. Sofern die Geräte es unterstützen, werden Mechanismen zum Diebstahlschutz wie Fernlöschung oder -sperrung aktiv genutzt. Der gesamte Prozess wird regelmäßig, mindestens einmal jährlich, getestet."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Bereitschaftsdienst des IT-Helpdesks oder ein externer Dienstleister ist beauftragt, Sperrungen rund um die Uhr durchzuführen. Benutzer werden geschult, wie sie ggf. selbst eine Fernsperrung einleiten können. Die Tests des Prozesses werden protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Verträge und Dienstbeschreibungen (SLAs) des 24/7 Service Desks. Er sichtet die Protokolle der durchgeführten Prozesstests. Zudem werden Schulungsunterlagen daraufhin geprüft, ob die Nutzung von Fernlösch-Funktionen behandelt wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a2-m5",
                    "uuid": "05391883-3450-4b82-a561-31820423b6b7",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Prozess zur Reaktion auf einen Geräteverlust ist weitgehend automatisiert. Sobald ein Benutzer ein Gerät über ein Self-Service-Portal als verloren meldet, wird automatisch die Sperrung der SIM-Karte beim Mobilfunkanbieter via API angestoßen und, falls technisch möglich, das Gerät ferngesperrt und gelöscht."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Mobile-Device-Management-Lösung (MDM/UEM) ist über eine API mit dem System des Mobilfunkanbieters und einem Self-Service-Portal für Benutzer integriert. Der Prozess läuft ohne manuelle Intervention ab, um die Reaktionszeit zu minimieren. Der Status des Prozesses (Meldung, Sperrung, Löschung) ist für den Benutzer und die IT-Sicherheit transparent einsehbar."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die Konfiguration der MDM/UEM-Lösung, der API-Schnittstellen und des Self-Service-Portals. Ein End-to-End-Test des automatisierten Prozesses wird durchgeführt, um die korrekte Funktionsweise zu verifizieren. Die Logs des Systems werden auf erfolgreiche und fehlgeschlagene Automatisierungsläufe geprüft. Ein automatischer Audit kann die Erreichbarkeit und korrekte Konfiguration der API-Endpunkte überwachen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "7e5e4a62-b82d-4ec9-b22d-062b4b12943b",
                "control-id": "KONF.6.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ASST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.3.3-a12-m2",
                    "uuid": "2ef59ed1-d25d-45da-8222-f6cc111a5690",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein Pool von Mobiltelefonen wird in einer einfachen Liste (z.B. Excel) verwaltet. Ausgabe und Rücknahme werden manuell vermerkt. Nach der Rückgabe wird jedes Gerät auf Werkseinstellungen zurückgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Verantwortung liegt bei einer Person im IT-Support. Die Geräte sind nicht vorkonfiguriert, sondern werden bei der Ausgabe mit einer SIM-Karte versehen. Der Ladezustand wird nicht garantiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Inventarliste und die Protokolleinträge für Ausgabe und Rücknahme. Er stellt fest, dass die Vorbereitung der Geräte für den nächsten Nutzer (Laden, Konfiguration) nicht Teil des Prozesses ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a12-m3",
                    "uuid": "e1c5d945-3ae2-43fc-8d98-863560fa5c29",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei häufig wechselnden Benutzenden dienstlicher Mobiltelefone SOLLTE eine Sammelaufbewahrung (Pool) eingerichtet werden. Die Ausgabe und Rücknahme von Mobiltelefonen und Zubehör SOLLTE dokumentiert werden. Vor der Ausgabe SOLLTE sichergestellt werden, dass die Mobiltelefone aufgeladen und mit den nötigen Daten für die neuen Besitzenden ausgestattet sind. Zudem SOLLTEN die Benutzenden auf die Einhaltung der Sicherheitsleitlinie hingewiesen werden. Nachdem die Geräte wieder zurückgegeben wurden, SOLLTEN sie auf den Werkszustand zurückgesetzt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist ein formaler Prozess für den Geräte-Pool definiert. Eine Checkliste für Ausgabe und Rücknahme stellt sicher, dass alle Schritte (Dokumentation, Laden, Konfiguration, Hinweis auf Richtlinie, Löschen nach Rückgabe) eingehalten werden. Die Geräte werden in einem abschließbaren Schrank mit Ladevorrichtungen aufbewahrt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Prozessdokumentation und die verwendeten Checklisten. Er inspiziert den Aufbewahrungsort. Er begleitet (oder simuliert) einen Ausgabe- und Rücknahmeprozess, um die Einhaltung der definierten Schritte zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a12-m4",
                    "uuid": "27a6924e-c9ff-4ca4-816c-c77d919a093e",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Verleihprozess wird über ein IT-Ticketsystem verwaltet, das die Dokumentation automatisiert. Jeder Benutzer muss bei der Ausgabe ein Formular unterzeichnen, in dem er den Erhalt und die Kenntnisnahme der Sicherheitsrichtlinien bestätigt. Jedes Gerät hat ein Standard-Konfigurationsprofil, das vor der Ausgabe aufgespielt wird."
                      },
                      {
                        "name": "guidance",
                        "value": "Anfragen für Leihgeräte werden als Ticket erfasst. Die Ausgabe und Rücknahme werden im Ticket dokumentiert. Die unterzeichneten Formulare werden digital archiviert. Die Standardkonfiguration umfasst z.B. gespeicherte Notfallnummern oder grundlegende Einstellungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft den Workflow im Ticketsystem. Er sichtet stichprobenartig die archivierten Empfangsbestätigungen. Er überprüft die definierten Standard-Konfigurationsprofile."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "68453d44-3e6a-42a5-a0af-6b0218d96ab4",
                "control-id": "KONF.8.1.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "TEST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.3.3-a6-m2",
                    "uuid": "33acfdb2-391d-4020-bd6c-0f2d13655282",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert eine Richtlinie, die besagt, dass Benutzer verfügbare Softwareupdates für ihre Mobiltelefone installieren sollen. Die IT-Abteilung versendet gelegentlich E-Mail-Erinnerungen, wenn wichtige Updates bekannt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Verantwortung für die Durchführung von Updates liegt vollständig beim Benutzer. Es gibt keine Überprüfung, ob die Updates tatsächlich installiert wurden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Richtlinie und die versendeten E-Mail-Erinnerungen. Durch Befragung von Benutzern wird festgestellt, dass der Update-Status der Geräte uneinheitlich und nicht nachverfolgbar ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a6-m3",
                    "uuid": "6ff643d5-86bd-4c9c-8ebd-de1e41a6201c",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE regelmäßig geprüft werden, ob es Softwareupdates für die Mobiltelefone gibt. Der Umgang mit Updates SOLLTE geregelt werden. Wenn es neue Softwareupdates gibt, SOLLTE festgelegt werden, wie die Benutzenden darüber informiert werden und ob sie die Updates selber installieren dürfen oder ob die Mobiltelefone an einer zentralen Stelle hierfür abgegeben werden sollen."
                      },
                      {
                        "name": "guidance",
                        "value": "Der IT-Betrieb führt eine Liste der eingesetzten Mobiltelefon-Modelle und prüft quartalsweise auf der Website der Hersteller die Verfügbarkeit von Updates. Es ist ein Prozess definiert: Entweder werden die Benutzer per E-Mail mit einer Anleitung zur Selbstinstallation informiert, oder es wird ein Termin für ein zentrales Update durch die IT angeboten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Liste der Mobiltelefon-Modelle und die Protokolle der regelmäßigen Update-Prüfungen. Er verifiziert die Existenz des definierten Prozesses zur Update-Durchführung (z. B. durch Einsicht in die versendeten Anleitungen oder die Terminankündigungen)."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a6-m4",
                    "uuid": "2234e3bb-594f-4207-882f-86fdaff45a74",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die IT-Abteilung überwacht proaktiv und zeitnah Sicherheitsmeldungen der Hersteller für die eingesetzten Gerätemodelle. Für kritische Sicherheitsupdates wird ein beschleunigter Update-Prozess eingeleitet. Die erfolgreiche Installation wird stichprobenartig überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Der IT-Betrieb abonniert die Security-Advisories der relevanten Hersteller. Bei kritischen Lücken werden die Benutzer umgehend zur Installation aufgefordert. Die Überprüfung erfolgt, wenn die Geräte für andere Support-Anfragen bei der IT sind."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Prozesse zur Überwachung von Sicherheitsmeldungen. Er sichtet die Kommunikation und die Maßnahmen, die bei der letzten kritischen Sicherheitslücke ergriffen wurden. Die Protokolle der stichprobenartigen Überprüfungen werden eingesehen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "afd58c46-4122-4b7a-a529-40a5ef1bb43d",
                "control-id": "NOT.4.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.3.3-a11-m2",
                    "uuid": "4ae7496a-4248-4eff-bb5a-ebfcc9bd796b",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Benutzer werden angewiesen, wichtige Kontaktdaten manuell auf ihrer SIM-Karte zu sichern. Es wird ein kleiner Pool an unkonfigurierten Ersatzgeräten vorgehalten."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Verantwortung für die Datensicherung liegt vollständig beim Benutzer. Im Falle eines Defekts erhält der Benutzer ein leeres Ersatzgerät und muss seine SIM-Karte einlegen. Die Wiederherstellung von Daten, die nicht auf der SIM-Karte waren, ist nicht möglich."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor stellt durch Interviews fest, dass die Datensicherung uneinheitlich und oft unvollständig erfolgt. Er prüft die Existenz des Ersatzgeräte-Pools und den Prozess des Austauschs."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a11-m3",
                    "uuid": "011ef878-e2db-4c25-805d-8920d73bbfbf",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die auf einem Mobiltelefon gespeicherten Daten SOLLTEN in regelmäßigen Abständen auf einem externen Medium gesichert werden. Muss ein defektes Mobiltelefon repariert werden, SOLLTEN zuvor alle Daten gelöscht und das Gerät auf den Werkszustand zurückgesetzt werden. Es SOLLTEN immer Ersatzgeräte vorhanden sein, um ein ausgefallenes Mobiltelefon kurzfristig ersetzen zu können."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist ein Prozess für regelmäßige Backups definiert, z.B. durch die Anweisung, das Telefon monatlich mit einer PC-Software zu synchronisieren. Ein Pool an vorkonfigurierten Ersatzgeräten steht zur Verfügung. Es gibt eine Checkliste, die sicherstellt, dass Geräte vor der Weitergabe zur Reparatur zurückgesetzt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Prozessdokumentation für Backups und für die Handhabung von Reparaturfällen. Er inspiziert den Ersatzgeräte-Pool. Die Einhaltung der Backup-Prozedur wird durch Befragung der Nutzer verifiziert."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.3.3-a11-m4",
                    "uuid": "799a335e-fc3b-4bb4-9b9a-6f2b4e64ae05",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Sofern technisch möglich, werden Kontaktdaten und Kalender zentral mit einem Server der Organisation (z.B. Exchange ActiveSync) synchronisiert. Der Austausch eines defekten Geräts ist innerhalb einer definierten, kurzen Frist (z.B. ein Arbeitstag) gewährleistet."
                      },
                      {
                        "name": "guidance",
                        "value": "Für Feature-Phones, die Synchronisation unterstützen, wird diese bei der Ausgabe konfiguriert. Dadurch wird die Abhängigkeit von manuellen Backups reduziert. Der Prozess für den Gerätetausch ist so optimiert, dass Ausfallzeiten minimiert werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Konfiguration der Synchronisationsdienste. Er verifiziert die definierte Service-Level-Vereinbarung (SLA) für den Austausch und prüft anhand von Tickets vergangener Austauschvorgänge, ob diese eingehalten wurde."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}