{
  "component-definition": {
    "uuid": "c84fcabb-06ef-4547-95e8-dc40d1520560",
    "metadata": {
      "title": "INF.12 Netze - Benutzerdefiniert",
      "last-modified": "2025-11-23T15:33:42.688041+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "27ad5af9-233a-423c-97b7-f77f4fc79e4a",
        "type": "physical",
        "title": "INF.12 Netze",
        "description": "This component represents the implementation of all controls for Baustein INF.12.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Die ordnungsgemäße und normgerechte Ausführung der Verkabelung ist Grundlage für einen sicheren IT-Betrieb. Dabei muss grundsätzlich zwischen der elektrotechnischen Verkabelung und der IT-Verkabelung unterschieden werden.<BR>Die elektrotechnische Verkabelung von IT-Systemen und anderen Geräten umfasst alle Kabel und Verteilungen im Gebäude vom Einspeisepunkt des Verteilungsnetzbetreibers (VNB) bis zu den Anschlüssen der Endgeräte.<BR>Die IT-Verkabelung in einer Institution umfasst alle Kommunikationskabel und passiven Komponenten wie Rangier- bzw. Spleißverteiler oder Patchfelder. Sie bildet also die physikalische Grundlage der internen Kommunikationsnetze. Die IT-Verkabelung reicht von den Übergabepunkten aus einem Fremdnetz bis zu den Anschlusspunkten der Netzteilnehmenden. Übergabepunkte sind z. B. der Anschluss eines Telekommunikationsunternehmens oder die DSL-Anbindung eines Internet-Providers.<BR>Trotz dieser Unterscheidung sind die grundlegenden Anforderungen an beide Arten der Verkabelung identisch. Daher sollte die Verkabelung innerhalb einer Institution immer auch als Ganzes betrachtet werden."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es, die gesamte elektrotechnische Verkabelung und IT-Verkabelung vor Ausfall, Manipulation und Störung zu schützen."
          },
          {
            "name": "Abgrenzung_und_Modellierung",
            "value": "Der Baustein INF.12 Verkabelung ist einmal auf die Verkabelung in Gebäuden und Räumen anzuwenden, zusätzlich zum Baustein INF.1 Allgemeines Gebäude. Die Anforderungen des Bausteins sind immer sowohl auf die IT- als auch auf die elektronische Verkabelung anzuwenden."
          },
          {
            "name": "_2.1._Kabelbrand",
            "value": "Kabelbrände können einen Informationsverbund erheblich schädigen. Ein Kabelbrand verursacht z. B. Kurzschlüsse oder unterbricht Leiter. Infolgedessen fallen auch Schutzeinrichtungen aus. Zudem können bei Kabelbränden, abhängig von den Materialien der Isolierungen, aggressive Gase entstehen."
          },
          {
            "name": "_2.2._Unzureichende_Dimensionierung_der_Verkabelung",
            "value": "Werden Arbeitsplätze, Serverräume oder Rechenzentren geplant, dann werden diese Pläne häufig ausschließlich am aktuellen Bedarf ausgerichtet. Jedoch verlangen zukünftige neue Anforderungen oft auch nach weiteren Kapazitäten des Stromnetzes und der Datenkabel. Dies kann z. B. notwendig werden, sobald zusätzliche Server eingesetzt werden oder sich technische Standards ändern. Die Verkabelung kann aber nur in dem Umfang erweitert werden, den die bereits vorhandenen und verlegten Kabel und Kabeltrassen zulassen."
          },
          {
            "name": "_2.3._Unzureichende_Dokumentation_der_Verkabelung",
            "value": "Wenn die genaue Lage von Kabeln nicht bekannt ist, weil sie unzureichend dokumentiert wurde, dann können diese Kabel bei Bauarbeiten außerhalb oder innerhalb eines Gebäudes beschädigt werden. Eine unzureichende Dokumentation erschwert es auch, Kabel zu prüfen und zu reparieren.<BR>Darüber hinaus kann nicht davon ausgegangen werden, dass alle Kabel in den Installationszonen nach aktuell gültigen Normen installiert sind."
          },
          {
            "name": "_2.4._Unzureichend_geschützte_Verteiler",
            "value": "Gelegentlich sind Verteilungen des Stromversorgungs- oder Datennetzes unverschlossen in Bereichen installiert, die allgemein zugänglich sind. Unbefugte Personen können solche Verteiler öffnen, manipulieren und so Ausfälle in der Strom- oder Datenversorgung herbeizuführen."
          },
          {
            "name": "_2.5._Leitungsbeschädigungen",
            "value": "Je ungeschützter ein Kabel verlegt ist, desto größer ist die Gefahr, dass es absichtlich oder unabsichtlich beschädigt wird. Beschädigungen verursachen nicht nur direkte Ausfälle von Verbindungen, sondern können auch später zu Störungen führen. Eine beschädigte Isolierung beeinträchtigt unter Umständen erst mit großer zeitlicher Verzögerung die funktionellen Eigenschaften eines Kabels."
          },
          {
            "name": "_2.6._Spannungsschwankungen__Überspannung__Unterspannung",
            "value": "Schwankungen der Versorgungsspannung können in allen Bereichen der Netze entstehen. Extrem kurze und kleine Ereignisse wirken sich kaum oder gar nicht auf IT-Systeme aus. Größere Schwankungen führen jedoch zu Funktionsstörungen. Die angeschlossenen Systeme können beschädigt werden bis hin zu Totalausfällen. Auch zerstörerische Überspannungen können auftreten."
          },
          {
            "name": "_2.7._Verwendung_qualitativ_unzureichender_Steckdosenleisten",
            "value": "Oft reichen die fest installierten Steckdosen für die zu betreibenden Geräte nicht aus. Um dies auszugleichen, werden häufig Steckdosenleisten verwendet. Sind diese Steckdosenleisten jedoch qualitativ unzureichend, dann können sie zur Zündquelle und damit zu einer großen Brandgefahr werden.<BR>In vielen Fällen werden mehrere Steckdosenleisten hintereinander geschaltet, um Steckplätze für alle Geräte bereitzustellen. Bei einer solchen Reihenschaltung besteht die Gefahr der Überlastung. Die Folge kann ein unvollständiger Kurzschluss mit hoher Brandgefahr sein."
          },
          {
            "name": "_2.8._Unzulässige_Kabelverbindungen",
            "value": "In manchen Fällen werden zwischen IT-Systemen oder anderen technischen Komponenten Kabelverbindungen hergestellt, die nicht vorgesehen und unzulässig sind. Dies kann Sicherheitsprobleme oder Betriebsstörungen verursachen.<BR>So ermöglichen solche Kabelverbindungen unter Umständen, dass unerlaubt auf Datennetze, IT-Systeme, Informationen oder Anwendungen zugegriffen werden kann. Durch unzulässige Kabelverbindungen können Informationen auch zu falschen Empfangenden übertragen werden. Zudem kann die Verbindung gestört werden."
          },
          {
            "name": "_2.9._Leitungsbeeinträchtigungen",
            "value": "Die elektrische Signalübertragung in Kommunikationskabeln kann durch elektrische und magnetische Felder negativ beeinflusst werden. Eine spezielle Form dieser Leitungsbeeinträchtigung ist Übersprechen. Dabei werden Ströme und Spannungen von benachbarten Leitungen als Störsignale auf das Kommunikationskabel übertragen."
          },
          {
            "name": "_2.10._Abhören_und_Manipulation_von_Kabeln",
            "value": "Abhörangriffe auf Datenkabel sind eine Gefahr für die Informationssicherheit, die nicht vernachlässigt werden sollte. Grundsätzlich gibt es keine abhörsicheren Kabel. Die Kabel unterscheiden sich in ihrer Qualität lediglich hinsichtlich des Aufwands, der zum Abhören der Leitung betrieben werden muss. Ob ein Kabel tatsächlich abgehört wird, ist nur mit hohem messtechnischem Aufwand feststellbar.<BR>Daneben stellen bewusste Manipulationen von Kabeln bis hin zu ihrer Zerstörung eine Gefahr für die Institution dar. Fehlfunktionen von Kabeln können in manipulativer Absicht bewusst herbeigeführt werden. Solche Manipulationen verfolgen oftmals das Ziel, den IT-Betrieb zu stören oder die Institution zu schädigen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "f985644c-b5e2-4c7a-89d2-8e193cc029eb",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Kompendien/Grundschutz%2B%2B-Kompendium/profile/netze_profile.json",
            "description": "Implementation for all controls in Baustein INF.12",
            "implemented-requirements": [
              {
                "uuid": "27e8b3e1-5e14-4766-9824-a323f7abc8cf",
                "control-id": "ARCH.2.1",
                "description": "(BSI Baustein INF.12) Relevant sind dabei (falls vorhanden) auch WLANs/SSIDs, IoT-Geräte wie vernetzte Kühlschränke, Hausleittechnik, operative Technologien, Industrielle Steuerungssysteme oder Netze zum Zugriff auf Speichersysteme (Storage Area Network, SAN). Die Anforderung gilt auch, wenn die Systeme nur noch als VMs oder Container existieren. Die Segmentierung kann hier in die virtuelle Netzwerk‑Ebene verlagert werden, sodass die Segmentierung weder vom Hypervisor noch von den Workloads umgangen wird. Die Einteilung in Segmente kann anhand einer Klassifizierung von Netzen erfolgen (z.B. nach Schutzbedarf der dort verarbeiteten Daten oder nach Risikoklassen angeschlossener Systeme) erfolgen. Beispiele hierfür sind Internet-Domäne, Endgeräte-Domäne, Domäne für zentrale Serverdienste, Domäne für Systeme hoher Vertraulichkeit. Alternativ können auch organisatorische Domänen verwendet werden, z.B. Personalwesen, Marketing, Finanzverwaltung, Innere Verwaltung. Die Filterkriterien können sich nach den Sicherheitsanforderungen der jeweiligen Netze im Einzelnen oder nach einer vorgenommenen Klassifikation der Netze richten. Hierzu gehören insbesondere die Anforderungen zur Authentifizierung und Autorisierung von Assets.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.2.1-m1",
                    "uuid": "2d2e95c2-4b9b-4a4a-95b4-92edb81699e5",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das interne Netz wird als flaches Netzwerk betrieben, in dem keine logische oder physische Unterteilung vorgenommen wird."
                      },
                      {
                        "name": "guidance",
                        "value": "Es existiert lediglich ein einzelnes Netzsegment für alle Geräte (Server, Clients, Drucker, IoT). Sicherheit beruht allein auf dem Perimeterschutz."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie den Netzwerkplan auf das Fehlen von Subnetzen oder VLANs. Ein Scan mit nmap zeigt Erreichbarkeit aller internen Hosts untereinander."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.1-m2",
                    "uuid": "16932214-cd00-48c9-8c9e-52d337407a16",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Segmentierung in Hauptbereiche (z. B. Server und Clients) ist mittels VLANs eingerichtet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Netzinfrastruktur ist rudimentär unterteilt, um Broadcast-Domänen zu verkleinern und grobe Sicherheitszonen zu schaffen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Switch-Konfigurationen auf die Existenz mehrerer VLANs (z. B. 'show vlan'). Prüfen Sie, ob Clients von Servern getrennt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.1-m3",
                    "uuid": "c16f6024-5882-4df2-b214-6d39d4f64dcc",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE eine Unterteilung des internen Netzes in Netzsegmente unter Berücksichtigung der Anforderungen der Institution und des Sc"
                      },
                      {
                        "name": "guidance",
                        "value": "Die Segmentierung muss den Schutzbedarf der verarbeiteten Daten widerspiegeln. Kritische Bereiche sind von weniger kritischen zu trennen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Verifizieren Sie, dass das Netzkonzept eine Segmentierung vorsieht, die dem Schutzbedarf entspricht. Prüfen Sie Routing-Tabellen und Firewall-Regelwerke auf korrekte Trennung."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.1-m4",
                    "uuid": "3ab8423e-03e9-411e-8f2f-32282b4c23e2",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Netz ist feingranular nach Abteilungen, Funktionen und Sicherheitsstufen segmentiert (Mikrosegmentierung)."
                      },
                      {
                        "name": "guidance",
                        "value": "Jede funktionale Einheit erhält ein eigenes Segment. Der Datenverkehr zwischen Segmenten ist standardmäßig blockiert und nur explizit erlaubt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Führen Sie Penetrationstests durch, um die Isolation zwischen Abteilungs-VLANs zu bestätigen. Prüfen Sie den Einsatz von Private VLANs oder ACLs auf Switch-Ebene."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.1-m5",
                    "uuid": "3b379365-2b97-4b9a-901d-b197fba20928",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Zero-Trust-Architektur mit dynamischer, softwaredefinierter Segmentierung (SDN) ist vollständig implementiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Segmentierung erfolgt identitätsbasiert und unabhängig von der physischen Topologie. Richtlinien werden automatisiert durchgesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die SDN-Controller-Richtlinien. Validieren Sie mittels automatisierter Tests, dass Workloads bei Verschiebung ihre Sicherheitszone behalten."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e536629f-1495-49f3-9223-4d85c3246d01",
                "control-id": "ARCH.2.2",
                "description": "(BSI Baustein INF.12) Dient dem Ziel, die Angriffsfläche innerhalb interner und externer Netze zu reduzieren und die Ausbreitung potenzieller Schadsoftware oder unberechtigter Zugriffe einzudämmen. Ohne solche Begrenzungen könnte ein einzelner kompromittierter Bereich direkten Zugriff auf weitere sensible Segmente erhalten und dadurch Geschäftsprozesse massiv beeinträchtigen. Beispielsweise benötigt ein Endgerät Verbindungen zu internen Servern und Druckern, während Gäste lediglich auf den Internetanschluss Zugriff benötigen. Im Blick auf weitreichende Sicherheitsvorfälle ist hier insbesondere die Trennung interner Netzsegmente vom Internet zu beachten. Diese Regeln können auf Kriterien wie Gerätetyp (z. B. Laptop, IoT-Gerät), Benutzerrolle (z. B. Administrator, Gast), physischem Anschlussort oder Uhrzeit basieren. Eine klare Trennung von Benutzergruppen über VLANs oder dynamische ACLs erhöht die Sicherheit und Transparenz. Für die Einführung in eine bestehende Umgebung kann ein gestuftes Vorgehen gewählt werden: (1) Zunächst wird ein Überwachungsmodus (\"Audit-Only\") aktiviert, der protokolliert, welche Zugriffe durch eine strengere Richtlinie verweigert würden, ohne sie tatsächlich zu blockieren. (2) Anschließend werden diese Protokolle analysiert, um legitime, für den Geschäftsbetrieb notwendige Zugriffe zu identifizieren und diese gezielt in die jeweiligen Rollen und Berechtigungsgruppen aufzunehmen. (3) Erst wenn keine legitimen Zugriffe mehr in den Protokollen als \"verweigert\" auftauchen, wird die Richtlinie scharf geschaltet und blockiert aktiv alle nicht explizit erlaubten Zugriffe.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.2.2-m1",
                    "uuid": "fbed49d4-e099-4cbc-898b-2f5c08d9c4ff",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Verbindungen zwischen Netzsegmenten sind weitgehend uneingeschränkt möglich."
                      },
                      {
                        "name": "guidance",
                        "value": "Routing zwischen Subnetzen erfolgt ohne Filterung. Ein 'Any-Any'-Ansatz dominiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Versuchen Sie, Dienste in einem anderen Segment ohne Einschränkung zu erreichen (z. B. via 'ping' oder 'telnet')."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2-m2",
                    "uuid": "752802f3-4ac9-4836-abca-8d69ef54381d",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Verbindungen werden durch statische Paketfilter (ACLs) auf Basis von IP-Adressen und Ports grundlegend eingeschränkt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es existieren Router-ACLs oder einfache Firewalls, die offensichtlich unnötigen Verkehr blockieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie Router-ACLs (z. B. 'show access-lists'). Stellen Sie sicher, dass nicht benötigte Ports zwischen Zonen geschlossen sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2-m3",
                    "uuid": "140e5acd-c75e-44ae-ab61-2b1ecf8e8a9c",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE Verbindungen zwischen Netzsegmenten anhand von {{ insert: param, arch.2.2-prm1 }} einschränken."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Datenfluss zwischen den Segmenten muss auf das betrieblich notwendige Minimum reduziert und reglementiert werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Firewall-Regelwerke auf Übereinstimmung mit der definierten Matrix der erlaubten Kommunikationsbeziehungen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2-m4",
                    "uuid": "4a2a65b7-b06c-45d2-8d22-6ee138769711",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Stateful Inspection Firewalls oder Next-Generation Firewalls kontrollieren den Verkehr auf Anwendungsebene (Layer 7)."
                      },
                      {
                        "name": "guidance",
                        "value": "Verbindungen werden nicht nur nach Port, sondern nach Applikation und Inhalt gefiltert. IPS ist aktiv."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Testen Sie, ob Protokoll-Tunneling erkannt wird. Überprüfen Sie Logs auf Blockierung nicht autorisierter Anwendungen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2-m5",
                    "uuid": "170ed201-85cd-48e7-9b09-3a800ff1e499",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Netzwerkzugriff wird dynamisch basierend auf Kontext, Identität und Risikoanalyse in Echtzeit gesteuert."
                      },
                      {
                        "name": "guidance",
                        "value": "Policy-Engines bewerten jeden Verbindungsaufbau neu. Anomalien führen zur sofortigen Isolation."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Führen Sie simulierte Angriffe durch, um die Reaktionszeit der dynamischen Zugriffskontrolle zu messen. Auditieren Sie die Policy-as-Code Repositories."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "9257ded4-1f15-4e63-9bf5-d1d09de768e2",
                "control-id": "ARCH.2.2.1",
                "description": "(BSI Baustein INF.12) Dient dazu, die Angriffsfläche zu reduzieren, unerwünschte Ein- und Ausleitungen zu begrenzen und das Risiko von Datenabflüssen zu minimieren. Für mobile Systeme kann dies z.B. über das Erzwingen einer VPN-Verbindung ins gefilterte Netz der Institution oder über die Verwendung eines direkten Internetzugangs erfolgen, welcher über einen Direct-Internet-Access Agenten abgesichert ist.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.2.2.1-m1",
                    "uuid": "8330b334-4e4c-4f30-afe3-64d8c6f4f6de",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Externe Netzanschlüsse werden dezentral und ohne einheitliche Sicherheitsvorgaben betrieben."
                      },
                      {
                        "name": "guidance",
                        "value": "Abteilungen nutzen eigene DSL-Modems oder LTE-Router ohne zentrale Kontrolle."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Führen Sie eine physische Begehung oder WLAN-Scans durch, um nicht autorisierte Access Points oder Modems zu finden."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.1-m2",
                    "uuid": "a1ea935a-a639-4ff6-8510-f8927b693fcd",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein zentraler Internetübergang ist eingerichtet und mit einer einfachen Firewall abgesichert."
                      },
                      {
                        "name": "guidance",
                        "value": "Der gesamte externe Verkehr wird über einen zentralen Punkt geleitet (Central Breakout)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Validieren Sie das Routing, um sicherzustellen, dass der Default-Gateway auf die zentrale Firewall zeigt."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.1-m3",
                    "uuid": "4507b094-2f08-4c55-9698-3a1d7578b965",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE Verbindungen über externe Netzanschlüsse einschränken."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle externen Verbindungen müssen über kontrollierte Sicherheitsgateways geführt und streng gefiltert werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Konfiguration des Sicherheitsgateways. Stellen Sie sicher, dass eingehende Verbindungen standardmäßig blockiert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.1-m4",
                    "uuid": "16b77009-83c9-4564-ab12-9051ae1c837a",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Externe Verbindungen werden durch Proxies, IDS/IPS und SSL-Inspection tiefgehend analysiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es erfolgt eine Inhaltsprüfung verschlüsselter Verbindungen. Der Zugriff auf externe Ressourcen ist Whitelist-basiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie, ob Malware in verschlüsselten Downloads durch die SSL-Inspection erkannt wird (z. B. EICAR Testfile via HTTPS)."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.1-m5",
                    "uuid": "df8e91b1-d3e5-49a0-8fae-b9d3d1a4a58c",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Einsatz einer SASE (Secure Access Service Edge) Architektur mit Cloud-native Security Stacks."
                      },
                      {
                        "name": "guidance",
                        "value": "Sicherheitsrichtlinien werden global und standortunabhängig durchgesetzt. Kontinuierliches Monitoring aller externen Datenflüsse."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Auditieren Sie die SASE-Konsole auf lückenlose Abdeckung aller Standorte und Roaming-User."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "0c0a222d-f8a0-440a-97bf-488a9907d915",
                "control-id": "ARCH.2.2.12",
                "description": "(BSI Baustein INF.12) Obwohl sich eine virtuelle Vernetzung immer größerer Beliebtheit erfreut, können Konfigurationsfehler oder Sicherheitslücken dabei leichter zu einer Umgehung der Netztrennung führen, als wenn die Netze bereits auf physischer Ebene voneinander getrennt werden.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.2.2.12-m1",
                    "uuid": "b5c001da-821d-454e-8353-28c67679ccce",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Netzwerkkomponenten sind in allgemein zugänglichen Bürobereichen oder unverschlossenen Schränken installiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Jeder mit Zutritt zum Gebäude kann physisch auf Ports oder Geräte zugreifen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Führen Sie eine Begehung durch und prüfen Sie, ob Switche oder Patchfelder frei zugänglich sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.12-m2",
                    "uuid": "03e5a15c-7aa4-4e65-9a02-66909ca5ad61",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Verteiler liegen in verschließbaren Schränken oder Räumen, Zutrittskontrolle ist einfach (Schlüssel)."
                      },
                      {
                        "name": "guidance",
                        "value": "Physischer Basisschutz ist vorhanden, Schlüsselmanagement erfolgt manuell."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie, ob Verteilerschränke tatsächlich verschlossen sind und wer Schlüssel besitzt."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.12-m3",
                    "uuid": "8f03c0af-eab5-4c06-b815-5a8ff168fe43",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze KANN den physischen Zugang auf diese einschränken."
                      },
                      {
                        "name": "guidance",
                        "value": "Kritische Netzbereiche sollten durch bauliche Maßnahmen und Zutrittskontrollsysteme geschützt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie Protokolle der elektronischen Zutrittskontrolle zu Serverräumen und Verteilerknoten."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.12-m4",
                    "uuid": "1432b84b-c516-4114-b7e8-835200f7d347",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zutritt zu Netzwerkverteilern ist elektronisch überwacht, protokolliert und alarmgesichert."
                      },
                      {
                        "name": "guidance",
                        "value": "Zutritt erfordert Mehrfaktor-Authentifizierung. Videoüberwachung in Serverbereichen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Testen Sie den Alarm, indem Sie eine Tür unberechtigt öffnen (unter Aufsicht). Prüfen Sie die Videoaufzeichnung."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.12-m5",
                    "uuid": "5d57dbc7-8070-4e7f-a33b-d698550c66f0",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Hochsicherheitszellen mit biometrischem Zutritt, Vereinzelungsanlagen und Schutz gegen elektromagnetische Abstrahlung."
                      },
                      {
                        "name": "guidance",
                        "value": "Verwendung von TEMPEST-geschützten Racks oder Räumen für hochsensitive Bereiche."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Auditieren Sie die Zertifizierung der baulichen Abschirmung und die biometrischen Zugangssysteme."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "3491c181-2404-46f8-8bfa-5d74dedb881c",
                "control-id": "ARCH.2.2.2",
                "description": "(BSI Baustein INF.12) Wenn Gäste der Institution sich mit dem internen Netz verbinden, könnten Schadprogramme in das Netz gelangen oder unbeabsichtigte Datenflüsse über die Verbindung fließen. Daher ist es sinnvoll, einen vom übrigen Netz getrennten Gastzugang einzurichten, z.B. in Besprechungs-, Veranstaltungs- und Schulungsräumen. Wenn die Einschränkungen von Gastnetzen lockerer sind als die interner Netze am gleichen Standort, so zeigt die Erfahrung, dass auch interne Mitarbeitende gerne auf Gastnetze zurückgreifen. Dadurch könnte es zur Umgehung der internen Schutzmaßnahmen kommen. Daher ist es empfehlenswert, für das Gastnetz gleiche oder strengere Einschränkungen zu wählen oder die Nutzung des Gastnetzes durch Mitarbeitende technisch oder organisatorisch zu beschränken.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.2.2.2-m1",
                    "uuid": "d9fde18e-cf0d-440c-8675-01b88883c688",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Gäste erhalten Zugriff auf das reguläre interne Netzwerk oder teilen sich das WLAN mit Mitarbeitenden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es findet keine Trennung zwischen vertrauenswürdigen internen Geräten und fremden Gastgeräten statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Verbinden Sie sich mit dem Gast-Zugang und versuchen Sie, interne Server (z. B. Drucker, Dateiserver) per Ping zu erreichen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.2-m2",
                    "uuid": "7be4574e-47e9-46cb-8a79-66fbc58e4f35",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein separates Gast-VLAN oder eine Gäste-SSID ist eingerichtet, wird aber über dieselbe Firewall geroutet."
                      },
                      {
                        "name": "guidance",
                        "value": "Gäste sind logisch getrennt, nutzen aber teilweise gemeinsame Infrastrukturkomponenten ohne strikte Client-Isolation."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie, ob vom Gastnetz aus Zugriff auf das Management-Interface der Firewall oder Access Points besteht."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.2-m3",
                    "uuid": "6cf86070-48f6-439c-8008-79fa89f63918",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE Verbindungen zwischen Gastnetz und internem Netz einschränken."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Gastnetz darf keinen Zugriff auf das interne LAN haben. Es sollte lediglich Internetzugriff bereitstellen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Firewall-Regeln: 'Deny any from Guest to Internal'. Führen Sie einen Netzwerkscan vom Gastnetz aus durch."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.2-m4",
                    "uuid": "0be03027-aaf6-4f73-944a-46eecf54735c",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Gastnetz ist vollständig isoliert (Client Isolation), zeitlich beschränkt und nutzt ein Captive Portal."
                      },
                      {
                        "name": "guidance",
                        "value": "Geräte im Gastnetz können nicht untereinander kommunizieren. Bandbreitenbegrenzung und Content-Filter sind aktiv."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Versuchen Sie, einen ARP-Scan im Gastnetz durchzuführen, um andere Gastgeräte zu finden. Dies sollte fehlschlagen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.2-m5",
                    "uuid": "9086373f-0605-430c-9dca-c22c779e4e63",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Gästezugänge werden über physisch getrennte DSL-Leitungen oder streng tunnelierte Verbindungen direkt ins Internet ausgeleitet."
                      },
                      {
                        "name": "guidance",
                        "value": "Es besteht keinerlei physikalische oder logische Verbindungsmöglichkeit zum internen Produktionsnetz."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die physikalische Verkabelung oder die VPN-Tunnel-Konfiguration, um die komplette Trennung zu verifizieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "f271cfdd-96dc-4439-b057-4e34c2ffd4fb",
                "control-id": "ARCH.2.2.4",
                "description": "(BSI Baustein INF.12) Werden sowohl Telefonie als auch andere Daten über dasselbe Netz geführt, so könnte dies bei einem Netzausfall dazu führen, dass keine Kommunikation mehr möglich ist, auch nicht zur Meldung oder Behebung der Störung. Die Wahrscheinlichkeit kann durch getrennt betriebene Voice- und Datennetze verringert werden. Für weitere Details siehe „Kompendium für organisationsinterne Telekommunikationssysteme mit erhöhtem Schutzbedarf\".",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.2.2.4-m1",
                    "uuid": "cc927cbd-e97c-4784-8ddb-32e505617b6d",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "VoIP-Telefone und Computer nutzen dasselbe unsegmentierte Netzwerk."
                      },
                      {
                        "name": "guidance",
                        "value": "Sprachdaten konkurrieren direkt mit Datendiensten, was zu Qualitätseinbußen und Abhörrisiken führt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Starten Sie einen Wireshark-Capture im Datennetz und prüfen Sie, ob unverschlüsselte SIP/RTP-Pakete sichtbar sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.4-m2",
                    "uuid": "9b371a4f-78ce-4887-bdf3-e9fb5d1f164f",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "VoIP-Geräte sind in einem eigenen VLAN (Voice VLAN) gruppiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Trennung erfolgt auf Layer 2. Einfaches QoS (Quality of Service) ist aktiviert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Switch-Konfiguration auf 'switchport voice vlan'."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.4-m3",
                    "uuid": "3bee3be6-d08e-42cc-8be0-f0ffd0ec1456",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze KANN eine oder mehrere separate Netzdomänen zur Trennung von Daten- und VoIP-Kommunikation installieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine strikte logische Trennung schützt vor VoIP-spezifischen Angriffen und sichert die Sprachqualität."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Stellen Sie sicher, dass Routing zwischen Daten- und Voice-Netz nur über dedizierte Gateways (SBC) möglich ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.4-m4",
                    "uuid": "e8e9d298-e727-412a-8517-fe3ba9c8b379",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "VoIP-Verkehr ist priorisiert (QoS), verschlüsselt (SRTP/TLS) und durch Session Border Controller (SBC) geschützt."
                      },
                      {
                        "name": "guidance",
                        "value": "Angriffe auf die VoIP-Infrastruktur werden aktiv erkannt und blockiert. Abhören ist durch Verschlüsselung unterbunden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Zertifikate auf den Telefonen und der TK-Anlage. Validieren Sie die SBC-Logs auf abgewehrte Angriffe."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.4-m5",
                    "uuid": "50a19060-a4fc-4b4e-a527-41dec31d0105",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Vollständig isolierte Unified Communications Infrastruktur mit KI-basierter Anomalieerkennung für Sprachmuster."
                      },
                      {
                        "name": "guidance",
                        "value": "Automatisierte Erkennung von Toll Fraud und Vishing-Versuchen. Dynamische Bandbreitenanpassung in Echtzeit."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Testen Sie das System mit VoIP-Security-Tools (z. B. SIPVicious) auf Resilienz gegen Flooding und Enumeration."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "74af75ad-e9a2-4132-990e-044cad965df2",
                "control-id": "ARCH.2.2.6",
                "description": "(BSI Baustein INF.12) Unter einer Demilitarisierten Zone versteht man in diesem Kontext ein logisch oder physisch getrenntes Teilnetz, in dem Systeme mit exponierten Diensten – wie Webserver, Mail-Gateways oder VPN-Endpunkte – betrieben werden. Systeme der Institution, die sowohl aus dem öffentlichen Netz als auch aus dem internen Netz erreichbar sind, werden in einer demilitarisierten Zone (DMZ) so betrieben, dass (1) der Netzverkehr zwischen dem System und dem öffentlichen Netz gefiltert wird und (2) der Netzverkehr zwischen dem System und anderen internen Netzen gefiltert wird. Eine DMZ kann sowohl durch dedizierte Hardware-Firewalls als auch durch virtuelle Netzwerksegmente umgesetzt werden. Ohne eine solche Trennung könnte ein kompromittierter Webserver direkt als Sprungbrett ins interne Netz dienen oder Schadsoftware könnte sich ungehindert auf sensible Systeme ausbreiten. Mit einer DMZ kann eine Institution hingegen erreichen, dass kompromittierte Systeme isoliert bleiben und sicherheitskritische interne Netze weiterhin geschützt sind.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.2.2.6-m1",
                    "uuid": "887924dd-48ba-40bc-85e1-6823dc29bb10",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Öffentlich erreichbare Dienste laufen auf Servern im internen Netzwerk mittels Port-Forwarding."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei Kompromittierung eines öffentlichen Dienstes ist das gesamte interne Netz direkt angreifbar."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die NAT-Regeln der Firewall auf Weiterleitungen zu internen IP-Adressen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.6-m2",
                    "uuid": "aa62b1a2-d0ab-4429-bb67-5c3350589db3",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine einfache DMZ (Demilitarized Zone) ist als separates Netzsegment an einer Firewall eingerichtet."
                      },
                      {
                        "name": "guidance",
                        "value": "Öffentliche Dienste stehen in der DMZ. Zugriff vom Internet ist erlaubt, aus der DMZ ins Interne Netz blockiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Validieren Sie, dass Server in der DMZ keine Verbindungen in das interne LAN initiieren können."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.6-m3",
                    "uuid": "fe8b5c2a-794f-4dbc-a49c-ecb74aea534d",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE eine demilitarisierte Zone installieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Systeme, die aus unsicheren Netzen erreichbar sind, müssen in einer DMZ isoliert werden, um das interne Netz zu schützen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie das Zonenkonzept und die Firewall-Regeln auf korrekte Implementierung der DMZ-Struktur."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.6-m4",
                    "uuid": "35da082a-84bc-420e-8c88-1c234f84e967",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Mehrstufige DMZ-Architektur (z. B. Web-Tier, App-Tier) mit Web Application Firewall (WAF)."
                      },
                      {
                        "name": "guidance",
                        "value": "Dienste sind kaskadiert geschützt. Eine WAF filtert Angriffe auf Applikationsebene vor den Servern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Führen Sie Angriffe gegen die Webanwendungen durch und prüfen Sie, ob die WAF diese blockiert und alarmiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.6-m5",
                    "uuid": "49e37b1f-ba69-490c-b17c-7cc4ee3250d8",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Containerisierte Microservices-DMZ mit ephemeren Instanzen und automatisiertem Redeployment bei Kompromittierungsverdacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Infrastruktur ist unveränderlich (Immutable). Jegliche Abweichung führt zum Neustart des Containers."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Orchestrierungs-Logs (z. B. Kubernetes) auf automatische Pod-Restarts bei Sicherheitsvorfällen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "7d8e92e6-aa5e-4927-973e-76f9ae5a68d6",
                "control-id": "ARCH.2.2.7",
                "description": "(BSI Baustein INF.12) Ein Management-Netz ist ein physisch oder durch Netzfilter separiertes Netzsegment, das dediziert für die Überwachung, Verwaltung und Wartung von IT-Systemen bestimmt ist. Es ist von anderen Produktions- und Datennetzen getrennt, um den Zugriff auf kritische Verwaltungsfunktionen zu schützen und die Verfügbarkeit dieser Zugänge auch bei Problemen im restlichen Netz zu sichern. Dies gilt auch für virtualisierte Systeme. Im Kontext der Containerisierung empfiehlt es sich, administrative Zugänge auf Applikations-Container immer über die Container-Runtime erfolgen zu lassen.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.2.2.7-m1",
                    "uuid": "f1586818-fac0-4c24-99d9-cd961501abf6",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Management-Schnittstellen von Netzwerkgeräten und Servern sind aus dem normalen Benutzer-LAN erreichbar."
                      },
                      {
                        "name": "guidance",
                        "value": "Administratoren greifen von regulären Office-PCs direkt auf sensible Konsolen zu."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Versuchen Sie, die Admin-Weboberfläche eines Switches oder Servers vom User-VLAN aus aufzurufen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.7-m2",
                    "uuid": "acfe6814-3fc4-4773-a42f-1e653ba41c76",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein dediziertes Management-VLAN existiert, Routing aus dem User-Netz ist jedoch teilweise erlaubt."
                      },
                      {
                        "name": "guidance",
                        "value": "Management-Traffic ist logisch gebündelt, aber der Zugriff ist nicht strikt auf Admin-Arbeitsplätze beschränkt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie ACLs, die den Zugriff auf das Management-VLAN regeln."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.7-m3",
                    "uuid": "9f8fbff9-8aec-412c-8792-98338422c9cd",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE ein oder mehrere Management-Netze installieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein dediziertes Management-Netz (Out-of-Band) trennt administrativen Zugriff strikt vom Nutzdatenverkehr."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Verifizieren Sie, dass Management-Schnittstellen nur über das dedizierte Netz und nicht über Produktions-Interfaces erreichbar sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.7-m4",
                    "uuid": "6b768281-1833-4189-b479-1885ac3cd9f5",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Management-Netz ist vollständig isoliert und nur über gesicherte Jump-Hosts (PAW) erreichbar."
                      },
                      {
                        "name": "guidance",
                        "value": "Direkter Zugriff ist technisch unterbunden. Zwei-Faktor-Authentifizierung ist für den Zugang zum Jump-Host pflicht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Versuchen Sie, das Management-Netz ohne Nutzung des Jump-Hosts zu erreichen. Dies muss fehlschlagen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.7-m5",
                    "uuid": "617960ce-43c7-4a6b-85c4-2bf2cf732672",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Physisch getrenntes Out-of-Band (OOB) Management-Netz mit vollautomatischer Auditierung und Session-Recording."
                      },
                      {
                        "name": "guidance",
                        "value": "Zugriffe erfolgen über isolierte Hardware-Pfade. KI überwacht administrative Tätigkeiten auf Anomalien."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die physische Verkabelung der Management-Ports. Kontrollieren Sie die Vollständigkeit der Session-Aufzeichnungen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "9ce555cd-63e9-4296-b04f-751c72a76937",
                "control-id": "ARCH.2.2.8",
                "description": "(BSI Baustein INF.12) Entwicklungs-, Staging- und Testumgebungen haben oft geringere Sicherheitsvorkehrungen als Produktivsysteme. Eine saubere Trennung zwischen Test- und Produktivumgebung verhindert Übergriffe auf das Produktivsystem und vermeidet Ressourcenkonflikte.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Operational",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.2.2.8-m1",
                    "uuid": "81b18ef9-9574-484e-b825-ca8f04b1a030",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Test- und Entwicklungssysteme laufen im selben Netzsegment wie Produktionssysteme."
                      },
                      {
                        "name": "guidance",
                        "value": "Fehler in Tests können direkt die Produktion beeinträchtigen. Echtdaten werden oft ungeschützt kopiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie, ob Testserver IP-Adressen im gleichen Subnetz wie der Produktivbetrieb haben."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.8-m2",
                    "uuid": "36eef5c2-f89b-426f-8a2b-0ac04189f77c",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Logische Trennung durch VLANs, jedoch mit offenen Verbindungen für Datentransfer."
                      },
                      {
                        "name": "guidance",
                        "value": "Testumgebungen sind eigene Segmente, aber Firewall-Regeln sind oft zu permissiv (z. B. für DB-Dumps)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie Firewall-Regeln auf Verbindungen von 'Test' nach 'Prod'."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.8-m3",
                    "uuid": "8784288e-f012-4916-a559-291d8b40fc28",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE Verbindungen zwischen Testumgebungen und Betrieb einschränken."
                      },
                      {
                        "name": "guidance",
                        "value": "Test- und Produktionsumgebungen müssen netztechnisch getrennt sein, um gegenseitige Beeinflussung zu verhindern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Validieren Sie die Netzwerktrennung. Stellen Sie sicher, dass keine direkten Verbindungen zwischen Test und Prod bestehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.8-m4",
                    "uuid": "86380ced-5d9f-4034-b154-6b038f647e47",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Strikte Firewall-Trennung. Datentransfer erfolgt nur anonymisiert und über definierte Schleusen."
                      },
                      {
                        "name": "guidance",
                        "value": "Kopieren von Echtdaten in Testsysteme ist technisch reglementiert und beinhaltet Anonymisierung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie den Prozess und die Logs der Datentransfer-Schleusen auf Einhaltung der Anonymisierungsvorgaben."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.2.8-m5",
                    "uuid": "ce2f0330-2849-41fa-8703-5d9ef427ddd4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Vollständig ephemere Testumgebungen in isolierten Containern/VPCs, die nach Nutzung zerstört werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Infrastructure as Code sorgt für identische, aber isolierte Umgebungen. Kein persistenter Zugriff möglich."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Auditieren Sie die CI/CD-Pipeline auf die Erstellung und Zerstörung von Testumgebungen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "1a6baa94-a318-4632-a62e-480a8a913036",
                "control-id": "ARCH.2.3",
                "description": "(BSI Baustein INF.12) Ein Netzplan (engl. network diagram) stellt eine schematische Darstellung der logischen und physischen Struktur von Kommunikationsnetzen dar und bildet die Grundlage für Transparenz im Betrieb. Er kann einen zentralen Beitrag zur Informationssicherheit leisten, da er Transparenz über die Struktur, Verbindungen und Schutzbedarfe einer Netzwerkumgebung schafft. Ein aktueller Netzplan, aus dem sich gut die Netzstruktur erkennen lässt, ermöglicht es Anschlüssen mit hohem Risiko oder von einzelnen Ausfallstellen (Single Points of Failure) auf einen Blick zu erkennen. Die Aufteilung in Netzdomänen ermöglicht es, verschiedene Zonen mit unterschiedlichen Schutzanforderungen – z. B. Büro-IT, Produktionsnetz, Managementnetz – getrennt zu betrachten und gezielt zu schützen. Die Erfassung externer Netzanschlüsse – etwa zu Partnernetzen, Cloud-Diensten oder dem Internet – hilft, potenzielle Angriffspunkte zu identifizieren und gezielte Schutzmaßnahmen zu planen. Beispiele für interne Netzsegmente können klassische Trennungen wie IT-Office-Netze, SCADA-/Leittechnik-Netze oder DMZs für externe Zugriffe sein. Dabei sollten auch virtuelle Netze und virtuelle Switches berücksichtigt werden, ebenso wie Container-Infrastrukturen. Als externe Netzanschlüsse kommen etwa VPN-Gateways, dedizierte Providerverbindungen, Fernwartungszugänge oder Cloud-Endpunkte in Frage. Dabei sind nicht nur die auf den ersten Blick relevanten Datennetze, sondern auch andere Telekommunikationsanbindungen wie ISDN-Leitungen, Mobilfunkausweichstrecken oder WLAN-Roaming von Clients relevant. Der Verwendungszweck beschreibt, warum ein Segment oder Anschluss existiert – etwa für Produktivsysteme, Entwicklung, Administration oder Gastzugänge. Der Zweck von Netzsegmenten kann durch einen sprechenden Namen dokumentiert werden, z. B. Management-Netz, OT-Netz, Internetanschluss, Netz der Finanzverwaltung. Dies hilft, Zuständigkeiten und Zugriffsrechte klar zuzuordnen, z. B. anhand von Geschäftsprozessen, Organisationseinheiten oder Zielgruppen (z. B. Gäste, Vertrieb, Leitung). Dabei sind, falls vorhanden, auch WLANs/SSIDs, IoT-Geräte wie vernetzte Kühlschränke, Hausleittechnik, operative Technologien oder Industrielle Steuerungssysteme zu berücksichtigen. Für die Umsetzung ist es nicht erforderlich, jedes Subnetz einzeln in einer Grafik zu visualisieren. Vielmehr kann es hilfreich sein, Netzpläne auf einem abstrahierten Level zu halten, z. B. als logische Übersicht mit Domänen, Segmenten und Übergängen (bereinigter Netzplan). Eine Visualisierung als Layer-Modell (z. B. Infrastruktur-, Kommunikations- und Applikationsebene) kann zusätzliche Einblicke schaffen. Informationen können aus Netzwerkmanagementsystemen, Konfigurationsdateien oder Asset-Management-Tools gewonnen werden. Die Pflege kann als wiederkehrende Aufgabe in Prozesse eingebettet oder im Rahmen von Änderungen (z. B. Change Management) angestoßen werden. Auch eine einfache Pflege in Tabellenform oder als visuelle Skizze kann sinnvoll sein – entscheidend ist die Klarheit und Aktualität.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Management",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.2.3-m1",
                    "uuid": "b2f8a14f-f9c5-4902-b976-e871018c67ec",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein Netzplan existiert nicht oder nur als veraltete Handskizze."
                      },
                      {
                        "name": "guidance",
                        "value": "Wissen über die Topologie ist nur in den Köpfen weniger Personen vorhanden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Fragen Sie nach dem aktuellen Netzplan. Vergleichen Sie diesen mit der Realität (Stichprobe)."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.3-m2",
                    "uuid": "75953f2a-d385-4657-b05a-24243cfd0885",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Statische Netzpläne (Visio/Excel) werden manuell gepflegt, sind aber oft nicht tagesaktuell."
                      },
                      {
                        "name": "guidance",
                        "value": "Dokumentation erfolgt anlassbezogen bei größeren Umbauten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie das Änderungsdatum der Netzpläne. Stimmen sie mit der Konfiguration der Core-Switche überein?"
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.3-m3",
                    "uuid": "ca73eb93-c8fe-4c03-ace1-ca984ab9c437",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE einen Netzplan einschließlich interner Segmente, externer Netzanschlüsse und deren Verwendungszweck dokumentieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Netzplan muss alle wesentlichen Komponenten, Verbindungen und IP-Adressbereiche aktuell abbilden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Gleichen Sie den dokumentierten Netzplan mit den Ergebnissen eines Netzwerkscans ab."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.3-m4",
                    "uuid": "cb473a5e-5439-4b74-aaec-090d71e618e4",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Netzplan ist mit einer CMDB verknüpft und wird regelmäßig durch Teilautomatisierung validiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Änderungen im Netz werden prozessual erfasst und in die Dokumentation übernommen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie, ob ein Change-Request im Ticket-System zu einer Aktualisierung des Netzplans geführt hat."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.3-m5",
                    "uuid": "f362df30-2882-4440-8c94-7f3b91196d77",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Dynamische, echtzeit-generierte Netztopologie-Karten basierend auf Live-Daten der Netzwerkgeräte."
                      },
                      {
                        "name": "guidance",
                        "value": "Monitoring-Tools visualisieren die Topologie automatisch. Abweichungen generieren Alarme."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Vergleichen Sie die Live-Ansicht des Monitoring-Tools mit der tatsächlichen Verkabelung. Prüfen Sie die Historie von Topologie-Änderungen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "906221d7-9902-4a20-b99b-61f1e0b8e381",
                "control-id": "ARCH.2.4",
                "description": "(BSI Baustein INF.12) Unbeabsichtigte Netzverbindungen können z.B. über falsch gesteckte Kabel, WLAN auf Clients oder Modems im öffentlichen Telefonnetz (PSTN) an einer TK-Anlage entstehen. Die Anforderung kann durch Netzscans, Software zur Topologieüberwachung oder Protokollanalyse umgesetzt werden. Hierbei sind auch virtualisierte Systeme auf VM-Hosts zu berücksichtigen.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Operational",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Audit",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.2.4-m1",
                    "uuid": "ea2b8a20-e0a8-4a1d-851d-083108fdf9f4",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es findet keine Überwachung der Netztopologie statt. Änderungen bleiben unbemerkt bis zu einem Ausfall."
                      },
                      {
                        "name": "guidance",
                        "value": "Fehlerbehebung erfolgt reaktiv. 'Schatten-IT' kann ungehindert wachsen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Schließen Sie einen nicht autorisierten Switch an und prüfen Sie, ob dies bemerkt wird (passiv)."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.4-m2",
                    "uuid": "2caddf27-df7f-45e7-aadd-00c4611c23db",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Manuelle Stichproben und einfache Ping-Monitorings prüfen die Verfügbarkeit von Schlüsselkomponenten."
                      },
                      {
                        "name": "guidance",
                        "value": "Verfügbarkeit steht im Vordergrund, nicht die Einhaltung der Architektur."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie, ob Checklisten für manuelle Audits der Netzwerkschränke existieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.4-m3",
                    "uuid": "75e92458-1d66-4859-8e59-0fd49e7ed331",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE die Einhaltung der Netzarchitektur {{ insert: param, arch.2.4-prm1 }} überprüfen."
                      },
                      {
                        "name": "guidance",
                        "value": "Regelmäßige Soll-Ist-Vergleiche müssen sicherstellen, dass keine unautorisierten Änderungen vorgenommen wurden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Führen Sie Audits durch, um unautorisierte Modems, Access Points oder Switches zu identifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.4-m4",
                    "uuid": "236a31a9-9faa-4655-8ee3-2461bbe1faf8",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Einsatz von NAC (Network Access Control) und automatisiertem Scannen nach unbekannten MAC-Adressen."
                      },
                      {
                        "name": "guidance",
                        "value": "Neue Geräte werden erkannt und vorerst in Quarantäne-VLANs verschoben oder blockiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Schließen Sie ein fremdes Gerät an eine Netzwerkdose an. Prüfen Sie, ob der Port gesperrt oder das Gerät isoliert wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.2.4-m5",
                    "uuid": "fbd331b0-0eac-4823-a32f-82f1b167b392",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Kontinuierliche Compliance-Überwachung (Continuous Monitoring) mit automatischem Config-Drift-Management."
                      },
                      {
                        "name": "guidance",
                        "value": "Jede Konfigurationsänderung wird automatisch gegen die Blueprint-Architektur geprüft und ggf. zurückgerollt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Ändern Sie eine VLAN-Konfiguration manuell. Prüfen Sie, ob das System die Änderung automatisch rückgängig macht."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "69a098ea-7af7-42dd-a549-5ae18b3311eb",
                "control-id": "ARCH.4.2",
                "description": "(BSI Baustein INF.12) Dient der Kontrolle von Netzarchitekturen, um unbeabsichtigte oder böswillige Änderungen zu verhindern. Ohne eine solche Freigabe könnte ein Angreifer durch unbemerkte Manipulation von Routing-Einträgen den Datenverkehr umleiten, abhören oder blockieren; auch ein ungeschulter Administrator könnte versehentlich falsche Routen konfigurieren, wodurch kritische Dienste ausfallen könnten. Die Autorisierung kann sicherstellen, dass jede Änderung nachvollziehbar geprüft, dokumentiert und nur nach sachgerechter Bewertung umgesetzt wird, wodurch die Integrität und Verfügbarkeit der Netze erhöht werden kann.  Im konkreten Kontext bedeutet „Routing-Verbindungen“ die Konfiguration von Pfaden, über die Datenpakete zwischen Netzsegmenten oder über Gateways weitergeleitet werden. „Autorisieren“ bedeutet hier die formale Freigabe nach einer sachlichen und fachlichen Prüfung, typischerweise durch Rollen wie (1) Netzwerkarchitekt, (2) IT-Sicherheitsbeauftragter oder (3) Leiter IT-Betrieb. Eine Institution kann dies umsetzen, indem sie (1) eine dokumentierte Freigabeprozedur für alle Routing-Änderungen etabliert, (2) Änderungen technisch über ein Ticket- oder Change-Management-System prüfen und protokollieren lässt, (3) rollenbasierte Zugriffsrechte in Routern und Firewalls so einschränken kann, dass nur autorisierte Personen Konfigurationsänderungen durchführen, und (4) automatisierte Plausibilitätsprüfungen oder Peer-Reviews nutzen kann, um fehlerhafte oder unsichere Routen frühzeitig zu erkennen.  Die Autorisierung kann entweder einzelne Routen (z.B. für Netz A zwischen Router B und C), als auch bestimmte Routing-Regeln (z.B. Default-Routing über die zentrale Firewall) autorisieren. Sinnvoll ist es dabei das Prinzip \"so allgemein wie für den Betrieb nötig, so spezifisch wie für die Sicherheit möglich\" als Faustregel anzuwenden. Bei der Verwendung dynamischer Routing-Algorithmen kann die Anforderung umgesetzt werden, indem eingeschränkte Bereiche freigegeben werden, z.B. \"dynamisches Routing im Bereich 10.x.x.x)\".",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.4.2-m1",
                    "uuid": "3b6f10e7-cff8-4d2f-bc5f-582abf3627ba",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Routing erfolgt weitgehend unkontrolliert oder dynamisch ohne Authentifizierung."
                      },
                      {
                        "name": "guidance",
                        "value": "Jedes Gerät kann potentiell Routen injizieren und den Verkehr umleiten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie mit Wireshark, ob Routing-Updates (z. B. RIP, OSPF) ohne Passwort im Netz sichtbar sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.4.2-m2",
                    "uuid": "04b3d067-a864-46a2-807d-e01dd40ab811",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Statische Routen werden bevorzugt eingesetzt, um die Kontrolle zu behalten."
                      },
                      {
                        "name": "guidance",
                        "value": "Manuelle Pflege von Routing-Tabellen verhindert dynamische Manipulationen, ist aber fehleranfällig."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Routing-Tabellen auf den Core-Switches ('show ip route static')."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.4.2-m3",
                    "uuid": "9e46b94c-c9b2-4732-9e70-e62cd8977ebc",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE Routing-Verbindungen durch {{ insert: param, arch.4.2-prm1 }} autorisieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Routing-Informationen dürfen nur von vertrauenswürdigen und autorisierten Nachbarn akzeptiert werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Konfiguration der Routing-Protokolle auf Nachbarschaftsfilter und Authentifizierung."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.4.2-m4",
                    "uuid": "818f79ee-2764-408b-89c2-7d95f2d69ed7",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Einsatz kryptographischer Authentifizierung (MD5/SHA) für alle dynamischen Routing-Protokolle (OSPF, BGP)."
                      },
                      {
                        "name": "guidance",
                        "value": "Nur Router mit dem korrekten Schlüssel können am Routing teilnehmen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Verifizieren Sie in der Router-Konfig die Nutzung von 'ip ospf authentication' oder ähnlichen Befehlen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.4.2-m5",
                    "uuid": "267571d5-f319-4080-9f5d-83786dd27bb3",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zentral gesteuertes Routing (SD-WAN) mit strenger Validierung (z. B. RPKI für BGP)."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Control-Plane ist vollständig von der Data-Plane getrennt und kryptographisch abgesichert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Auditieren Sie die SD-WAN Controller-Einstellungen bezüglich der Zertifikatsvalidierung für Edge-Router."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "3b353559-ae58-44de-8200-f81d72cb31da",
                "control-id": "ARCH.4.3",
                "description": "(BSI Baustein INF.12) Hierzu zählt z.B. die Authentifizierung von BGP/OSPF-Sitzungen zur Verhinderung von Route Hijacking, BGP origin validation with RPKI oder OSPF/ISIS/BGP MD5 or TTL+hMAC authentication. Die Formulierung \"im Einklang mit den Festlegungen des Identitäts- und Berechtigungsmanagements\" bedeutet, dass die Authentifizierung so erfolgt, wie in der Praktik IDM festgelegt. Hierzu gehört insbesondere die Verwendung aktueller kryptographischer Verfahren, wie sie im Thema Kryptographie zu finden ist.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.4.3-m1",
                    "uuid": "f53aeeba-a516-4ef1-a22a-b4f496722797",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Änderungen an Routing-Tabellen erfolgen ad-hoc ohne Protokollierung."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist nicht nachvollziehbar, wer wann welche Route geändert hat."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Fragen Sie nach Logs zu den letzten Routing-Änderungen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.4.3-m2",
                    "uuid": "31e8cbcc-756a-4399-8c7f-b46be8a48acd",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zugriff auf Router erfordert Login, Shared-Accounts sind jedoch üblich."
                      },
                      {
                        "name": "guidance",
                        "value": "Identifizierung der ändernden Person ist schwierig."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie, ob Router über individuelle Benutzerkonten oder ein zentrales TACACS+/RADIUS verfügen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.4.3-m3",
                    "uuid": "8eb92baf-d3ad-4137-88c6-1e2699599011",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE Änderungen an Routing-Tabellen im Einklang mit den zugehörigen Anforderungen des Identitäts- und Berechtigungsmanagements"
                      },
                      {
                        "name": "guidance",
                        "value": "Nur autorisierte Administratoren dürfen Routing-Konfigurationen ändern. Personalisierte Accounts sind Pflicht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die AAA-Konfiguration (Authentication, Authorization, Accounting) auf den Routern."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.4.3-m4",
                    "uuid": "33835dab-c630-44ff-8a00-a1755f9b1350",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zentrales Log-Management erfasst alle Konfigurationsänderungen revisionssicher."
                      },
                      {
                        "name": "guidance",
                        "value": "Automatisierte Alerts bei Änderungen an kritischen Routen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Führen Sie eine Änderung durch und prüfen Sie, ob diese im SIEM/Log-Server erscheint."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.4.3-m5",
                    "uuid": "03331c15-6b5f-4cad-af51-7766fdd9aa58",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Routing-Konfiguration erfolgt ausschließlich über automatisierte Pipelines (GitOps) mit Vier-Augen-Prinzip."
                      },
                      {
                        "name": "guidance",
                        "value": "Direkte manuelle Änderungen auf Geräten sind technisch unterbunden ('Read-Only' für Admins)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Versuchen Sie, via CLI eine Route zu ändern. Dies sollte abgelehnt werden oder vom System überschrieben werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e452f08a-96f0-42d7-b586-1f743f534665",
                "control-id": "ARCH.5.1",
                "description": "(BSI Baustein INF.12) Über Netverbindungen können unbeabsichtigte Verbindungen aufgebaut werden oder netzbasierte Angriffe über das Internet gegen die Institution erfolgen. Unerwünschter Datenverkehr nach außen können z.B. private IP-Adressen (RFC 1918 leakage), Multicasting, TCP/UDP Ports für veraltete, angreifbare Protokolle oder ICMP-Verkehr sein. Die Beschränkung der Verbindung zwischen IT-Systemen kann sowohl durch zustandsbehaftete Paketfilter, als auch mit Application Layer Gateways umgesetzt werden. Empfehlenswert ist eine Kombination aus Allowlisting, IP-Reputationslisten, Deep Packet Inspection und Durchsatzratenbegrenzung. Hierbei können Verbindungen auch nach Kategorien autorisiert werden (z.B. anhand von IP-Subnetzen oder Voraussetzungen wie per Zertifikat authentifzierten IT-Systemen). Damit dabei keine unnötigen Verbindungen zugelassen werden, ist es wichtig, die Kategorisierung möglich genau zu wählen (z.B. möglichst einzelne Subnetze statt des ganzen Netzes oder nur bestimmte Ports oder Anwendungen zuzulassen).",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.5.1-m1",
                    "uuid": "8aaca8a0-db5c-4374-a047-a4876af1091a",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Systeme im internen Netz kommunizieren ungehindert miteinander."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein kompromittierter Host kann alle anderen Systeme direkt angreifen (Lateral Movement)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Führen Sie einen Portscan von einem Client auf einen Server im gleichen Subnetz durch."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1-m2",
                    "uuid": "04a6e103-4e11-4e5e-bb12-19576b65a38d",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Host-basierte Firewalls (z. B. Windows Firewall) sind auf Standardeinstellungen aktiv."
                      },
                      {
                        "name": "guidance",
                        "value": "Basisschutz auf Endgeräten, aber keine zentrale Steuerung im Netz."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie stichprobenartig die lokalen Firewall-Einstellungen via Gruppenrichtlinie oder lokal."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1-m3",
                    "uuid": "9d94f0be-65b9-48b2-a6a3-7d4d0831c51e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE Verbindungen zwischen IT-Systemen einschränken."
                      },
                      {
                        "name": "guidance",
                        "value": "Netzwerk- und Host-Firewalls müssen Verbindungen auf das notwendige Minimum begrenzen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie das Konzept zur Netzkopplung und die implementierten Regeln an zentralen Firewalls."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1-m4",
                    "uuid": "3693557c-ffd5-4464-aba9-3bbf74e1439a",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Einsatz von zentral verwalteten Host-Firewalls und Netzwerk-ACLs mit 'Default Deny' Strategie."
                      },
                      {
                        "name": "guidance",
                        "value": "Kommunikationsmatrix ist definiert und technisch durchgesetzt. Logging abgewiesener Pakete."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Validieren Sie, dass Server nur auf den spezifischen Service-Ports erreichbar sind (z. B. nur Port 443 für Webserver)."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1-m5",
                    "uuid": "6451936f-b019-4b3d-a732-d4754d8bd9e5",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zero Trust Network Access (ZTNA) und Mikrosegmentierung auf Workload-Ebene."
                      },
                      {
                        "name": "guidance",
                        "value": "Jede Verbindung muss explizit authentifiziert und autorisiert werden, unabhängig vom Netzwerkstandort."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Testen Sie, ob der Zugriff entzogen wird, wenn sich der Sicherheitsstatus eines Geräts ändert (Device Posture Check)."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "7c5836ff-1b23-4052-aed1-69b13ae6b9b0",
                "control-id": "ARCH.5.1.1",
                "description": "(BSI Baustein INF.12) Anfällig sind Netzprotokolle, wenn sie veraltete oder gar keine Algorithmen zur Verschlüsselung oder Integritätsprüfung verwenden. Hierzu gehören Protokolle wie Telnet, SMB v1, SNMP v1/v2c. Für aktuelle Verschlüsselungsalgorithmen siehe BSI TR 02102.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.5.1.1-m1",
                    "uuid": "deb33a34-d0a6-4ea1-a9b9-fcbf33c25ef1",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Unsichere Protokolle wie Telnet, FTP oder HTTP werden standardmäßig genutzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Passwörter und Daten werden im Klartext übertragen und sind leicht abhörbar."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sniffen Sie den Verkehr bei einer Anmeldung (z. B. mit Wireshark) und suchen Sie nach Klartext-Passwörtern."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.1-m2",
                    "uuid": "a901ef96-df26-4969-ba3f-71b737eaf46b",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Veraltete Protokolle sind auf den meisten, aber nicht allen Systemen deaktiviert."
                      },
                      {
                        "name": "guidance",
                        "value": "Migration zu SSH/HTTPS hat begonnen, Legacy-Systeme nutzen weiterhin unsichere Dienste."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Scannen Sie das Netz gezielt nach Port 21 (FTP) und 23 (Telnet)."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.1-m3",
                    "uuid": "09261b63-b8d9-43cc-a4a2-47037fa276cf",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE anfällige Netzwerkprotokolle blockieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Protokolle, die Daten unverschlüsselt übertragen oder bekannte Schwachstellen haben, müssen gesperrt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie Firewall-Regeln auf Blockierung von Ports wie 23, 21, 69 (TFTP) an Zonengrenzen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.1-m4",
                    "uuid": "92be5ae3-a19c-4477-86cb-9e3184aea730",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Technische Erzwingung sicherer Protokollversionen (z. B. nur TLS 1.2+)."
                      },
                      {
                        "name": "guidance",
                        "value": "Veraltete Kryptografie wird aktiv unterbunden. HSTS für Webdienste aktiviert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Nutzen Sie Tools wie 'testssl.sh', um Server auf Unterstützung veralteter SSL/TLS-Versionen zu prüfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.1-m5",
                    "uuid": "679544a0-e948-4fa4-a54e-cdb3987827bf",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Automatisierte Erkennung und Isolierung von Clients/Servern, die unsichere Protokolle nutzen."
                      },
                      {
                        "name": "guidance",
                        "value": "Network Detection and Response (NDR) identifiziert Legacy-Protokolle sofort als Sicherheitsverstoß."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Versuchen Sie, einen Telnet-Server im Netz zu starten. Prüfen Sie, ob das NDR-System alarmiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e555a710-6c71-450b-b455-3edcc45d744a",
                "control-id": "ARCH.5.1.2",
                "description": "(BSI Baustein INF.12) Netzbasierte Angriffe verwenden Netzwerktechnologien (typischerweise auf OSI Layer 2-3), z.B. Fragmentierungsangriffe. Beispiele für mögliche Maßnahmen sind DHCP snooping, ARP/Dynamic ARP Inspection, IP-source guard, BPDU guard, root guard, port-security (sticky MAC).",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.5.1.2-m1",
                    "uuid": "5fb4d0c4-69f7-44a8-90f8-41396398da5e",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Keine spezifischen Maßnahmen gegen netzbasierte Angriffe vorhanden."
                      },
                      {
                        "name": "guidance",
                        "value": "Schutz verlässt sich allein auf die Robustheit der Endgeräte-Betriebssysteme."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie, ob Spoofing-Angriffe (z. B. ARP-Spoofing) im LAN möglich sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.2-m2",
                    "uuid": "fe96c6d0-a046-4df7-8874-69539cedf23d",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Grundlegende Firewall-Funktionen (Stateful Packet Inspection) sind an den Netzübergängen aktiv."
                      },
                      {
                        "name": "guidance",
                        "value": "Blockierung offensichtlich ungültiger Pakete (z. B. Bogon-Filterung)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Testen Sie, ob Pakete mit privaten Absender-IPs am externen Interface verworfen werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.2-m3",
                    "uuid": "5dc8013a-9d95-493e-96c7-b553c99e2e0e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE bekannte netzbasierte Angriffsmethoden blockieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Maßnahmen wie IP-Spoofing-Schutz, Schutz vor Fragmentierungsangriffen etc. müssen aktiviert sein."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Konfiguration von Routern/Firewalls auf uRPF (Unicast Reverse Path Forwarding) und Fragmentierungs-Einstellungen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.2-m4",
                    "uuid": "f7d608d4-bbe3-45ba-946c-8a514ae6a7ca",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Einsatz von Intrusion Prevention Systemen (IPS) mit täglich aktualisierten Signaturen."
                      },
                      {
                        "name": "guidance",
                        "value": "Aktives Blockieren von Exploits und bekannten Angriffsmustern im Datenstrom."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Führen Sie einen kontrollierten Testangriff (z. B. mit Metasploit) durch, um die IPS-Reaktion zu testen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.2-m5",
                    "uuid": "c2f7ca4b-dccb-4160-be21-83705930603d",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Verhaltensbasierte Anomalieerkennung mittels KI/ML zur Abwehr von Zero-Day-Attacken."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Netz lernt das 'Normalverhalten' und blockiert Abweichungen autonom."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Erzeugen Sie ungewöhnlichen Traffic (z. B. Datentunneling via DNS) und prüfen Sie die Erkennung."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "6ffb8d3b-3488-4b33-90c7-d6e354dfc9ef",
                "control-id": "ARCH.5.1.3",
                "description": "(BSI Baustein INF.12) TCP ist das am meisten verwendete Protokoll für die zuverlässige Datenübertragung. Durch TCP-basierte Angriffe können IT-Systeme gehackt oder Daten unbemerkt ausgeleitet werden. Beispiele sind TCP Session Hijacking (ACK-number guessing), Overlapping-Segment Attacks, TCP Reset (RST) Injection, Xmas-tree Scanning. Die Anforderung kann durch Blockieren solcher Verbindungen oder nur bestimmter Mechanismen umgesetzt werden.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.5.1.3-m1",
                    "uuid": "ce160e74-ec7f-422f-8408-9266cb3e47e4",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "TCP-Stack-Härtung erfolgt nur auf Betriebssystemebene (Default-Werte)."
                      },
                      {
                        "name": "guidance",
                        "value": "Netzwerkkomponenten leiten TCP-Angriffe ungefiltert an die Endgeräte weiter."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie Logs auf häufige Verbindungsabbrüche oder Timeouts."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.3-m2",
                    "uuid": "60d0da17-daf4-499d-90a4-0906512938c6",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Aktivierung von SYN-Flood-Schutzmechanismen auf Firewalls (Schwellwerte)."
                      },
                      {
                        "name": "guidance",
                        "value": "Begrenzung der Anzahl halboffener Verbindungen pro Sekunde."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Führen Sie einen kontrollierten SYN-Flood-Test (z. B. hping3) durch und beobachten Sie die Firewall-Zähler."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.3-m3",
                    "uuid": "be31cf25-f288-40fd-917e-0602527fbfbf",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE bekannte TCP-basierte Angriffsmethoden blockieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Schutz vor SYN-Floods, TCP-Sequence-Prediction und anderen Protokollmanipulationen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie Konfigurationen auf Aktivierung von TCP-Intercept oder SYN-Cookies."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.3-m4",
                    "uuid": "68792833-f787-432d-9311-5a235682c500",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Protokoll-Validierung durch Next-Gen Firewalls (TCP State Tracking, Window Validation)."
                      },
                      {
                        "name": "guidance",
                        "value": "Firewall verwirft Pakete, die nicht zum aktuellen Verbindungsstatus passen (Out-of-State Packets)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Senden Sie manipulierte TCP-Pakete (falsche Sequenznummern). Die Firewall muss diese verwerfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.3-m5",
                    "uuid": "b5832059-ffe2-411b-aa14-dde9f504fea4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Fortschrittliche Scrubbing-Technologien gegen Low-and-Slow Angriffe (z. B. Sockstress)."
                      },
                      {
                        "name": "guidance",
                        "value": "Intelligente Analyse des Handshake-Verhaltens zur Identifikation von Ressourcen-Erschöpfungsangriffen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Testen Sie die Resilienz gegen Slowloris-artige Angriffe."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "86fd13b6-847f-4481-abb2-cf4b4f568e36",
                "control-id": "ARCH.5.1.4",
                "description": "(BSI Baustein INF.12) UDP-basierte Angriffsmethoden (englisch: known UDP-based attack vectors) sind hierbei Techniken zu verstehen, die das User Datagram Protocol (UDP) ausnutzen. UDP ist das am meisten verwendete Protokoll für die Übertragung von Datenstreams. Aufgrund seiner verbindungslosen Eigenschaft ermöglicht UDP eine sehr schnelle Datenübertragung und wird daher oft für zeitkritische Anwendungen wie Videostreaming, VoIP oder DNS-Anfragen verwendet. Genau diese Eigenschaft macht es jedoch anfällig für Missbrauch, da die Absenderadresse leicht gefälscht werden kann (IP-Spoofing).  Beispiele für Angriffe sind Sequence Number Guessing, DHCP Starvation und UDP Hole-Punching Abuse. Die Anforderung kann durch Blockieren solcher Verbindungen oder nur bestimmter Mechanismen umgesetzt werden.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.5.1.4-m1",
                    "uuid": "1691e0f9-3d2f-4ea4-9437-0b69092b394d",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "UDP-Ports sind weitgehend offen, keine Ratenbegrenzung konfiguriert."
                      },
                      {
                        "name": "guidance",
                        "value": "Hohes Risiko für Missbrauch als Reflektor für Amplification-Angriffe."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Scannen Sie nach offenen UDP-Diensten (DNS, NTP, SSDP) die vom Internet erreichbar sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.4-m2",
                    "uuid": "2bb85bda-bdb4-44a2-97eb-edae892f2d93",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Generelles Rate-Limiting für UDP-Verkehr auf Routern eingerichtet."
                      },
                      {
                        "name": "guidance",
                        "value": "Pauschale Begrenzung kann legitime Anwendungen (VoIP) beeinträchtigen, schützt aber vor Volumenspitzen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die QoS- oder Policing-Einstellungen für UDP-Traffic."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.4-m3",
                    "uuid": "1f81490f-9654-443a-a0c2-2090c0fac35e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE bekannte UDP-basierte Angriffsmethoden blockieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Gezielte Maßnahmen gegen UDP-Floods und Reflection-Attacks (z. B. NTP Monlist deaktivieren)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie, ob anfällige UDP-Dienste gehärtet sind und Firewalls UDP-Floods erkennen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.4-m4",
                    "uuid": "b792cc83-ea82-44bd-9079-9d4c34b69ce8",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Applikationsspezifische Inspektion von UDP-Protokollen (DNS, SIP, NTP)."
                      },
                      {
                        "name": "guidance",
                        "value": "Firewalls prüfen den Inhalt von UDP-Paketen auf Konformität (z. B. DNS-Query-Länge)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Senden Sie malformierte DNS-Pakete und prüfen Sie, ob das Sicherheitsgateway diese filtert."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.5.1.4-m5",
                    "uuid": "992628bd-e925-4b82-aad3-23d1df465e85",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Automatisierte Flowspec-Regeln zur dynamischen Filterung von UDP-Angriffsmustern am Netzwerkrand."
                      },
                      {
                        "name": "guidance",
                        "value": "Angriffe werden bereits am Edge-Router oder beim Provider verworfen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Integration von BGP Flowspec zur Abwehr volumetrischer UDP-Angriffe."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "4f809548-48f1-4edb-9220-65285cf872bc",
                "control-id": "ARCH.8.1",
                "description": "(BSI Baustein INF.12) Ziel hierbei ist es, dass beim Ausfall eines Systems oder einer Systemkomponente die Netzanbindung stets weiterhin funktionsfähig bleibt (Single-Point-of-Failure).",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.8.1-m1",
                    "uuid": "00dedf29-6795-4381-90a4-67611625399d",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Kernnetz besteht aus Einzelkomponenten (Single Point of Failure)."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Ausfall eines zentralen Switches führt zum Stillstand weiter Teile des Netzes."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Identifizieren Sie den Core-Switch und prüfen Sie, ob ein redundantes Gerät aktiv bereitsteht."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.8.1-m2",
                    "uuid": "da911591-b3a5-4317-a009-a82b88958cc3",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Kalt-Reserve-Geräte sind vorhanden, müssen aber manuell in Betrieb genommen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Längere Ausfallzeiten durch manuellen Umbau und Konfigurations-Restore."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie das Vorhandensein und die Kompatibilität von Ersatzgeräten im Lager."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.8.1-m3",
                    "uuid": "280218a2-aa55-4369-8b7e-24777f176b68",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE für das Kernnetz redundante Netzkomponenten installieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Redundanz (z. B. Aktiv/Passiv) muss sicherstellen, dass der Betrieb bei Ausfall einer Komponente weiterläuft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Redundanzkonfiguration (z. B. VRRP, HSRP) und führen Sie einen Failover-Test durch."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.8.1-m4",
                    "uuid": "ca1fe1ae-a7b6-4816-8422-fb7a37ef042a",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Aktiv-Aktiv-Redundanz mit automatischem Lastenausgleich (z. B. MLAG, VSS)."
                      },
                      {
                        "name": "guidance",
                        "value": "Keine Unterbrechung bei Ausfall, volle Bandbreitennutzung im Normalbetrieb."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Simulieren Sie den Ausfall eines Core-Links und prüfen Sie auf Paketverluste (Ping-Dauerfeuer)."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.8.1-m5",
                    "uuid": "246823ab-2096-4eee-b0c2-7c4c81984a04",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Vollvermaschte Spine-Leaf-Architektur mit automatischem Rerouting und Self-Healing."
                      },
                      {
                        "name": "guidance",
                        "value": "Mehrfache Redundanz auf Pfad- und Geräteebene. Ausfälle sind für Anwendungen transparent."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Schalten Sie einen Spine-Switch ab und messen Sie die Auswirkung auf die Applikations-Latenz."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "7abbd185-4ca0-49af-ad16-c0a0fa3a5432",
                "control-id": "ARCH.9.1",
                "description": "(BSI Baustein INF.12) Für die Verfügbarkeit und Leistungsfähigkeit kritischer Geschäfts‑ und Fachverfahren ist eine bedarfsgerechte Netzanbindung erforderlich. Durch das strukturierte Erfassen des Bedarfes kann eine Institution frühzeitig Engpässe erkennen, Ausfallrisiken minimieren und eine wirtschaftliche Auslegung ihrer Anschlüsse erreichen. Gleichzeitig lässt sich so eine belastbare Grundlage für Kapazitäts‑, Notfall‑ und Budget‑Planungen schaffen, ohne sich allein auf starre Hersteller‑ oder Provider‑Vorgaben zu verlassen. Relevant ist hierbei die gesamte Netzstrecke zwischen Servern und IT-Clients, zumindest bis zum Internet-Anschluss der Institution. Beispiele für den Anwendungsbereich können sehr unterschiedlich ausfallen: In einem Call‑Center kann sich der Bedarf aus der Anzahl zeitgleich aktiver Soft‑Phones ableiten, deren Codec‑Bandbreite sowie der gewünschten Gesprächsqualität (Latenz < Antwortzeit in ms). In einem Forschungslabor kann die Anbindung darauf basieren, dass täglich große Datensätze mit einer bestimmten maximalen Bandbreite in Gbit/s zu Kooperationspartnern repliziert werden. Auch eine E‑Learning‑Plattform kann berücksichtigen, dass zu Semesterbeginn Studierende gleichzeitig parallele Video‑Streams in HD abrufen, während administrative Dienste weiterhin innerhalb einer bestimmten Antwortzeit in ms reagieren sollen. Dabei ist es sinnvoll, die Netzanbindung an realistische Belastungsszenarien anzupassen.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Management",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.9.1-m1",
                    "uuid": "fd4acdeb-f40d-4e3a-877a-403ffaf96de7",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Netzanbindung erfolgt auf 'Best Effort' Basis (z. B. Standard-DSL)."
                      },
                      {
                        "name": "guidance",
                        "value": "Keine garantierten Bandbreiten oder Entstörzeiten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie den Vertrag mit dem Internetprovider auf SLA-Klauseln."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.9.1-m2",
                    "uuid": "e414ea68-659b-4179-b9d1-62c11216d20e",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bandbreite wurde einmalig geschätzt, keine regelmäßige Überprüfung."
                      },
                      {
                        "name": "guidance",
                        "value": "Engpässe werden erst bei Beschwerden der Nutzer bemerkt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überwachen Sie die Auslastung des Uplinks (MRTG/Cacti) auf Sättigung zu Stoßzeiten."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.9.1-m3",
                    "uuid": "24c6232b-f916-4b1d-92ac-ae456be0f912",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze SOLLTE eine bedarfsgerechte Netzanbindung installieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Kapazität muss den aktuellen und geplanten Anforderungen entsprechen und Puffer für Spitzenlasten bieten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Vergleichen Sie die gemessene Spitzenauslastung mit der vertraglichen Bandbreite."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.9.1-m4",
                    "uuid": "e7edf950-6783-45da-91f6-217b79f75d85",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Vertraglich garantierte SLAs für Bandbreite, Latenz und Verfügbarkeit. Redundante Anbindung."
                      },
                      {
                        "name": "guidance",
                        "value": "Proaktives Capacity Management sorgt für rechtzeitige Upgrades."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die monatlichen SLA-Reports des Providers und die internen Kapazitätsreports."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.9.1-m5",
                    "uuid": "505015ae-14ec-4e77-8377-55a94e280923",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Dynamisch skalierbare Bandbreite (Bandwidth on Demand) und intelligentes Traffic-Engineering."
                      },
                      {
                        "name": "guidance",
                        "value": "Automatische Zuweisung von Prioritäten und Pfaden basierend auf Applikationsbedarf."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Konfiguration von SD-WAN Regeln zur Priorisierung geschäftskritischer Anwendungen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "68524b9a-03cf-4d74-9215-ffad23b9c18b",
                "control-id": "ARCH.9.5",
                "description": "(BSI Baustein INF.12) Volumetrische Angriffe können z.B. durch die Verwendung von Anycast-DNS, Upstream Rate Limiting, On-Premise- oder Cloud-Scrubbing, BGP FlowSpec-Filter, Auto-Null-Routing oder Remotely Triggered Blackholing abgewehrt werden.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ARCH.9.5-m1",
                    "uuid": "7fb50801-b658-4e27-989c-05c2e62dc78a",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Kein Schutz vor volumetrischen DDoS-Angriffen."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei einem Angriff wird die Internetleitung vollständig gesättigt und fällt aus."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie, ob der ISP DDoS-Schutzmaßnahmen im Standardvertrag inkludiert hat."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.9.5-m2",
                    "uuid": "7505de22-ab72-4dd4-8749-d2de6a3e596d",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Manuelles 'Blackholing' (Null-Routing) durch den Provider auf Zuruf."
                      },
                      {
                        "name": "guidance",
                        "value": "Reaktion erfolgt verzögert. Ziel-IP ist während des Angriffs komplett offline."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie, ob Notfallkontakte zum Provider für DDoS-Fälle bekannt und aktuell sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.9.5-m3",
                    "uuid": "8897532a-bfc1-43ad-90fa-7ce06b3a2172",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Architektur für Netze KANN Schutzmaßnahmen gegen volumetrische DoS-Angriffe aktivieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Nutzung spezialisierter Filterdienste, die den Angriffsverkehr vor der eigenen Leitung verwerfen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie Verträge oder Konfigurationen für DDoS-Mitigation-Services."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.9.5-m4",
                    "uuid": "af4f30b6-b9ef-47c9-ae3d-7e337d9741a3",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Automatische DDoS-Erkennung und Umschaltung auf Scrubbing-Center."
                      },
                      {
                        "name": "guidance",
                        "value": "Verkehr wird bei Angriffserkennung automatisch umgeleitet und gereinigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Testen Sie die Signalisierung zum Scrubbing-Center (z. B. via BGP-Community) im Wartungsfenster."
                      }
                    ]
                  },
                  {
                    "statement-id": "ARCH.9.5-m5",
                    "uuid": "eb308c88-fc51-4309-9b47-57bf39a1c3a1",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Hybride DDoS-Abwehr (On-Premises + Cloud) mit Always-On Mitigation."
                      },
                      {
                        "name": "guidance",
                        "value": "Sofortige Abwehr kleinerer Angriffe lokal, nahtlose Eskalation in die Cloud bei Volumenangriffen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Auditieren Sie die Integration und Schwellwerte der hybriden Lösung."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "7bd1c73c-7b85-4108-abc2-8fb4b5271722",
                "control-id": "ASST.2.2.1",
                "description": "(BSI Baustein INF.12) Ziel ist sicherzustellen, dass keine unautorisierten Assets im Informationsverbund betrieben werden. Hierzu können z.B. aktive Netzscans (z.B. mit Nmap), passive Analysen des Netzwerkverkehrs oder spezielle Werkzeuge zur Erkennung von unbekannten WLAN-Access-Points (z.B. Kismet) genutzt werden. Zur Behandlung können die gefundenen IT-Systeme beispielsweise aus dem Netz entfernt, in eine Quarantäne verschoben oder nach Überprüfung autorisiert werden.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ASST.2.2.1-m1",
                    "uuid": "8248afd0-89fc-462c-9fe4-7428bbcb15ce",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Suche nach unautorisierten IT-Systemen im Netzwerk erfolgt lediglich anlassbezogen oder sporadisch ohne festes Schema."
                      },
                      {
                        "name": "guidance",
                        "value": "Es existieren keine geregelten Prozesse zur Identifikation fremder Geräte. Maßnahmen werden oft erst reaktiv nach Sicherheitsvorfällen oder bei zufälligen Beobachtungen ergriffen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Befragen Sie die Administratoren, wann zuletzt aktiv nach fremden Geräten gesucht wurde. Prüfen Sie, ob vergangene Vorfälle mit unautorisierter Hardware dokumentiert wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "ASST.2.2.1-m2",
                    "uuid": "e0f05ecd-ed6c-4ae3-872f-585a56a26221",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden regelmäßige, vorwiegend manuelle Prüfungen durchgeführt, um unautorisierte IT-Systeme im Netzwerk zu identifizieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Überprüfung erfolgt beispielsweise durch den regelmäßigen manuellen Abgleich von MAC-Adresslisten mit dem Inventar oder die Durchsicht von DHCP-Logs."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichten Sie Protokolle der manuellen Abgleiche. Führen Sie stichprobenartig einen Scan (z. B. mittels `nmap -sn` oder `arp -a`) durch und vergleichen Sie das Ergebnis mit der Inventarliste, um Lücken im manuellen Prozess zu finden."
                      }
                    ]
                  },
                  {
                    "statement-id": "ASST.2.2.1-m3",
                    "uuid": "1c4e2c7c-a526-4fa9-a479-eefbb5983ee7",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Informationen und Assets für Netze SOLLTE das Aufdecken unautorisierter IT-Systeme verankern."
                      },
                      {
                        "name": "guidance",
                        "value": "Es muss ein definierter Prozess existieren, der beschreibt, wie unautorisierte Systeme (Rogue Devices) im Netzwerk erkannt und behandelt werden. Dies dient der Sicherstellung, dass nur zugelassene Assets kommunizieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Sicherheitsrichtlinien auf Vorgaben zur Erkennung unautorisierter Systeme. Kontrollieren Sie, ob Verantwortlichkeiten für die Sichtung von Abweichungen festgelegt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "ASST.2.2.1-m4",
                    "uuid": "6ce94788-96c9-4f10-885a-c1b3d1d6da9a",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Automatisierte Monitoring-Systeme überwachen das Netzwerk kontinuierlich und melden das Auftauchen unautorisierter IT-Systeme proaktiv."
                      },
                      {
                        "name": "guidance",
                        "value": "Einsatz von Tools wie Arpwatch oder passiven Netzwerkscannern, die bei Erkennung neuer MAC-Adressen oder unerwarteter DHCP-Requests sofort Warnmeldungen an die Administration versenden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Konfiguration der Monitoring-Tools (z. B. `arpwatch` Konfiguration oder Log-Alerts). Schließen Sie testweise ein unbekanntes Gerät an und verifizieren Sie den Eingang einer Alarmmeldung."
                      }
                    ]
                  },
                  {
                    "statement-id": "ASST.2.2.1-m5",
                    "uuid": "de394e4e-b5ed-478d-bafc-8f6f6854ee0a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine integrierte Network Access Control (NAC) Lösung unterbindet vollautomatisch und in Echtzeit den Netzwerkzugriff für unautorisierte IT-Systeme."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Schutz erfolgt präventiv, z. B. durch 802.1X Authentifizierung. Nicht authentifizierte Geräte werden technisch isoliert (z. B. Quarantäne-VLAN) und können nicht am Netzwerk teilnehmen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Versuchen Sie, ein nicht registriertes Gerät an einen Switch-Port anzuschließen. Überprüfen Sie technisch, ob der Port gesperrt wird oder das Gerät in ein isoliertes Netzsegment verschoben wird. Prüfen Sie die RADIUS/NAC-Logs."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "febe9cda-cf93-473b-82d9-c79b850b0dad",
                "control-id": "DET.4.10",
                "description": "(BSI Baustein INF.12) Beispiele sind ausgehende Netzverbindungen zu als bösartig bekannten oder gänzlich unbekannten DNS-Domains oder IP-Adressen, Anzeichen für DNS-Tunneling (ungewöhnlich lange Subdomains oder Spitzenwerte für TXT-Mengen), ungewöhnlich hohes Datenvolumen zu Cloud-Speicherlösungen, sowie unautorisierte Portscans oder Brute Force Angriffe auf Fernwartungsschnittstellen wie RDP oder SSH sein. Hierdurch können Verbindungen zu Angreiferservern (C2 Beacons), die Ausbreitung von Angriffen über das Netz, oder Datenabflüsse erkannt werden.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "DET.4.10-m1",
                    "uuid": "684b328a-b7b8-4f6d-80da-a2810caf1651",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Netzwerkverkehr wird lediglich anlassbezogen bei Störungen oder konkretem Verdacht manuell auf Auffälligkeiten geprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Es existiert keine kontinuierliche Überwachung. Die Analyse stützt sich auf zufällige Beobachtungen oder Nutzerbeschwerden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen, ob Protokolldateien nur reaktiv gesichtet werden. Keine definierten Prozesse für regelmäßige Kontrollen vorhanden."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.10-m2",
                    "uuid": "88757735-9291-4f83-816e-d6fde5465aeb",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Logs von Netzwerkkomponenten werden zentral gesammelt und in regelmäßigen Abständen manuell ausgewertet."
                      },
                      {
                        "name": "guidance",
                        "value": "Grundlegende Logging-Funktionen (z.B. Syslog) sind auf Firewalls und Core-Switches aktiviert. Die Auswertung ist personenabhängig."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen der Syslog-Konfiguration auf Netzwerkgeräten. Manuelle Stichprobe der Log-Review-Dokumentation."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.10-m3",
                    "uuid": "76a7554e-7622-449d-b46a-6c659e6330df",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Detektion für Netze SOLLTE den Netzwerkverkehr auf Anomalien überwachen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es muss definiert werden, was als Anomalie gilt (z.B. unerwartete Ports, Protokolle). Technische Maßnahmen zur Detektion sind erforderlich."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtung der Konzepte zur Anomalieerkennung und Prüfung, ob entsprechende Überwachungstools aktiv sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.10-m4",
                    "uuid": "71c098d6-e24b-454f-bf7f-a14875564059",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein automatisiertes Intrusion Detection System (IDS) überwacht den Verkehr kontinuierlich und alarmiert bei bekannten Signaturen."
                      },
                      {
                        "name": "guidance",
                        "value": "Das IDS wird regelmäßig aktualisiert. Kritische Alarme werden sofort an Administratoren weitergeleitet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung des IDS-Status (z.B. `systemctl status suricata`) und Verifizierung der Aktualität der Regelsätze (z.B. Emerging Threats)."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.10-m5",
                    "uuid": "a7b2916e-e71e-430a-843a-e110e4ff3960",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine KI-gestützte Verhaltensanalyse (NBA) erkennt unbekannte Anomalien in Echtzeit und leitet automatisierte Gegenmaßnahmen ein."
                      },
                      {
                        "name": "guidance",
                        "value": "Das System lernt das Normalverhalten des Netzes. Integration in ein SOAR ermöglicht das automatische Isolieren betroffener Hosts."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Audit der SIEM/SOAR-Integration. Simulation einer Anomalie (z.B. Dateneviltration) und Messung der Zeit bis zur automatischen Blockade."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "2109d138-282f-4c8d-adfb-312956e29cc5",
                "control-id": "DET.4.10.2",
                "description": "(BSI Baustein INF.12) Honeypots sind Systeme, die das Verhalten eines Betriebsservers simulieren, um bei netzbasierten Angriffen Informationen über den Angriff zu erhalten. Geeignet sind z.B. vermeintliche Rechnungsbearbeitungssysteme oder Datenbank-Server. Alarmierungsereignisse können hier z.B. Login-Versuche oder unerwartete API-Abfragen sein. Allerdings kann es hierbei zu falsch-positiv Vorfallsmeldungen kommen, insbesondere wenn die Honeypots dort platziert werden, wo sie für legitime Nutzende leicht zugänglich sind oder wenn legitime Netzwerkscans bereits eine Alarmierung auslösen. Daher ist es sinnvoll die konkreten Einsatzgegebenheiten mit den",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "DET.4.10.2-m1",
                    "uuid": "82e718c5-7a6c-476b-8e38-e7839743b700",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Honeypots werden, wenn überhaupt, nur experimentell und ohne Anbindung an ein Monitoring betrieben."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Einsatz erfolgt ohne Strategie, oft auf Initiative einzelner Administratoren zu Testzwecken."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Interview mit Administratoren, ob Test-Honeypots im Netz aktiv sind und ob diese dokumentiert wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.10.2-m2",
                    "uuid": "56c6d72d-5394-4b5e-99b4-ae82b4e4ad5c",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Einzelne Honeypots sind an exponierten Stellen platziert und werden manuell überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden einfache Lösungen (z.B. Low-Interaction) eingesetzt. Logs werden lokal gespeichert und gelegentlich geprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Erreichbarkeit eines Honeypots (z.B. via `nmap` Scan auf Honeypot-Ports) und Sichtung der lokalen Logs."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.10.2-m3",
                    "uuid": "111808eb-495a-4af1-afa7-b08d2e4cb2cd",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Detektion für Netze KANN Netzwerk-Honeypots installieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Honeypots dienen als Fallen für Angreifer. Ihr Einsatz muss geplant erfolgen, um keine zusätzlichen Risiken zu erzeugen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung des Konzepts für den Honeypot-Einsatz und Verifizierung der sicheren Netzwerksegmentierung der Honeypots."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.10.2-m4",
                    "uuid": "ba763b8f-aaf9-435c-9e5f-e973a0ba46de",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zentral verwaltete Honeypots sind in das Monitoring-System integriert und lösen bei Kontakt sofortige Alarme aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Honeypots simulieren realistische Dienste. Alarme werden im NOC/SOC priorisiert behandelt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Auslösen eines 'Angriffs' auf den Honeypot (z.B. Verbindungsaufbau) und Verifikation des Alarms im zentralen Monitoring."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.10.2-m5",
                    "uuid": "18896a9c-0455-4727-aeca-19aad303c435",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein dynamisches Deception-Netzwerk passt Köder automatisch an und analysiert Angreiferverhalten in isolierten Umgebungen."
                      },
                      {
                        "name": "guidance",
                        "value": "Hoch-interaktive Honeypots binden Angreifer und sammeln Threat Intelligence, die automatisch in Firewall-Regeln einfließt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Audit der Automatisierungsregeln. Nachweis, dass aus Honeypot-Daten automatisch IOCs generiert und verteilt werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "b5a440cd-08a0-4d32-a5d3-464d5e5f315d",
                "control-id": "DET.4.10.3",
                "description": "(BSI Baustein INF.12) Ein Netzverkehrsfluss ist eine Aufzeichnung von Verkehrsdaten einer Netzwerkverbindung (wie Quell-/Ziel-IP, Ports, Protokoll, übertragene Datenmenge und Zeitdauer). Die Aufzeichnung des gesamten Verkehrs (Packet Capture) des vollständigen Inhalts aller Datenpakete ist hierzu nicht erforderlich, sodass die zu untersuchende Datenmenge überschaubar bleibt. Allerdings sind hier Compliance-Anforderungen zur Datenspeicherung relevant. Für datenschutzrechtliche Fragen zu Verkehrsdaten kann der BfDI Leitfaden Speicherung Verkehrsdaten als Grundlage genutzt werden. Beispiele für Kriterien sind die Aufzeichnung an wichtigen Netzgrenzen (DMS-Internet), in kritischen Netzen, zwischen Serversystemen oder bei Leistungsproblemen.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "medium",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "DET.4.10.3-m1",
                    "uuid": "9b5e8084-d4c7-4f09-80f5-eed4e3e63603",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Netzverkehrsflüsse werden nur bei akuten Problemen mittels passiver Mitschnitte (Sniffer) punktuell analysiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt keine dauerhafte Erfassung von Verbindungsdaten. Analysen sind rein reaktiv."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen, ob Tools wie `tcpdump` oder `wireshark` vorhanden sind und wie diese im Störungsfall genutzt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.10.3-m2",
                    "uuid": "2833afba-f649-48db-a905-3ed712612bac",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Flow-Daten (z.B. NetFlow/IPFIX) werden generiert und für eine begrenzte Zeit zur nachträglichen Analyse gespeichert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Auswertung erfolgt manuell bei Bedarf. Es gibt keine automatische Alarmierung auf Basis der Flows."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Router-Konfiguration auf Export von Flow-Daten (z.B. `show ip flow-export`)."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.10.3-m3",
                    "uuid": "b7b710bd-2956-4dd4-8b67-80f4108534df",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Detektion für Netze KANN auf kritische Netzverkehrsflüsse anhand von {{ insert: param, det.4.10.3-prm1 }} überwachen."
                      },
                      {
                        "name": "guidance",
                        "value": "Kritische Flüsse können z.B. Verbindungen zu C&C-Servern oder massiver Datentransfer zu ungewöhnlichen Zeiten sein."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtung der Kriterienliste für kritische Flüsse und Überprüfung der Implementierung im Monitoring-Tool."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.10.3-m4",
                    "uuid": "67bcb437-21e2-4c52-8465-889b2353c316",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Flow-Daten werden automatisiert gegen definierte Schwellwerte und Blacklists geprüft, um Alarme zu generieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Das System alarmiert bei Abweichungen (z.B. Datenmenge > X GB zu externer IP) oder Verbindungen zu bekannten Malicious IPs."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Alert-Regeln in der Flow-Analyse-Software (z.B. NFSen, Elastiflow) auf definierte Schwellwerte."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.10.3-m5",
                    "uuid": "448df4f9-bdb3-4052-94fa-22b12906e2af",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Verkehrsflüsse werden mittels Machine Learning auf Verhaltensanomalien untersucht und automatisch unterbunden."
                      },
                      {
                        "name": "guidance",
                        "value": "Das System erkennt Zero-Day-Kommunikationsmuster und Lateral Movement ohne statische Signaturen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Validierung der ML-Modelle durch Test-Traffic-Muster und Prüfung der automatischen Response (z.B. QoS-Drosselung, ACL-Update)."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ec5a3220-66ee-4e9d-92e6-9e1e86124d91",
                "control-id": "DET.4.11",
                "description": "(BSI Baustein INF.12) Die Verfügbarkeit von Netzen, insbesondere des Internetanschlusses, sowie im Kern- und Verteilernetz, ist von zentraler Bedeutung für die Verfügbarkeit von IT-Infrastrukturen. Ein Monitoring ermöglicht es dem Betriebspersonal, bei Netzproblemen reagieren zu können, bevor Beschwerden von Nutzenden aufkommen. Kann durch Hello-Packete von Netzkomponenten oder die Erreichbarkeit von Diensten über das Netz umgesetzt werden.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "DET.4.11-m1",
                    "uuid": "e3dd2fd4-c63c-4d98-aa9f-96dffbedb8a8",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Netzverfügbarkeit wird nicht technisch überwacht; Ausfälle fallen erst durch Nutzerbeschwerden auf."
                      },
                      {
                        "name": "guidance",
                        "value": "Es existiert kein Monitoring-System. Die Reaktionszeit hängt von der Meldung durch Anwender ab."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Interview mit dem Helpdesk bezüglich des Prozesses bei Netzwerkausfällen."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.11-m2",
                    "uuid": "01c8711d-677d-4916-af27-e7cf9f3440d9",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zentrale Komponenten werden mittels einfacher Ping-Checks oder Status-Skripte auf Erreichbarkeit geprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird lediglich 'Up/Down' geprüft. Keine differenzierte Betrachtung von Latenzen oder Paketverlusten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung, ob ein einfaches Monitoring (z.B. Cronjob mit Ping) existiert. Check: `crontab -l` oder Monitoring-Dashboard."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.11-m3",
                    "uuid": "8163eef3-6abb-4a5e-a55c-0e5d5333a4ba",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Detektion für Netze SOLLTE die Verfügbarkeit des Netzes anhand von {{ insert: param, det.4.11-prm1 }} überwachen."
                      },
                      {
                        "name": "guidance",
                        "value": "Parameter können Verfügbarkeit von Knoten, Latenzzeiten oder Jitter umfassen. Ein Monitoring-System ist notwendig."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Konfiguration des Monitoring-Systems (z.B. Nagios, Zabbix) auf die definierten Parameter."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.11-m4",
                    "uuid": "75ff69b9-4f77-49e2-995a-b8ef8c0df95f",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein umfassendes Monitoring überwacht SLA-Parameter proaktiv und visualisiert Trends zur Früherkennung."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden redundante Pfade überwacht. Trends (z.B. steigende Latenz) lösen Warnungen vor dem Ausfall aus."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtung der Trendanalysen und SLA-Reports im Monitoring-System. Test eines Failovers und Überprüfung der Alarmierung."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.11-m5",
                    "uuid": "9546fb3d-bad1-4a72-9916-0f6699e13a50",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "End-to-End Überwachung mittels synthetischer Transaktionen steuert Self-Healing-Mechanismen des Netzwerks."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei Degradation der Verfügbarkeit werden Verkehrsströme automatisch und transparent umgeleitet (SD-WAN Integration)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Audit der SD-WAN Policies und Simulation einer Leitungsstörung zur Verifikation der automatischen Optimierung."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "766ba4f7-1e63-4636-943a-3d8046075e5b",
                "control-id": "DET.4.11.1",
                "description": "(BSI Baustein INF.12) Die Überwachung der Netzauslastung ermöglicht eine schnelle Reaktion bei Verfügbarkeitsproblemen. Wichtige Indikatoren sind Auslastung der verfügbaren Bandbreite, Netzlatenz und Packverluste. Unerwartet hoher Datenverkehr kann auch ein Indiz für einen unautorisierten Zugriff auf große Datenmengen sein. Zur Umsetzung ist es zweckmäßig zunächst Normwerte zu ermitteln (Baselining).",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Technical",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "low",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "DET.4.11.1-m1",
                    "uuid": "4a070222-5f60-46d0-8404-0b87a31550a3",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Auslastung wird nur bei spürbaren Performance-Einbußen manuell an den Geräten kontrolliert."
                      },
                      {
                        "name": "guidance",
                        "value": "Keine historischen Daten verfügbar. Analyse erfolgt ad-hoc per CLI (z.B. `show interface`)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Interview, wie bei Performance-Engpässen vorgegangen wird. Prüfung auf Fehlen von Monitoring-Tools."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.11.1-m2",
                    "uuid": "ee77131d-0d43-4f20-8690-eb20f4a3e7e7",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Auslastung wichtiger Uplinks wird periodisch erfasst und grafisch dargestellt (z.B. MRTG)."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Graphen werden manuell ausgewertet, um Engpässe nachträglich zu identifizieren. Keine aktive Alarmierung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtung der Auslastungsgraphen (z.B. Cacti/MRTG). Prüfung, ob SNMP auf Geräten aktiv ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.11.1-m3",
                    "uuid": "61722b1c-e7df-484f-97dd-bbd780f347eb",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Detektion für Netze KANN die Auslastung des Netzes anhand von {{ insert: param, det.4.11.1-prm1 }} überwachen."
                      },
                      {
                        "name": "guidance",
                        "value": "Parameter sind typischerweise Bandbreitennutzung, CPU-Last der Router oder Puffer-Auslastung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung, ob die definierten Parameter im Network-Performance-Monitoring konfiguriert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.11.1-m4",
                    "uuid": "ced5e470-11ee-4de1-b9c0-1fed6967d1f3",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Schwellwerte für die Auslastung sind definiert; bei Überschreitung erfolgt eine automatische Alarmierung."
                      },
                      {
                        "name": "guidance",
                        "value": "Kapazitätsengpässe werden proaktiv gemeldet (z.B. Warnung bei 80% Link-Last über 5 Minuten)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Threshold-Konfiguration im Monitoring (z.B. Prometheus Alertmanager Regeln)."
                      }
                    ]
                  },
                  {
                    "statement-id": "DET.4.11.1-m5",
                    "uuid": "5428fda0-c3ba-456a-a088-c4a2053af22a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Prädiktive Analysen steuern dynamisch Quality-of-Service (QoS) Parameter und skalieren Bandbreiten."
                      },
                      {
                        "name": "guidance",
                        "value": "Automatisches Provisioning von Zusatzkapazitäten (z.B. Cloud-Bursting) basierend auf KI-Vorhersagen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Nachweis der automatischen QoS-Anpassung oder Bandbreitenerweiterung durch Last-Simulation."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "191e7c08-7f8f-433a-b892-d549f924cc6f",
                "control-id": "GEB.7.3",
                "description": "(BSI Baustein INF.12) „Für die Funktionsfähigkeit des Netzes erforderliche Systeme“ sind in diesem Kontext alle physischen und logischen Komponenten, deren Betrieb direkt die Verfügbarkeit, Integrität oder Steuerbarkeit von Netzwerken beeinflusst — etwa aktive Netzwerkkomponenten (engl. network devices) wie Router, Switches, Firewalls oder Netzwerkmanagementsysteme (engl. Network Management Systems, NMS). Die Definition von „Räumen für technische Infrastruktur“ ist in den Definitionen für Zielobjekte zu finden. Diese Räume sind typischerweise mit einer kontrollierten physischen Zugangsbeschränkung, Klimatisierung, Brandfrüherkennung und einer stabilen Stromversorgung (z. B. über USV-Anlagen) ausgestattet. Die Anforderung gewährleistet somit, dass netzkritische Systeme räumlich von allgemeinen Arbeits- oder Aufenthaltsbereichen getrennt sind, um deren Sicherheit und Stabilität zu gewährleisten.",
                "props": [
                  {
                    "name": "control_class",
                    "value": "Operational",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "high",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "GEB.7.3-m1",
                    "uuid": "e77a0aeb-e854-4111-99bb-527b3f78977b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Netzkomponenten werden häufig ad-hoc in Büros, Fluren oder anderen verfügbaren Nischen platziert, ohne dass dedizierte Räume oder Schutzmaßnahmen vorhanden sind."
                      },
                      {
                        "name": "guidance",
                        "value": "In dieser Phase fehlt ein Konzept für die physische Sicherheit. Komponenten sind oft physisch für Jedermann zugänglich, was Manipulationen erleichtert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Führen Sie eine Begehung durch und suchen Sie nach frei zugänglichen Netzwerkgeräten (z.B. Switches unter Tischen oder in unverschlossenen Flurschränken)."
                      }
                    ]
                  },
                  {
                    "statement-id": "GEB.7.3-m2",
                    "uuid": "b22d9ea2-6074-44d4-8966-ffb19c58e51f",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zentrale Netzkomponenten befinden sich in Technikräumen, während Etagenverteiler oder kleinere Einheiten oft noch in unzureichend gesicherten Bereichen installiert sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Grundlegende physische Sicherheit ist für den Kernbereich gegeben, jedoch nicht flächendeckend für alle verteilten Komponenten umgesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie stichprobenartig, ob Etagenverteiler in abschließbaren Schränken untergebracht sind und ob der Schlüsselzugriff geregelt ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "GEB.7.3-m3",
                    "uuid": "e071c1ea-39f8-4238-a927-1a271f60eb6b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Gebäudemanagement für Netze SOLLTE für die Funktionsfähigkeit des Netzes erforderliche Systeme ausschließlich in Räumen für technische Infrastruktur p"
                      },
                      {
                        "name": "guidance",
                        "value": "Die Platzierung in dedizierten Räumen schützt vor unbefugtem Zugriff und Umwelteinflüssen. Dies ist essenziell für die Verfügbarkeit."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Vergleichen Sie die Raumpläne mit der Realität. Stellen Sie sicher, dass systemrelevante Komponenten nicht in öffentlichen Bereichen stehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "GEB.7.3-m4",
                    "uuid": "1abc647d-44e0-490f-8843-7880bfa02ab2",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle aktiven und passiven Netzkomponenten sind konsequent in zutrittsgeschützten, dedizierten Technikräumen untergebracht, die den aktuellen Normen entsprechen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es erfolgt eine strikte Trennung von technischer Infrastruktur und Bürofläche. Zutritte zu diesen Räumen werden protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Zutrittsprotokolle der Technikräume. Führen Sie einen Abgleich des Inventars mit der CMDB durch, um 'wilde' Installationen auszuschließen."
                      }
                    ]
                  },
                  {
                    "statement-id": "GEB.7.3-m5",
                    "uuid": "4b43e6fd-1e02-4553-a87b-34d0c28f77f8",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Technikräume unterliegen einer vollautomatischen Überwachung (Zutritt, Klima) mit direkter Alarmierung an das Sicherheitsmanagement-System."
                      },
                      {
                        "name": "guidance",
                        "value": "Physische Sicherheit wird durch Sensorik proaktiv überwacht. Abweichungen (z.B. Türöffnung, Temperaturanstieg) lösen sofortige Prozessketten aus."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Integration der Raumsensoren in das Monitoring (z.B. via SNMP). Simulieren Sie einen unbefugten Zutritt und prüfen Sie die Alarmkette."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}