{
  "component-definition": {
    "uuid": "d02f837c-a66b-4ddd-a4f5-e09fb1790c4c",
    "metadata": {
      "title": "NET.1.1 Netzarchitektur und -design - Benutzerdefiniert",
      "last-modified": "2025-11-22T12:46:13.391185+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "e034557f-ee0a-4654-afe5-1871685e8234",
        "type": "interconnection",
        "title": "NET.1.1 Netzarchitektur und -design",
        "description": "This component represents the implementation of all controls for Baustein NET.1.1.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Die meisten Institutionen benötigen heute für ihren Geschäftsbetrieb und für die Erfüllung ihrer Fachaufgaben Datennetze, über die beispielsweise Informationen und Daten ausgetauscht sowie verteilte Anwendungen realisiert werden. An solche Netze werden nicht nur herkömmliche Endgeräte, das Extranet und das Internet angeschlossen. Sie integrieren zunehmend auch mobile Endgeräte und Elemente, die dem Internet of Things (IoT) zugerechnet werden. Darüber hinaus werden über Datennetze vermehrt auch Cloud-Dienste sowie Dienste für Unified Communication and Collaboration (UCC) genutzt. Die Vorteile, die sich dadurch ergeben, sind unbestritten. Aber durch die vielen Endgeräte und Dienste steigen auch die Risiken. Deshalb ist es wichtig, das eigene Netz bereits durch eine sichere Netzarchitektur zu schützen. Dafür muss zum Beispiel geplant werden, wie ein lokales Netz (Local Area Network, LAN) oder ein Wide Area Network (WAN) sicher aufgebaut werden kann. Ebenso müssen nur eingeschränkt vertrauenswürdige externe Netze, z. B. das Internet oder Netze der Kundschaft, geeignet angebunden werden.<BR>Um ein hohes Sicherheitsniveau zu gewährleisten, sind zusätzliche sicherheitsrelevante Aspekte zu berücksichtigen. Beispiele hierfür sind eine sichere Trennung verschiedener Mandanten und Mandantinnen sowie Gerätegruppen auf Netzebene und die Kontrolle ihrer Kommunikation durch eine Firewall. Ein weiteres wichtiges Sicherheitselement, speziell bei Clients, ist außerdem die Netzzugangskontrolle."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es, die Informationssicherheit als integralen Bestandteil der Netzarchitektur und des Netzdesigns zu etablieren."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein NET.1.1 Netzarchitektur und -design ist auf das Gesamtnetz einer Institution inklusive aller Teilnetze anzuwenden.<BR>Der Baustein enthält grundsätzliche Anforderungen, die zu beachten und erfüllen sind, wenn Netze geplant, aufgebaut und betrieben werden. Anforderungen für den sicheren Betrieb der entsprechenden Netzkomponenten, inklusive Sicherheitskomponenten wie z. B. Firewalls, sind nicht Gegenstand des vorliegenden Bausteins. Diese werden in der Bausteingruppe NET.3 Netzkomponenten behandelt.<BR>Der Fokus dieses Bausteins liegt auf kabelgebundenen Netzen und der Datenkommunikation. Jedoch müssen allgemeine Anforderungen an die Architektur und das Design, z. B. dass Zonen gegenüber Netzsegmenten immer eine physische Trennung erfordern, für alle Netztechniken beachtet und erfüllt werden.<BR>Weitergehende spezifische Anforderungen für Netzbereiche wie Wireless LAN (WLAN) oder Speichernetze (Storage Area Networks, SAN) werden in der Bausteinschicht NET.2 Funknetze bzw. im Baustein SYS.1.8 Speicherlösungen behandelt. Darüber hinaus wird auch das Thema Voice over IP (VoIP) sowie die dafür zugrundeliegende Sicherheitsinfrastruktur nicht in diesem Baustein erörtert, sondern in dem entsprechenden Baustein NET.4.2 VoIP behandelt.<BR>Spezifische sicherheitstechnische Anforderungen für Virtual Private Clouds und Hybrid Clouds liegen ebenfalls nicht im Fokus dieses Bausteins.<BR>Das Netzmanagement wird im Rahmen der Zonierung und Segmentierung betrachtet, alle weitergehenden Themen des Netzmanagements werden im Baustein NET.1.2 Netzmanagement behandelt."
          },
          {
            "name": "2.1. Ausfall oder unzureichende Performance von Kommunikationsverbindungen",
            "value": "Sind die Kommunikationsverbindungen unzureichend dimensioniert oder reicht ihre Leistung aufgrund eines technischen Ausfalls oder eines Denial-of-Service-(DoS)-Angriffs nicht mehr aus, können z. B. Clients nur noch eingeschränkt mit Servern kommunizieren. Dadurch erhöhen sich die Zugriffszeiten auf interne und externe Dienste. Diese sind so mitunter nur noch eingeschränkt oder gar nicht mehr nutzbar. Auch sind eventuell institutionsrelevante Informationen nicht mehr verfügbar. In der Folge können essenzielle Geschäftsprozesse oder ganze Produktionsprozesse stillstehen."
          },
          {
            "name": "2.2. Ungenügend abgesicherte Netzzugänge",
            "value": "Ist das interne Netz mit dem Internet verbunden und der Übergang nicht ausreichend geschützt, z. B. weil keine Firewall eingesetzt wird oder sie falsch konfiguriert ist, können Angreifende auf schützenswerte Informationen der Institution zugreifen und diese kopieren oder manipulieren."
          },
          {
            "name": "2.3. Unsachgemäßer Aufbau von Netzen",
            "value": "Wird ein Netz unsachgemäß aufgebaut oder fehlerhaft erweitert, können unsichere Netztopologien entstehen oder Netze unsicher konfiguriert werden. Angreifende können so leichter Sicherheitslücken finden, ins interne Netz der Institution eindringen und dort Informationen stehlen, Daten manipulieren oder auch ganze Produktionssysteme stören. Auch bleiben Angreifende in einem fehlerhaft aufgebauten Netz, das die Sicherheitssysteme nur eingeschränkt überwachen können, länger unerkannt."
          }
        ],
        "control-implementations": [
          {
            "uuid": "98543c48-d7a4-4461-ac56-29a3a263b265",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Kompendien/Grundschutz%2B%2B-Kompendium/profile/netze_profile.json",
            "description": "Implementation for all controls in Baustein NET.1.1",
            "implemented-requirements": [
              {
                "uuid": "c6970c99-119c-496b-ae52-1a709a472525",
                "control-id": "ARCH.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Treatment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BES",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.4.A3-m1",
                    "uuid": "b93999d8-f720-4f76-b22f-1d16210fea5c",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Einige wenige, hochrangige Anforderungen werden informell in einer E-Mail oder einem kurzen Dokument festgehalten. Es gibt keinen strukturierten Katalog und die Anforderungen decken nicht alle relevanten NAC-Komponenten ab."
                      },
                      {
                        "name": "guidance",
                        "value": "In einer E-Mail steht: 'Wir brauchen eine NAC-Lösung, die 802.1X kann und einen RADIUS-Server hat'. Anforderungen an Endgeräte oder die Skalierbarkeit fehlen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bittet um den Anforderungskatalog und erhält eine E-Mail oder ein kurzes Memo. Es wird festgestellt, dass dies kein strukturierter Katalog ist und wesentliche Komponenten (z.B. Endgeräte) nicht berücksichtigt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A3-m2",
                    "uuid": "9516256c-d01d-4c2c-a87b-d2c4be7874b6",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Liste funktionaler Anforderungen wird erstellt, die die Hauptkomponenten adressiert. Diese Liste wird jedoch nicht formal mit allen betroffenen Fachabteilungen und Gremien abgestimmt und nicht regelmäßig aktualisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Netzwerkabteilung erstellt eine Excel-Tabelle mit Anforderungen an Switches und den RADIUS-Server. Diese wird für die Beschaffung genutzt, aber der Helpdesk oder die Client-Management-Abteilung wurden nicht einbezogen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer findet einen Anforderungskatalog, kann aber keine Nachweise (z.B. Protokolle, Unterschriften) für die Abstimmung mit allen relevanten Stakeholdern (insbesondere außerhalb der Netzwerkabteilung) finden."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A3-m3",
                    "uuid": "96836b5f-8120-452c-b5da-177d49dfa4af",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anforderungen an die NAC-Lösung SOLLTEN in einem Anforderungskatalog erhoben werden. Der Katalog SOLLTE die grundlegenden funktionalen Anforderungen umfassen und alle NAC-Komponenten (z. B. Endgeräte, Access-Switches und RADIUS-Server) adressieren. Er SOLLTE mit allen betroffenen Fachabteilungen, Gremien und Richtlinien abgestimmt, regelmäßig aktualisiert und bei Beschaffungen sowie Tests der Lösung berücksichtigt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein formales Dokument 'Anforderungskatalog NAC' erstellt. Es enthält Kapitel für Endgeräte (z.B. 'Muss EAP-TLS unterstützen'), Switches (z.B. 'Muss RADIUS Change of Authorization unterstützen') und RADIUS-Server (z.B. 'Muss Anbindung an Active Directory via LDAPS unterstützen'). Das Dokument wird nachweislich an die Leiter von IT-Betrieb, Clients und Sicherheit zur Freigabe geschickt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert den Anforderungskatalog an und prüft ihn auf Vollständigkeit bezüglich der Komponenten. Des Weiteren werden Freigabenachweise der Stakeholder und Protokolle von Aktualisierungen eingefordert. Bei einer kürzlichen Beschaffung von Switches wird geprüft, ob die Ausschreibung auf den Katalog Bezug genommen hat."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A3-m4",
                    "uuid": "71ef1d65-a247-4304-89b5-052311b1bc01",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Anforderungskatalog wird um nicht-funktionale Anforderungen erweitert. Dazu gehören explizite Vorgaben zur Leistung (z.B. maximale Authentisierungslatenz), Skalierbarkeit (z.B. Anzahl der zu unterstützenden Endpunkte) und Hochverfügbarkeit. Der Katalog ist versioniert und wird formal von allen Stakeholdern unterzeichnet."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Katalog steht unter 'Nicht-funktionale Anforderungen': 'NFR-01: Die RADIUS-Lösung muss 10.000 Endpunkte unterstützen können.' und 'NFR-02: Die durchschnittliche Authentisierungszeit darf 200ms nicht überschreiten.' Das Dokument ist in einem DMS mit Versionskontrolle gespeichert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft, ob der Katalog einen Abschnitt zu nicht-funktionalen Anforderungen enthält und ob diese quantifizierbar sind. Es wird die Versionshistorie des Dokuments und die formalen Freigabenachweise geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A3-m5",
                    "uuid": "ae705911-4652-4ed5-8ca8-6fda257e942d",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Anforderungskatalog wird in einem dedizierten Requirements-Engineering-Tool verwaltet. Jede Anforderung ist eindeutig identifizierbar und wird über den gesamten Lebenszyklus verfolgt (Traceability), von der ursprünglichen Anforderung über die Umsetzung im Konzept bis hin zu spezifischen Testfällen. Bei neuen Beschaffungsvorhaben wird automatisch geprüft, ob die Ausschreibung alle relevanten NAC-Anforderungen aus dem Tool abdeckt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Tool wie Jira oder ein spezialisiertes RE-Tool wird verwendet. Die Anforderung 'NAC-REQ-101: Switch muss CoA unterstützen' ist mit dem Testfall 'NAC-TC-205: Teste CoA-Funktion' und dem Konzeptkapitel '3.4.2 Dynamische Autorisierung' verknüpft. Eine neue Switch-Ausschreibung löst einen automatisierten Workflow aus, der die Abdeckung der Anforderungen prüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich einen Bericht aus dem RE-Tool generieren, der die Traceability-Matrix zwischen Anforderungen, Konzept und Testfällen zeigt. Es wird geprüft, ob der Prozess zur Überprüfung von Beschaffungen gegen die Anforderungen automatisiert ist. Ein automatisierter Test könnte eine API-Abfrage an das RE-Tool sein, um die Vollständigkeit der Verknüpfungen zu verifizieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "a16d9a1b-bbb7-4ccc-9677-d445bd5beec2",
                "control-id": "ARCH.2.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.4.A9-m3",
                    "uuid": "bf121083-2a7e-4edc-87db-cb80f188b051",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die NAC-Lösung SOLLTE ein NAC-Regelwerk definiert werden, das das NAC-Konzept umsetzt. Hierin SOLLTE für jedes Endgerät bzw. für jede Endgerätegruppe festgelegt werden, ob uneingeschränkt auf das Netz zugegriffen werden darf, ob der Zugriff verweigert wird oder ob nur Segmente mit eingeschränkten Kommunikationsmöglichkeiten erreichbar sind. Im Regelwerk SOLLTE auch festgelegt werden, auf welcher Basis die Zugangskontrolle erfolgt, indem für alle Endgeräte die genutzten Authentisierungsmethoden und die Bedingungen für eine erfolgreiche Authentisierung festgelegt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Auf dem RADIUS-Server wird eine Policy-Liste konfiguriert: 1. 'IF (User-Authentication-Type == EAP-TLS) AND (Client-Certificate-Issuer == Corp-PKI) THEN Permit-Access AND Assign-VLAN=10 (Clients)'. 2. 'IF (Calling-Station-Id IN Group:Printers) THEN Permit-Access AND Assign-VLAN=20 (Printers)'. 3. 'DEFAULT Deny-Access'. Diese Regeln setzen das Konzept direkt um."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des Regelwerks (Policy Set) auf dem RADIUS-Server. Dieses wird mit den Vorgaben aus dem NAC-Konzept verglichen, um die korrekte Umsetzung zu verifizieren. Es wird geprüft, ob für jede relevante Endgerätegruppe eine Regel existiert und ob eine 'Default Deny'-Regel am Ende steht."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A9-m4",
                    "uuid": "8e89092d-6ed4-4f14-aa24-20d0995f8145",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Regelwerk ist hochgradig granular und weist Endgeräten spezifische Mikrosemente zu, basierend auf einer Kombination von Attributen wie Benutzergruppe, Gerätetyp und Authentisierungs-Level. Das Regelwerk ist versioniert und jede Änderung daran folgt einem formalen Change-Management-Prozess."
                      },
                      {
                        "name": "guidance",
                        "value": "Die RADIUS-Policy wird erweitert: 'IF (User-Group == 'Finance') AND (Device-Type == 'Corporate-Laptop') AND (Authentication-Method == 'EAP-TLS') THEN Assign-VLAN=11 (Finance-Clients) AND Apply-ACL='ACL-Finance-Standard''. Alle Änderungen am Regelwerk werden in einem Git-Repository versioniert und erfordern einen genehmigten Change Request."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Komplexität und Granularität des Regelwerks. Es wird das Change-Management-System geprüft, um zu verifizieren, dass Änderungen am Regelwerk nachvollziehbar und genehmigt sind. Die Versionshistorie des Regelwerks wird eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A9-m5",
                    "uuid": "ed3e284a-4b3c-4024-87fb-1609afdd6ecd",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das NAC-Regelwerk ist dynamisch und kontextsensitiv. Die Zugriffsrechte werden in Echtzeit basierend auf dem aktuellen Zustand des Endgeräts (z.B. Compliance-Status aus einem MDM/EDR-System), dem Benutzerkontext und der aktuellen Bedrohungslage bestimmt. Das Regelwerk wird vollständig über einen Infrastructure-as-Code-Ansatz verwaltet und Änderungen werden automatisiert getestet und ausgerollt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der RADIUS-Server fragt bei jeder Anmeldung per API den Compliance-Status des Geräts beim EDR-System ab. 'IF (EDR-Status == 'compromised') THEN Assign-Quarantine-VLAN'. Das gesamte Regelwerk ist in einem Git-Repository als Code abgelegt. Eine Änderung im Code löst eine CI/CD-Pipeline aus, die das Regelwerk in einer Testumgebung validiert und bei Erfolg automatisch in die Produktion ausrollt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der API-Anbindungen an externe Systeme (EDR, MDM). Es wird die CI/CD-Pipeline für das Regelwerk-Management geprüft. Ein Testfall wird durchgespielt, bei dem ein Gerät als 'nicht-konform' gemeldet wird, um zu verifizieren, dass die dynamische Regeländerung in Echtzeit greift. Ein automatischer Test könnte die Konfiguration der API-Endpunkte und Authentifizierungsdaten im RADIUS-Server überprüfen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "68d799c1-3943-48fb-a6f0-e6060e0d60eb",
                "control-id": "ARCH.2.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Treatment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.4.A4-m3",
                    "uuid": "42daf61c-c19f-4463-8b8e-f0108f542543",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ausgehend von der Entscheidung (A1) und den Anforderungen (A3) SOLLTE ein NAC-Konzept erstellt werden. Dieses SOLLTE mit dem Segmentierungskonzept abgestimmt sein und mindestens folgende Aspekte festlegen: Netzbereiche für NAC, Authentisierung und Autorisierung, Nutzung von Zusatzfunktionen, Konfigurationsvorgaben für alle Komponenten, Aufbau der RADIUS-Infrastruktur und Regelwerk, sowie die Anbindung an externe Sicherheitskomponenten und Verzeichnisdienste. Das Konzept SOLLTE alle technischen und organisatorischen Vorgaben beschreiben, regelmäßig geprüft und aktualisiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein detailliertes Konzeptdokument wird erstellt. Es enthält ein Kapitel 'Authentisierung', das festlegt: 'Für firmeneigene Windows-Clients wird EAP-TLS mit maschinenbasierten Zertifikaten verwendet. Für Drucker wird MAC-Authentisierung verwendet.' Ein weiteres Kapitel 'RADIUS-Infrastruktur' beschreibt den Aufbau eines hochverfügbaren RADIUS-Clusters und definiert die RADIUS-Clients (Switches) mit ihren IP-Adressen und Shared Secrets."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das NAC-Konzept an und gleicht dessen Inhaltsverzeichnis und die Inhalte mit den in der Anforderung genannten Aspekten ab. Es wird geprüft, ob das Konzept mit dem allgemeinen Netzarchitektur- und Segmentierungskonzept konsistent ist und ob ein Prozess zur regelmäßigen Überprüfung des Konzepts existiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A4-m4",
                    "uuid": "f38cbecd-5186-43b6-8584-65563479fdf9",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das NAC-Konzept wird um detaillierte Beschreibungen von Ausfallszenarien und den dazugehörigen Fallback-Mechanismen (RADIUS-down-Policies) erweitert. Das Konzept wird formal durch ein Gremium (z.B. IT-Sicherheitsmanagement) geprüft und freigegeben. Es wird ein fester Review-Zyklus (z.B. jährlich) für das Konzept etabliert und dessen Einhaltung nachgewiesen."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Konzept enthält ein Kapitel 'Notfallbetrieb', das festlegt: 'Bei Ausfall beider RADIUS-Server verbleiben bereits authentisierte Clients im Netz. Neu angebundene Clients werden in ein Quarantäne-VLAN mit reiner Internet-Konnektivität verschoben.' Das Dokument wird versioniert und die Freigabe wird im Protokoll des IT-Sicherheits-Boards vermerkt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert das Vorhandensein des Kapitels zu Ausfallszenarien. Es werden die Freigabeprotokolle und die Nachweise über die Einhaltung des Review-Zyklus (z.B. Meeting-Einladungen, aktualisierte Dokumentenversionen) geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A4-m5",
                    "uuid": "24d73d49-0d38-4b90-896f-37c40167276d",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das NAC-Konzept wird als ausführbares Modell im Rahmen eines Infrastructure-as-Code (IaC) Ansatzes umgesetzt. Die Konfigurationen für Switches, RADIUS-Server und Firewalls werden in Code-Templates (z.B. Ansible Playbooks, Terraform-Modelle) beschrieben. Die menschlich lesbare Dokumentation wird aus diesen Code-Templates und Kommentaren automatisch generiert. Das Konzept sieht eine dynamische Anpassung von Policies basierend auf externen Threat-Intelligence-Feeds vor."
                      },
                      {
                        "name": "guidance",
                        "value": "Die RADIUS-Client-Definitionen werden in einer Ansible-Variablendatei gepflegt. Ein Playbook liest diese Datei und konfiguriert den RADIUS-Server entsprechend. Ein Skript generiert aus der Variablendatei und Markdown-Templates eine HTML-Dokumentation. Eine Integration mit einem Threat-Feed sorgt dafür, dass bei Bekanntwerden einer kritischen Schwachstelle automatisch eine Policy ausgerollt wird, die betroffene Systeme isoliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das IaC-Repository (z.B. in Git). Es wird geprüft, ob die produktive Konfiguration nachvollziehbar aus den Code-Templates abgeleitet ist und ob ein Prozess zur automatischen Dokumentationsgenerierung existiert. Automatisiert kann die Konsistenz zwischen dem Code-Repository und der laufenden Konfiguration durch Ausführung eines Read-Only-Ansible-Playbooks im Check-Modus verifiziert werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "f8863075-14c1-4201-a98d-a378153968de",
                "control-id": "ARCH.5.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.4.A7-m3",
                    "uuid": "f9d7207e-1e3e-4574-b8db-9db05d963eb7",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Endgeräte SOLLTEN sichere Authentisierungsverfahren nach dem Stand der Technik verwenden und automatisiert auf Basis von Zertifikaten oder Zugangskonten authentisiert werden. Unsichere Authentisierungsverfahren SOLLTEN nur in begründeten Ausnahmefällen genutzt und die Entscheidung dokumentiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Standardkonfiguration für Windows- und macOS-Clients wird so eingestellt, dass EAP-TLS mit Gerätezertifikaten für die 802.1X-Authentisierung verwendet wird. Für eine Liste von alten Druckern, die kein 802.1X unterstützen, wird eine Ausnahme für MAC-Authentisierung in einem separaten, stark eingeschränkten VLAN dokumentiert und genehmigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration auf dem RADIUS-Server und die Client-Konfigurationen (z.B. GPOs für Windows), um festzustellen, welche Authentisierungsverfahren erlaubt sind. Es wird die Liste der dokumentierten Ausnahmen für unsichere Verfahren angefordert und deren Begründung geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A7-m4",
                    "uuid": "c3b5602d-2025-4688-bd27-49703a4cb40d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Richtlinie erzwingt die ausschließliche Verwendung von sicheren EAP-Typen, insbesondere EAP-TLS. Die Verwendung schwächerer Methoden wie MAC-Authentisierung oder EAP-MD5 ist grundsätzlich verboten und erfordert einen formalen Risikoakzeptanzprozess durch das Informationssicherheitsmanagement. Die Validierung des RADIUS-Server-Zertifikats wird auf allen Clients erzwungen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die RADIUS-Server-Konfiguration lässt nur EAP-TLS als Authentisierungsmethode zu. Für die MAC-Authentisierung von Druckern muss ein formaler Antrag mit Risikoanalyse gestellt und vom CISO genehmigt werden. Die Client-Konfigurationen (via MDM/GPO) erzwingen die Server-Zertifikatsprüfung und geben den Namen des erwarteten RADIUS-Servers vor, um Man-in-the-Middle-Angriffe zu verhindern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die RADIUS-Konfiguration, um die erlaubten EAP-Typen zu verifizieren. Es wird der Prozess für die Risikoakzeptanz von Ausnahmen geprüft. Zudem wird die Client-Konfiguration daraufhin untersucht, ob die Server-Zertifikatsvalidierung erzwungen wird. Automatisiert kann dies durch ein Skript auf einem Test-Client geprüft werden, das versucht, sich mit einem falschen Server-Zertifikat zu verbinden, was fehlschlagen muss."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A7-m5",
                    "uuid": "25fdc82e-8db8-45ce-b8ef-82f2c6f4efc7",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die Authentisierung werden ausschließlich hardware-gestützte Zertifikate verwendet, die sicher in einem Trusted Platform Module (TPM) oder einer vergleichbaren Secure Enclave auf den Endgeräten gespeichert sind. Die Ausstellung, Erneuerung und der Widerruf dieser Zertifikate sind vollständig automatisiert und in eine PKI- und Mobile-Device-Management-Lösung integriert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Zertifikatsvorlagen in der Microsoft PKI sind so konfiguriert, dass der private Schlüssel im TPM des Clients erstellt und gespeichert wird ('Key Attestation'). Die Verteilung und Erneuerung der Zertifikate erfolgt automatisch über SCEP/NDES, das vom MDM-System gesteuert wird. Unsichere Authentisierungsverfahren sind auf dem RADIUS-Server komplett deaktiviert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration der Zertifikatsvorlagen auf der PKI und die SCEP/MDM-Konfiguration. Auf einem Beispiel-Client wird geprüft, ob der private Schlüssel des Zertifikats tatsächlich als nicht exportierbar und hardware-gebunden markiert ist. Die RADIUS-Logs werden daraufhin analysiert, ob ausschließlich Authentisierungen mit zertifikatbasierten Methoden stattfinden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "53c20126-2b3a-4168-8e71-f2be51f0ce8b",
                "control-id": "ASST.2.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.4.A10-m3",
                    "uuid": "20a6e051-b654-42a3-b270-144401742550",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die NAC-Authentisierung SOLLTEN individuelle Identitäten genutzt werden. Identitäten, die von mehr als einem Endgerät verwendet werden, SOLLTEN nur in begründeten Ausnahmefällen genutzt werden. Alle Informationen, die für eine erfolgreiche Authentisierung benötigt werden, SOLLTEN nach aktuellem Stand der Technik vor unberechtigtem Zugriff abgesichert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Jedes Endgerät erhält ein eigenes Gerätezertifikat als Identität. Die Nutzung von Shared Secrets für RADIUS-Clients wird auf das Notwendigste beschränkt und die Secrets werden sicher im RADIUS-Server gespeichert und nicht im Klartext in Skripten oder Dokumenten abgelegt. Die Nutzung einer geteilten Identität für eine Gruppe von Testgeräten wird als Ausnahme dokumentiert und genehmigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer untersucht die Konfiguration des RADIUS-Servers und der Endgeräte, um zu verifizieren, dass individuelle Identitäten (z.B. einzigartige Zertifikate) der Regelfall sind. Die Dokumentation von Ausnahmen für geteilte Identitäten wird geprüft. Es wird geprüft, wie und wo RADIUS-Secrets gespeichert werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A10-m4",
                    "uuid": "14e8bd4c-dc95-4745-a51a-851689915f1d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Richtlinie verbietet die Nutzung von geteilten Identitäten strikt. Jede Ausnahme erfordert einen formalen Risikoakzeptanzprozess durch den CISO. Authentisierungsinformationen wie RADIUS-Secrets oder private Schlüssel werden in einem dedizierten, gehärteten Secure Vault (z.B. HashiCorp Vault) gespeichert, auf den nur der RADIUS-Dienst selbst zugreifen kann. Alle Zugriffe auf den Vault werden protokolliert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die RADIUS-Software ist so konfiguriert, dass sie beim Start die Shared Secrets für die Kommunikation mit den Switches über eine API aus einem zentralen Vault abruft. Die Secrets sind in der Konfigurationsdatei des RADIUS-Servers selbst nicht mehr vorhanden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Richtlinie zum Verbot geteilter Identitäten und prüft den Prozess zur Risikoakzeptanz. Es wird die Konfiguration des RADIUS-Servers und des Secure Vaults analysiert, um sicherzustellen, dass Secrets nicht im Klartext auf dem Dateisystem gespeichert sind. Die Zugriffsprotokolle des Vaults werden eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A10-m5",
                    "uuid": "30becb31-1d95-4d47-9da2-2fa8fedab719",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für jedes Endgerät werden einzigartige, kryptographisch starke Identitäten verwendet, deren private Schlüssel in Hardware (TPM) erzeugt und gespeichert werden (siehe A7). Das Konzept geteilter Identitäten ist technisch unterbunden. Anstelle von Shared Secrets wird, wo immer möglich, eine zertifikatbasierte Authentifizierung auch für die Kommunikation zwischen den NAC-Komponenten (z.B. zwischen Switch und RADIUS-Server mittels RADSEC) eingesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Kommunikation zwischen Switches und RADIUS-Server wird auf RADSEC (RADIUS over TLS) umgestellt. Sowohl die Switches als auch die RADIUS-Server erhalten Zertifikate aus der internen PKI und authentisieren sich gegenseitig. Die Konfiguration von Shared Secrets entfällt dadurch komplett."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration von RADSEC auf Switches und RADIUS-Servern. Es wird eine Netzwerkanalyse (z.B. mit Wireshark auf einem gespiegelten Port) durchgeführt, um zu bestätigen, dass der RADIUS-Verkehr TLS-verschlüsselt ist. Es wird geprüft, ob in der RADIUS-Konfiguration keine Shared Secrets mehr definiert sind."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}