{
  "component-definition": {
    "uuid": "2e2e63ae-879d-4147-b496-c7f38160cbb2",
    "metadata": {
      "title": "NET.1.1 Netzarchitektur und -design - Benutzerdefiniert",
      "last-modified": "2025-11-14T22:08:59.799382+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "9e20a5a9-2ed5-4caf-af73-8a12c80a16a2",
        "type": "interconnection",
        "title": "NET.1.1 Netzarchitektur und -design",
        "description": "This component represents the implementation of all controls for Baustein NET.1.1.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Die meisten Institutionen benötigen heute für ihren Geschäftsbetrieb und für die Erfüllung ihrer Fachaufgaben Datennetze, über die beispielsweise Informationen und Daten ausgetauscht sowie verteilte Anwendungen realisiert werden. An solche Netze werden nicht nur herkömmliche Endgeräte, das Extranet und das Internet angeschlossen. Sie integrieren zunehmend auch mobile Endgeräte und Elemente, die dem Internet of Things (IoT) zugerechnet werden. Darüber hinaus werden über Datennetze vermehrt auch Cloud-Dienste sowie Dienste für Unified Communication and Collaboration (UCC) genutzt. Die Vorteile, die sich dadurch ergeben, sind unbestritten. Aber durch die vielen Endgeräte und Dienste steigen auch die Risiken. Deshalb ist es wichtig, das eigene Netz bereits durch eine sichere Netzarchitektur zu schützen. Dafür muss zum Beispiel geplant werden, wie ein lokales Netz (Local Area Network, LAN) oder ein Wide Area Network (WAN) sicher aufgebaut werden kann. Ebenso müssen nur eingeschränkt vertrauenswürdige externe Netze, z. B. das Internet oder Netze der Kundschaft, geeignet angebunden werden.<BR>Um ein hohes Sicherheitsniveau zu gewährleisten, sind zusätzliche sicherheitsrelevante Aspekte zu berücksichtigen. Beispiele hierfür sind eine sichere Trennung verschiedener Mandanten und Mandantinnen sowie Gerätegruppen auf Netzebene und die Kontrolle ihrer Kommunikation durch eine Firewall. Ein weiteres wichtiges Sicherheitselement, speziell bei Clients, ist außerdem die Netzzugangskontrolle."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es, die Informationssicherheit als integralen Bestandteil der Netzarchitektur und des Netzdesigns zu etablieren."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein NET.1.1 Netzarchitektur und -design ist auf das Gesamtnetz einer Institution inklusive aller Teilnetze anzuwenden.<BR>Der Baustein enthält grundsätzliche Anforderungen, die zu beachten und erfüllen sind, wenn Netze geplant, aufgebaut und betrieben werden. Anforderungen für den sicheren Betrieb der entsprechenden Netzkomponenten, inklusive Sicherheitskomponenten wie z. B. Firewalls, sind nicht Gegenstand des vorliegenden Bausteins. Diese werden in der Bausteingruppe NET.3 Netzkomponenten behandelt.<BR>Der Fokus dieses Bausteins liegt auf kabelgebundenen Netzen und der Datenkommunikation. Jedoch müssen allgemeine Anforderungen an die Architektur und das Design, z. B. dass Zonen gegenüber Netzsegmenten immer eine physische Trennung erfordern, für alle Netztechniken beachtet und erfüllt werden.<BR>Weitergehende spezifische Anforderungen für Netzbereiche wie Wireless LAN (WLAN) oder Speichernetze (Storage Area Networks, SAN) werden in der Bausteinschicht NET.2 Funknetze bzw. im Baustein SYS.1.8 Speicherlösungen behandelt. Darüber hinaus wird auch das Thema Voice over IP (VoIP) sowie die dafür zugrundeliegende Sicherheitsinfrastruktur nicht in diesem Baustein erörtert, sondern in dem entsprechenden Baustein NET.4.2 VoIP behandelt.<BR>Spezifische sicherheitstechnische Anforderungen für Virtual Private Clouds und Hybrid Clouds liegen ebenfalls nicht im Fokus dieses Bausteins.<BR>Das Netzmanagement wird im Rahmen der Zonierung und Segmentierung betrachtet, alle weitergehenden Themen des Netzmanagements werden im Baustein NET.1.2 Netzmanagement behandelt."
          },
          {
            "name": "2.1. Ausfall oder unzureichende Performance von Kommunikationsverbindungen",
            "value": "Sind die Kommunikationsverbindungen unzureichend dimensioniert oder reicht ihre Leistung aufgrund eines technischen Ausfalls oder eines Denial-of-Service-(DoS)-Angriffs nicht mehr aus, können z. B. Clients nur noch eingeschränkt mit Servern kommunizieren. Dadurch erhöhen sich die Zugriffszeiten auf interne und externe Dienste. Diese sind so mitunter nur noch eingeschränkt oder gar nicht mehr nutzbar. Auch sind eventuell institutionsrelevante Informationen nicht mehr verfügbar. In der Folge können essenzielle Geschäftsprozesse oder ganze Produktionsprozesse stillstehen."
          },
          {
            "name": "2.2. Ungenügend abgesicherte Netzzugänge",
            "value": "Ist das interne Netz mit dem Internet verbunden und der Übergang nicht ausreichend geschützt, z. B. weil keine Firewall eingesetzt wird oder sie falsch konfiguriert ist, können Angreifende auf schützenswerte Informationen der Institution zugreifen und diese kopieren oder manipulieren."
          },
          {
            "name": "2.3. Unsachgemäßer Aufbau von Netzen",
            "value": "Wird ein Netz unsachgemäß aufgebaut oder fehlerhaft erweitert, können unsichere Netztopologien entstehen oder Netze unsicher konfiguriert werden. Angreifende können so leichter Sicherheitslücken finden, ins interne Netz der Institution eindringen und dort Informationen stehlen, Daten manipulieren oder auch ganze Produktionssysteme stören. Auch bleiben Angreifende in einem fehlerhaft aufgebauten Netz, das die Sicherheitssysteme nur eingeschränkt überwachen können, länger unerkannt."
          }
        ],
        "control-implementations": [
          {
            "uuid": "f2708635-e007-47bd-98df-758f5f00eb8a",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/netze_profile.json",
            "description": "Implementation for all controls in Baustein NET.1.1",
            "implemented-requirements": [
              {
                "uuid": "f4abf636-fa04-42d3-a42f-2cbb54285476",
                "control-id": "ARCH.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Treatment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.4.A4-m3",
                    "uuid": "9838b329-4dbe-48d2-beeb-8d097259ffa5",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ausgehend von der Entscheidung (A1) und den Anforderungen (A3) SOLLTE ein NAC-Konzept erstellt werden. Dieses SOLLTE mit dem Segmentierungskonzept abgestimmt sein und mindestens folgende Aspekte festlegen: Netzbereiche für NAC, Authentisierung und Autorisierung, Nutzung von Zusatzfunktionen, Konfigurationsvorgaben für alle Komponenten, Aufbau der RADIUS-Infrastruktur und Regelwerk, sowie die Anbindung an externe Sicherheitskomponenten und Verzeichnisdienste. Das Konzept SOLLTE alle technischen und organisatorischen Vorgaben beschreiben, regelmäßig geprüft und aktualisiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein detailliertes Konzeptdokument wird erstellt. Es enthält ein Kapitel 'Authentisierung', das festlegt: 'Für firmeneigene Windows-Clients wird EAP-TLS mit maschinenbasierten Zertifikaten verwendet. Für Drucker wird MAC-Authentisierung verwendet.' Ein weiteres Kapitel 'RADIUS-Infrastruktur' beschreibt den Aufbau eines hochverfügbaren RADIUS-Clusters und definiert die RADIUS-Clients (Switches) mit ihren IP-Adressen und Shared Secrets."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das NAC-Konzept an und gleicht dessen Inhaltsverzeichnis und die Inhalte mit den in der Anforderung genannten Aspekten ab. Es wird geprüft, ob das Konzept mit dem allgemeinen Netzarchitektur- und Segmentierungskonzept konsistent ist und ob ein Prozess zur regelmäßigen Überprüfung des Konzepts existiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A4-m4",
                    "uuid": "4d739ec0-25ef-4628-9d99-d66a12f5608f",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das NAC-Konzept wird um detaillierte Beschreibungen von Ausfallszenarien und den dazugehörigen Fallback-Mechanismen (RADIUS-down-Policies) erweitert. Das Konzept wird formal durch ein Gremium (z.B. IT-Sicherheitsmanagement) geprüft und freigegeben. Es wird ein fester Review-Zyklus (z.B. jährlich) für das Konzept etabliert und dessen Einhaltung nachgewiesen."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Konzept enthält ein Kapitel 'Notfallbetrieb', das festlegt: 'Bei Ausfall beider RADIUS-Server verbleiben bereits authentisierte Clients im Netz. Neu angebundene Clients werden in ein Quarantäne-VLAN mit reiner Internet-Konnektivität verschoben.' Das Dokument wird versioniert und die Freigabe wird im Protokoll des IT-Sicherheits-Boards vermerkt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert das Vorhandensein des Kapitels zu Ausfallszenarien. Es werden die Freigabeprotokolle und die Nachweise über die Einhaltung des Review-Zyklus (z.B. Meeting-Einladungen, aktualisierte Dokumentenversionen) geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A4-m5",
                    "uuid": "023bc7e7-fa6c-4b1d-b9cd-26861ad8e8c8",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das NAC-Konzept wird als ausführbares Modell im Rahmen eines Infrastructure-as-Code (IaC) Ansatzes umgesetzt. Die Konfigurationen für Switches, RADIUS-Server und Firewalls werden in Code-Templates (z.B. Ansible Playbooks, Terraform-Modelle) beschrieben. Die menschlich lesbare Dokumentation wird aus diesen Code-Templates und Kommentaren automatisch generiert. Das Konzept sieht eine dynamische Anpassung von Policies basierend auf externen Threat-Intelligence-Feeds vor."
                      },
                      {
                        "name": "guidance",
                        "value": "Die RADIUS-Client-Definitionen werden in einer Ansible-Variablendatei gepflegt. Ein Playbook liest diese Datei und konfiguriert den RADIUS-Server entsprechend. Ein Skript generiert aus der Variablendatei und Markdown-Templates eine HTML-Dokumentation. Eine Integration mit einem Threat-Feed sorgt dafür, dass bei Bekanntwerden einer kritischen Schwachstelle automatisch eine Policy ausgerollt wird, die betroffene Systeme isoliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das IaC-Repository (z.B. in Git). Es wird geprüft, ob die produktive Konfiguration nachvollziehbar aus den Code-Templates abgeleitet ist und ob ein Prozess zur automatischen Dokumentationsgenerierung existiert. Automatisiert kann die Konsistenz zwischen dem Code-Repository und der laufenden Konfiguration durch Ausführung eines Read-Only-Ansible-Playbooks im Check-Modus verifiziert werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "8b0bd13d-e1aa-40df-93c8-d762f6deeca9",
                "control-id": "ARCH.2.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.4.A9-m3",
                    "uuid": "72022dec-a91d-4516-a2c5-f16a3a2b097c",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die NAC-Lösung SOLLTE ein NAC-Regelwerk definiert werden, das das NAC-Konzept umsetzt. Hierin SOLLTE für jedes Endgerät bzw. für jede Endgerätegruppe festgelegt werden, ob uneingeschränkt auf das Netz zugegriffen werden darf, ob der Zugriff verweigert wird oder ob nur Segmente mit eingeschränkten Kommunikationsmöglichkeiten erreichbar sind. Im Regelwerk SOLLTE auch festgelegt werden, auf welcher Basis die Zugangskontrolle erfolgt, indem für alle Endgeräte die genutzten Authentisierungsmethoden und die Bedingungen für eine erfolgreiche Authentisierung festgelegt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Auf dem RADIUS-Server wird eine Policy-Liste konfiguriert: 1. 'IF (User-Authentication-Type == EAP-TLS) AND (Client-Certificate-Issuer == Corp-PKI) THEN Permit-Access AND Assign-VLAN=10 (Clients)'. 2. 'IF (Calling-Station-Id IN Group:Printers) THEN Permit-Access AND Assign-VLAN=20 (Printers)'. 3. 'DEFAULT Deny-Access'. Diese Regeln setzen das Konzept direkt um."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des Regelwerks (Policy Set) auf dem RADIUS-Server. Dieses wird mit den Vorgaben aus dem NAC-Konzept verglichen, um die korrekte Umsetzung zu verifizieren. Es wird geprüft, ob für jede relevante Endgerätegruppe eine Regel existiert und ob eine 'Default Deny'-Regel am Ende steht."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A9-m4",
                    "uuid": "c121d649-078f-4d5c-9b8d-de44add79337",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Regelwerk ist hochgradig granular und weist Endgeräten spezifische Mikrosemente zu, basierend auf einer Kombination von Attributen wie Benutzergruppe, Gerätetyp und Authentisierungs-Level. Das Regelwerk ist versioniert und jede Änderung daran folgt einem formalen Change-Management-Prozess."
                      },
                      {
                        "name": "guidance",
                        "value": "Die RADIUS-Policy wird erweitert: 'IF (User-Group == 'Finance') AND (Device-Type == 'Corporate-Laptop') AND (Authentication-Method == 'EAP-TLS') THEN Assign-VLAN=11 (Finance-Clients) AND Apply-ACL='ACL-Finance-Standard''. Alle Änderungen am Regelwerk werden in einem Git-Repository versioniert und erfordern einen genehmigten Change Request."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Komplexität und Granularität des Regelwerks. Es wird das Change-Management-System geprüft, um zu verifizieren, dass Änderungen am Regelwerk nachvollziehbar und genehmigt sind. Die Versionshistorie des Regelwerks wird eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A9-m5",
                    "uuid": "6df73c1b-7599-40b0-a7ed-7e980a194877",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das NAC-Regelwerk ist dynamisch und kontextsensitiv. Die Zugriffsrechte werden in Echtzeit basierend auf dem aktuellen Zustand des Endgeräts (z.B. Compliance-Status aus einem MDM/EDR-System), dem Benutzerkontext und der aktuellen Bedrohungslage bestimmt. Das Regelwerk wird vollständig über einen Infrastructure-as-Code-Ansatz verwaltet und Änderungen werden automatisiert getestet und ausgerollt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der RADIUS-Server fragt bei jeder Anmeldung per API den Compliance-Status des Geräts beim EDR-System ab. 'IF (EDR-Status == 'compromised') THEN Assign-Quarantine-VLAN'. Das gesamte Regelwerk ist in einem Git-Repository als Code abgelegt. Eine Änderung im Code löst eine CI/CD-Pipeline aus, die das Regelwerk in einer Testumgebung validiert und bei Erfolg automatisch in die Produktion ausrollt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der API-Anbindungen an externe Systeme (EDR, MDM). Es wird die CI/CD-Pipeline für das Regelwerk-Management geprüft. Ein Testfall wird durchgespielt, bei dem ein Gerät als 'nicht-konform' gemeldet wird, um zu verifizieren, dass die dynamische Regeländerung in Echtzeit greift. Ein automatischer Test könnte die Konfiguration der API-Endpunkte und Authentifizierungsdaten im RADIUS-Server überprüfen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "6f07041d-5b1d-4d80-9e43-bc41a15360d3",
                "control-id": "ARCH.2.2.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.4.A8-m3",
                    "uuid": "a9a9daa3-4e7d-435c-94f0-5dca36ebb9c6",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Im Rollen- und Berechtigungskonzept für den RADIUS-Server SOLLTEN die verschiedenen Gruppen berücksichtigt werden, die wegen NAC auf einen RADIUS-Server zugreifen müssen. Mindestens SOLLTEN die jeweiligen Organisationseinheiten, die Access-Switches (RADIUS-Clients) administrieren, die Zuständigen für Endgerätegruppen, die Identitäten verwalten, und der First-Level-Support berücksichtigt werden, um diesen zu administrieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein Berechtigungskonzept für den RADIUS-Server erstellt. Es definiert folgende Rollen: 'RADIUS-Admin' (Vollzugriff, 2 Personen), 'Switch-Admin' (darf nur RADIUS-Clients anlegen/ändern, Mitglieder des Netzwerk-Teams), 'MAC-Admin' (darf nur MAC-Adressen in bestimmten Gruppen pflegen, z.B. Facility Management für Drucker), 'Helpdesk-User' (reiner Lesezugriff auf Logs zur Fehleranalyse)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das Berechtigungskonzept für den RADIUS-Server an. Es wird geprüft, ob die genannten Gruppen berücksichtigt sind und das Prinzip der geringsten Rechte (Least Privilege) angewendet wird. Eine Stichprobe der Benutzerkonten auf dem RADIUS-Server wird mit dem Konzept abgeglichen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A8-m4",
                    "uuid": "02966b6d-dee3-4cd4-b77f-996b548fecd6",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Rollen- und Berechtigungskonzept ist granular umgesetzt. Teams können nur die Objekte (z.B. RADIUS-Clients, MAC-Adress-Gruppen) verwalten, für die sie zuständig sind. Alle administrativen Aktionen auf dem RADIUS-Server werden zentral protokolliert und die Logs werden regelmäßig, z.B. wöchentlich, auf unautorisierte oder ungewöhnliche Aktivitäten überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Auf dem RADIUS-Server wird eine Regel implementiert, die dem Team 'Produktions-IT' nur die Verwaltung von Switches erlaubt, deren IP-Adressen im Bereich 10.100.0.0/16 liegen. Jede Konfigurationsänderung wird mit Zeitstempel und ausführendem Admin an den zentralen Syslog-Server gesendet. Ein wöchentlicher Bericht über alle Änderungen wird generiert und vom IT-Sicherheitsbeauftragten geprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die granulare Umsetzung der Berechtigungen, indem er sich als Mitglied eines eingeschränkten Teams anmeldet und versucht, Objekte außerhalb seiner Zuständigkeit zu ändern. Es wird geprüft, ob die administrative Protokollierung aktiviert ist und die Review-Protokolle der Log-Analyse werden eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A8-m5",
                    "uuid": "69a25a4a-749a-488c-8bd4-e7e91958e5bf",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der administrative Zugriff auf den RADIUS-Server ist vollständig in eine zentrale Identity- und Access-Management-Lösung (IAM) integriert. Für alle administrativen Rollen wird eine Multi-Faktor-Authentisierung (MFA) erzwungen. Die Zuweisung von Berechtigungen erfolgt dynamisch basierend auf der Rolle des Mitarbeiters im IAM und wird regelmäßig durch automatisierte Access-Reviews (Rezertifizierungskampagnen) überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Anmeldung am RADIUS-Admin-Interface erfolgt über SAML oder OpenID Connect gegen den zentralen Identity Provider der Organisation, der MFA erzwingt. Verlässt ein Mitarbeiter das Netzwerk-Team, wird seine Gruppenzugehörigkeit im IAM-System geändert, was ihm automatisch und sofort den Zugriff auf den RADIUS-Server entzieht. Alle drei Monate wird eine automatische Rezertifizierungskampagne gestartet, bei der die Vorgesetzten die Berechtigungen ihrer Mitarbeiter bestätigen müssen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration der IAM-Anbindung und die MFA-Pflicht. Es werden Berichte aus dem IAM-System über die letzte Access-Review-Kampagne für die RADIUS-Administratoren angefordert. Automatisiert kann die Konfiguration durch eine API-Abfrage an den Identity Provider geprüft werden, um die MFA-Anforderung für die RADIUS-Admin-Anwendung zu verifizieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c2fcac3a-74df-412a-8eb8-4efb51337494",
                "control-id": "ARCH.2.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Treatment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ISGA",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.4.A2-m1",
                    "uuid": "63e859f0-074f-4a23-b828-fb4dacc640fe",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Planung beschränkt sich auf die Auswahl und Beschaffung einer NAC-Software. Wichtige Aspekte wie die Anpassung von Prozessen, die Erstellung eines detaillierten Konzepts oder die Planung der Migration werden ignoriert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Team bekommt den Auftrag, 'NAC einzuführen'. Es wird eine Software gekauft und versucht, diese zu installieren, ohne vorher Anforderungen zu definieren oder einen Migrationspfad zu planen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fragt nach dem Projektplan für die NAC-Einführung und stellt fest, dass dieser nur aus einem Punkt 'Software beschaffen' besteht und keine der in der Anforderung genannten Aspekte enthält."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A2-m2",
                    "uuid": "5491c826-5b5d-418b-87fe-8dd71c037f48",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende technische Planung findet statt, die sich auf die Platzierung der RADIUS-Server und die grundlegende Switch-Konfiguration konzentriert. Es fehlt jedoch eine formale, detaillierte Planung der Betriebs- und Incident-Prozesse sowie ein strukturierter Migrationsplan."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Netzwerkarchitekt erstellt ein Diagramm, wie die NAC-Komponenten verbunden werden. Die Konfiguration wird rudimentär geplant, aber wie der Helpdesk mit NAC-bedingten Anfragen umgehen soll, wird nicht festgelegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer findet technische Planungsdokumente (z.B. Netzwerkpläne), kann aber keine Dokumentation zu den angepassten Betriebsprozessen oder einem detaillierten Migrationsplan (z.B. mit Pilotphasen) finden."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A2-m3",
                    "uuid": "fd8cbc89-a6e8-4a6d-b99d-fbf456afe959",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Einsatz von NAC SOLLTE umfassend und detailliert geplant werden. Die Planung SOLLTE dabei mindestens die Erstellung von Anforderungskatalogen, die Prüfung und Ergänzung des IT-Asset-Managements, die Erstellung eines spezifischen NAC-Konzepts, die Festlegung von Beschaffungs-, Betriebs- und Incident-Prozessen, eine Migrationsplanung sowie das Monitoring und Logging der NAC-Lösung beinhalten."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein formeller Projektplan erstellt, der Arbeitspakete für alle genannten Aspekte enthält. Zum Beispiel gibt es ein Arbeitspaket 'AP3: NAC-Konzept erstellen', das die Erstellung des Konzepts gemäß NET.3.4.A4 zum Ziel hat, und ein 'AP5: Migration planen', das eine phasenweise Einführung (z.B. erst Monitor-Modus, dann ein Pilot-Bereich, dann vollständiger Rollout) festlegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert den Gesamtplan für den NAC-Einsatz an. Es wird geprüft, ob dieser Plan alle im Kontrolltext genannten Aspekte (Anforderungskatalog, Asset-Management, Konzept, Prozesse, Migration, Monitoring) adressiert und ob die Planung ausreichend detailliert ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A2-m4",
                    "uuid": "4b308278-6cef-4c15-b89d-453ea6bfcded",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Planung wird als formales Projekt nach einer anerkannten Projektmanagement-Methode (z.B. PRINCE2, PMBOK) durchgeführt. Der Plan enthält detaillierte Ressourcen- und Zeitpläne, ein explizites Risikomanagement für das Projekt, definierte Erfolgskennzahlen (KPIs) und Test- sowie Rollback-Pläne für die Migration."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Projektplan wird in einem Projektmanagement-Tool (z.B. Jira, MS Project) verwaltet. Er enthält einen expliziten Testplan, der besagt: 'In Phase 2 wird der Rollout mit 50 Pilot-Usern aus der Finanzabteilung getestet. Erfolgskriterium ist, dass weniger als 5% der User ein Ticket beim Helpdesk eröffnen. Ein detaillierter Rollback-Plan beschreibt, wie die Konfiguration bei Scheitern zurückgesetzt wird.'"
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert nicht nur die Existenz des Plans, sondern auch dessen Qualität. Es wird geprüft, ob ein Projekt-Risikoregister existiert, ob klare Meilensteine und KPIs definiert sind und ob formale Test- und Rollback-Prozeduren dokumentiert sind. Automatisiert könnte geprüft werden, ob im PM-Tool alle Planungs-Artefakte als vorhanden markiert und freigegeben sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A2-m5",
                    "uuid": "cfab20bf-4e08-40c9-8a65-9bcb542cf037",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Planung ist vollständig in ein Change-Management-System integriert und nutzt automatisierte Werkzeuge zur Unterstützung. Für die Bestandsaufnahme und Abhängigkeitsanalyse werden automatisierte Discovery-Tools eingesetzt. Der Plan ist ein lebendes Dokument, das während der Einführung kontinuierlich auf Basis von Feedback aus den Implementierungsphasen und Monitoring-Ergebnissen angepasst wird."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Netzwerk-Discovery-Tool scannt das Netz und füllt automatisch das IT-Asset-Management mit den relevanten Geräten. Der Migrationsplan wird im Change-Management-System so modelliert, dass die Konfigurationsänderungen für jeden Bereich als separater Change Request mit automatisierten Pre- und Post-Checks behandelt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den Prozess im Change-Management-System. Es wird geprüft, ob die Planung auf automatisch erfassten Asset-Daten basiert und ob ein formaler Feedback-Loop existiert, der Erkenntnisse aus der Implementierung in die weitere Planung einfließen lässt. Automatisiert kann geprüft werden, ob Change Requests für die NAC-Einführung mit Einträgen aus einem Discovery-Tool verknüpft sind."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "8da08acb-20f8-47d8-a59a-fda2234e8dfb",
                "control-id": "ARCH.5.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Treatment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BES",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.4.A3-m1",
                    "uuid": "c2949872-069a-4573-b1da-c0bf6169e306",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Einige wenige, hochrangige Anforderungen werden informell in einer E-Mail oder einem kurzen Dokument festgehalten. Es gibt keinen strukturierten Katalog und die Anforderungen decken nicht alle relevanten NAC-Komponenten ab."
                      },
                      {
                        "name": "guidance",
                        "value": "In einer E-Mail steht: 'Wir brauchen eine NAC-Lösung, die 802.1X kann und einen RADIUS-Server hat'. Anforderungen an Endgeräte oder die Skalierbarkeit fehlen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bittet um den Anforderungskatalog und erhält eine E-Mail oder ein kurzes Memo. Es wird festgestellt, dass dies kein strukturierter Katalog ist und wesentliche Komponenten (z.B. Endgeräte) nicht berücksichtigt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A3-m2",
                    "uuid": "0cf009b5-494a-4d44-8c3a-4506d0f0900e",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Liste funktionaler Anforderungen wird erstellt, die die Hauptkomponenten adressiert. Diese Liste wird jedoch nicht formal mit allen betroffenen Fachabteilungen und Gremien abgestimmt und nicht regelmäßig aktualisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Netzwerkabteilung erstellt eine Excel-Tabelle mit Anforderungen an Switches und den RADIUS-Server. Diese wird für die Beschaffung genutzt, aber der Helpdesk oder die Client-Management-Abteilung wurden nicht einbezogen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer findet einen Anforderungskatalog, kann aber keine Nachweise (z.B. Protokolle, Unterschriften) für die Abstimmung mit allen relevanten Stakeholdern (insbesondere außerhalb der Netzwerkabteilung) finden."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A3-m3",
                    "uuid": "f9adeece-f5f7-4700-aad3-077ac97627f9",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anforderungen an die NAC-Lösung SOLLTEN in einem Anforderungskatalog erhoben werden. Der Katalog SOLLTE die grundlegenden funktionalen Anforderungen umfassen und alle NAC-Komponenten (z. B. Endgeräte, Access-Switches und RADIUS-Server) adressieren. Er SOLLTE mit allen betroffenen Fachabteilungen, Gremien und Richtlinien abgestimmt, regelmäßig aktualisiert und bei Beschaffungen sowie Tests der Lösung berücksichtigt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein formales Dokument 'Anforderungskatalog NAC' erstellt. Es enthält Kapitel für Endgeräte (z.B. 'Muss EAP-TLS unterstützen'), Switches (z.B. 'Muss RADIUS Change of Authorization unterstützen') und RADIUS-Server (z.B. 'Muss Anbindung an Active Directory via LDAPS unterstützen'). Das Dokument wird nachweislich an die Leiter von IT-Betrieb, Clients und Sicherheit zur Freigabe geschickt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert den Anforderungskatalog an und prüft ihn auf Vollständigkeit bezüglich der Komponenten. Des Weiteren werden Freigabenachweise der Stakeholder und Protokolle von Aktualisierungen eingefordert. Bei einer kürzlichen Beschaffung von Switches wird geprüft, ob die Ausschreibung auf den Katalog Bezug genommen hat."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A3-m4",
                    "uuid": "a948b75a-dd35-4410-97fd-3a0345205694",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Anforderungskatalog wird um nicht-funktionale Anforderungen erweitert. Dazu gehören explizite Vorgaben zur Leistung (z.B. maximale Authentisierungslatenz), Skalierbarkeit (z.B. Anzahl der zu unterstützenden Endpunkte) und Hochverfügbarkeit. Der Katalog ist versioniert und wird formal von allen Stakeholdern unterzeichnet."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Katalog steht unter 'Nicht-funktionale Anforderungen': 'NFR-01: Die RADIUS-Lösung muss 10.000 Endpunkte unterstützen können.' und 'NFR-02: Die durchschnittliche Authentisierungszeit darf 200ms nicht überschreiten.' Das Dokument ist in einem DMS mit Versionskontrolle gespeichert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft, ob der Katalog einen Abschnitt zu nicht-funktionalen Anforderungen enthält und ob diese quantifizierbar sind. Es wird die Versionshistorie des Dokuments und die formalen Freigabenachweise geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A3-m5",
                    "uuid": "70b3b7bf-40ff-474a-b959-5470f844771d",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Anforderungskatalog wird in einem dedizierten Requirements-Engineering-Tool verwaltet. Jede Anforderung ist eindeutig identifizierbar und wird über den gesamten Lebenszyklus verfolgt (Traceability), von der ursprünglichen Anforderung über die Umsetzung im Konzept bis hin zu spezifischen Testfällen. Bei neuen Beschaffungsvorhaben wird automatisch geprüft, ob die Ausschreibung alle relevanten NAC-Anforderungen aus dem Tool abdeckt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Tool wie Jira oder ein spezialisiertes RE-Tool wird verwendet. Die Anforderung 'NAC-REQ-101: Switch muss CoA unterstützen' ist mit dem Testfall 'NAC-TC-205: Teste CoA-Funktion' und dem Konzeptkapitel '3.4.2 Dynamische Autorisierung' verknüpft. Eine neue Switch-Ausschreibung löst einen automatisierten Workflow aus, der die Abdeckung der Anforderungen prüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich einen Bericht aus dem RE-Tool generieren, der die Traceability-Matrix zwischen Anforderungen, Konzept und Testfällen zeigt. Es wird geprüft, ob der Prozess zur Überprüfung von Beschaffungen gegen die Anforderungen automatisiert ist. Ein automatisierter Test könnte eine API-Abfrage an das RE-Tool sein, um die Vollständigkeit der Verknüpfungen zu verifizieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "68b9bf6e-b784-402d-9278-4a46783d7355",
                "control-id": "ASST.2.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "REAL",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.3.4.A5-m3",
                    "uuid": "06c6e596-9bd7-4315-8442-81224989e1dc",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die Endgeräte, die in die NAC-Lösung eingebunden werden, SOLLTE NAC in allen relevanten Prozessen angemessen berücksichtigt werden. Insbesondere SOLLTEN die Prozesse zu Inbetriebnahme, Austausch, Änderungen und Störungen angepasst werden. Für Supplicant-Software, Konfiguration und Identitätsmerkmale (z. B. Zertifikate), die für NAC auf den Endgeräten erforderlich sind, SOLLTE ein Prozess festgelegt werden, um die Endgeräte zentral zu verwalten."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Checkliste für die Inbetriebnahme eines neuen Laptops wird um die Punkte 'Installation des 802.1X-Supplicants' und 'Beantragung und Installation des Gerätezertifikats' erweitert. Das Störungshandbuch für den Helpdesk wird um ein Kapitel 'Fehleranalyse bei NAC-Problemen' ergänzt. Für die Verteilung des Supplicants und von Konfigurationsupdates wird die zentrale Softwareverteilung genutzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Prozessdokumentationen für den Endgeräte-Lifecycle (Inbetriebnahme, Störung etc.) und prüft, ob diese um NAC-spezifische Schritte ergänzt wurden. Es wird geprüft, ob ein dokumentierter Prozess für die zentrale Verwaltung der Supplicant-Software existiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A5-m4",
                    "uuid": "eed767c9-aabe-41cb-b506-5d39445bf379",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die angepassten Prozesse sind in einem IT-Service-Management-Tool (ITSM) abgebildet. Die Workflows im Tool werden so angepasst, dass sie NAC-bezogene Aufgaben (z.B. die automatische Beantragung eines Zertifikats bei der Bestellung eines neuen Geräts) beinhalten und deren Abarbeitung sicherstellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Im ITSM-Tool wird der Workflow 'Neuer Mitarbeiter' so erweitert, dass er automatisch ein Ticket für die PKI-Abteilung zur Erstellung eines Gerätezertifikats generiert, sobald der Laptop im Asset-Management erfasst ist. Das Störungs-Ticket für 'Netzwerkprobleme' erhält eine eigene Kategorie 'NAC-Authentisierung fehlgeschlagen' mit einem verknüpften Lösungs-Workflow."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Prozessmodelle im ITSM-Tool. Es wird geprüft, ob die Workflows für den Endgeräte-Lifecycle explizite NAC-bezogene Aufgaben oder Schritte enthalten. Automatisiert kann ein Bericht aus dem ITSM-Tool erstellt werden, der die Prozessschritte für relevante Service-Requests auflistet."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.3.4.A5-m5",
                    "uuid": "1e514fa1-6db8-41d3-a1a7-490683ee7a23",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das gesamte Endgeräte-Lifecycle-Management ist hochgradig automatisiert (Zero-Touch-Provisioning). Das ITSM-System orchestriert alle NAC-bezogenen Prozessschritte vollautomatisch, von der Bestellung eines Geräts über die automatische Installation und Konfiguration (inkl. Supplicant und Zertifikat) bis hin zur sicheren Außerbetriebnahme mit automatischem Widerruf des Zertifikats."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein neues Gerät wird ausgepackt und mit dem Netz verbunden. Es authentisiert sich in einem Onboarding-VLAN, wird von der Client-Management-Lösung (z.B. Intune, Jamf) erkannt, die automatisch die gesamte Software, die 802.1X-Konfiguration und ein Zertifikat via SCEP ausrollt. Nach erfolgreicher Konfiguration wird das Gerät neu gestartet und authentisiert sich im produktiven Netz. Bei der Außerbetriebnahme wird das Gerät im Asset-Management auf 'entsorgt' gesetzt, was automatisch den Widerruf des Zertifikats in der PKI auslöst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich den automatisierten Onboarding- und Offboarding-Prozess demonstrieren. Es werden die Logs der beteiligten Systeme (Client-Management, PKI, NAC) analysiert, um die vollautomatische Orchestrierung zu verifizieren. Automatisiert kann der Prozess durch eine API-Abfrage an das Client-Management-System geprüft werden, das den Status des Onboarding-Prozesses zurückgibt."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}