{
  "component-definition": {
    "uuid": "ebcb3205-5ac6-43c6-b7b4-26e1bf875222",
    "metadata": {
      "title": "NET.3.4 Network Access Control - Benutzerdefiniert",
      "last-modified": "2025-11-15T16:31:55.284169+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "08a4ecd5-d572-49f5-bf32-7d24fb5bf3d3",
        "type": "interconnection",
        "title": "NET.3.4 Network Access Control",
        "description": "This component represents the implementation of all controls for Baustein NET.3.4.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Eine Netzzugangskontrolle (engl. Network Access Control, NAC) sichert Netzzugänge im Endgerätebereich durch Identitätsprüfung (Authentisierung) und Reglementierung (Autorisierung) ab. Unter Endgeräten werden in diesem Baustein alle IT-Systeme verstanden, die am Access Layer eines Campus-Netzes angeschlossen werden. NAC kann sowohl in kabelgebundenen als auch in drahtlosen Netzen eingesetzt werden. Eine Identität kann zum Beispiel über Konten mit Zertifikaten sicher geprüft werden. Durch die folgende Autorisierung werden den Endgeräten über Autorisierungsregeln passende Netzsegmente und Berechtigungen zugewiesen und damit Zugriffsregeln festgelegt. Ebenso kann Endgeräten der Netzzugang verweigert werden.<BR><BR>Beispielsweise kann ein Drucker über NAC als solcher identifiziert und mit einem validen Zertifikat sicher authentisiert werden. Wurde der Drucker erfolgreich authentisiert, wird er dann mittels NAC-Autorisierung dem für den Drucker vorgesehenen Netzsegment zugewiesen.<BR><BR>NAC-Lösungen nutzen dabei entweder die im Standard IEEE 802.1X (Port Based Network Access Control) beschriebenen Techniken oder die sogenannte MAC-Adress-Authentisierung. Bei IEEE 802.1X erfolgt die Authentisierung über das Extensible Authentication Protocol (EAP) zwischen einer Software auf dem Endgerät, dem sogenannten Supplicant, und dem sogenannten Authenticator, der von einem Access-Switch, WLAN Access Point oder WLAN Controller realisiert wird. Für die Authentisierung wird zusätzlich ein zentraler RADIUS-Server (Remote Authentication Dial-In User Service) genutzt. Der RADIUS-Server wird auch als Authentication Server oder AAA-Server (Authentication, Authorization, Accounting) bezeichnet. Bei der MAC-Adress-Authentisierung wird das Endgerät über seine MAC-Adresse authentisiert.<BR><BR>Eine NAC-Lösung nach IEEE 802.1X umfasst also folgende Komponenten:<BR><BR>• Authentication Server oder RADIUS-Server<BR>• Supplicant auf einem Endgerät<BR>• Authenticator auf einem Access-Switch oder einer WLAN-Komponente (WLAN Access Point oder WLAN Controller)<BR>• zentrale NAC-Identitätsverwaltung, die als integrierte Identitätsverwaltung auf dem Server realisiert sein kann oder auf bestehende Verzeichnisdienste zurückgreift<BR><BR>Eine NAC-Lösung umfasst in diesem Baustein alle zuvor beschriebenen Komponenten. Ist eine einzelne Komponente der NAC-Lösung gemeint, z. B. der RADIUS-Server, dann wird diese Komponente tatsächlich auch als solche benannt. Als zentrale Komponenten einer NAC-Lösung gelten in diesem Baustein der RADIUS-Server und die NAC-Identitätsverwaltung.<BR><BR>Damit eine NAC-Lösung sinnvoll eingesetzt werden kann und die Netzzugänge geeignet abgesichert werden können, müssen viele Punkte festgelegt und die genannten Komponenten der Lösung aufeinander abgestimmt werden. Weiterhin sind NAC-spezifische Prozesse (z. B. Maßnahmen, um Störungen zu beheben) zu definieren und bestehende Prozesse (z. B. Inbetriebnahme von Endgeräten) anzupassen."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es, die Informationssicherheit als integralen Bestandteil bei NAC zu etablieren. Eine NAC-Lösung soll sicherstellen, dass der Zugang zum Netz durch identitätsabhängige Autorisierungsregeln reglementiert wird. Dadurch werden Informationen geschützt, die über Netze verarbeitet, gespeichert und übertragen werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein NET.3.4 Network Access Control ist auf die Elemente einer NAC-Lösung anzuwenden. Dies beinhaltet betroffene Netze, Clients und zentrale Komponenten.<BR><BR>Um ein IT-Grundschutz-Modell für einen konkreten Informationsverbund zu erstellen, muss grundsätzlich die Gesamtheit aller Bausteine betrachtet werden. In der Regel sind mehrere Bausteine auf das Thema bzw. Zielobjekt anzuwenden.<BR><BR>Dieser Baustein behandelt NAC-Lösungen, die auf dem Standard IEEE 802.1X und MAC-Adress-Authentisierung via RADIUS basieren. Dabei liegt der Fokus auf folgende Teilaspekte einer NAC-Lösung:<BR><BR>• allgemeine Festlegungen für NAC sowohl für die zentralen Komponenten als auch für die Endgeräte<BR>• Anforderungen an Authentisierung und Autorisierung<BR>• Festlegungen für Management und Betrieb einer NAC-Lösung<BR><BR>Folgende Inhalte sind ebenfalls von Bedeutung und werden an anderer Stelle behandelt:<BR><BR>• Verzeichnisdienste (siehe APP.2.1 Allgemeiner Verzeichnisdienst)<BR>• Netzarchitektur und -design (siehe NET.1.1 Netzarchitektur und -design)<BR>• WLAN-spezifische Aspekte (siehe NET.2.1 WLAN-Betrieb und NET.2.2 WLAN-Nutzung)<BR>• allgemeine Betriebsaspekte (siehe Bausteine der Schicht OPS Betrieb)<BR><BR>Dieser Baustein behandelt nicht die folgenden Inhalte:<BR><BR>• Port Security sowie allgemeine Aspekte für Netzkomponenten (siehe NET.3.1 Router und Switches)<BR>• proprietäre NAC-Implementierungen, die nicht auf IEEE 802.1X basieren<BR>• die Implementierung eines RADIUS-Servers auf Netzkomponenten (Access-Switch, WLAN Access Point oder WLAN Controller)<BR>• administrative Authentisierung an Netzkomponenten mittels RADIUS<BR>• allgemeine Aspekte für Endgeräte (siehe Bausteine der Schichten SYS.2 Desktop-Systeme, SYS.3 Mobile Devices und SYS.4 Sonstige Systeme)<BR>• allgemeine Aspekte für Server (siehe SYS.1.1 Allgemeiner Server) und Virtualisierung (siehe SYS.1.5 Virtualisierung)<BR>• allgemeine Aspekte für Identitäts- und Berechtigungsmanagement (siehe ORP.4 Identitäts- und Berechtigungsmanagement)"
          },
          {
            "name": "2.1. Unzureichende Planung der NAC-Lösung",
            "value": "Sind nicht alle für NAC relevanten IT-Systeme und Informationen in einem IT-Asset-Management erfasst, kann eine NAC-Lösung nicht ausreichend geplant werden. Endgeräte erhalten dann gegebenenfalls keinen Zugang zum Netz oder einen Zugang zu einem falschen Netzsegment.<BR><BR>Wurden die Anforderungen an die NAC-Lösung nicht ausreichend erfasst und analysiert, kann auch dies zu einer unzureichenden Planung führen. Beispielsweise ist es dann möglich, dass eingesetzte Switches die Anforderungen an die geplante NAC-Lösung nicht erfüllen können oder der geplante RADIUS-Server falsch dimensioniert wird. Eine weitere Folge könnten auch zu harte oder zu weiche Vorgaben für die genutzten Authentisierungs- und Autorisierungsverfahren sein. Dadurch könnte Endgeräten entweder der Zugang zum Netz verweigert oder unsichere Authentisierungsverfahren könnten genutzt werden, obwohl sichere Verfahren möglich wären. Möglicherweise könnten dadurch auch zu weitreichende Kommunikationsberechtigungen erlangt werden."
          },
          {
            "name": "2.2. Unzureichend abgestimmte Integration von Endgeräten in die NAC-Lösung",
            "value": "Fehlende oder unzureichend umgesetzte Orchestrierungswerkzeuge, Sicherheitsrichtlinien, Anforderungskataloge und Ressourcen für die Erfassung aller Endgeräte können dazu führen, dass Endgeräte unzureichend abgestimmt in die NAC-Lösung integriert werden. Dies erschwert es, ein sicheres und betriebsfreundliches Authentisierungsverfahren je Endgerätegruppe umzusetzen und ein entsprechendes Inbetriebnahmeverfahren zu konzipieren. Dadurch könnten die Kommunikationsmöglichkeiten der Endgeräte negativ beeinträchtigt werden. Außerdem kann es sein, dass zu schützende Geräte versehentlich in falschen Netzsegmenten positioniert werden.<BR><BR>Sind die Endgeräte unzureichend standardisiert oder werden NAC-spezifische Endgeräteanforderungen unzureichend unterstützt, kann dies auch dazu führen, dass unsichere Authentisierungsverfahren eingesetzt werden, obwohl eine starke Authentisierung grundsätzlich möglich wäre."
          },
          {
            "name": "2.3. Nutzung unzureichend sicherer Protokolle bei NAC",
            "value": "Werden sichere EAP-Authentisierungsverfahren technisch nicht unterstützt, kann es passieren, dass unsichere Authentisierungsprotokolle wie EAP-MD5 oder MAC-Authentisierung eingesetzt werden müssen. In diesem Fall sind Spoofing-, Replay- oder Man-in-the-Middle-Angriffe leichter möglich und es kann nicht ausgeschlossen werden, dass unberechtigte IT-Systeme in das Netz gelangen. Wird für Endgeräte mit schwachen Authentisierungsprotokollen nicht eingeschränkt, mit welchen Zielen und über welche Protokolle sie kommunizieren dürfen, können auch unberechtigte IT-Systeme, die durch einen der oben genannten Angriffe Zugang erhalten, weitreichende Kommunikationsmöglichkeiten erlangen."
          },
          {
            "name": "2.4. Fehlerhafte Konfiguration der NAC-Lösung",
            "value": "Durch menschliche Fehler, unzureichende Prozesse oder unzureichende Personalkapazitäten und den dadurch bedingten Zeitmangel kann es passieren, dass die NAC-spezifischen Parameter an Endgeräten, Access-Switches oder RADIUS-Servern (NAC-Regelwerk) fehlerhaft konfiguriert werden. Dies kann dazu führen, dass sich die gesamte NAC-Lösung ungewollt falsch verhält, wodurch z. B. Endgeräte benötigte Ressourcen nicht erreichen können oder keinen Netzzugang erhalten.<BR><BR>Werden MAC-Adressen bewusst falsch registriert, können dadurch zu viele Ressourcen freigeschaltet werden, indem falsche Netzsegmente oder andere falsche Autorisierungsparameter zugewiesen werden."
          },
          {
            "name": "2.5. Unzureichende Validierung von Konfigurationsänderungen",
            "value": "Unzureichende Änderungsprozesse, die Konfigurationsänderungen nicht oder nur unzureichend validieren, begünstigen Fehler in der Konfiguration. Hierdurch kann es passieren, dass für Endgeräte zu viel oder zu wenig schützenswerte Ressourcen erreichbar sind oder es ihnen gänzlich verwehrt wird, auf das Netz zuzugreifen. Wird z. B. NAC an Switch-Ports ohne zwingenden Grund abgeschaltet, können gegebenenfalls unberechtigte Endgeräte uneingeschränkt auf das Netz zugreifen. Wird neue Software auf Endgeräten unzureichend validiert, kann dies z. B. zu Interferenzen zwischen Software-Komponenten führen und die Funktionalität des Supplicants beeinflussen."
          },
          {
            "name": "2.6. Unzureichend geschützter Netzzugang",
            "value": "Wird NAC an Switch-Ports temporär oder dauerhaft abgeschaltet, ist der Netzzugang unzureichend geschützt. Dadurch ist es möglich, dass unautorisierte Personen auf das Netz zugreifen können oder unsichere IT-Systeme zu weitgehende Kommunikationsberechtigungen erhalten. In der Folge kann unberechtigt auf Informationen zugegriffen und Informationen können manipuliert oder gelöscht werden. Außerdem kann auf diese Weise Schadsoftware eingeschleust werden.<BR><BR>Wird die Endgeräte-Compliance unzureichend geprüft, kann dies auch zu einem unzureichend geschützten Netzzugang führen, wenn das Endgerät z. B. über unzureichenden Virenschutz verfügt und dadurch Schadsoftware eingeschleust wird."
          },
          {
            "name": "2.7. Ausfall oder unzureichende Erreichbarkeit der zentralen NAC-Komponenten",
            "value": "Ein unzureichendes oder unzureichend umgesetztes NAC-Konzept, gestörte NAC-Komponenten oder ein gestörtes Netz, unzureichende Anforderungsanalyse, mangelnde Prozesse oder Denial-of-Service-Angriffe (DoS-Angriffe) können dazu führen, dass die zentralen NAC-Komponenten ausfallen oder nicht erreichbar sind. Dies hat Auswirkungen auf die Fähigkeit der Endgeräte zu kommunizieren. Zum Beispiel haben, abhängig von der Switch-Konfiguration, Endgeräte bei Ausfall aller RADIUS-Server entweder keinen oder einen uneingeschränkten Netzzugang."
          },
          {
            "name": "2.8. Nachverfolgung von Benutzenden",
            "value": "Ein unzureichendes Administrationskonzept, eine unzureichende Umsetzung der Konzeptionierung, zu lange Speicherzeiten oder eine mangelnde Abstimmung mit Betriebsrat und Datenschutzbeauftragten könnten dazu führen, dass personenrelevante Log-Daten unzureichend geschützt sind. Dadurch könnten Benutzendenprofile erstellt werden, die es ermöglichen, dass Mitarbeitende zeitlich nachverfolgt werden können."
          }
        ],
        "control-implementations": [
          {
            "uuid": "12e9eb8c-86a4-4734-8c95-e56807cba560",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/netze_profile.json",
            "description": "Implementation for all controls in Baustein NET.3.4",
            "implemented-requirements": [
              {
                "uuid": "48e57ecb-de92-4079-b77a-22222b33b8d3",
                "control-id": "ARCH.2.2.12",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a15-m3",
                    "uuid": "c5b891f9-83c2-422e-98e1-8f4fc8cfbf0a",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE überlegt werden, Kabel und Verteiler gegen unbefugte Zugriffe zu sichern. Die Zahl und der Umfang derjenigen Stellen, an denen Einrichtungen der Energieversorgung und Zugangspunkte des Datennetzes für Unbefugte zugänglich sind, SOLLTE möglichst gering gehalten werden. Haupt- und Etagenverteiler werden in abschließbaren Räumen oder Schränken untergebracht."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle zentralen Verteilerschränke für die Strom- und Datenversorgung sind in dedizierten, abschließbaren Technikräumen untergebracht. Die Schlüssel zu diesen Räumen werden kontrolliert an einen begrenzten Personenkreis (IT, Haustechnik) ausgegeben. In öffentlich zugänglichen Bereichen werden Kabel, wenn möglich, unter Putz oder in geschlossenen Kabelkanälen verlegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert bei einer Begehung, dass die Verteilerschränke verschlossen sind und sich in gesicherten Bereichen befinden. Die Regelungen zur Schlüsselverwaltung für die Technikräume werden eingesehen und auf ihre Wirksamkeit bewertet. Es wird geprüft, ob in öffentlichen Bereichen wie Fluren Kabel offen und ungeschützt verlegt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a15-m4",
                    "uuid": "f03ae7bd-cf0a-4992-9717-9ffb898973cf",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zum Verschluss der Räume und Schränke werden diese mit Einbruchmeldeanlagen (EMA) bzw. Öffnungskontakten überwacht. Kabeltrassen, die durch nicht permanent kontrollierte Bereiche führen, werden als geschlossene, abschließbare Stahlblechkanäle ausgeführt. Netzwerkdosen in öffentlichen Bereichen werden bei Nichtbenutzung deaktiviert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Türen der Technikräume und die Verteilerschränke selbst sind mit Magnetkontakten ausgestattet, die an die EMA angeschlossen sind. Ein unberechtigtes Öffnen löst einen Alarm aus. Kabeltrassen im Keller oder in Tiefgaragen sind als manipulationssichere Kanäle ausgeführt. Netzwerk-Ports in Konferenzräumen oder Foyers werden über das Netzwerk-Managementsystem (Port-Security) standardmäßig abgeschaltet und müssen bei Bedarf freigeschaltet werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Konfiguration der EMA und der Öffnungskontakte. Es wird getestet, ob bei einem unautorisierten Öffnungsversuch ein Alarm ausgelöst wird. Die Konfiguration der Port-Security für Dosen in öffentlichen Bereichen wird im Netzwerk-Managementsystem kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a15-m5",
                    "uuid": "371805d5-11a7-4141-a044-27c2da3e1f5e",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die gesamte kritische Verkabelungsinfrastruktur wird durch ein Leitungswegemonitoring permanent überwacht. Spezielle Überwachungskabel oder -fasern, die zusammen mit den Datenkabeln verlegt werden, erkennen Manipulationsversuche wie das Anbohren oder Öffnen der Kabeltrasse und lösen sofort einen Alarm aus. Der Zugang zu allen Verteilern wird über ein elektronisches Zutrittskontrollsystem mit Protokollierung gesteuert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Hauptkabeltrassen zwischen den Rechenzentren und den Etagenverteilern sind als LWL-basierte Alarmanlagen ausgeführt (z.B. LIOS-System). Jede unautorisierte Erschütterung oder Öffnung der Trasse wird mit Standortangabe gemeldet. Der Zugang zu den Verteilerschränken ist nur mit einer persönlichen Transponderkarte möglich, wobei jeder Zutritt protokolliert wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Konzeption des Leitungswegemonitorings und der elektronischen Zutrittskontrolle. Die Wirksamkeit des Systems wird durch einen simulierten Manipulationsversuch an einer Teststrecke verifiziert. Die Zutrittsprotokolle der Verteilerschränke werden auf unautorisierte oder ungewöhnliche Zugriffsversuche analysiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "fe7bcb0a-e266-485c-a2c7-31120d768fc5",
                "control-id": "ARCH.2.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DOCS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a10-m1",
                    "uuid": "44024cb0-9419-4ba7-bdde-26e30eb0a740",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Dokumentation der Verkabelung existiert nicht oder ist stark veraltet und unvollständig. Kabel und Anschlüsse sind nicht oder inkonsistent gekennzeichnet."
                      },
                      {
                        "name": "guidance",
                        "value": "Um herauszufinden, welcher Switch-Port zu welcher Dose im Büro gehört, muss ein Techniker mit einem Kabelsuchgerät die Leitung 'durchklingeln'. Pläne existieren nicht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, dass keine verwertbare Verkabelungsdokumentation vorhanden ist. Eine Sichtprüfung in einem Verteiler zeigt ein chaotisches Bild ohne lesbare oder nachvollziehbare Kennzeichnungen an den Kabeln und Patchfeldern."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a10-m2",
                    "uuid": "b0e58f1c-3261-4123-8125-d4d1e37e341a",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert eine grundlegende Dokumentation, meist in Form von Excel-Listen und einfachen Plänen. Die Kennzeichnung der Anschlüsse ist vorhanden, aber nicht immer systematisch oder aktuell. Änderungen werden nur unregelmäßig nachgepflegt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine Excel-Tabelle, die jedem Port auf dem Patchfeld eine Raumnummer und eine Dosennummer zuordnet. Die Patchkabel zwischen Switch und Patchfeld sind jedoch nicht dokumentiert. Wenn neue Anschlüsse hinzukommen, wird die Liste manchmal, aber nicht immer, aktualisiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die vorhandenen Dokumentationsunterlagen. Bei einer stichprobenartigen Überprüfung im Verteiler wird festgestellt, dass die Kennzeichnungen auf den Patchfeldern mit der Dokumentation übereinstimmen, aber die Dokumentation seit über einem Jahr nicht mehr aktualisiert wurde und neuere Änderungen fehlen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a10-m3",
                    "uuid": "66e3cd2b-c79e-44b1-b6c6-4336619efae5",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Institution SOLLTE sicherstellen, dass sie für ihre Verkabelung sowohl über eine interne (detaillierte) als auch eine externe (neutrale Beschriftung der Anschlüsse) Dokumentation verfügt. Die interne Dokumentation MUSS alle Aufzeichnungen zur Installation und zum Betrieb enthalten. Jede Veränderung im Netz SOLLTE dokumentiert werden, wobei die Stammdokumentation spätestens 4 Wochen nach Abschluss der Arbeiten aktualisiert sein MUSS. Die Dokumentation SOLLTE regelmäßig überprüft und aktualisiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Verkabelung wird in einem CAFM- oder DCIM-System dokumentiert. Dies umfasst Trassenpläne, Kabelpläne und Patchlisten (Ende-zu-Ende-Verbindung). Jedes Kabel und jeder Port ist nach einem einheitlichen Schema eindeutig gekennzeichnet. Änderungen werden zunächst in einer Arbeitsversion dokumentiert und nach Abschluss der Arbeiten innerhalb der 4-Wochen-Frist in die Stammdokumentation überführt. Jährlich wird eine Überprüfung der Dokumentation auf Aktualität durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Verkabelungsdokumentation im Verwaltungssystem. Es wird geprüft, ob der Detaillierungsgrad ausreichend ist und ob ein Prozess zur Aktualisierung definiert und gelebt wird. Anhand von Änderungsanträgen der letzten Monate wird kontrolliert, ob die 4-Wochen-Frist zur Aktualisierung eingehalten wurde. Stichproben vor Ort verifizieren die Korrektheit der Kennzeichnung und der Dokumentation."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a10-m4",
                    "uuid": "01ef127c-a6ff-4344-b4e8-5915b1838a78",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Verkabelungsdokumentation ist mit anderen Verwaltungssystemen, wie dem Netzwerk-Monitoring oder dem Asset-Management, verknüpft. Die Konsistenz der Daten zwischen den Systemen wird regelmäßig automatisiert geprüft. Die Kennzeichnung der Kabel erfolgt mit langlebigen, maschinenlesbaren Etiketten (z.B. Barcodes)."
                      },
                      {
                        "name": "guidance",
                        "value": "Im DCIM-System ist nicht nur das Kabel dokumentiert, sondern auch, welcher Switch (aus dem Asset Management) an welchem Port angeschlossen ist und welche MAC-Adresse (aus dem Netzwerk-Monitoring) an der zugehörigen Dose aktiv ist. Ein nächtlicher Abgleich prüft diese Verknüpfungen und meldet Inkonsistenzen. Alle Kabel und Ports sind mit Barcodes versehen, die bei Änderungen mit einem mobilen Gerät gescannt werden können."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Schnittstellen zwischen den Managementsystemen und die Konfiguration der Konsistenzprüfungen. Die Protokolle dieser Prüfungen werden eingesehen. Bei einer Begehung wird die Funktionalität der Barcode-gestützten Erfassung stichprobenartig getestet."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a10-m5",
                    "uuid": "8c67363f-5c7d-44b0-8066-a4fbe789ef24",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Dokumentation und Kennzeichnung ist vollständig automatisiert durch ein Automated Infrastructure Management (AIM) System. Jede physische Änderung an der Verkabelung wird von Sensoren am Patchfeld in Echtzeit erfasst und die Dokumentation wird sofort und ohne manuelles Eingreifen aktualisiert. Unautorisierte Änderungen lösen einen Alarm aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Intelligente Patchfelder mit RFID- oder Kontakt-Sensoren registrieren das Stecken und Ziehen jedes Patchkabels. Das AIM-System aktualisiert die Verbindungsdatenbank in Echtzeit. Wenn ein Techniker ein Kabel umsteckt, ohne einen entsprechenden Arbeitsauftrag im System zu haben, wird eine Sicherheitsmeldung an den IT-Betrieb generiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Konfiguration des AIM-Systems, insbesondere die Alarmierungsregeln. Die Revisionssicherheit der automatisch erstellten Protokolle wird bewertet. Durch eine Test-Änderung (Ziehen und Stecken eines Kabels) wird die Echtzeit-Aktualisierung der Dokumentation und die Auslösung eines Alarms live verifiziert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "020d62e2-b3ee-4ad2-aa90-c1de059234e6",
                "control-id": "ARCH.2.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Audit",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "PERF",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a12-m1",
                    "uuid": "203e59a7-7203-45df-8373-f11c75d9487a",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Prüfungen elektrischer Anlagen und Betriebsmittel finden nicht oder nur auf explizite Anforderung nach einem Vorfall statt. Es gibt keinen präventiven Prüfprozess."
                      },
                      {
                        "name": "guidance",
                        "value": "Elektrische Geräte werden so lange betrieben, bis sie ausfallen. Eine regelmäßige Prüfung nach DGUV Vorschrift 3 findet nicht statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer findet keine Prüfprotokolle oder Prüfplaketten an elektrischen Anlagen und Geräten. Interviews bestätigen, dass kein regelmäßiger Prüfzyklus etabliert ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a12-m2",
                    "uuid": "8169d046-b261-43b1-a789-2781160ae2f9",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ortsveränderliche elektrische Betriebsmittel (z.B. Monitore, Netzteile) werden in unregelmäßigen Abständen geprüft. Ortsfeste Anlagen wie die Elektroverteilung werden selten oder gar nicht geprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle paar Jahre wird ein Dienstleister beauftragt, die elektrischen Geräte an den Arbeitsplätzen zu prüfen. Die fest installierte Elektroinfrastruktur in den Wänden und Verteilern wird dabei jedoch ausgelassen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer findet Prüfplaketten an vielen Endgeräten, kann aber keine Prüfprotokolle für die Elektroverteilungen oder festen Installationen einsehen. Die Prüffristen für die Endgeräte sind teilweise überschritten."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a12-m3",
                    "uuid": "b3673498-1501-42b2-b749-1aa225457600",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle elektrischen Anlagen und Betriebsmittel SOLLTEN gemäß DGUV Vorschrift 3 regelmäßig geprüft werden. Alle Unregelmäßigkeiten MÜSSEN unverzüglich dokumentiert und den zuständigen Organisationseinheiten gemeldet werden. Diese MÜSSEN die Mängel so zeitnah beheben, dass eine Gefährdung von Personen ausgeschlossen werden kann. Die Verfügbarkeit MUSS hierbei im erforderlichen Maß sichergestellt sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist eine verantwortliche Elektrofachkraft benannt. Es existiert ein Prüfkonzept mit definierten Prüffristen für alle ortsfesten und ortsveränderlichen elektrischen Anlagen und Betriebsmittel. Die Prüfungen werden von qualifiziertem Personal durchgeführt und in einem Prüfprotokoll dokumentiert. Festgestellte Mängel werden in einer Mängelliste erfasst und deren Behebung wird nachverfolgt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Prüfkonzept und die Gefährdungsbeurteilung, auf der die Prüffristen basieren. Es werden die Prüfprotokolle der letzten Prüfzyklen eingesehen. Stichprobenartig wird die Existenz von Prüfplaketten kontrolliert. Die Mängelliste wird auf offene, kritische Punkte und auf die Geschwindigkeit der Mängelbehebung geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a12-m4",
                    "uuid": "df54e411-52e9-4df4-b1c1-464fee40ac52",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Verwaltung der Prüfungen, Fristen und Protokolle erfolgt über eine spezialisierte Softwarelösung. Diese erinnert automatisch an anstehende Prüfungen und eskaliert überfällige Prüfungen. Mängel werden direkt in der Software erfasst und als Workflows an die zuständigen Techniker zur Behebung weitergeleitet."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Software für die Instandhaltungsplanung (z.B. CAFM-Modul) verwaltet alle elektrischen Assets und deren Prüffristen. Der Prüfer erfasst die Prüfergebnisse vor Ort auf einem mobilen Gerät direkt in der Software und druckt die Prüfplakette aus. Ein festgestellter Mangel erzeugt automatisch ein Ticket im Ticketsystem der Haustechnik."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den in der Software abgebildeten Prüf- und Mängelbehebungsprozess. Es wird die Konfiguration der Erinnerungs- und Eskalationsmechanismen geprüft. Anhand der Systemdaten wird die Einhaltung der Prüffristen und die durchschnittliche Zeit zur Mängelbehebung (Mean Time to Repair) ausgewertet."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a12-m5",
                    "uuid": "7c930393-85cf-4174-8bed-8b4aa511c877",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Kritische elektrische Anlagen werden permanent durch Monitoringsysteme überwacht (z.B. Isolationsüberwachung, Differenzstrom-Monitoring). Dies ermöglicht die Erkennung von schleichenden Fehlern, lange bevor sie zu einer Gefahr oder einem Ausfall führen, und reduziert die Notwendigkeit von Prüfungen, die eine Abschaltung erfordern."
                      },
                      {
                        "name": "guidance",
                        "value": "In den Stromverteilungen des Rechenzentrums sind Differenzstrom-Überwachungsgeräte (RCMs) installiert, die permanent Fehlerströme messen. Eine langsame Verschlechterung der Isolation eines Geräts wird so frühzeitig erkannt. Die Messwerte werden zentral protokolliert und analysiert. Bei Überschreitung von Vorwarn-Schwellenwerten wird die Instandhaltung informiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Konzeption und die Installationsdokumentation des permanenten Monitoringsystems. Die Konfiguration der Schwellenwerte und Alarme wird geprüft. Anhand der aufgezeichneten Messdaten wird die Wirksamkeit des Systems zur Früherkennung von Fehlern bewertet."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "115817d3-ff35-42bb-8ccf-b74a3e46bc00",
                "control-id": "ARCH.8.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a17-m3",
                    "uuid": "60163ae4-0484-4f00-9128-6ccf9ae83157",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE geprüft werden, ob eine redundante primäre IT-Verkabelung geschaffen werden soll, die über unabhängige Trassen geführt wird. Ebenso SOLLTE geprüft werden, ob Anschlüsse an IT- oder TK-Provider redundant ausgelegt werden sollen. Eine grundlegende Planung hierzu wird erstellt, aber nicht zwingend umgesetzt oder geprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Für die Anbindung des zentralen Serverraums an die Etagenverteiler wird eine redundante Verkabelung geplant. Dies bedeutet, dass zwei getrennte LWL- oder Kupfer-Backbone-Kabel verlegt werden. Idealerweise werden diese Kabel durch unterschiedliche Steigschächte geführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Planungsunterlagen der Verkabelungsinfrastruktur. Es wird geprüft, ob für kritische Verbindungen (Backbone, Provider-Anbindung) eine redundante Auslegung geplant wurde. Eine Begehung verifiziert, ob die geplanten redundanten Wege physisch getrennt voneinander umgesetzt wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a17-m4",
                    "uuid": "780bcd70-b08e-4df6-9e2b-3fb23478b62a",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine redundante Verkabelung für die Primär- und Sekundärebene ist implementiert und wird über physisch getrennte Wege (z.B. unterschiedliche Brandabschnitte) geführt. Wird eine redundante Verkabelung verwendet, SOLLTE deren Funktionsfähigkeit regelmäßig geprüft werden. Dies gilt auch für redundante Provider-Anschlüsse."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Backbone-Verkabelung ist vollständig redundant ausgelegt und die beiden Kabelwege verlaufen in unterschiedlichen Gebäudeflügeln und Brandabschnitten. Die redundanten Verbindungen sind an separate Switches angeschlossen, die Protokolle wie Spanning Tree oder Link Aggregation (LACP) nutzen, um die Redundanz zu verwalten. Jährlich wird ein Failover-Test durchgeführt, bei dem eine der primären Verbindungen physisch getrennt wird, um die automatische Umschaltung auf den redundanten Weg zu testen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die physisch getrennte und brandabschnittsübergreifende Verlegung der redundanten Kabelwege anhand von Plänen und einer Begehung. Die Konfiguration der Netzwerkprotokolle zur Verwaltung der Redundanz wird auf den Switches geprüft. Die Protokolle der jährlichen Failover-Tests werden eingesehen und auf eine erfolgreiche, unterbrechungsfreie Umschaltung geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a17-m5",
                    "uuid": "0ce27ff6-9c28-45ed-b62c-5cd7d593468f",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Redundanz erstreckt sich auf alle Verkabelungsebenen, einschließlich der Tertiärverkabelung zu hochkritischen Arbeitsplätzen oder Systemen. Die Funktionsfähigkeit beider Wege wird permanent durch das Netzwerk-Managementsystem überwacht. Bei Ausfall eines Weges erfolgt eine automatische Umschaltung und Alarmierung. Die Provider-Anbindungen sind nicht nur redundant, sondern stammen von unterschiedlichen Carriern und werden über diverse Gebäudeeinführungen realisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Arbeitsplatz des Administrators der zentralen Sicherheitssysteme ist mit zwei Netzwerkdosen ausgestattet, die an zwei verschiedene Etagenverteiler angeschlossen sind, welche wiederum über die redundanten Backbones versorgt werden. Das Netzwerk-Managementsystem überwacht die Latenz und Verfügbarkeit beider Wege kontinuierlich. Die Internetanbindung erfolgt über einen Glasfaseranschluss der Telekom (Gebäudeeinführung Nord) und einen Richtfunk-Link von Vodafone (Dacheinführung Süd)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert das durchgängige Redundanzkonzept von der Provider-Anbindung bis zum Endgerät für definierte, hochkritische Systeme. Die Konfiguration des permanenten Monitorings der redundanten Wege wird geprüft. Die Verträge und technischen Unterlagen der unterschiedlichen Carrier werden eingesehen, um die Diversität der Anbindungen zu bestätigen. Die Reaktion des Systems auf einen simulierten Ausfall eines der Wege wird live getestet."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "79e86c14-7762-4119-9540-21d8cc536b3f",
                "control-id": "ARCH.9.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BES",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a5-m1",
                    "uuid": "4911b506-e5d5-4ef0-ae26-074a9238c665",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Planung der Verkabelung orientiert sich ausschließlich am unmittelbaren, aktuellen Bedarf. Zukünftige Entwicklungen oder Schutzziele wie Vertraulichkeit werden nicht berücksichtigt."
                      },
                      {
                        "name": "guidance",
                        "value": "Für ein neues Büro für 10 Mitarbeiter werden genau 10 Netzwerkanschlüsse bestellt. Die Möglichkeit, dass in Zukunft mehr Anschlüsse oder höhere Bandbreiten benötigt werden, wird ignoriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch Interviews fest, dass keine strategische Planung für die Verkabelung existiert. Projektdokumentationen bestätigen, dass die Dimensionierung immer nur den Status quo abbildet."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a5-m2",
                    "uuid": "79ef5e33-459d-41c3-96c7-9ac6e7c6f1bb",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei der Planung der Verkabelung wird eine pauschale Reserve für zukünftiges Wachstum eingeplant. Die grundlegenden Schutzziele Verfügbarkeit und Integrität werden implizit durch die Verwendung von Standardkomponenten adressiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Regel lautet: 'Immer doppelt so viele Anschlüsse installieren, wie aktuell benötigt'. Eine detailliertere Analyse, z.B. über zukünftige Technologien (WLAN, VoIP) oder Sicherheitsanforderungen, findet nicht statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz und Anwendung der pauschalen Planungsregeln. Es wird bewertet, ob dieser Ansatz ausreicht, um den mittelfristigen Bedarf zu decken, und ob grundlegende Schutzziele zumindest implizit erfüllt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a5-m3",
                    "uuid": "18c8ae6b-c6dd-4aa9-b613-2bc03ff9e7fd",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Grundsätzlich SOLLTEN die Anforderungen analysiert werden, die Einfluss auf eine zukunftssichere, bedarfsgerechte und wirtschaftliche Ausführung der Verkabelung haben. In dieser Anforderungsanalyse SOLLTE zunächst die kurzfristige Nutzung abgeschätzt werden. Darauf aufbauend SOLLTE die längerfristige Entwicklung abgeschätzt werden. Darüber hinaus MÜSSEN die Schutzziele der Verfügbarkeit, Integrität und Vertraulichkeit bei der Anforderungsanalyse mit betrachtet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor größeren Verkabelungsprojekten wird ein Workshop mit Vertretern der IT, der Haustechnik und der Nutzer durchgeführt. In einem Dokument werden der aktuelle Bedarf, der prognostizierte Bedarf für die nächsten 5-7 Jahre (z.B. durch neue Technologien wie Wi-Fi 7, IoT) und die spezifischen Schutzanforderungen (z.B. Notwendigkeit von geschirmten Kabeln in Entwicklungsabteilungen) festgehalten. Dieses Dokument ist die Grundlage für die Detailplanung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Dokumentation der Anforderungsanalyse. Es wird geprüft, ob sowohl kurz- als auch längerfristige Aspekte berücksichtigt wurden und ob die Schutzziele Verfügbarkeit, Integrität und Vertraulichkeit adressiert wurden. Die Nachvollziehbarkeit der Bedarfsprognose wird bewertet."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a5-m4",
                    "uuid": "86163ebf-0d19-48fb-8362-2cea5caf1804",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anforderungsanalyse ist ein formalisierter und wiederkehrender Prozess. Sie basiert auf strukturierten Kapazitätsprognosen und einer detaillierten Risikoanalyse. Die Ergebnisse fließen nicht nur in die technische Planung, sondern auch in die Budgetplanung und die strategische IT-Ausrichtung ein."
                      },
                      {
                        "name": "guidance",
                        "value": "Jährlich wird im Rahmen der IT-Strategieplanung auch die Verkabelungsinfrastruktur bewertet. Trendanalysen (z.B. Zunahme des Datenverkehrs, Anzahl der Endgeräte) werden genutzt, um den zukünftigen Bedarf zu modellieren. Eine Risikoanalyse bewertet Bedrohungen wie physische Manipulation oder Abhören und leitet daraus konkrete Anforderungen an die Verkabelung ab (z.B. Notwendigkeit von Leitungswegesicherung)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass der Prozess der Anforderungsanalyse fest in den IT-Planungsprozessen verankert ist. Die Qualität der Kapazitätsprognosen und der Risikoanalyse wird bewertet. Es wird geprüft, ob die Ergebnisse der Analyse nachweislich in konkrete Planungs- und Budgetentscheidungen eingeflossen sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a5-m5",
                    "uuid": "d5deffe8-0d2c-4062-9dae-c2270d1122dd",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anforderungsanalyse wird durch ein automatisiertes System unterstützt, das kontinuierlich Nutzungs- und Leistungsdaten der Netzwerkinfrastruktur sammelt. Mithilfe von KI-gestützten Prognosemodellen wird der zukünftige Bedarf dynamisch vorhergesagt und es werden proaktiv Vorschläge für notwendige Erweiterungen oder Modernisierungen generiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Netzwerk-Monitoring-System, gekoppelt mit einem DCIM-Tool, erfasst permanent Port-Belegung, Bandbreitennutzung und das Wachstum der angebundenen Geräte. Das System meldet, wenn die Kapazität einer Trasse voraussichtlich in 6 Monaten 80% erreichen wird und erstellt automatisch ein Ticket mit einem Vorschlag für eine Erweiterung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration und die Wirksamkeit des automatisierten Analyse- und Prognosesystems. Die Genauigkeit der Vorhersagemodelle wird anhand historischer Daten überprüft. Es wird kontrolliert, ob die vom System generierten Vorschläge zeitnah und angemessen bearbeitet werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "6e6ac295-52ba-480a-bf07-dc45cfd8695c",
                "control-id": "GEB.7.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a16-m3",
                    "uuid": "3526d8df-b308-4a06-89f5-3c3c7fa5c7a0",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Elektrotechnische Anschlüsse und Verteiler SOLLTEN in Schranksystemen aufgestellt oder in diese eingebaut werden. Bei der Dimensionierung der Schranksysteme SOLLTE das erwartete Wachstum für den geplanten Einsatzzeitraum berücksichtigt werden, indem ausreichend Reserveplatz für zukünftige Erweiterungen eingeplant wird."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle aktiven und passiven Netzwerkkomponenten sowie die zugehörigen Stromverteilungen sind in standardisierten 19-Zoll-Schranksystemen (Racks) untergebracht. Bei der Planung eines neuen Verteilers wird ein Schranksystem gewählt, das mindestens 30% ungenutzte Höheneinheiten (HE) als Reserve für zukünftiges Wachstum bietet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert bei einer Begehung, dass alle Verteilerkomponenten ordnungsgemäß in Schranksystemen verbaut sind. Anhand der Dokumentation und durch Sichtprüfung wird der verfügbare Reserveplatz in den Schränken bewertet. Es wird geprüft, ob es eine Planungsrichtlinie für die Dimensionierung von neuen Schränken gibt."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a16-m4",
                    "uuid": "96c34f72-0775-4aa3-84ee-2296515fcacb",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Schranksysteme werden systematisch geplant und verwaltet. Dies umfasst ein durchdachtes Konzept für Klimatisierung, Stromversorgung (z.B. redundante PDUs) und Kabelmanagement innerhalb des Schranks. Die Belegung der Schränke wird in einem DCIM- oder CAFM-System detailliert dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Für die Schranksysteme im Rechenzentrum gibt es ein standardisiertes Aufbaukonzept. Dies definiert z.B. die Position der Switches, Patchfelder und Kabelführungen, um eine optimale Luftzirkulation (Kalt-/Warmgang) und eine saubere Verkabelung sicherzustellen. Jede Höheneinheit und die genaue Position jeder Komponente ist in einem DCIM-Tool erfasst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Konzept für den Aufbau der Schranksysteme und die Dokumentation im Verwaltungstool. Es wird verglichen, ob der reale Aufbau der Schränke dem definierten Standard und der Dokumentation entspricht. Insbesondere wird auf ordentliches Kabelmanagement und die korrekte Umsetzung des Klimatisierungskonzepts geachtet."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a16-m5",
                    "uuid": "da980239-c331-49b6-9530-a947fd2437e6",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Schranksysteme sind mit einer umfassenden Sensorik zur Überwachung von Temperatur, Luftfeuchtigkeit, Zutritt und Stromverbrauch ausgestattet. Die Daten werden zentral erfasst und analysiert, um den Betrieb zu optimieren und Risiken proaktiv zu managen. Die Planung und Verwaltung des Rack-Space erfolgt vollautomatisch über ein DCIM-System."
                      },
                      {
                        "name": "guidance",
                        "value": "Jedes Rack ist mit Sensoren ausgestattet, die die Temperatur an mehreren Punkten (vorne/hinten, oben/unten) sowie die Türöffnungen überwachen. Die intelligenten PDUs melden den Stromverbrauch pro Ausgang. Das DCIM-System nutzt diese Daten, um eine 'Heatmap' des Rechenzentrums zu erstellen und warnt, wenn in einem Rack die Temperaturgrenzwerte überschritten werden oder die Stromversorgung überlastet zu werden droht. Bei der Planung einer neuen Serverinstallation schlägt das System den optimalen Einbauort basierend auf verfügbarem Platz, Strom und Kühlkapazität vor."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der Rack-Sensorik und des DCIM-Systems. Es wird geprüft, ob die erfassten Live-Daten korrekt sind und die definierten Alarme funktionieren. Die Protokolle und Auswertungen (z.B. Energieeffizienz, Temperaturverlauf) werden auf ihre Aussagekraft und auf die Reaktion auf vergangene Ereignisse hin bewertet."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}