{
  "component-definition": {
    "uuid": "117576b0-e756-4300-9069-e73c63f2d581",
    "metadata": {
      "title": "APP.1.1 Office-Anwendungen - Benutzerdefiniert",
      "last-modified": "2025-11-22T12:46:06.189315+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "c182f354-3f44-4f15-b9d9-932bb7fa057e",
        "type": "software",
        "title": "APP.1.1 Office-Anwendungen",
        "description": "This component represents the implementation of all controls for Baustein APP.1.1.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Die Gruppe der Office-Produkte umfasst in erster Linie Anwendungen, die dazu dienen, Dokumente zu erstellen, zu bearbeiten oder zu betrachten. Dazu zählen unter anderem die freie Anwendung LibreOffice und die proprietäre Anwendung Microsoft Office, die in vielen Institutionen genutzt werden. Office-Produkte gehören für die meisten Institutionen zur notwendigen IT-Grundausstattung. Sie umfassen unter anderem Programme zur Textverarbeitung, Tabellenkalkulation und Erstellung von Präsentationen sowie Zeichenprogramme und einfache Datenbanksysteme."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel des vorliegenden Bausteins ist der Schutz der Informationen, die durch Office-Produkte verarbeitet und genutzt werden. Dazu werden spezielle Anforderungen an die Funktionsweise der Komponenten von Office-Produkten gestellt. Der Baustein zeigt Anforderungen auf, die zur Absicherung von Office-Produkten vor spezifischen Gefährdungen erfüllt werden sollten."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein APP.1.1 Office-Produkte ist auf jedes Office-Produkt anzuwenden, das lokal installiert ist und mit dem Dokumente betrachtet, bearbeitet oder erstellt werden, außer E-Mail-Anwendungen.<BR>Dieser Baustein betrachtet den Einsatz von Office-Produkten aus Sicht des IT-Betriebs und gibt Hinweise für Benutzende, wie Office-Produkte eingesetzt werden sollten. Ergänzend zu den Anforderungen dieses Bausteins müssen die Anforderungen des übergeordneten Bausteins APP.6 Allgemeine Software umgesetzt werden. E-Mail-Anwendungen werden in diesem Baustein nicht berücksichtigt, die entsprechenden Anforderungen sind im Baustein APP.5.3 Allgemeiner E-Mail-Client und -Server zu finden. Bei der Verwendung von integrierten Datenbanksystemen wie Base in LibreOffice oder Access in Microsoft Office muss der Baustein APP.4.3 Relationale Datenbanken berücksichtigt werden. Ebenfalls im vorliegenden Baustein ausgenommen sind reine Cloud-Office-Anwendungen wie Google Workspace mit den Anwendungen Docs oder Sheets. Anforderungen an Cloud-Anwendungen sind in dem Baustein OPS.2.2 Cloud-Nutzung festgelegt."
          },
          {
            "name": "2.1. Fehlende Anpassung der Office-Produkte an den Bedarf der Institution",
            "value": "Werden Office-Produkte beschafft oder angepasst, ohne die Anforderungen an diese Software zu beachten, kann der Betrieb erheblich gestört werden. Es kann beispielsweise sein, dass vorhandene Vorlagen und Dokumente nicht kompatibel sind oder mit Anwendungen von Geschäftspartnern und -partnerinnen nicht interoperabel ist. Sollten Office-Produkte nicht an den Bedarf der Institution angepasst werden, kann dies zu Performance-Verlusten, Störungen oder Fehlern innerhalb der Geschäftsprozesse führen."
          },
          {
            "name": "2.2. Schädliche Inhalte in Office-Dokumenten",
            "value": "Office-Dokumente können in der Regel verschiedene sogenannte „Aktive Inhalte“ oder Makros enthalten, die mitunter für komplexe Automatisierungen genutzt werden. Aktive Inhalte können aber auch Schadcode enthalten, der ausgeführt wird, wenn das Dokument geöffnet wird. Solche Schadfunktionen in Office-Dokumenten können die betroffenen Dokumente selbst, aber auch andere Daten und Programme manipulieren. Darüber hinaus kann sich der Schadcode weiter ausbreiten. Alle betroffenen Geschäftsprozesse der Institution können in ihren Funktionen gestört oder blockiert werden. Im schlimmsten Fall bleibt die Manipulation unerkannt und führt zu Sicherheitslücken und zur Verarbeitung von verfälschten Informationen."
          },
          {
            "name": "2.3. Integritätsverlust von Office-Dokumenten",
            "value": "Die Integrität von Office-Dokumenten kann verfälscht werden, wenn unbeabsichtigt oder vorsätzlich die Inhalte geändert werden. Durch einen unbedachten Umgang mit Office-Produkten oder durch Unkenntnis der Benutzenden im Umgang mit Office-Dokumenten können Dokumente unerkannt geändert werden. Dies ist dann besonders problematisch, wenn es sich um produktiv eingesetzte Dokumente handelt. Wird mit Dokumenten weitergearbeitet, die unerkannt verfälscht wurden, werden möglicherweise falsche Entscheidungen getroffen oder es kann ein Image-Schaden für die Institution entstehen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "bdb8e98b-4f96-420c-a7b2-bceab7430223",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Kompendien/Grundschutz%2B%2B-Kompendium/profile/office-anwendungen_profile.json",
            "description": "Implementation for all controls in Baustein APP.1.1",
            "implemented-requirements": [
              {
                "uuid": "7b6b6465-876e-4fba-af64-4921a88abc62",
                "control-id": "DEV.4.11",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "TEST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.1.1.A6-m2",
                    "uuid": "82c8b0de-bbbd-4993-a1f4-66ef194f79a1",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Vor dem Rollout einer neuen Office-Version wird diese auf einem Testsystem installiert. Die Grundfunktionen werden informell von einem IT-Mitarbeiter geprüft, um offensichtliche Probleme zu erkennen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein einzelner PC in der IT-Abteilung wird als Testsystem verwendet. Der Test ist nicht formalisiert und konzentriert sich auf die grundlegende Funktionalität wie das Öffnen, Bearbeiten und Speichern von Dokumenten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fragt nach dem Vorgehen bei der Einführung neuer Office-Versionen. Es wird geprüft, ob überhaupt Tests stattfinden, auch wenn diese nicht dokumentiert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A6-m3",
                    "uuid": "338e76b2-fd09-44b9-b2c1-276d1788a5c3",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Neue Versionen von Office-Produkten SOLLTEN vor dem produktiven Einsatz auf Kompatibilität mit etablierten Arbeitsmitteln wie Makros, Dokumentenvorlagen oder Formularen der Institution geprüft werden. Es SOLLTE sichergestellt sein, dass wichtige Arbeitsmittel auch mit der neuen Software-Version einwandfrei funktionieren. Bei entdeckten Inkompatibilitäten SOLLTEN geeignete Lösungen für die betroffenen Arbeitsmittel gefunden werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es existiert eine dedizierte Testumgebung, die das Produktivsystem abbildet. Ein formaler Testplan wird erstellt, der alle kritischen, institutionsspezifischen Arbeitsmittel (z.B. Vorlagen mit Makros für die Rechnungsstellung, Excel-Tools für das Controlling) umfasst. Key-User aus den Fachabteilungen werden in die Tests einbezogen. Die Testergebnisse und gefundene Lösungen werden dokumentiert, bevor die Freigabe für den Rollout erfolgt (siehe OPS.1.1.6)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert den Testplan, die Testdokumentation und den Freigabebericht für die letzte eingeführte Office-Version an. Es wird geprüft, ob die kritischen Arbeitsmittel identifiziert wurden und ob Key-User in den Testprozess involviert waren."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A6-m4",
                    "uuid": "42f68890-7d5f-40ba-ad55-a2cb29690086",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Testprozess für neue Office-Versionen ist weitgehend automatisiert. Testfälle für kritische Makros und Dokumentvorlagen werden in einem Testautomatisierungs-Framework verwaltet und nach jeder neuen Version automatisch ausgeführt. Die Tests umfassen auch Performance-Vergleiche und die Überprüfung der Kompatibilität mit wichtigen Drittanbieter-Anwendungen und -Add-ins."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Tool wie Ranorex, Selenium (für webbasierte Teile) oder ein spezialisiertes Testwerkzeug wird eingesetzt, um die Interaktion mit Office-Anwendungen zu skripten. Die Testumgebung wird automatisiert (Infrastructure as Code) aufgesetzt, um konsistente Ergebnisse zu gewährleisten. Die Testergebnisse werden in einem zentralen Testmanagementsystem gesammelt und ausgewertet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Konfiguration des Testautomatisierungs-Frameworks und die Testskripte. Die automatisiert erstellten Testberichte werden analysiert. Es wird geprüft, wie die Testfälle für neue oder geänderte Arbeitsmittel aktualisiert werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "d41209df-4ee2-4789-912a-2f9678e69d69",
                "control-id": "DEV.5.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.1.1.A16-m3",
                    "uuid": "4db561a5-e9a2-4078-aa66-72733496f5dc",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für wichtige Dokumente werden bei der Finalisierung manuell Hashwerte (Prüfsummen) gebildet und zusammen mit dem Dokument an einem sicheren Ort gespeichert. Bei Bedarf kann der Hashwert neu berechnet und verglichen werden, um Veränderungen festzustellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine dokumentierte Anweisung für Key-User, wie sie mit einem bereitgestellten Tool (z.B. 7-Zip, PowerShell-Befehl Get-FileHash) einen SHA-256-Hashwert einer Datei erstellen und diesen in einer separaten Textdatei im selben Verzeichnis ablegen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Anweisung zur Hashwertbildung. Es wird stichprobenartig bei wichtigen Dokumenten geprüft, ob eine entsprechende Hashwert-Datei existiert und ob der darin enthaltene Wert mit dem aktuell berechneten Hashwert des Dokuments übereinstimmt."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A16-m4",
                    "uuid": "7f3100c1-bc5b-46e7-83fc-f744f66a68f1",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wenn Daten mit erhöhtem Schutzbedarf gespeichert oder übertragen werden, SOLLTEN geeignete Verfahren zur Integritätsprüfung eingesetzt werden. Falls Daten vor Manipulation geschützt werden sollen, SOLLTEN darüber hinaus kryptografische Verfahren eingesetzt werden. Für Dokumente, deren Integrität geschäftskritisch ist, werden durchgängig digitale Signaturen verwendet, da diese sowohl Integrität als auch Authentizität des Unterzeichners gewährleisten."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein formaler Prozess zur Nutzung digitaler Signaturen ist etabliert. Benutzern, die kritische Dokumente (z.B. Finanzberichte, Verträge) bearbeiten, werden Signaturzertifikate aus einer vertrauenswürdigen PKI bereitgestellt. Es ist per Richtlinie festgelegt, dass diese Dokumente vor der Verteilung oder Archivierung digital signiert werden müssen. Office-Anwendungen werden so konfiguriert, dass sie Signaturen automatisch validieren und den Benutzer bei ungültigen Signaturen warnen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Richtlinie zur Anwendung digitaler Signaturen. Der Prozess zur Zertifikatsausgabe wird geprüft. Stichprobenartig werden kritische Dokumente daraufhin überprüft, ob sie eine gültige digitale Signatur von einem autorisierten Unterzeichner tragen. Es wird getestet, wie die Anwendung auf ein Dokument mit gebrochener Signatur reagiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A16-m5",
                    "uuid": "fc052daa-b24f-4516-a89b-d1247a0e6dc6",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Dokumente auf zentralen Dateiservern werden durch ein File Integrity Monitoring (FIM) System kontinuierlich überwacht. Das FIM-System erstellt eine kryptografische Baseline aller Dateien und alarmiert in Echtzeit bei jeder unautorisierten oder unerwarteten Änderung."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine FIM-Lösung (z.B. Tripwire, Wazuh) ist auf den Fileservern installiert und konfiguriert. Sie überwacht die als kritisch definierten Verzeichnisse. Die generierten Alarme werden an ein zentrales SIEM zur Korrelation und Analyse weitergeleitet. Der Prozess zur Behandlung von FIM-Alarmen ist definiert und personell besetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Konfiguration der FIM-Lösung und die Definition der zu überwachenden Bereiche. Die SIEM-Regeln und die im SIEM auflaufenden Alarme werden geprüft. Der Prozess zur Alarmbearbeitung wird bewertet. Testweise wird eine Datei im überwachten Bereich verändert, um die Alarmierungskette zu verifizieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "b8a1627f-1eb3-4d26-bf1f-60208ad8224e",
                "control-id": "KONF.11.8",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.1.1.A12-m2",
                    "uuid": "6e9e66fb-39b3-48bc-baec-fdf732f4c58b",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert eine schriftliche Weisung in der IT-Benutzerordnung, die die Speicherung von dienstlichen Dokumenten in privaten oder nicht genehmigten öffentlichen Cloud-Speichern verbietet. Die integrierten Cloud-Funktionen in den Office-Anwendungen sind jedoch nicht technisch deaktiviert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die IT-Benutzerordnung, die jeder Mitarbeiter bei Eintritt erhält, enthält einen entsprechenden Passus. Es wird auf die Einhaltung durch die Benutzer vertraut."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die IT-Benutzerordnung auf das Vorhandensein der entsprechenden Klausel. In Interviews wird das Bewusstsein der Benutzer für diese Regelung stichprobenartig geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A12-m3",
                    "uuid": "55290bc7-02df-4e78-92f9-471b755704f1",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die in Office-Produkten integrierten Funktionen für Cloud-Speicher SOLLTEN grundsätzlich deaktiviert werden. Alle Cloud-Laufwerke SOLLTEN deaktiviert werden. Alle Dokumente SOLLTEN von den Benutzenden auf zentral verwalteten Fileservern gespeichert werden. Für die Freigabe von Dokumenten für Dritte SOLLTEN spezialisierte, genehmigte Anwendungen eingesetzt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Mittels Gruppenrichtlinien (GPO) werden die Optionen zum Hinzufügen von Cloud-Speicherorten (z.B. OneDrive, Dropbox) in den 'Speichern unter'-Dialogen der Office-Anwendungen ausgeblendet und deaktiviert. Den Benutzern wird eine genehmigte, unternehmenseigene Filesharing-Lösung als Alternative zur Verfügung gestellt, die eine Rechteverwaltung und Protokollierung bietet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration der relevanten Gruppenrichtlinien. Auf einem Test-Client wird geprüft, ob die Cloud-Speicher-Optionen in Office-Anwendungen tatsächlich deaktiviert sind. Die Konfiguration und die Sicherheitsmerkmale der bereitgestellten Filesharing-Lösung werden bewertet."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A12-m4",
                    "uuid": "8ed84e43-4e7a-4ce6-bc26-74953516cc6e",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zur Deaktivierung der Funktionen in Office wird der Netzwerkverkehr zu bekannten, nicht genehmigten Cloud-Speicherdiensten am zentralen Internet-Gateway (Firewall, Proxy) blockiert. Die Nutzung der genehmigten Filesharing-Lösung wird protokolliert und auf anomale Aktivitäten überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Firewall oder der Web-Proxy wird mit Kategorisierungs-Feeds aktualisiert, um die URLs und IP-Adressen von Cloud-Speicherdiensten zu identifizieren und den Zugriff darauf zu sperren. Ein Cloud Access Security Broker (CASB) im Discovery-Modus wird eingesetzt, um Schatten-IT-Nutzung zu erkennen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Regelwerke der Firewall oder des Proxys. Es wird versucht, von einem Client-PC aus auf einen blockierten Cloud-Dienst zuzugreifen. Die Berichte des CASB-Systems werden eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A12-m5",
                    "uuid": "a114bc3d-0c4c-4bda-aa5c-3f686a5842aa",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine umfassende Data Loss Prevention (DLP) Lösung ist im Einsatz. Sie inspiziert ausgehenden Datenverkehr und blockiert aktiv den Upload von Dokumenten mit sensiblen Inhalten (basierend auf Klassifizierung oder Inhaltsanalyse) zu allen nicht genehmigten Zielen, einschließlich privater Cloud-Speicher, Webmail und anderer Kanäle."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Host-basierte und/oder Netzwerk-basierte DLP-Lösung wird implementiert. Dokumente werden automatisch oder manuell klassifiziert (z.B. 'Intern', 'Vertraulich'). DLP-Richtlinien verhindern den Transfer von als 'Vertraulich' klassifizierten Dokumenten an externe Ziele, mit Ausnahme der genehmigten Filesharing-Lösung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration der DLP-Richtlinien und der Klassifizierungsschemata. Es wird testweise versucht, ein als sensibel klassifiziertes Dokument auf einen externen Cloud-Speicher hochzuladen. Die DLP-Incidents und -Berichte werden analysiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "06378469-874f-44f2-97c8-b8e93a786fb2",
                "control-id": "KONF.11.9",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.1.1.A15-m3",
                    "uuid": "016d89c4-47cb-4d15-a455-7e2a130f0dfa",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für Daten mit erhöhtem Schutzbedarf wird die integrierte Dokumentenverschlüsselung von Office-Produkten mit einem Passwortschutz verwendet. Die Benutzer sind angewiesen, starke Passwörter zu verwenden und diese sicher zu verwalten."
                      },
                      {
                        "name": "guidance",
                        "value": "In einer Richtlinie ist festgelegt, welche Arten von Informationen verschlüsselt werden müssen. Benutzer werden geschult, wie sie die passwortbasierte Verschlüsselung in Word, Excel etc. aktivieren. Es gibt Vorgaben zur Komplexität der zu verwendenden Passwörter."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Richtlinie zur Datenklassifizierung und Verschlüsselung. Es wird geprüft, ob Benutzer geschult sind. Stichprobenartig werden als schutzbedürftig klassifizierte Dateien daraufhin überprüft, ob sie verschlüsselt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A15-m4",
                    "uuid": "bb32eee5-a6e8-4a1f-9624-62022b9779ac",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Daten mit erhöhtem Schutzbedarf SOLLTEN nur verschlüsselt gespeichert bzw. übertragen werden. Bevor ein integriertes Verschlüsselungsverfahren genutzt wird, SOLLTE dessen Stärke geprüft werden. Zusätzlich SOLLTE ein Verfahren für digitale Signaturen für Makros und Dokumente eingesetzt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Stärke der Office-Standardverschlüsselung (z.B. AES-256) wird als ausreichend bewertet und ihre Verwendung per GPO erzwungen. Für die Verschlüsselung und den Schutz von Dokumenten wird eine Rechtemanagementlösung (z.B. Azure Information Protection/Microsoft Purview Information Protection) eingesetzt. Diese ermöglicht eine zertifikatsbasierte Verschlüsselung und eine feingranulare Rechtevergabe (z.B. 'darf nicht drucken'), die auch nach dem Versand des Dokuments bestehen bleibt. Digitale Signaturen werden für definierte Dokumententypen (z.B. Verträge, Freigaben) verpflichtend eingesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die GPO-Einstellungen zur Verschlüsselungsstärke. Die Konfiguration der Rechtemanagementlösung, insbesondere die Schutzvorlagen und Berechtigungen, wird geprüft. Es wird ein als schutzbedürftig klassifiziertes Dokument untersucht, um zu sehen, ob die Schutzmaßnahmen (Verschlüsselung, Rechte) korrekt angewendet werden. Die Richtlinien und die Umsetzung für digitale Signaturen werden geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A15-m5",
                    "uuid": "ac862059-eebd-4afd-84c2-1dcfcc740182",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Verschlüsselung von Dokumenten mit erhöhtem Schutzbedarf erfolgt automatisch, basierend auf einer Inhaltsanalyse und/oder einer manuellen Klassifizierung durch den Benutzer. Die Schlüsselverwaltung ist zentralisiert und es existiert ein sicherer Prozess zur Wiederherstellung von Daten bei Schlüsselverlust."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Rechtemanagementlösung ist so konfiguriert, dass sie Dokumente automatisch verschlüsselt, wenn bestimmte Schlüsselwörter (z.B. 'Sozialversicherungsnummer', 'Projekt-Codename') oder Muster erkannt werden. Die Klassifizierung und der damit verbundene Schutz werden bei der Erstellung des Dokuments erzwungen. Ein Key-Escrow-Mechanismus ist implementiert und der Wiederherstellungsprozess ist dokumentiert und wird regelmäßig getestet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration der automatischen Klassifizierungs- und Verschlüsselungsregeln. Es wird ein Testdokument mit sensiblen Testdaten erstellt, um zu verifizieren, dass der Schutz automatisch angewendet wird. Der Prozess und die Protokolle der Schlüsselwiederherstellung werden eingesehen und bewertet."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "3d10afa0-ac8a-466a-84e2-97f6a08703a3",
                "control-id": "KONF.12.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.1.1.A3-m1",
                    "uuid": "5cf79f3e-d128-4e25-890e-49814c5d88ad",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Auf den Endgeräten ist eine Antiviren-Software mit Basiskonfiguration installiert, die eingehende Dateien scannt. Es gibt keine spezifischen Policies oder Anweisungen zum Umgang mit externen Dokumenten."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Antiviren-Lösung wird als Teil des Standard-Client-Images ausgerollt. Es werden die Standard-Signaturen des Herstellers verwendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert auf einer Stichprobe von Clients die Installation und den Betrieb der Antiviren-Software. Es wird geprüft, ob die Virensignaturen aktuell sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A3-m2",
                    "uuid": "8a71d9c4-a8ff-4a57-ac70-5506bb0a4c37",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle aus externen Quellen bezogenen Dokumente müssen vor dem Öffnen auf Schadsoftware überprüft werden. Dies wird durch eine zentral verwaltete Antiviren-Lösung auf den Endgeräten und am E-Mail-Gateway sichergestellt. Die Benutzer sind angewiesen, keine verdächtigen Anhänge zu öffnen."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine zentral verwaltete Endpoint-Protection-Lösung ist auf allen Clients installiert. Zusätzlich scannt ein E-Mail-Security-Gateway alle eingehenden Anhänge. Benutzer werden im Rahmen der Security Awareness auf die Gefahren hingewiesen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Konfiguration des E-Mail-Gateways und der Endpoint-Protection-Lösung. Es wird geprüft, ob alle Systeme an die zentrale Verwaltung angebunden sind. Die Inhalte der Awareness-Kampagne werden geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A3-m3",
                    "uuid": "b36e5412-f2f0-4192-a2d1-5e2b3ed269c1",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle aus externen Quellen bezogenen Dokumente MÜSSEN auf Schadsoftware überprüft werden, bevor sie geöffnet werden. Alle als problematisch eingestuften und alle innerhalb der Institution nicht benötigten Dateiformate MÜSSEN verboten werden. Falls möglich, SOLLTEN sie blockiert werden. Durch technische Maßnahmen SOLLTE erzwungen werden, dass Dokumente aus externen Quellen geprüft werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Am E-Mail-Gateway und/oder Proxy wird eine strikte Dateitypenfilterung basierend auf einer Whitelist der erlaubten Formate durchgesetzt. Nicht benötigte oder als risikoreich bekannte Dateitypen (z.B. .js, .pif, .scr) werden blockiert. Zusätzlich zum Virenscan wird eine Sandboxing-Analyse für unbekannte oder potenziell gefährliche Dateitypen (z.B. Office-Dokumente, PDFs) durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration des Dateitypenfilters am Gateway/Proxy. Die Liste der blockierten/erlaubten Dateitypen wird auf Angemessenheit geprüft. Es wird die Konfiguration der Sandbox-Analyse kontrolliert. Testweise wird versucht, blockierte Dateitypen zu empfangen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A3-m4",
                    "uuid": "df4ba0a2-48eb-4646-a991-7ea52a744c1e",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Dokumente aus externen Quellen werden zwingend in einem geschützten Modus (Protected View) geöffnet. Dieser Modus verhindert die Bearbeitung und die Ausführung aktiver Inhalte. Benutzer können den Schutz nur nach einer bewussten Aktion aufheben. Diese Einstellung ist zentral konfiguriert und kann von Benutzern nicht dauerhaft deaktiviert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Einstellung 'Geschützte Ansicht für Dateien aus dem Internet aktivieren' wird per GPO für alle Office-Anwendungen erzwungen. Die Aufhebung des Schutzes wird protokolliert und an ein SIEM-System zur Auswertung weitergeleitet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die entsprechende GPO-Einstellung. Es wird getestet, ob ein Dokument aus dem Internet (z.B. E-Mail-Anhang) in der geschützten Ansicht geöffnet wird. Die Protokolleinträge im SIEM werden bei einer Test-Aufhebung des Schutzes überprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A3-m5",
                    "uuid": "8b77b20b-ed1e-488e-ab27-2cdafd133051",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Dokumente aus externen Quellen werden vor der Zustellung an den Benutzer durch eine Content Disarm and Reconstruction (CDR) Lösung proaktiv von allen potenziell gefährlichen Inhalten (Makros, Skripte, externe Links) befreit. Alternativ oder ergänzend werden solche Dokumente ausschließlich in einer vollständig isolierten Container- oder Virtualisierungsumgebung (z.B. Microsoft Defender Application Guard) geöffnet, die keinen Zugriff auf das Host-System oder das interne Netzwerk hat."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine CDR-Lösung ist dem E-Mail-Gateway und dem Web-Proxy vorgeschaltet. Für Fälle, in denen Originaldokumente benötigt werden, ist Application Guard for Office per GPO für alle Benutzer aktiviert. Benutzer sind geschult, Dokumente aus unsicheren Quellen ausschließlich in dieser Umgebung zu verwenden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration der CDR-Lösung, indem er Test-Dokumente mit aktiven Inhalten von extern sendet und prüft, ob diese entfernt werden. Es wird die GPO-Konfiguration für Application Guard geprüft und auf einem Test-Client verifiziert, dass ein externes Dokument im Container geöffnet wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "480195d1-bbe0-4004-9270-b79f3780306c",
                "control-id": "KONF.12.1.11",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.1.1.A2-m1",
                    "uuid": "44848a68-bdc6-4cd5-8f54-f8239a6ca30b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert eine Anweisung oder Empfehlung, dass Benutzer die automatische Ausführung von Aktiven Inhalten (Makros) in Office-Anwendungen deaktivieren sollen. Diese Einstellung wird jedoch nicht zentral verwaltet oder überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Umsetzung erfolgt durch eine einmalige Kommunikation, z.B. per E-Mail, an die Mitarbeitenden. Es werden keine technischen Maßnahmen zur Durchsetzung ergriffen. Die Verantwortung liegt vollständig beim einzelnen Benutzer."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer befragt eine Stichprobe von Benutzern, ob sie über die Anweisung zur Deaktivierung von Aktiven Inhalten informiert sind und ob sie diese umgesetzt haben. Es wird geprüft, ob eine entsprechende schriftliche Kommunikation existiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A2-m2",
                    "uuid": "09fa6300-8a5f-4181-8feb-301b7b7f3e45",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die automatische Ausführung von Aktiven Inhalten ist standardmäßig auf allen Systemen in den Office-Anwendungen deaktiviert. Benutzer werden bei Dokumenten mit Makros benachrichtigt und müssen die Ausführung manuell pro Dokument bestätigen. Es gibt keine Unterscheidung nach Herkunft der Quellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Standardeinstellung 'Alle Makros mit Benachrichtigung deaktivieren' wird während der Client-Installation gesetzt. Es gibt jedoch noch keine zentrale, zwingende Richtlinie (z.B. GPO), die Benutzer daran hindert, diese Einstellung zu ändern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert auf einer Stichprobe von Client-Systemen, dass die Standardkonfiguration zur Deaktivierung von Makros gesetzt ist. Es wird geprüft, ob Benutzer beim Öffnen eines Dokuments mit Makros eine Sicherheitswarnung erhalten. Ein automatisierter Check kann die entsprechenden Registry-Keys auf den Clients auslesen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A2-m3",
                    "uuid": "d3924162-1995-4517-bbad-4892390c7b43",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Funktion, dass eingebettete Aktive Inhalte automatisch ausgeführt werden, MUSS zentral und für Benutzer nicht veränderbar deaktiviert werden. Falls es notwendig ist, Aktive Inhalte auszuführen, MUSS darauf geachtet werden, dass diese nur ausgeführt werden, wenn sie aus definierten vertrauenswürdigen Quellen stammen. Alle Benutzenden MÜSSEN hinsichtlich der Risiken und der sicheren Vorgehensweise eingewiesen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Deaktivierung wird mittels Gruppenrichtlinien (GPO) für die gesamte Organisation durchgesetzt. 'Vertrauenswürdige Quellen' werden über 'Vertrauenswürdige Speicherorte' (z.B. bestimmte Netzlaufwerke) oder durch digital signierte Makros von vertrauenswürdigen Herausgebern definiert. Die Einweisung der Benutzer erfolgt im Rahmen von regelmäßigen Security-Awareness-Schulungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration der relevanten Gruppenrichtlinien. Es wird geprüft, ob die Liste der vertrauenswürdigen Speicherorte und Herausgeber dokumentiert und restriktiv gehandhabt wird. Die Schulungsunterlagen und Teilnehmerlisten werden eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A2-m4",
                    "uuid": "7f956056-2e8b-4bd5-b404-383388049bc6",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zur zentralen Deaktivierung werden alle Versuche, Aktive Inhalte aus nicht vertrauenswürdigen Quellen auszuführen, protokolliert und an ein zentrales Monitoring-System gemeldet. Die Liste der vertrauenswürdigen Quellen wird regelmäßig überprüft und auf das notwendige Minimum reduziert."
                      },
                      {
                        "name": "guidance",
                        "value": "Windows Defender for Endpoint oder eine vergleichbare EDR-Lösung wird genutzt, um die Ausführung von Makros zu überwachen. SIEM-Regeln werden konfiguriert, um bei verdächtigen Aktivitäten (z.B. häufige Ausführungsversuche durch einen Benutzer) Alarme auszulösen. Der Prozess zur Überprüfung der vertrauenswürdigen Quellen ist dokumentiert und wird quartalsweise durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die SIEM-Konfiguration und die generierten Alarme. Es werden die Protokolle der Überprüfungen der vertrauenswürdigen Quellen eingesehen. Es wird stichprobenartig geprüft, ob Protokolleinträge bei entsprechenden Test-Aktionen erzeugt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A2-m5",
                    "uuid": "21757017-46f3-428e-aff1-19a7804ba487",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Ausführung von jeglichen Aktiven Inhalten ist grundsätzlich blockiert, es sei denn, sie sind explizit durch eine Kombination aus digitaler Signatur von einem internen, streng verwalteten Zertifikatsdienst UND der Herkunft aus einem vertrauenswürdigen Speicherort genehmigt. Alle anderen Dokumente, insbesondere von externen Quellen, werden automatisch in einer Sandbox-Umgebung (Content Disarm and Reconstruction, CDR) bereinigt, bevor sie dem Benutzer zugestellt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine strikte Application Whitelisting-Policy für Makros umgesetzt. Eine CDR-Lösung, die in den E-Mail-Gateway integriert ist, entfernt proaktiv alle aktiven Inhalte aus eingehenden Dokumenten und rekonstruiert die Dateien. Nur absolut notwendige Ausnahmen werden über einen formalen Genehmigungsprozess mit Mehr-Augen-Prinzip gewährt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration der CDR-Lösung und der Application Whitelisting-Regeln. Es wird der Prozess zur Signierung und Genehmigung von Makros geprüft. Testweise werden Dokumente mit unsignierten Makros von extern gesendet, um die Wirksamkeit der Bereinigung zu überprüfen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "2162fbf9-cb95-4d98-85c3-d0c576fdf4e8",
                "control-id": "KONF.6.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.1.1.A13-m3",
                    "uuid": "e8c58ac3-771d-4025-9a76-6e609dde5f65",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Daten aus potenziell unsicheren Quellen SOLLTEN automatisch in einem geschützten Modus geöffnet werden, der NICHT durch die Benutzenden deaktivierbar sein SOLLTE. Eine Liste vertrauenswürdiger Quellen SOLLTE definiert werden. Im geschützten Modus SOLLTEN Daten NICHT unmittelbar bearbeitbar sein und Aktive Inhalte NICHT automatisch ausgeführt werden. Wenn Dokumente nur betrachtet werden sollen, SOLLTEN dedizierte Viewer-Anwendungen verwendet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die 'Geschützte Ansicht' (Protected View) in Microsoft Office wird per GPO für Dateien aus dem Internet, aus E-Mail-Anhängen und aus unsicheren Speicherorten erzwungen. Die Option, diese Funktion dauerhaft zu deaktivieren, wird für Benutzer gesperrt. Eine Liste vertrauenswürdiger Speicherorte (z.B. interne Netzlaufwerke) wird gepflegt, für die die geschützte Ansicht nicht gilt. Für die reine Betrachtung von z.B. PDF-Dateien wird ein Reader ohne Bearbeitungsfunktionen als Standardanwendung festgelegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die GPO-Einstellungen für die geschützte Ansicht. Es wird getestet, ob ein Dokument aus einem E-Mail-Anhang im geschützten Modus geöffnet wird und ob Bearbeitungsfunktionen blockiert sind. Die Liste der vertrauenswürdigen Speicherorte wird auf Angemessenheit geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A13-m4",
                    "uuid": "c03d6ca6-f662-4da3-b0c7-33c36f9ee7e9",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zum geschützten Modus werden alle Dokumente von externen Quellen vor der Zustellung an den Benutzer durch eine Sandboxing-Lösung analysiert. Die Ergebnisse der Analyse werden dem Benutzer angezeigt, um eine fundierte Entscheidung über die Freigabe des Dokuments zu ermöglichen."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Advanced Threat Protection (ATP) oder Sandboxing-Lösung (z.B. Microsoft Defender for Office 365, Check Point SandBlast) ist dem E-Mail-Gateway und Web-Proxy vorgeschaltet. Sie führt Dokumente in einer isolierten Umgebung aus, um bösartiges Verhalten zu erkennen. Verdächtige Dokumente werden blockiert oder dem Benutzer mit einer deutlichen Warnung zugestellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Konfiguration der Sandboxing-Lösung. Es werden die Berichte und Protokolle analysiert. Testweise wird ein (harmloses, aber unbekanntes) Dokument von extern gesendet, um den Analyseprozess zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.1.1.A13-m5",
                    "uuid": "2660aab2-a157-4baa-8e3f-128c34240fa6",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Dokumente aus nicht vertrauenswürdigen Quellen werden ausschließlich in einer hardware-isolierten Container-Umgebung geöffnet. Diese Umgebung ist vom Host-Betriebssystem und dem internen Netzwerk vollständig getrennt und wird nach jeder Sitzung zurückgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Microsoft Defender Application Guard ist per GPO für Office, Edge und PDF-Reader für alle Benutzer zwingend aktiviert. Richtlinien verhindern das Kopieren von Daten aus dem Container in das Host-System, es sei denn, dies wird explizit durch eine Policy erlaubt. Benutzer sind geschult, diese Funktion für alle externen Dokumente zu nutzen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die GPO-Konfiguration für Application Guard auf den Clients. Es wird getestet, ob das Öffnen eines E-Mail-Anhangs die Application Guard-Umgebung startet. Die Richtlinien zur Datenübertragung zwischen Container und Host werden überprüft."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}