{
  "component-definition": {
    "uuid": "dc76e308-7763-4714-a898-74b7aaa4effd",
    "metadata": {
      "title": "INF.13 Technisches Gebäudemanagement - Benutzerdefiniert",
      "last-modified": "2025-11-15T16:31:56.115286+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "5bb3317b-c396-4e94-9982-1bcd214f7350",
        "type": "physical",
        "title": "INF.13 Technisches Gebäudemanagement",
        "description": "This component represents the implementation of all controls for Baustein INF.13.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Das Gebäudemanagement (GM), auch Facility Management genannt, ist für alle Leistungen zuständig, die in der Planungs- und Nutzungsphase von Gebäuden, Gebäudekomplexen, Liegenschaften oder Liegenschaftsportfolios anfallen. Im Folgenden wird hierfür einheitlich der Begriff Gebäude genutzt. Ausnahmen hiervon werden explizit genannt. Das GM ist standort- sowie objektbezogen ausgerichtet. Es lässt sich in technisches, infrastrukturelles und kaufmännisches GM untergliedern. Das technische Gebäudemanagement (TGM) umfasst gemäß DIN 32736 alle Leistungen, die die technische Funktion und Verfügbarkeit eines Gebäudes erhalten. Zu diesen Leistungen gehören unter anderem: Betreiben, Dokumentieren, Energie- und Umweltmanagement, Informationsmanagement, Modernisieren, Sanieren, Umbauen, Verfolgen der technischen Gewährleistung. Wesentliche technische Funktionen eines Gebäudes werden durch die technische Gebäudeausrüstung (TGA) bereitgestellt, die durch das TGM betrieben, gepflegt und weiterentwickelt wird. Die TGA umfasst dabei gemäß VDI 4700 Blatt 1 alle im Bauwerk eingebauten und damit verbundenen technischen und nutzungsspezifischen Einrichtungen sowie technische Einrichtungen in Außenanlagen und Ausstattungen (siehe auch Kapitel 4.1 Genutzte TGM-spezifische Fachbegriffe). Falls die TGA automatisiert und gewerkübergreifend betrieben werden soll, wird zusätzliche technische Infrastruktur zur Gebäudeautomation (GA, engl. Building Automation and Control Systems, BACS) eingesetzt. Somit ist die GA ein zentrales Werkzeug des TGM. Ein Gebäude kann durch TGM auch ohne GA betrieben werden, GA hingegen ist immer durch TGM flankiert. Gewisse Komponenten der GA sind dabei auch der TGA zuzurechnen, wie z. B. echtzeitfähige Industrial Ethernet Switches. Während die TGA in der Vergangenheit meist unabhängig von der IT und der Prozessleit- und Automatisierungstechnik (Operational Technology, OT) betrieben wurde, werden heute zunehmend Netzübergänge zu diesen Bereichen etabliert. Hinzu kommt, dass Teile der TGA rund um die Uhr genutzt werden. Daher müssen Änderungen oft parallel zur produktiven Nutzung durchgeführt werden. Auch im TGM müssen die Grundwerte der Informationssicherheit berücksichtigt werden, denn der Verlust von Verfügbarkeit, Vertraulichkeit und Integrität von Systemen kann im TGM weitreichende Auswirkungen bis hin zur Gefährdung von Leib und Leben nach sich ziehen."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es, die Informationssicherheit als integralen Bestandteil bei Planung, Umsetzung und Betrieb im Rahmen des TGM zu etablieren."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein INF.13 Technisches Gebäudemanagement ist auf das TGM einer Institution anzuwenden, sobald Gebäude mit TGA geplant, gebaut oder betrieben werden. Dieser Baustein behandelt das TGM, somit die Aufgaben und Prozesse, die für die Planung und den Betrieb der TGA-Anlagen (siehe Kapitel 4.1 Genutzte TGM-spezifische Fachbegriffe) eines Gebäudes erforderlich sind. Die technische Infrastruktur für den automatisierten Betrieb von Gebäuden wird im Baustein INF.14 Gebäudeautomation behandelt. Letzterer muss zusätzlich zum Baustein INF.13 Technisches Gebäudemanagement angewendet werden, wenn die zu betreibende TGA automatisiert und anlagenübergreifend gesteuert wird. In diesem Sinne umfasst das TGM auch die Prozesse der GA. Weiterhin ist es möglich, dass zu den zu verwaltenden Systemen auch solche gehören, die durch Bausteine aus den Schichten IND Industrielle IT und SYS IT-Systeme modelliert werden, z. B. IND.2.1 Allgemeine ICS-Komponente oder auch SYS.4.4 Allgemeines IoT-Gerät. Darüber hinaus müssen die für das TGM relevanten Aspekte der Schichten ORP und OPS beachtet werden, insbesondere die Teilschichten OPS.1 Eigener Betrieb und OPS.2 Betrieb von Dritten sowie die Bausteine ORP.2 Personal und ORP.4 Identitäts- und Berechtigungsmanagement. Werden für das TGM Cloud-Dienste eingesetzt, muss für die Auswahl dieser Dienste der Baustein OPS.2.2 Cloud-Nutzung berücksichtigt werden. Zur Absicherung von Fernzugängen im TGM sind die Bausteine OPS.1.2.5 Fernwartung und IND.3.2 Fernwartung im industriellen Umfeld anzuwenden. Der Baustein INF.13 Technisches Gebäudemanagement behandelt nicht die physische Sicherheit von Gebäuden, diese wird in dem Baustein INF.1 Allgemeines Gebäude behandelt. Ebenso spielt der Aspekt der Safety in diesem Baustein keine hervorgehobene Rolle, sondern wird im Baustein IND.2.7 Safety Instrumented Systems behandelt."
          },
          {
            "name": "2.1. Fehlende Grundlagen für die Planung des TGM",
            "value": "Wenn beim Bau eines Gebäudes die Nachfrageorganisationen (siehe Kapitel 4.1 Genutzte TGM-spezifische Fachbegriffe) noch nicht feststehen, fehlen Kontaktpersonen, Zielsetzung und Bedarfe für das TGM. Das kann dazu führen, dass das TGM im Betrieb nicht dem tatsächlichen Bedarf entspricht, weil dieser zum Zeitpunkt der Planung und Umsetzung nicht abgefragt werden konnte."
          },
          {
            "name": "2.2. Mangelnde Dokumentation beim TGM",
            "value": "In das TGM ist häufig eine Vielzahl von Dienstleistenden involviert. Ist die Dokumentation der Zuständigkeiten mit Kontaktpersonen und zugehörigen SLAs unvollständig oder nicht zugänglich, führt dies im Ernstfall, wenn wichtige Systeme ausfallen, zu vermeidbaren Verzögerungen, die gegebenenfalls sogar Personenschaden zur Folge haben können. Eine fehlende Dokumentation von Sicherheitszertifizierungen der TGA-Anlagen inklusive Terminen für notwendige Erneuerung kann dazu führen, dass abgelaufene Zertifizierungen nicht rechtzeitig erneuert werden. Dadurch kann gegen Gesetze verstoßen werden, je nach TGA-Anlage Gefahr für Leib und Leben entstehen und ein entstandener Schaden nicht über entsprechende Versicherungen abgewickelt werden."
          },
          {
            "name": "2.3. Kompromittierung der Schnittstellen mit TGM",
            "value": "Das TGM hat technische Schnittstellen zu besonders schützenswerten Bereichen, z. B. Safety Instrumented Systems (SIS), Sicherheitsdienst und Brandmeldeanlagen. Wenn diese Schnittstellen bewusst oder unbewusst durch Fehler im TGM kompromittiert werden, dann kann dies einen Verstoß gegen Gesetze sowie Gefahr für Leib und Leben zur Folge haben. Wird z. B. bei einem Feueralarm in einem Rechenzentrum die optische oder akustische Warnung außer Kraft gesetzt, können im Raum befindliche Personen diesen nicht rechtzeitig verlassen, bevor der Raum mit Löschgas geflutet wird. Ebenso kann ein vorgetäuschter Feueralarm dazu führen, dass Fluchttüren geöffnet werden und dadurch unberechtigter Zugang erlangt wird oder Türen geschlossen und gegebenenfalls Personen eingeschlossen werden."
          },
          {
            "name": "2.4. Unzureichendes Monitoring der TGA",
            "value": "Wenn die TGA nur unzureichend durch ein entsprechendes Monitoring überwacht wird, dann werden sicherheitsrelevante Ereignisse, wie z. B. relevante Fehlfunktionen in der TGA, unter Umständen nicht oder zu spät erkannt. Dies kann je nach Ereignis zu weiteren Schäden führen oder Gefahr für Leib und Leben bedeuten. Wird z. B. der Ausfall der Heizung bei Außentemperaturen im Minusbereich nicht gemeldet, kühlen die Räume erst stark aus, bevor der Ausfall bemerkt wird und eine Behebung eingeleitet werden kann."
          },
          {
            "name": "2.5. Unzureichendes Rollen- und Berechtigungsmanagement",
            "value": "Wenn das TGM oder einzelne seiner Teile von der restlichen IT der Institution physisch getrennt werden, dann wird in der Regel auch ein dediziertes Identitäts- und Berechtigungsmanagement eingerichtet. Wenn dieses unzureichend konzipiert und umgesetzt wird, dann kann nicht ausgeschlossen werden, dass mehrere Personen dasselbe Konto nutzen oder Berechtigungen von ausgeschiedenen internen oder externen Mitarbeitenden oder Dienstleistenden nicht gelöscht wurden. Als Folge kann auf das TGM unberechtigt zugegriffen werden."
          }
        ],
        "control-implementations": [
          {
            "uuid": "10a360e4-9d38-4ad0-ad98-91795dcc6b12",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/ot-systeme_profile.json",
            "description": "Implementation for all controls in Baustein INF.13",
            "implemented-requirements": [
              {
                "uuid": "70eea9ec-38f3-40ff-838b-9c0c093e1c3d",
                "control-id": "ARCH.2.2.11",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a10-m3",
                    "uuid": "e2f37f33-3848-4cf6-9190-bbc4c84cdb38",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In der GA SOLLTEN GA-Bereiche derart geplant und umgesetzt werden, dass Abhängigkeiten zwischen den GA-Bereichen minimiert werden und GA-Bereiche unabhängig gesteuert werden können. Eine Störung in einem GA-Bereich SOLLTE keine oder nur geringe Auswirkungen auf andere GA-Bereiche haben."
                      },
                      {
                        "name": "guidance",
                        "value": "Die GA-Architektur wird modular nach GA-Bereichen (z.B. pro Etage, pro Brandabschnitt, pro Mieter) aufgebaut. Jeder Bereich hat eine eigene, autarke Steuerung (Controller). Die Kommunikation zwischen den Bereichen wird auf das absolute Minimum beschränkt und über definierte Schnittstellen abgewickelt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Analyse der GA-Architekturpläne, um die Aufteilung in unabhängige Bereiche zu verifizieren. Prüfung der Konfiguration der Controller und Gateways, um die Kommunikationsbeschränkungen zwischen den Bereichen zu überprüfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a10-m4",
                    "uuid": "dcf4af3a-bc12-425f-9893-9073a270664b",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Insbesondere SOLLTEN die Gebäude innerhalb eines Gebäudekomplexes oder einer Liegenschaft separat steuerbar sein. Die eingerichteten GA-Bereiche SOLLTEN auch im GA-Managementsystem entsprechend sichtbar sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Jedes Gebäude einer Liegenschaft hat ein komplett eigenständiges GA-System, das ohne Verbindung zu den anderen Gebäuden funktioniert. Im zentralen GA-Managementsystem (Leitstand) wird die Bereichsstruktur klar abgebildet, und die Rechtevergabe erfolgt bereichsbezogen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der GA-Architektur auf Liegenschaftsebene. Prüfung der Visualisierung und der Benutzerberechtigungen im GA-Managementsystem, um die separate Steuerbarkeit zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a10-m5",
                    "uuid": "41796e6d-cb6a-4b9d-ac17-9c3ceffb1c41",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Unabhängigkeit der GA-Bereiche wird regelmäßig durch automatisierte Tests überprüft. Dabei wird der Ausfall eines Bereichscontrollers simuliert und verifiziert, dass die anderen Bereiche ungestört weiterfunktionieren. Die Ergebnisse dieser 'Chaos Engineering'-Tests werden zur kontinuierlichen Verbesserung der Architektur genutzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Testskripte entwickelt, die gezielt einzelne Controller oder Netzwerkverbindungen zwischen Bereichen deaktivieren. Monitoring-Systeme überwachen währenddessen die Funktion der übrigen Bereiche. Dieser Test wird quartalsweise in einem Wartungsfenster durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Einsicht in die Planung, Skripte und Protokolle der Ausfallsimulationstests. Analyse der Testergebnisse und der daraus abgeleiteten Verbesserungsmaßnahmen. `test-command: /usr/local/bin/ga-chaos-test --fail-area 'floor-7' --verify-others`"
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "a29acfc3-5276-4e21-a4e9-1af5a45df991",
                "control-id": "ARCH.2.2.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a6-m1",
                    "uuid": "f4ab3967-7602-4ada-b977-092aee9d221e",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "GA-Netze und Büro-Netze sind nicht voneinander getrennt. Komponenten der Gebäudeautomation befinden sich im selben Netzwerk wie Büro-PCs und Server."
                      },
                      {
                        "name": "guidance",
                        "value": "Aus Bequemlichkeit oder Kostengründen werden GA-Komponenten einfach an den nächstgelegenen Switch des Büro-Netzes angeschlossen. Es gibt keine Segmentierung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Analyse eines Netzwerkscans oder der IP-Adressbereiche, um festzustellen, ob GA-Komponenten und Büro-Geräte im selben Subnetz betrieben werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a6-m2",
                    "uuid": "7e474085-f7e3-474a-838a-d384379446e9",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "GA-Netze sind von Büro-Netzen durch eine einfache Firewall getrennt, deren Regelwerk jedoch sehr pauschal und freizügig ist ('any-any'). Eine Kontrolle der Kommunikation findet nur unzureichend statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein GA-VLAN wurde eingerichtet und eine Firewall dazwischen geschaltet. Die Firewall-Regeln erlauben jedoch fast jegliche Kommunikation vom Büro-Netz in das GA-Netz, um die Funktionalität nicht zu beeinträchtigen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Review des Firewall-Regelwerks zwischen dem GA-VLAN und dem Büro-Netz. Prüfung auf übermäßig freizügige Regeln."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a6-m3",
                    "uuid": "0b155c4d-6be0-4a29-a3de-4f5119ada7a2",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "GA-Netze MÜSSEN von Büro-Netzen und sonstigen Netzen der Institution mindestens logisch getrennt werden. Jegliche Kommunikation zwischen GA-Systemen und sonstigen IT-Systemen MUSS kontrolliert und reglementiert werden. Hierfür MÜSSEN an allen Übergängen einer solchen Segmentierung entsprechende Komponenten mit Sicherheitsfunktionen, mindestens mit Firewall-Funktion, vorgesehen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Das GA-Netz wird in einem eigenen VLAN oder einer Gruppe von VLANs betrieben. An den Übergängen zum Büro-Netz werden Firewalls mit einem restriktiven 'Default-Deny'-Regelwerk eingesetzt. Nur explizit definierte und notwendige Kommunikationsbeziehungen werden freigeschaltet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Netzwerkarchitektur auf logische Trennung (VLAN-Konzept). Review des Firewall-Regelwerks, um sicherzustellen, dass es auf dem 'Default-Deny'-Prinzip basiert und nur minimal notwendige Ports und Protokolle erlaubt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a6-m4",
                    "uuid": "f81e806d-245c-4356-9d0a-51d43d196613",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wird die GA für einen Gebäudekomplex oder eine Liegenschaft zentral eingerichtet, so MUSS die gebäudeübergreifende GA-Kommunikation über LAN-, WLAN-, WAN-, Funknetz- oder Internet-Verbindungen auch auf Ebene des Netzes separiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für die gebäudeübergreifende Kommunikation werden dedizierte WAN-Verbindungen oder sichere VPN-Tunnel mit starken Verschlüsselungs- und Authentifizierungsmechanismen verwendet. Diese Verbindungen werden ebenfalls durch restriktive Firewall-Regeln geschützt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Konfiguration der WAN-Verbindungen oder VPN-Tunnel. Review der Firewall-Regeln, die den Datenverkehr zwischen den Gebäuden regeln."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a6-m5",
                    "uuid": "8dc28f21-9d49-4f55-98f5-1d7bc8af9d35",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "GA-Netze werden physisch von allen anderen Netzen getrennt betrieben. An den wenigen, notwendigen Kopplungspunkten werden Application Layer Gateways oder Datendioden eingesetzt, um die Kommunikation auf das absolut notwendige Minimum zu beschränken und eine Protokollvalidierung durchzuführen."
                      },
                      {
                        "name": "guidance",
                        "value": "Das GA-Netz verwendet eine komplett eigene physische Infrastruktur (Switches, Kabel). Die Kopplung zum Büro-Netz erfolgt über eine demilitarisierte Zone (DMZ), in der ein Application Layer Gateway steht, das nur bestimmte Befehle des GA-Protokolls zulässt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Physische Inspektion der Netzwerkinfrastruktur, um die physische Trennung zu verifizieren. Detailliertes Review der Konfiguration des Application Layer Gateways in der DMZ. Durchführung von Penetrationstests, um die Wirksamkeit der Trennung zu überprüfen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "37c4bd79-9b35-4004-a98f-2485eec629cf",
                "control-id": "KONF.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DOCS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a5-m1",
                    "uuid": "05eb5f32-846c-4f7e-8672-a877f63657b6",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Dokumentation der GA ist nur für einzelne Komponenten oder Systeme vorhanden. Es gibt keinen Gesamtüberblick über alle Komponenten, Zugänge und deren Abhängigkeiten."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Dokumentation besteht meist aus Herstellerhandbüchern und unvollständigen Netzwerkplänen. Änderungen werden nicht nachdokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der GA-Dokumentation und Prüfung auf Vollständigkeit und Aktualität. Vergleich der Dokumentation mit der Realität an wenigen Stichproben."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a5-m2",
                    "uuid": "add35978-c6d9-44f8-93bc-8c975b141cad",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt eine grundlegende Dokumentation, die die meisten Komponenten und Zugänge der GA erfasst. Diese wird jedoch nicht regelmäßig geprüft oder bei Änderungen zeitnah angepasst."
                      },
                      {
                        "name": "guidance",
                        "value": "Es existiert ein zentraler Ordner mit der GA-Dokumentation, aber es gibt keinen festen Prozess, der sicherstellt, dass alle Änderungen (z.B. neue Geräte, geänderte Firewall-Regeln) dort eingepflegt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Einsicht in die zentrale Dokumentation. Vergleich der Dokumentation mit dem Ist-Zustand an mehreren Stellen, um die Aktualität zu bewerten. Befragung der Mitarbeiter zum Prozess der Dokumentationspflege."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a5-m3",
                    "uuid": "c89bbe81-ccc8-4c74-b7c7-3e9969cc716e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die GA MUSS die Vielzahl unterschiedlicher Komponenten und Zugänge dokumentiert werden. Insbesondere MÜSSEN auch alle deaktivierten physischen Kommunikationsschnittstellen, Protokolle und Zugänge bzw. Zugriffsmöglichkeiten zur GA dokumentiert werden. Darüber hinaus MÜSSEN alle Wechselwirkungen und Abhängigkeiten von GA-relevanten Komponenten sowie von TGA-Anlagen dokumentiert werden. Die Dokumentation MUSS regelmäßig und bei Änderungen innerhalb der GA geprüft und angepasst werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein umfassendes GA-Dokumentationskonzept erstellt, das Vorlagen für Netzwerkpläne, Komponentenlisten, Schnittstellenbeschreibungen und Abhängigkeitsmatrizen enthält. Jede Änderung an der GA muss über einen Change-Management-Prozess laufen, der eine Aktualisierung der Dokumentation zwingend vorschreibt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung des GA-Dokumentationskonzepts. Einsicht in die vollständige Dokumentation. Überprüfung von kürzlich durchgeführten Changes, um festzustellen, ob die dazugehörige Dokumentation angepasst wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a5-m4",
                    "uuid": "84f916d2-9b97-4b6a-bf35-88402f750bfd",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die verfügbaren und genutzten Sicherheitseigenschaften der verwendeten Protokolle SOLLTEN dokumentiert werden. Die Dokumentation SOLLTE für alle GA-Systeme übergreifend hinsichtlich Inhalten und deren Datenstrukturen abgestimmt werden, um eine einfache, systemübergreifende Auswertung zu ermöglichen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Dokumentation wird in einer zentralen Datenbank (z.B. CMDB) oder einem Wiki mit standardisierten Vorlagen und Datenfeldern geführt. Für jedes Protokoll wird dokumentiert, welche Sicherheitsfunktionen (z.B. Verschlüsselung, Authentisierung) es bietet und ob diese aktiviert sind."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der CMDB oder des Wikis auf Konsistenz und Vollständigkeit. Stichprobenartige Überprüfung, ob die dokumentierten Sicherheitseigenschaften der Protokolle mit der tatsächlichen Konfiguration der Komponenten übereinstimmen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a5-m5",
                    "uuid": "fc1e17a9-665f-4c4a-9f0b-ce9dd1ab89f9",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Dokumentation der GA wird durch automatisierte Inventarisierungs- und Scanning-Tools kontinuierlich erstellt und aktuell gehalten. Abweichungen zwischen der automatisch erfassten Realität und der Solldokumentation (z.B. aus dem BIM-Modell) werden automatisch gemeldet."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine OT-Asset-Management-Lösung wird eingesetzt, die das GA-Netzwerk passiv scannt, alle Geräte und ihre Konfigurationen erfasst und in die CMDB schreibt. Diese Daten werden regelmäßig gegen die Planungsdaten aus dem BIM-System validiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Live-Demonstration des automatisierten Inventarisierungstools. Überprüfung des Prozesses zur Meldung und Bearbeitung von Abweichungen. `test-command: /usr/local/bin/ga-asset-scan --discover --diff-to-cmdb`"
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "2e618719-cc4c-4b6e-af3f-103a8ca680b0",
                "control-id": "KONF.3.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a11-m2",
                    "uuid": "760153f8-ad46-4866-a80f-a2c6e29336f8",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Frei zugängliche Ports (Ethernet, USB) an GA-Komponenten sind organisatorisch zur Deaktivierung vorgesehen, die Umsetzung wird aber nicht kontrolliert. Eine Netzzugangskontrolle ist nicht implementiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine Anweisung, ungenutzte Ports zu deaktivieren, aber es gibt keine technische Überprüfung. Temporär für Wartungszwecke aktivierte Ports werden oft vergessen und bleiben offen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Physische Inspektion von frei zugänglichen GA-Komponenten (z.B. in Fluren, öffentlichen Bereichen) und Prüfung, ob ungenutzte Ports aktiv sind. Anschließen eines Testgeräts, um die Netzwerkverbindung zu prüfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a11-m3",
                    "uuid": "e3d03bba-f38a-457f-a7cf-f817e350e558",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Anschluss von Komponenten, speziell von unautorisierten, unbekannten Komponenten und Fremdgeräten, SOLLTE insbesondere an frei zugänglichen Ethernet-Ports, USB-Ports und anderen Schnittstellen der GA kontrolliert und eingeschränkt werden. Frei zugängliche Schnittstellen für temporäre Wartungszwecke, wie beispielsweise USB-Ports an GA-Komponenten, SOLLTEN nur bei Bedarf aktiviert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle nicht benötigten physischen Ports an GA-Komponenten werden softwareseitig im Switch oder im Betriebssystem des Geräts deaktiviert. Temporäre Freischaltungen für Wartungseinsätze müssen beantragt werden und werden nach einer festgelegten Zeit automatisch wieder deaktiviert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Switch-Konfigurationen, um die Deaktivierung ungenutzter Ports zu verifizieren. Einsicht in den Prozess zur temporären Freischaltung von Ports und Überprüfung der entsprechenden Tickets."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a11-m4",
                    "uuid": "f652abf9-bcee-41a5-8d32-54e86e1feaad",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für frei zugängliche LAN- oder WLAN-Zugänge SOLLTE eine Netzzugangskontrolle gemäß IEEE 802.1X oder vergleichbare Sicherheitsmechanismen eingesetzt werden. Der Anschluss einer unautorisierten oder unbekannten Komponente SOLLTE in die Ereignisprotokollierung aufgenommen werden. Eine direkte IP-basierte Kommunikation von solchen Komponenten mit Systemen der GA SOLLTE unterbunden werden."
                      },
                      {
                        "name": "guidance",
                        "value": "An allen frei zugänglichen Netzwerkdosen wird 802.1X mit Zertifikats- oder MAC-Adressen-basierter Authentifizierung aktiviert. Geräte, die sich nicht authentifizieren können, werden in ein Quarantäne-VLAN verschoben, das keinen Zugriff auf das produktive GA-Netz hat. Jeder fehlgeschlagene Authentifizierungsversuch wird protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Konfiguration des RADIUS-Servers und der Switches für 802.1X. Durchführung eines Tests durch Anschluss eines nicht autorisierten Geräts an einen Port. Prüfung der Systemprotokolle auf entsprechende Einträge. `test-command: Connect-TestDevice -Port 42; Get-FirewallLog -Filter 'quarantine-vlan'`"
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a11-m5",
                    "uuid": "6f161012-da43-42b0-a900-3814bfd3eccd",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Anschluss unautorisierter Geräte wird nicht nur verhindert, sondern löst auch einen automatisierten Sicherheitsvorfall aus. Der betroffene Port wird sofort physisch gesperrt und eine Benachrichtigung an das Sicherheitsteam gesendet, die den genauen Standort des Ports enthält. Die Kommunikation im Quarantäne-Netz wird aktiv überwacht, um Angriffsversuche zu erkennen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Netzzugangskontroll-Lösung ist mit dem SIEM und einem SOAR-System integriert. Bei einem 802.1X-Fehlschlag wird der Switch-Port via Skript auf 'shutdown' gesetzt und ein Ticket mit der Port-Bezeichnung aus der Dokumentation erstellt. Im Quarantäne-VLAN ist ein Intrusion Detection System (IDS) aktiv."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Live-Test des gesamten Prozesses durch Anschluss eines nicht autorisierten Laptops. Überprüfung, ob der Port gesperrt wird und ob ein entsprechender Alarm und ein Ticket im SIEM/Ticketsystem generiert werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "08189b02-88db-4ad4-8940-7eb9d0a19026",
                "control-id": "KONF.7.15",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a3-m1",
                    "uuid": "012c24d8-2716-4354-a191-070c8811b33d",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anbindung von TGA-Anlagen an GA-Systeme erfolgt ohne definierte Sicherheitsregeln. Es wird nicht systematisch festgelegt, welche Aktionen ausgelöst werden dürfen, was zu unvorhersehbarem Verhalten führen kann."
                      },
                      {
                        "name": "guidance",
                        "value": "Systeme werden nach dem Prinzip 'was technisch funktioniert, wird verbunden' integriert. Eine Analyse der Ablauf- und Funktionsketten findet nicht statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Befragung der Administratoren, nach welchen Regeln TGA-Anlagen angebunden werden. Prüfung, ob Dokumentationen über erlaubte Interaktionen zwischen Systemen existieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a3-m2",
                    "uuid": "cbff7619-1d8b-4c00-8269-22e5e812e54a",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt grundlegende Festlegungen, welche TGA-Anlagen mit GA-Systemen interagieren dürfen. Die Anbindung wird jedoch nicht durch technische Maßnahmen abgesichert und die Ablaufketten werden nicht umfassend geplant oder getestet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Anbindung wird auf Netzwerkebene erlaubt, aber die erlaubten Aktionen auf Applikationsebene werden nicht eingeschränkt. Funktionstests beschränken sich auf den 'Happy Path'."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Einsicht in die Dokumentation der erlaubten Anbindungen. Überprüfung der Konfiguration von Koppelelementen, um festzustellen, ob Sicherheitsregeln implementiert sind. Prüfung der Testdokumentation."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a3-m3",
                    "uuid": "4f966c2c-2f89-402f-8a43-f727441eac4f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für alle TGA-Anlagen, GA-Systeme und GA-relevanten Komponenten MUSS festgelegt werden, ob durch andere Systeme Aktionen ausgelöst werden dürfen. Sowohl die Integration von TGA-Anlagen in ein GA-System als auch die rückwirkungsfreie Kopplung von TGA-Anlagen an GA-Systeme MÜSSEN angemessen abgesichert sein. Ebenfalls MUSS die Anbindung von GA-Systemen untereinander angemessen abgesichert werden. Hierzu MÜSSEN insbesondere die Ablauf- und Funktionsketten innerhalb eines GA-Systems bzw. zwischen GA-Systemen angemessen geplant und getestet werden. Die Festlegungen MÜSSEN vollumfänglich dokumentiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für jede Anbindung wird eine Interaktionsmatrix erstellt, die genau definiert, welches System welche Daten an welches andere System senden und welche Aktionen auslösen darf. Diese Regeln werden in den Koppelelementen (z.B. Gateways, Firewalls) technisch umgesetzt. Jede Anbindung durchläuft einen standardisierten Test- und Freigabeprozess."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Interaktionsmatrizen und der dazugehörigen Dokumentation. Überprüfung der Konfiguration der Koppelelemente, um die Umsetzung der definierten Regeln zu verifizieren. Einsicht in die Testprotokolle der Ablauf- und Funktionsketten."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a3-m4",
                    "uuid": "9f2100c8-faaf-4542-96d9-077b76f07e83",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Falls eine Integration zulässig ist, SOLLTE reglementiert werden, welche automatisierten Aktionen durch welche Informationen eines GA-Systems ausgelöst werden dürfen. Die Ablauf- und Funktionsketten SOLLTEN umfassend getestet und bei Fehlverhalten nachjustiert werden. Die Dokumentation SOLLTE regelmäßig und ergänzend bei Bedarf geprüft werden, ob sie noch aktuell ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Regeln für automatisierte Aktionen werden detailliert spezifiziert, inklusive Schwellenwerten und Plausibilitätsprüfungen. Die Tests umfassen auch Fehlerszenarien (z.B. Ausfall einer Komponente, ungültige Daten). Die Dokumentation wird jährlich auf Aktualität geprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Spezifikation der automatisierten Aktionen. Einsicht in die Testpläne und -protokolle, insbesondere für Fehlerszenarien. Prüfung der Protokolle der jährlichen Dokumentationsreviews."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a3-m5",
                    "uuid": "8fcd4914-8505-45d7-a0e6-9787662ec10f",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die gesamte Kommunikation zwischen TGA-Anlagen und GA-Systemen wird in Echtzeit überwacht. Abweichungen von den definierten Ablauf- und Funktionsketten werden automatisch erkannt und gemeldet. Bei erkannten Abweichungen werden die betroffenen Interaktionen blockiert und ein Incident-Prozess ausgelöst. Die Testfälle werden automatisiert aus den Spezifikationen generiert und ausgeführt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine OT-Security-Monitoring-Lösung eingesetzt, die den Datenverkehr der GA analysiert und über Anomalieerkennung verfügt. Ein Security Orchestration, Automation and Response (SOAR)-System wird verwendet, um auf Alarme automatisiert zu reagieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Live-Demonstration des Monitoring-Systems und der automatischen Alarmierung. Prüfung eines simulierten Angriffs, um die Reaktion des SOAR-Systems zu verifizieren. `test-command: /usr/local/bin/ga-traffic-analyser --watch --alert-on-deviation`"
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}