{
  "component-definition": {
    "uuid": "8dcf43e8-9c79-4467-a201-9de6ea4c25aa",
    "metadata": {
      "title": "IND.2.7 Safety Instrumented Systems - Benutzerdefiniert",
      "last-modified": "2025-11-22T12:46:13.188853+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "9928e55c-8649-412a-b4f2-8a8955f99402",
        "type": "software",
        "title": "IND.2.7 Safety Instrumented Systems",
        "description": "This component represents the implementation of all controls for Baustein IND.2.7.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Safety Instrumented Systems (SIS) bilden eine Untergruppe der Industrial Control Systems (ICS). SIS werden eingesetzt, um Gefahren für technische Anlagen, die Umwelt und Personen abzuwehren. Der prinzipielle Aufbau von SIS unterscheidet sich kaum von den konventionellen Automatisierungssystemen. Der wesentliche Unterschied liegt in den erhöhten Anforderungen an die Zuverlässigkeit, mit der die von einem SIS auszuführenden Sicherheitsfunktionen (SIF) vollzogen werden. Das Maß an Zuverlässigkeit wird mit Hilfe des vierstufigen Sicherheits-Integritätslevels (SIL) ausgedrückt, diese werden in der IEC 61508 definiert. SIL1 ist hierbei die geringste und SIL4 die höchste Anforderung an die Zuverlässigkeit. Abhängig von der SIL-Stufe gelten unterschiedliche Anforderungen an die zulässige Ausfallrate von Komponenten, die Hardware-Fehlertoleranz der Architektur, die Unabhängigkeit von Prüfenden sowie weitere sicherheitsrelevante Punkte. Der gesamte Lebenszyklus eines SIS ist organisatorisch in ein Functional Safety Management (FSM) eingebettet.<BR>Dieser Baustein ist unabhängig von der jeweiligen SIL-Stufe eines SIS umzusetzen. Die Informationssicherheit ist in jeder Lebensphase zu berücksichtigen, von der Entwicklung der Komponenten bis hin zu deren Anwendung, Betrieb und Außerbetriebnahme. Dabei ist zu beachten, dass die Sicherstellung der Integrität der SIS die höchste Priorität hat.<BR>Ein weiteres wesentliches Merkmal von SIS ist die Unabhängigkeit und die Trennung von umgebenden IT-Systemen und von der Betriebstechnik (Operational Technology, OT). Das bedeutet, dass die Verfügbarkeit und Integrität des SIS nicht von ihnen beeinflusst werden dürfen."
          },
          {
            "name": "Zielsetzung",
            "value": "Das Ziel dieses Bausteins besteht darin, geeignete Anforderungen an SIS zu formulieren, die beim Aufbau eines Managementsystems für Informationssicherheit (ISMS) erfüllt werden müssen.<BR>Der Begriff „SIS“ umfasst im Sinne dieses Bausteins die Komponenten Sensor, Aktor, die sicherheitsgerichtete speicherprogrammierbare Steuerung (SSPS), auch als Logiksystem bezeichnet, das Anwendungsprogramm sowie auch insbesondere die dazugehörigen Programmiergeräte (Engineering Station, Handhelds für die Sensor-/Aktor-Konfiguration) und Visualisierungseinrichtungen."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein IND.2.7 Safety Instrumented Systems ist auf jede SIS-Komponente einmal anzuwenden.<BR>Der vorliegende Baustein ergänzt die übergeordneten Bausteine IND.1 Prozessleit- und Automatisierungstechnik und IND.2.1 Allgemeine ICS-Komponente und setzt voraus, dass diese umgesetzt wurden."
          },
          {
            "name": "2.1. Manipulation des Logiksystems",
            "value": "Die Manipulation des Anwendungsprogramms auf dem Logiksystem, bei der die Integrität eines SIS verletzt werden kann, stellt das größte Risiko dar. Anders als bei „einfachen\" OT-Komponenten, kann dies potenziell schwerste Auswirkungen auf die Sicherheit von Menschen, Umwelt und technischen Anlagen haben. Im Arbeitsblatt NA 163 des internationalen Verbands der Anwender von Automatisierungstechnik der Prozessindustrie NAMUR sind diesbezüglich folgende drei Kategorien zur Risikobeurteilung definiert:<BR><BR>• Unter Kategorie 1 werden Manipulationen zusammengefasst, welche die Sicherheitsfunktion (SIF) auslösen, ohne dass der Anforderungsfall eingetreten ist. Die Auswirkungen sind im Sinne der funktionalen Sicherheit nicht gefährlich, da das SIS den sicheren Zustand herbeigerufen hat. Die Manipulationen führen allerdings zu einer Betriebsunterbrechung. Ursache dafür können beispielsweise Schadsoftware oder menschliche Fehlhandlungen sein.<BR><BR>• Kategorie 2 beschreibt einen Fall, bei dem die Sicherheitsfunktion deaktiviert ist und dadurch kein Schutz mehr geboten ist. Ein inakzeptables Ergebnis wird erst erreicht, wenn der Anforderungsfall eingetreten ist. Die Auswirkungen werden als gefährlich eingestuft, da das SIS seine primäre Aufgabe nicht erfüllen kann. Angriffsszenarien werden als komplex eingestuft, da die Manipulation des Logiksystems allein nicht ausreicht, um einen Schaden zu verursachen.<BR><BR>• Die dritte Kategorie behandelt das gravierendste Szenario, indem eine oder mehrere Sicherheitsfunktionen deaktiviert werden und der Anforderungsfall vorsätzlich herbeigeführt wird. Auch hier werden die Auswirkungen als gefährlich und die Angriffsszenarien als sehr komplex eingestuft. Denn um den Anforderungsfall herbeiführen zu können, müssen Angreifende neben Kenntnissen über die Manipulation des SIS auch über fundierte Kenntnisse zu den physikalischen Prozessen verfügen.<BR><BR>Im Dezember 2017 wurde erstmals über eine Schadsoftware berichtet, die gezielt SIS manipuliert hat. Der Weg des Angriffs führte über die Engineering Station, auf der sich die spezielle Software für die Programmierung und Parametrierung befand. Die dort installierte Malware suchte von dort aus gezielt nach verbundenen Logiksystemen eines bestimmten herstellenden Unternehmens und lud darauf ausführbaren Code, der das Anwendungsprogramm (die Logik) manipulierte. Aufgrund eines Fehlers in diesem Code schlug die Gültigkeitsüberprüfung fehl. Daraufhin löste die Sicherheitsfunktion aus und fuhr die angegriffene Anlage in einen sicheren Zustand herunter. Der Angriff war zwar nicht erfolgreich, hätte aber sowohl aufgrund seiner Auswirkung als auch seiner Komplexität der Kategorie 2 oder 3 zugeordnet werden können."
          },
          {
            "name": "2.2. Unzureichende Überwachungs- und Detektionsverfahren",
            "value": "Eine wesentliche Funktion von Automatisierungssystemen liegt darin, Betriebszustände des zu automatisierenden Prozesses zu überwachen. So werden für gewöhnlich den Prozess betreffende Warnungen (z. B. bei überschrittenen Füllständen) und technische Parameter (z. B. Temperatur, Ventilstellung) berücksichtigt. Im Gegensatz dazu wird die unterstützende IT-Infrastruktur oft nicht überwacht.<BR>Werden ungewöhnliche oder sicherheitsrelevante Ereignisse nicht oder nur unzureichend überwacht, können Angriffsversuche, Netzengpässe oder absehbare Ausfälle nicht frühzeitig erkannt werden."
          }
        ],
        "control-implementations": [
          {
            "uuid": "d5ac3eab-3958-406d-bbd6-d86a02e0210d",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Kompendien/Grundschutz%2B%2B-Kompendium/profile/ot-systeme_profile.json",
            "description": "Implementation for all controls in Baustein IND.2.7",
            "implemented-requirements": [
              {
                "uuid": "2f885fd0-7115-48e0-bd49-48a5d6c86bfd",
                "control-id": "ARCH.2.2.11",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a10-m3",
                    "uuid": "fa754f02-0d63-4784-93ba-b5ad3f96f3c5",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In der GA SOLLTEN GA-Bereiche derart geplant und umgesetzt werden, dass Abhängigkeiten zwischen den GA-Bereichen minimiert werden und GA-Bereiche unabhängig gesteuert werden können. Eine Störung in einem GA-Bereich SOLLTE keine oder nur geringe Auswirkungen auf andere GA-Bereiche haben."
                      },
                      {
                        "name": "guidance",
                        "value": "Die GA-Architektur wird modular nach GA-Bereichen (z.B. pro Etage, pro Brandabschnitt, pro Mieter) aufgebaut. Jeder Bereich hat eine eigene, autarke Steuerung (Controller). Die Kommunikation zwischen den Bereichen wird auf das absolute Minimum beschränkt und über definierte Schnittstellen abgewickelt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Analyse der GA-Architekturpläne, um die Aufteilung in unabhängige Bereiche zu verifizieren. Prüfung der Konfiguration der Controller und Gateways, um die Kommunikationsbeschränkungen zwischen den Bereichen zu überprüfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a10-m4",
                    "uuid": "7246120b-9f02-403b-a3a5-aefb1e27d239",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Insbesondere SOLLTEN die Gebäude innerhalb eines Gebäudekomplexes oder einer Liegenschaft separat steuerbar sein. Die eingerichteten GA-Bereiche SOLLTEN auch im GA-Managementsystem entsprechend sichtbar sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Jedes Gebäude einer Liegenschaft hat ein komplett eigenständiges GA-System, das ohne Verbindung zu den anderen Gebäuden funktioniert. Im zentralen GA-Managementsystem (Leitstand) wird die Bereichsstruktur klar abgebildet, und die Rechtevergabe erfolgt bereichsbezogen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der GA-Architektur auf Liegenschaftsebene. Prüfung der Visualisierung und der Benutzerberechtigungen im GA-Managementsystem, um die separate Steuerbarkeit zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a10-m5",
                    "uuid": "079ec235-d821-43fd-bc80-97d42bf960c6",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Unabhängigkeit der GA-Bereiche wird regelmäßig durch automatisierte Tests überprüft. Dabei wird der Ausfall eines Bereichscontrollers simuliert und verifiziert, dass die anderen Bereiche ungestört weiterfunktionieren. Die Ergebnisse dieser 'Chaos Engineering'-Tests werden zur kontinuierlichen Verbesserung der Architektur genutzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Testskripte entwickelt, die gezielt einzelne Controller oder Netzwerkverbindungen zwischen Bereichen deaktivieren. Monitoring-Systeme überwachen währenddessen die Funktion der übrigen Bereiche. Dieser Test wird quartalsweise in einem Wartungsfenster durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Einsicht in die Planung, Skripte und Protokolle der Ausfallsimulationstests. Analyse der Testergebnisse und der daraus abgeleiteten Verbesserungsmaßnahmen. `test-command: /usr/local/bin/ga-chaos-test --fail-area 'floor-7' --verify-others`"
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "cc190848-7b3a-457a-9224-7cb4dc8d6f03",
                "control-id": "ARCH.2.2.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a6-m1",
                    "uuid": "a4bab8e3-bf49-48ef-b53b-ded9893e9a4b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "GA-Netze und Büro-Netze sind nicht voneinander getrennt. Komponenten der Gebäudeautomation befinden sich im selben Netzwerk wie Büro-PCs und Server."
                      },
                      {
                        "name": "guidance",
                        "value": "Aus Bequemlichkeit oder Kostengründen werden GA-Komponenten einfach an den nächstgelegenen Switch des Büro-Netzes angeschlossen. Es gibt keine Segmentierung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Analyse eines Netzwerkscans oder der IP-Adressbereiche, um festzustellen, ob GA-Komponenten und Büro-Geräte im selben Subnetz betrieben werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a6-m2",
                    "uuid": "88cdb47c-fef7-4c14-bfdc-c63070497268",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "GA-Netze sind von Büro-Netzen durch eine einfache Firewall getrennt, deren Regelwerk jedoch sehr pauschal und freizügig ist ('any-any'). Eine Kontrolle der Kommunikation findet nur unzureichend statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein GA-VLAN wurde eingerichtet und eine Firewall dazwischen geschaltet. Die Firewall-Regeln erlauben jedoch fast jegliche Kommunikation vom Büro-Netz in das GA-Netz, um die Funktionalität nicht zu beeinträchtigen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Review des Firewall-Regelwerks zwischen dem GA-VLAN und dem Büro-Netz. Prüfung auf übermäßig freizügige Regeln."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a6-m3",
                    "uuid": "4c0d7d2c-244a-4f76-aff4-fe785532726e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "GA-Netze MÜSSEN von Büro-Netzen und sonstigen Netzen der Institution mindestens logisch getrennt werden. Jegliche Kommunikation zwischen GA-Systemen und sonstigen IT-Systemen MUSS kontrolliert und reglementiert werden. Hierfür MÜSSEN an allen Übergängen einer solchen Segmentierung entsprechende Komponenten mit Sicherheitsfunktionen, mindestens mit Firewall-Funktion, vorgesehen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Das GA-Netz wird in einem eigenen VLAN oder einer Gruppe von VLANs betrieben. An den Übergängen zum Büro-Netz werden Firewalls mit einem restriktiven 'Default-Deny'-Regelwerk eingesetzt. Nur explizit definierte und notwendige Kommunikationsbeziehungen werden freigeschaltet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Netzwerkarchitektur auf logische Trennung (VLAN-Konzept). Review des Firewall-Regelwerks, um sicherzustellen, dass es auf dem 'Default-Deny'-Prinzip basiert und nur minimal notwendige Ports und Protokolle erlaubt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a6-m4",
                    "uuid": "e0c6fd8f-6cfb-435f-bfba-c3b1d8057818",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wird die GA für einen Gebäudekomplex oder eine Liegenschaft zentral eingerichtet, so MUSS die gebäudeübergreifende GA-Kommunikation über LAN-, WLAN-, WAN-, Funknetz- oder Internet-Verbindungen auch auf Ebene des Netzes separiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für die gebäudeübergreifende Kommunikation werden dedizierte WAN-Verbindungen oder sichere VPN-Tunnel mit starken Verschlüsselungs- und Authentifizierungsmechanismen verwendet. Diese Verbindungen werden ebenfalls durch restriktive Firewall-Regeln geschützt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Konfiguration der WAN-Verbindungen oder VPN-Tunnel. Review der Firewall-Regeln, die den Datenverkehr zwischen den Gebäuden regeln."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a6-m5",
                    "uuid": "2af3904b-ff3a-4cc0-aa06-f77987dd0218",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "GA-Netze werden physisch von allen anderen Netzen getrennt betrieben. An den wenigen, notwendigen Kopplungspunkten werden Application Layer Gateways oder Datendioden eingesetzt, um die Kommunikation auf das absolut notwendige Minimum zu beschränken und eine Protokollvalidierung durchzuführen."
                      },
                      {
                        "name": "guidance",
                        "value": "Das GA-Netz verwendet eine komplett eigene physische Infrastruktur (Switches, Kabel). Die Kopplung zum Büro-Netz erfolgt über eine demilitarisierte Zone (DMZ), in der ein Application Layer Gateway steht, das nur bestimmte Befehle des GA-Protokolls zulässt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Physische Inspektion der Netzwerkinfrastruktur, um die physische Trennung zu verifizieren. Detailliertes Review der Konfiguration des Application Layer Gateways in der DMZ. Durchführung von Penetrationstests, um die Wirksamkeit der Trennung zu überprüfen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "5b0703bb-7ef7-41ff-a02f-45d9c59796c5",
                "control-id": "KONF.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DOCS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a5-m1",
                    "uuid": "ab0c67a1-b6bd-4866-9f07-0d08e215f19a",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Dokumentation der GA ist nur für einzelne Komponenten oder Systeme vorhanden. Es gibt keinen Gesamtüberblick über alle Komponenten, Zugänge und deren Abhängigkeiten."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Dokumentation besteht meist aus Herstellerhandbüchern und unvollständigen Netzwerkplänen. Änderungen werden nicht nachdokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der GA-Dokumentation und Prüfung auf Vollständigkeit und Aktualität. Vergleich der Dokumentation mit der Realität an wenigen Stichproben."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a5-m2",
                    "uuid": "baaef2f6-d61c-4b68-8488-db3b78c7163f",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt eine grundlegende Dokumentation, die die meisten Komponenten und Zugänge der GA erfasst. Diese wird jedoch nicht regelmäßig geprüft oder bei Änderungen zeitnah angepasst."
                      },
                      {
                        "name": "guidance",
                        "value": "Es existiert ein zentraler Ordner mit der GA-Dokumentation, aber es gibt keinen festen Prozess, der sicherstellt, dass alle Änderungen (z.B. neue Geräte, geänderte Firewall-Regeln) dort eingepflegt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Einsicht in die zentrale Dokumentation. Vergleich der Dokumentation mit dem Ist-Zustand an mehreren Stellen, um die Aktualität zu bewerten. Befragung der Mitarbeiter zum Prozess der Dokumentationspflege."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a5-m3",
                    "uuid": "a87b9849-bef4-43bb-891c-c81d0c3e3a5b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die GA MUSS die Vielzahl unterschiedlicher Komponenten und Zugänge dokumentiert werden. Insbesondere MÜSSEN auch alle deaktivierten physischen Kommunikationsschnittstellen, Protokolle und Zugänge bzw. Zugriffsmöglichkeiten zur GA dokumentiert werden. Darüber hinaus MÜSSEN alle Wechselwirkungen und Abhängigkeiten von GA-relevanten Komponenten sowie von TGA-Anlagen dokumentiert werden. Die Dokumentation MUSS regelmäßig und bei Änderungen innerhalb der GA geprüft und angepasst werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein umfassendes GA-Dokumentationskonzept erstellt, das Vorlagen für Netzwerkpläne, Komponentenlisten, Schnittstellenbeschreibungen und Abhängigkeitsmatrizen enthält. Jede Änderung an der GA muss über einen Change-Management-Prozess laufen, der eine Aktualisierung der Dokumentation zwingend vorschreibt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung des GA-Dokumentationskonzepts. Einsicht in die vollständige Dokumentation. Überprüfung von kürzlich durchgeführten Changes, um festzustellen, ob die dazugehörige Dokumentation angepasst wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a5-m4",
                    "uuid": "3fb7aae8-04da-47d8-8aec-d2e712da1b26",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die verfügbaren und genutzten Sicherheitseigenschaften der verwendeten Protokolle SOLLTEN dokumentiert werden. Die Dokumentation SOLLTE für alle GA-Systeme übergreifend hinsichtlich Inhalten und deren Datenstrukturen abgestimmt werden, um eine einfache, systemübergreifende Auswertung zu ermöglichen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Dokumentation wird in einer zentralen Datenbank (z.B. CMDB) oder einem Wiki mit standardisierten Vorlagen und Datenfeldern geführt. Für jedes Protokoll wird dokumentiert, welche Sicherheitsfunktionen (z.B. Verschlüsselung, Authentisierung) es bietet und ob diese aktiviert sind."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der CMDB oder des Wikis auf Konsistenz und Vollständigkeit. Stichprobenartige Überprüfung, ob die dokumentierten Sicherheitseigenschaften der Protokolle mit der tatsächlichen Konfiguration der Komponenten übereinstimmen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a5-m5",
                    "uuid": "674ed248-dd83-43ce-931b-d706c3325816",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Dokumentation der GA wird durch automatisierte Inventarisierungs- und Scanning-Tools kontinuierlich erstellt und aktuell gehalten. Abweichungen zwischen der automatisch erfassten Realität und der Solldokumentation (z.B. aus dem BIM-Modell) werden automatisch gemeldet."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine OT-Asset-Management-Lösung wird eingesetzt, die das GA-Netzwerk passiv scannt, alle Geräte und ihre Konfigurationen erfasst und in die CMDB schreibt. Diese Daten werden regelmäßig gegen die Planungsdaten aus dem BIM-System validiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Live-Demonstration des automatisierten Inventarisierungstools. Überprüfung des Prozesses zur Meldung und Bearbeitung von Abweichungen. `test-command: /usr/local/bin/ga-asset-scan --discover --diff-to-cmdb`"
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "45a5b38e-28cb-4401-a55a-88d6de973b6c",
                "control-id": "KONF.3.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a11-m2",
                    "uuid": "42aaa2e6-dde6-4b73-877d-f5a922c3132e",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Frei zugängliche Ports (Ethernet, USB) an GA-Komponenten sind organisatorisch zur Deaktivierung vorgesehen, die Umsetzung wird aber nicht kontrolliert. Eine Netzzugangskontrolle ist nicht implementiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine Anweisung, ungenutzte Ports zu deaktivieren, aber es gibt keine technische Überprüfung. Temporär für Wartungszwecke aktivierte Ports werden oft vergessen und bleiben offen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Physische Inspektion von frei zugänglichen GA-Komponenten (z.B. in Fluren, öffentlichen Bereichen) und Prüfung, ob ungenutzte Ports aktiv sind. Anschließen eines Testgeräts, um die Netzwerkverbindung zu prüfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a11-m3",
                    "uuid": "2034475f-6b86-4303-a2d8-43de1cb1da8e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Anschluss von Komponenten, speziell von unautorisierten, unbekannten Komponenten und Fremdgeräten, SOLLTE insbesondere an frei zugänglichen Ethernet-Ports, USB-Ports und anderen Schnittstellen der GA kontrolliert und eingeschränkt werden. Frei zugängliche Schnittstellen für temporäre Wartungszwecke, wie beispielsweise USB-Ports an GA-Komponenten, SOLLTEN nur bei Bedarf aktiviert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle nicht benötigten physischen Ports an GA-Komponenten werden softwareseitig im Switch oder im Betriebssystem des Geräts deaktiviert. Temporäre Freischaltungen für Wartungseinsätze müssen beantragt werden und werden nach einer festgelegten Zeit automatisch wieder deaktiviert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Switch-Konfigurationen, um die Deaktivierung ungenutzter Ports zu verifizieren. Einsicht in den Prozess zur temporären Freischaltung von Ports und Überprüfung der entsprechenden Tickets."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a11-m4",
                    "uuid": "1688a330-3fcd-49de-a68f-b8f20b82ef52",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für frei zugängliche LAN- oder WLAN-Zugänge SOLLTE eine Netzzugangskontrolle gemäß IEEE 802.1X oder vergleichbare Sicherheitsmechanismen eingesetzt werden. Der Anschluss einer unautorisierten oder unbekannten Komponente SOLLTE in die Ereignisprotokollierung aufgenommen werden. Eine direkte IP-basierte Kommunikation von solchen Komponenten mit Systemen der GA SOLLTE unterbunden werden."
                      },
                      {
                        "name": "guidance",
                        "value": "An allen frei zugänglichen Netzwerkdosen wird 802.1X mit Zertifikats- oder MAC-Adressen-basierter Authentifizierung aktiviert. Geräte, die sich nicht authentifizieren können, werden in ein Quarantäne-VLAN verschoben, das keinen Zugriff auf das produktive GA-Netz hat. Jeder fehlgeschlagene Authentifizierungsversuch wird protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Konfiguration des RADIUS-Servers und der Switches für 802.1X. Durchführung eines Tests durch Anschluss eines nicht autorisierten Geräts an einen Port. Prüfung der Systemprotokolle auf entsprechende Einträge. `test-command: Connect-TestDevice -Port 42; Get-FirewallLog -Filter 'quarantine-vlan'`"
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a11-m5",
                    "uuid": "cc584bfe-4c64-4c7d-ba89-0d722c73c422",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Anschluss unautorisierter Geräte wird nicht nur verhindert, sondern löst auch einen automatisierten Sicherheitsvorfall aus. Der betroffene Port wird sofort physisch gesperrt und eine Benachrichtigung an das Sicherheitsteam gesendet, die den genauen Standort des Ports enthält. Die Kommunikation im Quarantäne-Netz wird aktiv überwacht, um Angriffsversuche zu erkennen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Netzzugangskontroll-Lösung ist mit dem SIEM und einem SOAR-System integriert. Bei einem 802.1X-Fehlschlag wird der Switch-Port via Skript auf 'shutdown' gesetzt und ein Ticket mit der Port-Bezeichnung aus der Dokumentation erstellt. Im Quarantäne-VLAN ist ein Intrusion Detection System (IDS) aktiv."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Live-Test des gesamten Prozesses durch Anschluss eines nicht autorisierten Laptops. Überprüfung, ob der Port gesperrt wird und ob ein entsprechender Alarm und ein Ticket im SIEM/Ticketsystem generiert werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "efdaf1dc-14ef-44ef-a332-83d4277f7172",
                "control-id": "KONF.7.15",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a3-m1",
                    "uuid": "13cb54ef-6915-4380-838c-eb306bddc521",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anbindung von TGA-Anlagen an GA-Systeme erfolgt ohne definierte Sicherheitsregeln. Es wird nicht systematisch festgelegt, welche Aktionen ausgelöst werden dürfen, was zu unvorhersehbarem Verhalten führen kann."
                      },
                      {
                        "name": "guidance",
                        "value": "Systeme werden nach dem Prinzip 'was technisch funktioniert, wird verbunden' integriert. Eine Analyse der Ablauf- und Funktionsketten findet nicht statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Befragung der Administratoren, nach welchen Regeln TGA-Anlagen angebunden werden. Prüfung, ob Dokumentationen über erlaubte Interaktionen zwischen Systemen existieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a3-m2",
                    "uuid": "c6df3add-f0e3-440e-a32f-498c7a235969",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt grundlegende Festlegungen, welche TGA-Anlagen mit GA-Systemen interagieren dürfen. Die Anbindung wird jedoch nicht durch technische Maßnahmen abgesichert und die Ablaufketten werden nicht umfassend geplant oder getestet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Anbindung wird auf Netzwerkebene erlaubt, aber die erlaubten Aktionen auf Applikationsebene werden nicht eingeschränkt. Funktionstests beschränken sich auf den 'Happy Path'."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Einsicht in die Dokumentation der erlaubten Anbindungen. Überprüfung der Konfiguration von Koppelelementen, um festzustellen, ob Sicherheitsregeln implementiert sind. Prüfung der Testdokumentation."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a3-m3",
                    "uuid": "9693b28a-d446-4702-94cd-3f78f279e57a",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für alle TGA-Anlagen, GA-Systeme und GA-relevanten Komponenten MUSS festgelegt werden, ob durch andere Systeme Aktionen ausgelöst werden dürfen. Sowohl die Integration von TGA-Anlagen in ein GA-System als auch die rückwirkungsfreie Kopplung von TGA-Anlagen an GA-Systeme MÜSSEN angemessen abgesichert sein. Ebenfalls MUSS die Anbindung von GA-Systemen untereinander angemessen abgesichert werden. Hierzu MÜSSEN insbesondere die Ablauf- und Funktionsketten innerhalb eines GA-Systems bzw. zwischen GA-Systemen angemessen geplant und getestet werden. Die Festlegungen MÜSSEN vollumfänglich dokumentiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für jede Anbindung wird eine Interaktionsmatrix erstellt, die genau definiert, welches System welche Daten an welches andere System senden und welche Aktionen auslösen darf. Diese Regeln werden in den Koppelelementen (z.B. Gateways, Firewalls) technisch umgesetzt. Jede Anbindung durchläuft einen standardisierten Test- und Freigabeprozess."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Interaktionsmatrizen und der dazugehörigen Dokumentation. Überprüfung der Konfiguration der Koppelelemente, um die Umsetzung der definierten Regeln zu verifizieren. Einsicht in die Testprotokolle der Ablauf- und Funktionsketten."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a3-m4",
                    "uuid": "52a3f9f7-3dd0-42a0-84d7-f3c8581a01cc",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Falls eine Integration zulässig ist, SOLLTE reglementiert werden, welche automatisierten Aktionen durch welche Informationen eines GA-Systems ausgelöst werden dürfen. Die Ablauf- und Funktionsketten SOLLTEN umfassend getestet und bei Fehlverhalten nachjustiert werden. Die Dokumentation SOLLTE regelmäßig und ergänzend bei Bedarf geprüft werden, ob sie noch aktuell ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Regeln für automatisierte Aktionen werden detailliert spezifiziert, inklusive Schwellenwerten und Plausibilitätsprüfungen. Die Tests umfassen auch Fehlerszenarien (z.B. Ausfall einer Komponente, ungültige Daten). Die Dokumentation wird jährlich auf Aktualität geprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Spezifikation der automatisierten Aktionen. Einsicht in die Testpläne und -protokolle, insbesondere für Fehlerszenarien. Prüfung der Protokolle der jährlichen Dokumentationsreviews."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a3-m5",
                    "uuid": "2c16ebcf-f976-4f4f-8dab-42a14c0a4c0f",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die gesamte Kommunikation zwischen TGA-Anlagen und GA-Systemen wird in Echtzeit überwacht. Abweichungen von den definierten Ablauf- und Funktionsketten werden automatisch erkannt und gemeldet. Bei erkannten Abweichungen werden die betroffenen Interaktionen blockiert und ein Incident-Prozess ausgelöst. Die Testfälle werden automatisiert aus den Spezifikationen generiert und ausgeführt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine OT-Security-Monitoring-Lösung eingesetzt, die den Datenverkehr der GA analysiert und über Anomalieerkennung verfügt. Ein Security Orchestration, Automation and Response (SOAR)-System wird verwendet, um auf Alarme automatisiert zu reagieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Live-Demonstration des Monitoring-Systems und der automatischen Alarmierung. Prüfung eines simulierten Angriffs, um die Reaktion des SOAR-Systems zu verifizieren. `test-command: /usr/local/bin/ga-traffic-analyser --watch --alert-on-deviation`"
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}