{
  "component-definition": {
    "uuid": "2205cf5a-f4f8-4739-91a1-142dc0a92ca6",
    "metadata": {
      "title": "IND.2.1 Allgemeine ICS-Komponente - Benutzerdefiniert",
      "last-modified": "2025-11-14T19:05:36.832779+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "0b28dad8-c22f-4e8e-a19a-06d811179d60",
        "type": "software",
        "title": "IND.2.1 Allgemeine ICS-Komponente",
        "description": "This component represents the implementation of all controls for Baustein IND.2.1.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Eine ICS-Komponente ist eine elektronische Komponente, die eine Maschine oder Anlage steuert oder regelt. Sie ist damit Bestandteil eines industriellen Steuerungssystems (englisch Industrial Control System, ICS) oder allgemeiner einer Betriebstechnik (englisch Operational Technology, OT). Diese Komponenten können Speicherprogrammierbare Steuerungen (SPS) (englisch Programmable Logic Controller, PLC), Sensoren, Aktoren, eine Maschine oder andere Teile eines ICS sein.<BR>Aufgrund der im OT-Umfeld typischen hohen Verfügbarkeitsanforderungen und der oft extremen Umgebungsbedingungen wie Hitze oder Kälte, Staub, Vibration oder Korrosion wurden ICS-Komponenten schon immer als robuste Geräte mit hoher Zuverlässigkeit und langer Lebensdauer konstruiert.<BR>ICS-Komponenten werden normalerweise über Spezialsoftware des jeweiligen herstellenden Unternehmens konfiguriert bzw. programmiert. Das wird entweder über sogenannte Programmiergeräte z. B. als Anwendung unter Windows oder Linux oder über eine Engineering-Station durchgeführt, welche die Anwendungsprogramme in die Speicherprogrammierbaren Steuerungen lädt.<BR>Die Rolle des oder der Informationssicherheitsbeauftragten für den Bereich der industriellen Automatisierung wird je nach Art und Ausrichtung der Institution anders genannt. Eine weitere Bezeichnung neben ICS-Informationssicherheitsbeauftragte (ICS-ISB) ist auch Industrial Security Officer."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist die Absicherung aller Arten von ICS-Komponenten, unabhängig von herstellenden Unternehmen, Bauart, Einsatzzweck und -ort. Er kann für ein einzelnes Gerät oder ein aus mehreren Komponenten aufgebautes modulares Gerät verwendet werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein IND.2.1 Allgemeine ICS-Komponente ist auf jede im Informationsverbund eingesetzte ICS-Komponente anzuwenden.<BR>Die Anforderungen sind für eine allgemeine ICS-Komponente erarbeitet. Für spezifischere ICS-Komponenten, z. B. Sensoren und Aktoren oder Maschinen, sind zusätzliche Bausteine wie IND.2.3 Sensoren und Aktoren bzw. IND.2.4 Maschine verfügbar. Dort sind Anforderungen beschrieben, die über die allgemeinen Anforderungen dieses Bausteins hinausgehen und zusätzlich umgesetzt werden müssen.<BR>Der Baustein enthält keine organisatorischen Anforderungen zur Absicherung einer ICS-Komponente. Dafür müssen die Anforderungen des Bausteins IND.1 Prozessleit- und Automatisierungstechnik umgesetzt werden."
          },
          {
            "name": "2.1. Unsichere Systemkonfiguration",
            "value": "Die Standardkonfiguration von ICS-Komponenten ist häufig darauf ausgelegt, dass die Komponenten korrekt funktionieren und sich leicht in Betrieb nehmen lassen. Sicherheitsmechanismen spielen dabei oft eine untergeordnete Rolle. So sind in der Standardeinstellung häufig alle Dienste, Protokolle und Anschlüsse eingeschaltet und bleiben aktiv, auch wenn sie nicht benutzt werden. Ebenso bleiben voreingestellte Berechtigungen häufig unverändert.<BR>Es ist für Angreifende leicht, diese ICS-Komponenten zu übernehmen und zu manipulieren. Ebenso ist es möglich, dass bei einem Angriff die unsichere Systemkonfiguration ausgenutzt wird, um die ICS-Komponente als Ausgangspunkt für weitere Angriffe zu nutzen. In der Folge können institutionskritische Informationen abfließen oder auch der gesamte Betrieb der Institution beeinträchtigt werden."
          },
          {
            "name": "2.2. Unzureichendes Benutzenden- und Berechtigungsmanagement",
            "value": "Einige ICS-Komponenten verfügen über ein eigenes Benutzenden- und Berechtigungsmanagement. Ist dieses unzureichend konzipiert, kann es passieren, dass Mitarbeitende gemeinsam Konten nutzen oder dass Berechtigungen von ausgeschiedenen Mitarbeitenden oder Dienstleistenden nicht gelöscht werden. Insgesamt können so unberechtigte Personen auf ICS-Komponenten zugreifen."
          },
          {
            "name": "2.3. Unzureichende Protokollierung",
            "value": "Bei ICS-Komponenten beschränkt sich die Protokollierung häufig auf prozessrelevante Ereignisse. Für die Informationssicherheit relevante Daten werden oft nicht aufgezeichnet. Dadurch lassen sich Sicherheitsvorfälle nur schwer detektieren und hinterher nicht mehr rekonstruieren."
          },
          {
            "name": "2.4. Manipulation und Sabotage einer ICS-Komponente",
            "value": "Die vielfältigen Schnittstellen von ICS-Komponenten führen zu einem erhöhten Manipulationsrisiko für IT-Systeme, die Software und übertragene Informationen. Je nach Motivation und Kenntnissen der Angreifenden kann sich das lokal, aber auch standortübergreifend auswirken. Zudem können Status- und Alarmmeldungen oder sonstige Messwerte unterdrückt oder verändert werden.<BR>Manipulierte Messwerte können Fehlentscheidungen von ICS-Komponenten bzw. des Bedienpersonals nach sich ziehen. Manipulierte Systeme können dazu genutzt werden, um andere Systeme oder Standorte anzugreifen oder um eine laufende Manipulation zu vertuschen."
          },
          {
            "name": "2.5. Einsatz unsicherer Protokolle",
            "value": "Die im Umfeld industrieller Steuerungsanlagen eingesetzten Protokolle bieten teilweise keine oder nur eingeschränkte Sicherheitsmechanismen. Technische Informationen wie Mess- und Steuerwerte werden häufig im Klartext und ohne Integritätssicherung oder Authentisierung übertragen. Dritte mit Zugang zum Übertragungsmedium können dann die Inhalte der Kommunikation auslesen und verändern oder Steuerbefehle einschleusen. So können Handlungen provoziert bzw. der Betrieb direkt beeinflusst werden. Ein Angriff auf Protokollebene ist auch dann möglich, wenn die ICS-Komponente ansonsten sicher konfiguriert ist und selbst keine Schwachstellen aufweist."
          },
          {
            "name": "2.6. Denial-of-Service-(DoS)-Angriffe",
            "value": "Angreifende können den Betrieb von ICS-Komponenten durch DoS-Angriffe beeinträchtigen. Bei Prozessen, die unter Echtzeitbedingungen ablaufen, kann bereits eine kürzere Störung zu Informations- oder Kontrollverlusten führen."
          },
          {
            "name": "2.7. Schadprogramme",
            "value": "Die Bedrohung durch Schadprogramme verschärft sich auch für industrielle Steuerungsanlagen immer mehr. Infektionsmöglichkeiten ergeben sich durch Schnittstellen zur Office-IT (vertikale Integration) und zur Außenwelt. Aber auch mobile Endgeräte wie Service-Notebooks oder Wechseldatenträger, die bei der Programmierung und Wartung von ICS-Komponenten eingesetzt werden, stellen eine Gefahr dar. Denn durch Letztere können Schadprogramme auch in isolierte Umgebungen eingebracht werden."
          },
          {
            "name": "2.8. Ausspionieren von Informationen",
            "value": "ICS-Komponenten enthalten häufig detaillierte Informationen über den geregelten oder überwachten Prozess bzw. Vorgang. Auch aus sonstigen übertragenen Werten wie Mess- oder Steuerungsdaten lassen sich diese Informationen teilweise rekonstruieren. Gleiches gilt für Steuerungsprogramme oder -parameter.<BR>Dritte könnten hier im Rahmen von Industriespionage an Geschäftsgeheimnisse gelangen, z. B. an Rezepte, Verfahren oder anderes geistiges Eigentum. Auch können sie Informationen über die Funktionsweise einer ICS-Komponente und ihre Sicherheitsmechanismen gewinnen, die sie für weitere Angriffe benutzen können."
          },
          {
            "name": "2.9. Manipulierte Firmware",
            "value": "Bei ICS-Komponenten lässt sich neben dem Anwendungsprogramm auch das Betriebssystem (Firmware) verändern. Dadurch kann manipulierte Software in das System gelangen. Die internen Speicher könnten durch ein kompromittiertes Programmiergerät, über eine lokale Datenschnittstelle (z. B. USB) oder über eine andere bestehende Netzverbindung von Angreifenden verändert werden. Ebenso könnte ein Software-Update auf dem Weg vom herstellenden Unternehmen zum Betreibenden manipuliert worden sein. Schließlich könnte eine ICS-Komponente mit bereits kompromittierter Firmware beim Betreibenden eintreffen, etwa bei manipulierter Lieferkette (englisch supply chain) oder einem Einkauf aus unsicheren Quellen. Angreifende erhalten dadurch die Möglichkeit, Prozesse und Abläufe zu verändern bzw. zu verfälschen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "78323352-6753-473f-b1b5-e8d19f039bb4",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/ot-systeme_profile.json",
            "description": "Implementation for all controls in Baustein IND.2.1",
            "implemented-requirements": [
              {
                "uuid": "9096c10d-0ee6-4b5a-b8d9-551708833f1f",
                "control-id": "ARCH.2.2.11",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a10-m3",
                    "uuid": "fa78cb86-d987-4e06-b90e-492a27a73a87",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In der GA SOLLTEN GA-Bereiche derart geplant und umgesetzt werden, dass Abhängigkeiten zwischen den GA-Bereichen minimiert werden und GA-Bereiche unabhängig gesteuert werden können. Eine Störung in einem GA-Bereich SOLLTE keine oder nur geringe Auswirkungen auf andere GA-Bereiche haben."
                      },
                      {
                        "name": "guidance",
                        "value": "Die GA-Architektur wird modular nach GA-Bereichen (z.B. pro Etage, pro Brandabschnitt, pro Mieter) aufgebaut. Jeder Bereich hat eine eigene, autarke Steuerung (Controller). Die Kommunikation zwischen den Bereichen wird auf das absolute Minimum beschränkt und über definierte Schnittstellen abgewickelt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Analyse der GA-Architekturpläne, um die Aufteilung in unabhängige Bereiche zu verifizieren. Prüfung der Konfiguration der Controller und Gateways, um die Kommunikationsbeschränkungen zwischen den Bereichen zu überprüfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a10-m4",
                    "uuid": "d3aee531-573d-488e-854f-abec4b163a8b",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Insbesondere SOLLTEN die Gebäude innerhalb eines Gebäudekomplexes oder einer Liegenschaft separat steuerbar sein. Die eingerichteten GA-Bereiche SOLLTEN auch im GA-Managementsystem entsprechend sichtbar sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Jedes Gebäude einer Liegenschaft hat ein komplett eigenständiges GA-System, das ohne Verbindung zu den anderen Gebäuden funktioniert. Im zentralen GA-Managementsystem (Leitstand) wird die Bereichsstruktur klar abgebildet, und die Rechtevergabe erfolgt bereichsbezogen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der GA-Architektur auf Liegenschaftsebene. Prüfung der Visualisierung und der Benutzerberechtigungen im GA-Managementsystem, um die separate Steuerbarkeit zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a10-m5",
                    "uuid": "7f3d7d1f-cb15-41b9-b024-4aa1446d8e98",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Unabhängigkeit der GA-Bereiche wird regelmäßig durch automatisierte Tests überprüft. Dabei wird der Ausfall eines Bereichscontrollers simuliert und verifiziert, dass die anderen Bereiche ungestört weiterfunktionieren. Die Ergebnisse dieser 'Chaos Engineering'-Tests werden zur kontinuierlichen Verbesserung der Architektur genutzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Testskripte entwickelt, die gezielt einzelne Controller oder Netzwerkverbindungen zwischen Bereichen deaktivieren. Monitoring-Systeme überwachen währenddessen die Funktion der übrigen Bereiche. Dieser Test wird quartalsweise in einem Wartungsfenster durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Einsicht in die Planung, Skripte und Protokolle der Ausfallsimulationstests. Analyse der Testergebnisse und der daraus abgeleiteten Verbesserungsmaßnahmen. `test-command: /usr/local/bin/ga-chaos-test --fail-area 'floor-7' --verify-others`"
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "b1af9336-baed-4518-889a-c66bdfea361e",
                "control-id": "ARCH.2.2.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a6-m1",
                    "uuid": "3c3e5ed3-baec-43ab-b761-f193ae15573d",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "GA-Netze und Büro-Netze sind nicht voneinander getrennt. Komponenten der Gebäudeautomation befinden sich im selben Netzwerk wie Büro-PCs und Server."
                      },
                      {
                        "name": "guidance",
                        "value": "Aus Bequemlichkeit oder Kostengründen werden GA-Komponenten einfach an den nächstgelegenen Switch des Büro-Netzes angeschlossen. Es gibt keine Segmentierung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Analyse eines Netzwerkscans oder der IP-Adressbereiche, um festzustellen, ob GA-Komponenten und Büro-Geräte im selben Subnetz betrieben werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a6-m2",
                    "uuid": "990ba8c9-1512-4eee-9c6b-0f623c24385a",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "GA-Netze sind von Büro-Netzen durch eine einfache Firewall getrennt, deren Regelwerk jedoch sehr pauschal und freizügig ist ('any-any'). Eine Kontrolle der Kommunikation findet nur unzureichend statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein GA-VLAN wurde eingerichtet und eine Firewall dazwischen geschaltet. Die Firewall-Regeln erlauben jedoch fast jegliche Kommunikation vom Büro-Netz in das GA-Netz, um die Funktionalität nicht zu beeinträchtigen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Review des Firewall-Regelwerks zwischen dem GA-VLAN und dem Büro-Netz. Prüfung auf übermäßig freizügige Regeln."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a6-m3",
                    "uuid": "234f3dd2-7ac9-4e8c-a7d6-9b5701fc20f7",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "GA-Netze MÜSSEN von Büro-Netzen und sonstigen Netzen der Institution mindestens logisch getrennt werden. Jegliche Kommunikation zwischen GA-Systemen und sonstigen IT-Systemen MUSS kontrolliert und reglementiert werden. Hierfür MÜSSEN an allen Übergängen einer solchen Segmentierung entsprechende Komponenten mit Sicherheitsfunktionen, mindestens mit Firewall-Funktion, vorgesehen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Das GA-Netz wird in einem eigenen VLAN oder einer Gruppe von VLANs betrieben. An den Übergängen zum Büro-Netz werden Firewalls mit einem restriktiven 'Default-Deny'-Regelwerk eingesetzt. Nur explizit definierte und notwendige Kommunikationsbeziehungen werden freigeschaltet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Netzwerkarchitektur auf logische Trennung (VLAN-Konzept). Review des Firewall-Regelwerks, um sicherzustellen, dass es auf dem 'Default-Deny'-Prinzip basiert und nur minimal notwendige Ports und Protokolle erlaubt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a6-m4",
                    "uuid": "2efd6eb7-6068-423c-8b21-bdc52a5e4c4f",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wird die GA für einen Gebäudekomplex oder eine Liegenschaft zentral eingerichtet, so MUSS die gebäudeübergreifende GA-Kommunikation über LAN-, WLAN-, WAN-, Funknetz- oder Internet-Verbindungen auch auf Ebene des Netzes separiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für die gebäudeübergreifende Kommunikation werden dedizierte WAN-Verbindungen oder sichere VPN-Tunnel mit starken Verschlüsselungs- und Authentifizierungsmechanismen verwendet. Diese Verbindungen werden ebenfalls durch restriktive Firewall-Regeln geschützt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Konfiguration der WAN-Verbindungen oder VPN-Tunnel. Review der Firewall-Regeln, die den Datenverkehr zwischen den Gebäuden regeln."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a6-m5",
                    "uuid": "648fa348-8247-4b88-8d0e-f88cb42283a2",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "GA-Netze werden physisch von allen anderen Netzen getrennt betrieben. An den wenigen, notwendigen Kopplungspunkten werden Application Layer Gateways oder Datendioden eingesetzt, um die Kommunikation auf das absolut notwendige Minimum zu beschränken und eine Protokollvalidierung durchzuführen."
                      },
                      {
                        "name": "guidance",
                        "value": "Das GA-Netz verwendet eine komplett eigene physische Infrastruktur (Switches, Kabel). Die Kopplung zum Büro-Netz erfolgt über eine demilitarisierte Zone (DMZ), in der ein Application Layer Gateway steht, das nur bestimmte Befehle des GA-Protokolls zulässt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Physische Inspektion der Netzwerkinfrastruktur, um die physische Trennung zu verifizieren. Detailliertes Review der Konfiguration des Application Layer Gateways in der DMZ. Durchführung von Penetrationstests, um die Wirksamkeit der Trennung zu überprüfen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "43f57019-166c-48e0-aa5c-6da535978638",
                "control-id": "KONF.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DOCS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a5-m1",
                    "uuid": "ae10cb9e-4757-42c5-b0ad-48ca44a3e392",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Dokumentation der GA ist nur für einzelne Komponenten oder Systeme vorhanden. Es gibt keinen Gesamtüberblick über alle Komponenten, Zugänge und deren Abhängigkeiten."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Dokumentation besteht meist aus Herstellerhandbüchern und unvollständigen Netzwerkplänen. Änderungen werden nicht nachdokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der GA-Dokumentation und Prüfung auf Vollständigkeit und Aktualität. Vergleich der Dokumentation mit der Realität an wenigen Stichproben."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a5-m2",
                    "uuid": "6ae007a9-a51d-4a69-b459-6218a4af8d55",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt eine grundlegende Dokumentation, die die meisten Komponenten und Zugänge der GA erfasst. Diese wird jedoch nicht regelmäßig geprüft oder bei Änderungen zeitnah angepasst."
                      },
                      {
                        "name": "guidance",
                        "value": "Es existiert ein zentraler Ordner mit der GA-Dokumentation, aber es gibt keinen festen Prozess, der sicherstellt, dass alle Änderungen (z.B. neue Geräte, geänderte Firewall-Regeln) dort eingepflegt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Einsicht in die zentrale Dokumentation. Vergleich der Dokumentation mit dem Ist-Zustand an mehreren Stellen, um die Aktualität zu bewerten. Befragung der Mitarbeiter zum Prozess der Dokumentationspflege."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a5-m3",
                    "uuid": "ab96782c-a2a6-43a5-b797-085d35161d6b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die GA MUSS die Vielzahl unterschiedlicher Komponenten und Zugänge dokumentiert werden. Insbesondere MÜSSEN auch alle deaktivierten physischen Kommunikationsschnittstellen, Protokolle und Zugänge bzw. Zugriffsmöglichkeiten zur GA dokumentiert werden. Darüber hinaus MÜSSEN alle Wechselwirkungen und Abhängigkeiten von GA-relevanten Komponenten sowie von TGA-Anlagen dokumentiert werden. Die Dokumentation MUSS regelmäßig und bei Änderungen innerhalb der GA geprüft und angepasst werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein umfassendes GA-Dokumentationskonzept erstellt, das Vorlagen für Netzwerkpläne, Komponentenlisten, Schnittstellenbeschreibungen und Abhängigkeitsmatrizen enthält. Jede Änderung an der GA muss über einen Change-Management-Prozess laufen, der eine Aktualisierung der Dokumentation zwingend vorschreibt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung des GA-Dokumentationskonzepts. Einsicht in die vollständige Dokumentation. Überprüfung von kürzlich durchgeführten Changes, um festzustellen, ob die dazugehörige Dokumentation angepasst wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a5-m4",
                    "uuid": "a4f9f7e6-7e08-41f6-926c-de0fef15134a",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die verfügbaren und genutzten Sicherheitseigenschaften der verwendeten Protokolle SOLLTEN dokumentiert werden. Die Dokumentation SOLLTE für alle GA-Systeme übergreifend hinsichtlich Inhalten und deren Datenstrukturen abgestimmt werden, um eine einfache, systemübergreifende Auswertung zu ermöglichen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Dokumentation wird in einer zentralen Datenbank (z.B. CMDB) oder einem Wiki mit standardisierten Vorlagen und Datenfeldern geführt. Für jedes Protokoll wird dokumentiert, welche Sicherheitsfunktionen (z.B. Verschlüsselung, Authentisierung) es bietet und ob diese aktiviert sind."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der CMDB oder des Wikis auf Konsistenz und Vollständigkeit. Stichprobenartige Überprüfung, ob die dokumentierten Sicherheitseigenschaften der Protokolle mit der tatsächlichen Konfiguration der Komponenten übereinstimmen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a5-m5",
                    "uuid": "5eb6af6c-1a4e-4ef0-9b30-e6f5c5f63bc0",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Dokumentation der GA wird durch automatisierte Inventarisierungs- und Scanning-Tools kontinuierlich erstellt und aktuell gehalten. Abweichungen zwischen der automatisch erfassten Realität und der Solldokumentation (z.B. aus dem BIM-Modell) werden automatisch gemeldet."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine OT-Asset-Management-Lösung wird eingesetzt, die das GA-Netzwerk passiv scannt, alle Geräte und ihre Konfigurationen erfasst und in die CMDB schreibt. Diese Daten werden regelmäßig gegen die Planungsdaten aus dem BIM-System validiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Live-Demonstration des automatisierten Inventarisierungstools. Überprüfung des Prozesses zur Meldung und Bearbeitung von Abweichungen. `test-command: /usr/local/bin/ga-asset-scan --discover --diff-to-cmdb`"
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "d5669081-9ce0-44a5-ba1d-b5f8bfa757f8",
                "control-id": "KONF.3.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a11-m2",
                    "uuid": "082f87e6-1ab4-4b96-a604-b8449e5505ce",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Frei zugängliche Ports (Ethernet, USB) an GA-Komponenten sind organisatorisch zur Deaktivierung vorgesehen, die Umsetzung wird aber nicht kontrolliert. Eine Netzzugangskontrolle ist nicht implementiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine Anweisung, ungenutzte Ports zu deaktivieren, aber es gibt keine technische Überprüfung. Temporär für Wartungszwecke aktivierte Ports werden oft vergessen und bleiben offen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Physische Inspektion von frei zugänglichen GA-Komponenten (z.B. in Fluren, öffentlichen Bereichen) und Prüfung, ob ungenutzte Ports aktiv sind. Anschließen eines Testgeräts, um die Netzwerkverbindung zu prüfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a11-m3",
                    "uuid": "313e31e5-cbd2-4c92-9327-374fe62f87ae",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Anschluss von Komponenten, speziell von unautorisierten, unbekannten Komponenten und Fremdgeräten, SOLLTE insbesondere an frei zugänglichen Ethernet-Ports, USB-Ports und anderen Schnittstellen der GA kontrolliert und eingeschränkt werden. Frei zugängliche Schnittstellen für temporäre Wartungszwecke, wie beispielsweise USB-Ports an GA-Komponenten, SOLLTEN nur bei Bedarf aktiviert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle nicht benötigten physischen Ports an GA-Komponenten werden softwareseitig im Switch oder im Betriebssystem des Geräts deaktiviert. Temporäre Freischaltungen für Wartungseinsätze müssen beantragt werden und werden nach einer festgelegten Zeit automatisch wieder deaktiviert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Switch-Konfigurationen, um die Deaktivierung ungenutzter Ports zu verifizieren. Einsicht in den Prozess zur temporären Freischaltung von Ports und Überprüfung der entsprechenden Tickets."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a11-m4",
                    "uuid": "9a06727f-f6f8-413a-9a84-d34c8a4292d7",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für frei zugängliche LAN- oder WLAN-Zugänge SOLLTE eine Netzzugangskontrolle gemäß IEEE 802.1X oder vergleichbare Sicherheitsmechanismen eingesetzt werden. Der Anschluss einer unautorisierten oder unbekannten Komponente SOLLTE in die Ereignisprotokollierung aufgenommen werden. Eine direkte IP-basierte Kommunikation von solchen Komponenten mit Systemen der GA SOLLTE unterbunden werden."
                      },
                      {
                        "name": "guidance",
                        "value": "An allen frei zugänglichen Netzwerkdosen wird 802.1X mit Zertifikats- oder MAC-Adressen-basierter Authentifizierung aktiviert. Geräte, die sich nicht authentifizieren können, werden in ein Quarantäne-VLAN verschoben, das keinen Zugriff auf das produktive GA-Netz hat. Jeder fehlgeschlagene Authentifizierungsversuch wird protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Konfiguration des RADIUS-Servers und der Switches für 802.1X. Durchführung eines Tests durch Anschluss eines nicht autorisierten Geräts an einen Port. Prüfung der Systemprotokolle auf entsprechende Einträge. `test-command: Connect-TestDevice -Port 42; Get-FirewallLog -Filter 'quarantine-vlan'`"
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a11-m5",
                    "uuid": "23e81fb0-daa5-4c5c-a40c-3bff7f32a4eb",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Anschluss unautorisierter Geräte wird nicht nur verhindert, sondern löst auch einen automatisierten Sicherheitsvorfall aus. Der betroffene Port wird sofort physisch gesperrt und eine Benachrichtigung an das Sicherheitsteam gesendet, die den genauen Standort des Ports enthält. Die Kommunikation im Quarantäne-Netz wird aktiv überwacht, um Angriffsversuche zu erkennen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Netzzugangskontroll-Lösung ist mit dem SIEM und einem SOAR-System integriert. Bei einem 802.1X-Fehlschlag wird der Switch-Port via Skript auf 'shutdown' gesetzt und ein Ticket mit der Port-Bezeichnung aus der Dokumentation erstellt. Im Quarantäne-VLAN ist ein Intrusion Detection System (IDS) aktiv."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Live-Test des gesamten Prozesses durch Anschluss eines nicht autorisierten Laptops. Überprüfung, ob der Port gesperrt wird und ob ein entsprechender Alarm und ein Ticket im SIEM/Ticketsystem generiert werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "f21abdc6-29d9-4d08-bd7d-e3415ac3a83a",
                "control-id": "KONF.6.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a3-m1",
                    "uuid": "8bd25573-5da1-445a-a9b0-1bbe44fc8462",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anbindung von TGA-Anlagen an GA-Systeme erfolgt ohne definierte Sicherheitsregeln. Es wird nicht systematisch festgelegt, welche Aktionen ausgelöst werden dürfen, was zu unvorhersehbarem Verhalten führen kann."
                      },
                      {
                        "name": "guidance",
                        "value": "Systeme werden nach dem Prinzip 'was technisch funktioniert, wird verbunden' integriert. Eine Analyse der Ablauf- und Funktionsketten findet nicht statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Befragung der Administratoren, nach welchen Regeln TGA-Anlagen angebunden werden. Prüfung, ob Dokumentationen über erlaubte Interaktionen zwischen Systemen existieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a3-m2",
                    "uuid": "96d35877-e0d4-43e8-9d84-a656236b5dbc",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt grundlegende Festlegungen, welche TGA-Anlagen mit GA-Systemen interagieren dürfen. Die Anbindung wird jedoch nicht durch technische Maßnahmen abgesichert und die Ablaufketten werden nicht umfassend geplant oder getestet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Anbindung wird auf Netzwerkebene erlaubt, aber die erlaubten Aktionen auf Applikationsebene werden nicht eingeschränkt. Funktionstests beschränken sich auf den 'Happy Path'."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Einsicht in die Dokumentation der erlaubten Anbindungen. Überprüfung der Konfiguration von Koppelelementen, um festzustellen, ob Sicherheitsregeln implementiert sind. Prüfung der Testdokumentation."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a3-m3",
                    "uuid": "b45c6e71-c962-48fc-92a2-b1f219b6ba02",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für alle TGA-Anlagen, GA-Systeme und GA-relevanten Komponenten MUSS festgelegt werden, ob durch andere Systeme Aktionen ausgelöst werden dürfen. Sowohl die Integration von TGA-Anlagen in ein GA-System als auch die rückwirkungsfreie Kopplung von TGA-Anlagen an GA-Systeme MÜSSEN angemessen abgesichert sein. Ebenfalls MUSS die Anbindung von GA-Systemen untereinander angemessen abgesichert werden. Hierzu MÜSSEN insbesondere die Ablauf- und Funktionsketten innerhalb eines GA-Systems bzw. zwischen GA-Systemen angemessen geplant und getestet werden. Die Festlegungen MÜSSEN vollumfänglich dokumentiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für jede Anbindung wird eine Interaktionsmatrix erstellt, die genau definiert, welches System welche Daten an welches andere System senden und welche Aktionen auslösen darf. Diese Regeln werden in den Koppelelementen (z.B. Gateways, Firewalls) technisch umgesetzt. Jede Anbindung durchläuft einen standardisierten Test- und Freigabeprozess."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Interaktionsmatrizen und der dazugehörigen Dokumentation. Überprüfung der Konfiguration der Koppelelemente, um die Umsetzung der definierten Regeln zu verifizieren. Einsicht in die Testprotokolle der Ablauf- und Funktionsketten."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a3-m4",
                    "uuid": "46e9ed7d-bc1e-43dd-b520-efeb4fef41fe",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Falls eine Integration zulässig ist, SOLLTE reglementiert werden, welche automatisierten Aktionen durch welche Informationen eines GA-Systems ausgelöst werden dürfen. Die Ablauf- und Funktionsketten SOLLTEN umfassend getestet und bei Fehlverhalten nachjustiert werden. Die Dokumentation SOLLTE regelmäßig und ergänzend bei Bedarf geprüft werden, ob sie noch aktuell ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Regeln für automatisierte Aktionen werden detailliert spezifiziert, inklusive Schwellenwerten und Plausibilitätsprüfungen. Die Tests umfassen auch Fehlerszenarien (z.B. Ausfall einer Komponente, ungültige Daten). Die Dokumentation wird jährlich auf Aktualität geprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Spezifikation der automatisierten Aktionen. Einsicht in die Testpläne und -protokolle, insbesondere für Fehlerszenarien. Prüfung der Protokolle der jährlichen Dokumentationsreviews."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a3-m5",
                    "uuid": "bfe32596-1bd3-4582-b7ca-fa09aeeda565",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die gesamte Kommunikation zwischen TGA-Anlagen und GA-Systemen wird in Echtzeit überwacht. Abweichungen von den definierten Ablauf- und Funktionsketten werden automatisch erkannt und gemeldet. Bei erkannten Abweichungen werden die betroffenen Interaktionen blockiert und ein Incident-Prozess ausgelöst. Die Testfälle werden automatisiert aus den Spezifikationen generiert und ausgeführt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine OT-Security-Monitoring-Lösung eingesetzt, die den Datenverkehr der GA analysiert und über Anomalieerkennung verfügt. Ein Security Orchestration, Automation and Response (SOAR)-System wird verwendet, um auf Alarme automatisiert zu reagieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Live-Demonstration des Monitoring-Systems und der automatischen Alarmierung. Prüfung eines simulierten Angriffs, um die Reaktion des SOAR-Systems zu verifizieren. `test-command: /usr/local/bin/ga-traffic-analyser --watch --alert-on-deviation`"
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ca387de1-0faf-4fff-9a20-addda7ead41a",
                "control-id": "KONF.7.15",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.14.a4-m1",
                    "uuid": "7c11ecd5-80b3-4072-bea7-5774dbc8c09b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Gefahrenmeldeanlagen sind teilweise in GA-Systeme integriert, ohne dass die Rückwirkungsfreiheit sichergestellt ist. Die netztechnische Anbindung erfolgt über das allgemeine GA-Netz."
                      },
                      {
                        "name": "guidance",
                        "value": "Beispielsweise wird eine Brandmeldeanlage direkt mit der Klimasteuerung verbunden, um diese abzuschalten. Eine Fehlfunktion in der Klimasteuerung könnte theoretisch die Brandmeldeanlage beeinflussen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Netzwerk- und Systemarchitekturpläne, um die Art der Anbindung von Gefahrenmeldeanlagen (GMA) an die GA zu ermitteln."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a4-m2",
                    "uuid": "584977ed-be38-4193-8f29-452d4366b95c",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Gefahrenmeldeanlagen sind an GA-Systeme gekoppelt, aber die Rückwirkungsfreiheit ist nur konzeptionell vorgesehen und nicht technisch durchgesetzt. Die netztechnische Anbindung erfolgt logisch getrennt, aber nicht physisch."
                      },
                      {
                        "name": "guidance",
                        "value": "Die GMA befindet sich in einem eigenen VLAN, aber es wird kein Gateway mit Diode-Funktionalität verwendet. Die Kopplung ist als unidirektional dokumentiert, aber nicht technisch erzwungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Konfiguration der Netzwerkkomponenten (z. B. VLANs, Firewall-Regeln) zwischen GMA und GA."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a4-m3",
                    "uuid": "dcca80ae-bc63-4f90-8102-79c31d03e34f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Gefahrenmeldeanlagen inklusive Sicherheitsanlagen MÜSSEN rückwirkungsfrei an GA-Systeme gekoppelt werden. Sie DÜRFEN NICHT in ein GA-System integriert werden. Für die netztechnische Anbindung MÜSSEN physisch getrennte Netzkomponenten und physisch getrennte Segmente genutzt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Anbindung der GMA an die GA erfolgt über ein dediziertes Gateway, das nur eine unidirektionale Kommunikation von der GMA zur GA zulässt (z.B. eine Datendiode). Die GMA und ihre Anbindungskomponenten befinden sich in einem eigenen, physisch vom GA-Netz getrennten Netzwerksegment mit eigenen Switches."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Physische Inspektion der Netzwerkverkabelung und -komponenten zur Überprüfung der physischen Trennung. Überprüfung der Konfiguration und des Typs des verwendeten Gateways, um die Rückwirkungsfreiheit sicherzustellen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a4-m4",
                    "uuid": "1dc4af6b-01ca-4db9-abed-eba325b7c581",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Werden Funknetze zur Kopplung genutzt, MÜSSEN solche TGA-Anlagen als Primärnutzende für die verwendeten Frequenzbereiche festgelegt werden. Für die Kommunikation über Funknetze SOLLTEN zertifizierte Mechanismen genutzt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei Nutzung von Funk (z.B. für Rauchmelder) wird ein Frequenzband exklusiv für die GMA reserviert und bei der Bundesnetzagentur angemeldet. Es werden nur Funkprotokolle mit zertifizierter Sicherheit (z.B. nach VdS-Richtlinien) eingesetzt, die Verschlüsselung und Authentisierung bieten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Frequenzzuteilungsurkunde der Bundesnetzagentur. Einsicht in die Zertifikate der eingesetzten Funkkomponenten und -protokolle."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.14.a4-m5",
                    "uuid": "b9626248-3c83-4eea-8991-1ef4833f51fa",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Kommunikation von der GMA zur GA wird zusätzlich auf Integrität und Authentizität auf Applikationsebene geprüft. Jeglicher Versuch einer Kommunikation von der GA zur GMA wird aktiv blockiert und als schwerwiegender Sicherheitsvorfall gemeldet. Die physikalische Trennung wird durch manipulationssichere Gehäuse und plombierte Ports ergänzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Gateway zwischen GMA und GA prüft kryptografische Signaturen der ankommenden Meldungen. Die Firewall-Regeln am Gateway sind so konfiguriert, dass jeder Verbindungsversuch von der GA-Seite geloggt und an ein SIEM gemeldet wird. Die Netzwerkkomponenten des GMA-Netzes sind in verschlossenen Schränken untergebracht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Durchführung eines Penetrationstests, der versucht, die Rückwirkungsfreiheit zu umgehen. Überprüfung der SIEM-Logs auf Alarmmeldungen bei einem simulierten Angriffsversuch. Physische Inspektion der Sicherheitsmaßnahmen an den Netzwerkkomponenten. `test-command: nmap -sS <GMA-Gateway-IP> --source-port 12345 --reason`"
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}