{
  "component-definition": {
    "uuid": "c8856f93-ea1d-4e2d-9ffe-619094c1fdac",
    "metadata": {
      "title": "OPS.3.2 Outsourcing - Benutzerdefiniert",
      "last-modified": "2025-11-22T12:46:06.063348+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "dc69cc62-7f7f-4762-bfeb-04335f53dd9f",
        "type": "policy",
        "title": "OPS.3.2 Outsourcing",
        "description": "This component represents the implementation of all controls for Baustein OPS.3.2.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Beim Outsourcing lagern Institutionen (Nutzende von Outsourcing) Geschäftsprozesse oder Tätigkeiten ganz oder teilweise zu einem oder mehreren externen Dienstleistungsunternehmen (Anbietende von Outsourcing) aus. Diese sogenannten Anbietende von Outsourcing betreiben im Rahmen des vereinbarten Outsourcing-Verhältnisses die Geschäftsprozesse oder Tätigkeiten nach festgelegten Kriterien. Allerdings verbleibt die Verantwortung aus Sicht der Informationssicherheit stets bei der auslagernden Institution.<BR>Outsourcing kann die Nutzung und den Betrieb von Hard- und Software betreffen, wobei die Leistung in den Räumlichkeiten der Auftraggebenden oder in einer externen Betriebsstätte der Anbietenden von Outsourcing erbracht werden kann. Typische Beispiele des klassischen \"IT-Outsourcings\", worauf sich dieser Baustein bezieht, sind der Betrieb eines Rechenzentrums, einer Applikation oder einer Webseite. Outsourcing ist ein Oberbegriff, der oftmals durch weitere Begriffe konkretisiert wird, wie Hosting, Housing oder Colocation.<BR>Ein Outsourcing-Verhältnis betrifft neben den ursprünglichen Nutzenden und Anbietenden von Outsourcing in vielen Fällen weitere, den Anbietenden von Outsourcing nachgelagerte, Sub-Dienstleistende. Werden Teile von Geschäftsprozessen oder Tätigkeiten von Anbietenden von Outsourcing weiter an Sub-Dienstleistende verlagert, so werden die von Nutzenden ausgelagerten Geschäftsprozesse oder Tätigkeiten weiter fragmentiert. Dies wirkt sich auf die Komplexität der Outsourcing-Kette aus, woraus eine schwindende Transparenz für die Nutzenden von Outsourcing folgt. Der Nachweis, dass die an die Anbietenden von Outsourcing gestellten Anforderungen erfüllt werden, erstreckt sich hierbei sowohl auf die Anbietenden von Outsourcing als auch auf die Sub-Dienstleistenden.<BR>Zur besseren Verständlichkeit wird in diesem Baustein der Begriff \"Prozess\" stellvertretend für Geschäftsprozess, Tätigkeit oder Komponente verwendet, die ausgelagert wird."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es, die Grundwerte der Informationssicherheit Vertraulichkeit, Integrität und Verfügbarkeit über den gesamten Lebenszyklus des Outsourcings durch die Anbietenden von Outsourcing sicherzustellen. Der Baustein soll dazu beitragen, dass die Anbietenden von Outsourcing gegenüber den Nutzenden von Outsourcing eine grundlegende Informationssicherheit gewährleistet. Mit Outsourcing ist dabei das klassische \"IT-Outsourcing\" gemeint.<BR>Die Anforderungen des Bausteins OPS.3.2 Anbieten von Outsourcing sollen dazu beitragen, dass potenzielle Gefährdungen aus der Dienstleistung der Anbietenden von Outsourcing nicht die Nutzenden von Outsourcing gefährden. Dementsprechend sind diese Risiken zu mindern und vorzubeugen."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein OPS.3.2 Anbieten von Outsourcing ist aus Sicht der Anbietenden auf jede oder jeden Nutzenden, der Dienstleistungen vom Anbietenden bezieht, einmal anzuwenden.<BR>Dabei bezieht sich der Baustein auf die Perspektive der Anbietenden von Outsourcing im Outsourcing-Verhältnis. Die Anforderungen des Bausteins stellen sicher, dass fundamentale Sicherheitsstandards gegenüber den Nutzenden von Outsourcing eingehalten werden und dazu beitragen, dass die Anforderungen der Nutzenden von Outsourcing an die Informationssicherheit über den gesamten Outsourcing-Prozess eingehalten werden können.<BR>Der Fall einer Weiterverlagerung wird in dem Baustein OPS.3.2 Anbieten von Outsourcing nur bedingt betrachtet, da dies ein weiteres Outsourcing-Verhältnis darstellt und somit die Anbietenden von Outsourcing den Baustein OPS.2.3 Nutzung von Outsourcing für diese Sub-Dienstleistenden modellieren müssen.<BR>Vom klassischen „IT-Outsourcing“ (wie dem Betrieb von Hard- und Software, Hosting, Housing usw.) abweichende Szenarien können mit dem Baustein OPS.3.2 Anbieten von Outsourcing mitunter nicht abschließend abgebildet werden und benötigen unter Umständen eine separate Risikoanalyse."
          },
          {
            "name": "2.1. Unzureichendes Informationssicherheitsmanagement bei Anbietenden von Outsourcing",
            "value": "Ein mangelhaftes Informationssicherheitsmanagement kann dazu führen, dass die Schutzziele der Informationssicherheit durch die Anbietenden von Outsourcing nur unzureichend eingehalten werden. Durch einen Outsourcing-Vertrag sind die Anbietenden von Outsourcing dafür zuständig, das erforderliche Niveau an Informationssicherheit für den Outsourcing-Prozess einzuhalten. Sollten die Anbietenden von Outsourcing ihrer Zuständigkeit nicht nachkommen, so kann dies zu einer Gefahr für alle am Outsourcing-Prozess beteiligten Institutionen führen."
          },
          {
            "name": "2.2. Unzureichendes Notfallmanagement der Anbietenden von Outsourcing",
            "value": "Wenn Störungen oder Notfälle bei Anbietenden von Outsourcing eintreten, kann dies zu einer Betriebsstörung führen, die auch die ausgelagerten Prozesse der Nutzenden von Outsourcing betreffen können und sich auf deren ordentlichen Geschäftsbetrieb auswirken. Insbesondere die Notfallvorsorge ist im Vorfeld von Not- und Krisensituation von entscheidender Bedeutung. Im Falle einer mangelhaften Notfallvorsorge kann für die Institution keine effektive Notfallbewältigung sichergestellt werden. Somit sind für die einzelnen Institutionen Störungen, Not- und Krisensituationen unter Umständen unkontrollierbar. Es kommt zu einem Kaskadeneffekt, der neben den Anbietenden von Outsourcing auch alle vor- und nachgelagerten Dienstleistenden sowie Kunden beeinträchtigt."
          },
          {
            "name": "2.3. Unzulängliche vertragliche Regelungen mit Nutzenden von Outsourcing",
            "value": "Unzulänglichkeiten in der Vertragsgestaltung können dazu führen, dass die Informationssicherheit von ausgelagerten Prozessen der Nutzenden von Outsourcing unzureichend abgesichert ist. Vertragliche Regelungen definieren den gesamten Outsourcing-Prozess und stellen die rechtliche Grundlage für Ansprüche der Anbietenden von Outsourcing gegenüber den Nutzenden von Outsourcing dar. Somit übertragen sich die Unzulänglichkeiten aus der Vertragsgestaltung auf den gesamten Outsourcing-Lebenszyklus. Dies ist verbunden mit einer Vielzahl an möglichen Gefährdungsszenarien mit finanziellen und gesellschaftlichen Auswirkungen für die Nutzenden sowie Anbietenden von Outsourcing."
          },
          {
            "name": "2.4. Schwachstellen bei der Anbindung Nutzender von Outsourcing",
            "value": "Die technische Anbindung der Nutzenden von Outsourcing an die Netze der Anbietenden von Outsourcing kann an den Schnittstellen zu technischen sowie organisatorischen Schwachstellen führen. Die technischen Schwachstellen in der Anbindung können zu Störungen, Datenverlust sowie zum Ausgangspunkt von IT-gestützte Angriffe führen. Dagegen können organisatorische Schwachstellen in Form von unbesetzten Schnittstellen zu Kommunikationsproblemen zwischen den Anbietenden und Nutzenden von Outsourcing führen. Diese können eine Gefahr für die Effizienz von Risikobewältigungsmaßnahmen in Not- und Krisensituationen darstellen."
          },
          {
            "name": "2.5. Abhängigkeit von Sub-Dienstleistenden",
            "value": "Werden Tätigkeiten von Anbietenden von Outsourcing an Sub-Dienstleistende weiter verlagert, besteht das Risiko, dass die Sub-Dienstleistenden ihre Positionen ausnutzen, um Forderungen durchzusetzen sowie Vorgaben der Vereinbarung zu missachten. Es entsteht eine Abhängigkeit von Dritten, um die Kundenleistung zu erbringen. Sollten die Anbietenden von Outsourcing nicht in der Lage sein, eine Störung oder Ausfall der Sub-Dienstleistenden zu kompensieren, besteht eine zwingende Abhängigkeit. Dies bringt die Sub-Dienstleistenden gegenüber den Anbietenden von Outsourcing in eine vorteilhafte Position. Die Sub-Dienstleistenden können davon absehen, die vertraglich geregelte Qualität sowie das festgelegte Niveau der Informationssicherheit einzuhalten. Dies beeinträchtigt das Outsourcing-Verhältnis mit den Nutzenden von Outsourcing und bedeutet für die Anbietenden von Outsourcing rechtliche und finanzielle Auswirkungen sowie einen Reputationsverlust."
          },
          {
            "name": "2.6. Ungeeignete Konfiguration und Verwaltung von Zutritts-, Zugangs- und Zugriffsrechten",
            "value": "Eine entweder ungeeignete oder unzureichende Konfiguration eines zentralen Verzeichnisdienstes kann dazu führen, dass Nutzende Rechte erhalten, die sie potenziell dazu befähigen auf sensible oder personenbezogene Daten der Anbietenden von Outsourcing oder anderer Kunden des Anbietenden von Outsourcing zuzugreifen. Unter Umständen erfordern Outsourcing-Vorhaben, dass Nutzende von Outsourcing auf den Informationsverbund der Anbietenden von Outsourcing zugreifen müssen. Dies ist mit entsprechenden Rechten für Zutritt-, Zugang- und Zugriff verbunden, die ein Risiko für die IT-Systeme, Informationen sowie Gebäude darstellen. Eine Folge ist, dass die Integrität und Vertraulichkeit dieser Daten gefährdet sind. Letztlich kann dies dazu führen, dass Vertragsstrafen von den Nutzenden von Outsourcing gegenüber den Anbietenden von Outsourcing geltend gemacht werden sowie ein Reputationsverlust für die Anbietenden von Outsourcing sowie ihre Kunden eintreten kann."
          },
          {
            "name": "2.7. Unzureichende Mandantenfähigkeit bei Anbietenden von Outsourcing",
            "value": "Anbietende von Outsourcing haben in der Regel unterschiedliche Kunden, die auf die gleichen Ressourcen wie IT-Systeme, Netze oder Personal zurückgreifen. Sind IT-Systeme und Daten der Nutzenden von Outsourcing unzureichend voneinander getrennt und abgesichert, besteht die Gefahr, dass Nutzende auf die Bereiche anderer Nutzender zugreifen und unberechtigt auf Daten zugreifen können. Dies stellt einen unmittelbaren Verstoß gegen die Vertraulichkeit der jeweiligen Daten der Nutzenden dar. Insbesondere ist dies problematisch bei Nutzenden von Outsourcing, die im Wettbewerb miteinander stehen. Die Auswirkungen wären Reputationsverlust für die Anbietenden von Outsourcing sowie rechtliche Folgen durch die geschädigten Nutzenden von Outsourcing."
          },
          {
            "name": "2.8. Kontroll- und Steuerungsverlust bei der Weiterverlagerung an Sub-Dienstleistende",
            "value": "Ausgelagerte Prozesse werden von Anbietenden von Outsourcing unter Umständen im Rahmen einer Weiterverlagerung vollständig oder partiell an Sub-Dienstleistende weitergegeben. Eine unzureichende Kontrolle der Sub-Dienstleistenden führt dazu, dass vereinbarte Aspekte der Informationssicherheit von Sub-Dienstleistenden unzureichend eingehalten werden. Dies hat im weiteren Verlauf Konsequenzen für das Outsourcing-Verhältnis mit den Nutzenden von Outsourcing sowie unmittelbare finanzielle Auswirkungen und Reputationsverluste für die Anbietenden von Outsourcing zur Folge."
          },
          {
            "name": "2.9. Unzulängliche Regelungen für eine geplante oder ungeplante Beendigung eines Outsourcing-Verhältnisses",
            "value": "Unzulängliche Regelungen für das Ende eines Outsourcing-Verhältnisses können dazu führen, dass Hardware sowie Daten abschließend nicht ordnungsgemäß an die Nutzenden von Outsourcing übergeben oder übermittelt werden. Hinzu kommt, dass vorhandene Kundendaten nicht nach Speicherfrist der einschlägigen Gesetze und Vorschriften ordnungsgemäß gelöscht werden. Ein Outsourcing-Verhältnis kann durch eine ordentliche Kündigung sowie durch außerordentliche Gründe beendet werden. Exemplarisch hierfür ist eine Insolvenz von Anbietenden von Outsourcing. Die Anbietenden von Outsourcing schützen unter Umständen nach der Vertragsauflösung die vorhandenen Daten der Nutzenden von Outsourcing nicht angemessen gemäß des Schutzbedarfs des jeweiligen Eigentümers. Die Daten können in die Hand Dritter gelangen und bei Veröffentlichung zu Reputationsverlust führen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "f6af1347-c02d-458c-80e2-c058ab25a315",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Kompendien/Grundschutz%2B%2B-Kompendium/profile/outsourcing_profile.json",
            "description": "Implementation for all controls in Baustein OPS.3.2",
            "implemented-requirements": [
              {
                "uuid": "35bd4f03-8422-47d9-b520-a60aee7b5fa2",
                "control-id": "BES.3.2.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DLS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ops.3.2.a7-m1",
                    "uuid": "addefd9e-ce70-4289-9919-7c487aafdc2a",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Anbieter ist sich des Risikos eines Ausfalls eines kritischen Sub-Dienstleisters bewusst, hat aber keine konkreten alternativen Dienstleister evaluiert oder vertraglich gebunden. Es besteht eine vollständige Abhängigkeit von einem einzelnen Sub-Dienstleister."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Falle eines Ausfalls des Sub-Dienstleisters müsste eine Suche nach einem Ersatz erst beginnen, was zu langen Ausfallzeiten für den Endkunden führen würde. Dieses Risiko wird nicht proaktiv gemanagt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer identifiziert im Gespräch mit dem Management die kritischen Sub-Dienstleister und fragt nach den Plänen für den Fall eines Ausfalls. Es wird festgestellt, dass keine alternativen Anbieter oder Ausweichpläne existieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a7-m2",
                    "uuid": "170c14b3-df47-4fe1-b4b0-60f6c5ca5d70",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alternative Sub-Dienstleistende für kritische Prozesse wurden identifiziert und eine erste Kontaktanbahnung hat stattgefunden. Es bestehen jedoch keine formalen Vereinbarungen, Verträge oder technische Pläne für einen schnellen Wechsel."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Liste potenzieller Ersatz-Dienstleister wird im Einkauf oder im Risikomanagement geführt. Es gibt jedoch keine Garantie, dass diese im Notfall verfügbar wären oder die technischen Anforderungen erfüllen könnten. Ein Wechsel wäre ein langwieriges Projekt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Liste der identifizierten Alternativanbieter. Durch Nachfrage wird festgestellt, dass keine vertraglichen Regelungen (z.B. Rahmenverträge) oder technischen Migrationspläne existieren, die einen geordneten Übergang ermöglichen würden."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a7-m3",
                    "uuid": "beb9c076-249f-4c54-899a-e8d6696da573",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Werden Prozesse von Anbietenden von Outsourcing weiter an Sub-Dienstleistende verlagert, SOLLTEN die Anbietenden von Outsourcing mehrere qualifizierte Sub-Dienstleistende zur Verfügung haben, falls Sub-Dienstleistende ausfallen oder kündigen. Dies SOLLTE gemeinsam mit den Nutzenden von Outsourcing dokumentiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für jeden kritischen Sub-Dienstleister wird mindestens ein qualifizierter Alternativanbieter identifiziert und einer Eignungsprüfung unterzogen. Die Existenz dieser Alternative und die grundsätzliche Strategie für einen Wechsel werden in der Dokumentation für den Kunden (z.B. im Sicherheitskonzept) festgehalten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft das Sub-Dienstleister-Register und die zugehörige Risikobewertung. Für jeden als kritisch eingestuften Dienstleister wird verifiziert, ob ein qualifizierter Alternativanbieter dokumentiert ist. Die Dokumentation, die dem Kunden zur Verfügung gestellt wird, wird auf entsprechende Vermerke geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a7-m4",
                    "uuid": "197d2e9c-b71f-4fbb-ab28-b755541f26a1",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Mit mindestens einem alternativen Sub-Dienstleister für jede kritische Dienstleistung besteht ein Rahmen- oder Standby-Vertrag. Ein technischer Migrationsplan für den Wechsel wurde entwickelt und wird regelmäßig auf seine Aktualität überprüft. Die wesentlichen Schritte des Plans werden in einer Table-Top-Übung durchgespielt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Rahmenvertrag sichert zu, dass der alternative Anbieter im Notfall Kapazitäten bereithält. Der Migrationsplan beschreibt die technischen Schritte, Datenformate, Verantwortlichkeiten und den Zeitplan für einen Wechsel. Jährlich wird in einem Workshop geprüft, ob der Plan noch zu den aktuellen Systemen passt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich den Rahmenvertrag mit dem alternativen Sub-Dienstleister und den technischen Migrationsplan vorlegen. Die Protokolle der regelmäßigen Überprüfungen oder Übungen werden eingesehen, um die Aktualität und Plausibilität des Plans zu bewerten."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a7-m5",
                    "uuid": "f3947404-2bb7-4d1a-b362-ace4dd47cb96",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine aktive Multi-Sourcing-Strategie ist etabliert. Die Dienstleistung ist so konzipiert, dass sie technologie-agnostisch ist und mit minimalem Aufwand zwischen mehreren vorqualifizierten Sub-Dienstleistern portiert werden kann (z.B. durch Nutzung von Containern und standardisierten APIs). Der Umschaltprozess ist weitgehend automatisiert und wird regelmäßig live getestet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Anwendung wird in Docker-Containern betrieben und nutzt offene Standards (z.B. S3-kompatiblen Speicher). Die Infrastruktur wird als Code (Terraform) verwaltet, wobei es für jeden der qualifizierten Anbieter ein eigenes Provider-Modul gibt. Ein jährlicher Failover-Test beinhaltet das Live-Deployment der Anwendung bei einem der Alternativanbieter."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Anwendungsarchitektur und die 'Infrastructure as Code'-Artefakte, um die Portabilität zu verifizieren. Die Protokolle der letzten Live-Failover-Tests werden eingesehen und auf Erfolg, Dauer und aufgetretene Probleme analysiert. (`terraform validate` für die verschiedenen Provider-Konfigurationen)."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "a20d339c-9f2d-4f80-8c7b-f15a1a77972d",
                "control-id": "BES.4.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DLS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ops.3.2.a2-m1",
                    "uuid": "b43a6deb-637d-49ee-b799-a9b01f23385c",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Anforderungen an die Informationssicherheit werden nur ad hoc und ohne standardisierte Grundlage in Verträge aufgenommen. Es existiert keine einheitliche Vertragsvorlage, und wichtige Aspekte wie Prüfungsrechte oder Regelungen zur Weiterverlagerung fehlen häufig."
                      },
                      {
                        "name": "guidance",
                        "value": "Verträge werden individuell vom Vertrieb oder Projektmanagement aufgesetzt. Sicherheitsklauseln werden nur eingefügt, wenn der Kunde diese explizit fordert. Es gibt kein zentrales Review durch eine Sicherheits- oder Rechtsabteilung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert eine Auswahl an Kundenverträgen und stellt fest, dass keine einheitlichen Sicherheitsklauseln verwendet werden. Das Fehlen von wesentlichen Regelungen (z.B. Auditrecht, Sub-Dienstleister) wird dokumentiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a2-m2",
                    "uuid": "3e5c510c-ba59-49d8-9b0d-ed282a7d4580",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert eine grundlegende Checkliste oder ein Textbaustein mit Sicherheitsanforderungen, dessen Verwendung in Verträgen empfohlen, aber nicht erzwungen wird. Eine einheitliche Vertragsvorlage wird nicht konsequent genutzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Rechts- oder Sicherheitsabteilung stellt einen Standard-Anhang zur Informationssicherheit zur Verfügung. Die Vertriebsmitarbeiter entscheiden jedoch im Einzelfall, ob und in welcher Form sie diesen verwenden. SLAs und Vertraulichkeitserklärungen werden oft als separate, unverbundene Dokumente gehandhabt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht mehrere Verträge mit der bereitgestellten Checkliste oder dem Textbaustein und stellt Abweichungen und inkonsistente Anwendung fest. Es wird geprüft, ob grundlegende Elemente wie SLAs und NDAs systematisch fehlen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a2-m3",
                    "uuid": "0ade0151-e6da-48da-b5aa-9b63baa5cb69",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Einheitliche Grundanforderungen an Outsourcing-Verträge MÜSSEN entwickelt werden. Diese MÜSSEN Aspekte der Informationssicherheit, Sicherheitsanforderungen der Nutzenden, den Umgang mit Weiterverlagerungen und das Recht der Nutzenden auf Prüfungen, Revisionen und Auditierungen beinhalten. Diese Grundanforderungen MÜSSEN in Vereinbarungen und Verträgen einheitlich umgesetzt werden. Mit den Nutzenden SOLLTE eine Verschwiegenheitserklärung, Vereinbarungen zum Informationsaustausch und Service-Level-Agreements vereinbart werden. Auf Basis der Grundanforderungen SOLLTE eine einheitliche Vertragsvorlage erstellt und für alle Outsourcing-Vorhaben genutzt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine von der Rechts- und Sicherheitsabteilung freigegebene, standardisierte Vertragsvorlage wird entwickelt, die alle geforderten Klauseln als festen Bestandteil enthält. Die Verwendung dieser Vorlage ist für alle neuen Outsourcing-Verträge verbindlich. Abweichungen erfordern einen formalen Genehmigungsprozess."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die offizielle Vertragsvorlage und den Prozess zu deren Anwendung vorlegen. Anschließend wird anhand einer Stichprobe von kürzlich geschlossenen Verträgen verifiziert, dass die Vorlage konsequent verwendet wurde und alle geforderten Regelungen (Sicherheit, Auditrecht, Sub-Dienstleister, SLAs) enthält."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a2-m4",
                    "uuid": "a8896c04-e158-4b85-879b-e177c6043eff",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die verbindliche Vertragsvorlage wird regelmäßig, mindestens jährlich, von der Rechts- und Sicherheitsabteilung auf Aktualität und Wirksamkeit überprüft und bei Bedarf an neue rechtliche oder technische Rahmenbedingungen angepasst. Der Prozess beinhaltet eine klare Regelung für die Nachverhandlung bestehender Verträge bei wesentlichen Änderungen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein jährlicher Review-Workshop mit Recht, Sicherheit und Vertrieb angesetzt, um die Vertragsvorlage zu prüfen. Änderungen werden über einen formellen Change-Management-Prozess dokumentiert und kommuniziert. Für Bestandsverträge gibt es eine Strategie, wie die neuen Standards bei der nächsten Vertragsverlängerung eingeführt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Protokolle und Ergebnisse der jährlichen Vertragsreviews. Es wird geprüft, ob identifizierter Anpassungsbedarf (z.B. durch neue Gesetze wie den DORA) zeitnah in die Vorlage eingearbeitet wurde. Die Umsetzung bei Vertragsverlängerungen wird stichprobenartig kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a2-m5",
                    "uuid": "78f5243b-9996-4b4e-81e7-14c051d40f5b",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der gesamte Vertragslebenszyklus wird durch ein Contract-Lifecycle-Management-System (CLM) unterstützt. Die Standardvorlage und alle Klauseln sind im System hinterlegt. Abweichungen von der Norm werden automatisch erkannt und lösen einen Eskalations- und Genehmigungsworkflow aus. Die Einhaltung von SLAs wird automatisiert überwacht und direkt mit den vertraglichen Vereinbarungen im CLM-System abgeglichen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein CLM-Tool wird implementiert und mit dem CRM-System (für Kundendaten) und dem Monitoring-System (für SLA-Daten) integriert. Rechtliche und sicherheitstechnische Freigaben erfolgen direkt im System. Das System generiert automatisch Berichte über Vertragseinhaltung und Risiken."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer erhält Lesezugriff auf das CLM-System. Es wird geprüft, ob die Workflows für die Vertragsgenehmigung korrekt konfiguriert sind. Anhand der Audit-Logs im System wird die korrekte Handhabung von Standardverträgen und Abweichungen nachvollzogen. Die automatisierte SLA-Überwachung wird durch die Analyse der Systemberichte verifiziert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "6f9335f7-e167-4818-a177-10b69903c0f5",
                "control-id": "BES.4.5.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ops.3.2.a4-m1",
                    "uuid": "6c8a964a-ccf5-4de4-b1d5-4b6e5f64ebcd",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Mandantentrennung ist nur auf einer Ebene, z.B. auf Netzwerkebene durch VLANs, implementiert. Eine Trennung auf Anwendungs- oder Datenbankebene fehlt oder ist unzureichend. Ein übergreifendes, schriftliches Konzept existiert nicht."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Trennung verlässt sich auf grundlegende Virtualisierungs- oder Netzwerkfunktionen. Innerhalb einer Anwendung, die von mehreren Mandanten genutzt wird, erfolgt die Trennung beispielsweise nur durch einen einfachen Filter in der Datenbankabfrage, was fehleranfällig ist."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Systemarchitektur und stellt fest, dass die Mandantentrennung nicht durchgängig über alle Schichten (Netzwerk, System, Anwendung, Daten) umgesetzt ist. Das Fehlen eines schriftlichen Konzepts wird als wesentlicher Mangel dokumentiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a4-m2",
                    "uuid": "cbb75837-1f73-420c-a5d7-98281223db86",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Mandantentrennung ist auf mehreren Ebenen (z.B. Netzwerk, separate VMs/Container) umgesetzt. Es fehlt jedoch ein formales, dokumentiertes Konzept, das alle Mechanismen detailliert beschreibt und die Unterscheidung zwischen mandantenspezifischen und mandantenübergreifenden Daten regelt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Trennung wird von den Systemadministratoren nach bestem Wissen und Gewissen umgesetzt. Die Konfigurationen sind vorhanden, aber ihre Begründung und das Zusammenspiel der verschiedenen Mechanismen sind nicht dokumentiert, was die Überprüfung und Wartung erschwert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert durch Einsicht in die Systemkonfigurationen, dass grundlegende Trennungsmechanismen existieren. Durch Interviews wird jedoch festgestellt, dass kein übergreifendes, schriftliches Konzept existiert, das als Soll-Vorgabe dient."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a4-m3",
                    "uuid": "b74a1f30-a411-4487-9165-2e9b1837dde1",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS ein Mandantentrennungskonzept erstellt und umgesetzt werden. Das Konzept MUSS sicherstellen, dass Daten und Verarbeitungskontexte verschiedener Nutzender ausreichend sicher getrennt werden. Dabei MUSS zwischen mandantenabhängigen und mandantenübergreifenden Daten und Objekten unterschieden werden. Es MUSS dargelegt werden, mit welchen Mechanismen die Mandanten getrennt werden. Die Mechanismen MÜSSEN ausreichend umgesetzt werden. Das Konzept MUSS den Nutzenden zur Verfügung gestellt werden und eine für den Schutzbedarf der Daten angemessene Sicherheit bieten."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein schriftliches Konzept wird erstellt, das die Architektur der Mandantentrennung auf allen relevanten Ebenen (physisch, Netzwerk, Virtualisierung, Betriebssystem, Datenbank, Anwendung) beschreibt. Es definiert klar, welche Ressourcen geteilt und welche dediziert sind und wie die logische Trennung durchgesetzt wird. Dieses Konzept ist Teil der Standarddokumentation, die an Kunden ausgehändigt wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft das Mandantentrennungskonzept auf Vollständigkeit, Schlüssigkeit und Angemessenheit für den Schutzbedarf der Kundendaten. Anschließend wird stichprobenartig überprüft, ob die im Konzept beschriebenen technischen und organisatorischen Maßnahmen in der produktiven Umgebung korrekt und wirksam umgesetzt sind. (`show running-config`, Datenbank-Schema-Analyse)."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a4-m4",
                    "uuid": "72d74dfb-f4bc-44da-b85e-9e9959c35eda",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Wirksamkeit des Mandantentrennungskonzepts und seiner Implementierung wird regelmäßig, mindestens jährlich, durch gezielte technische Prüfungen oder Penetrationstests verifiziert. Das Konzept umfasst detaillierte logische Trennungsmechanismen auf Anwendungs-, Datenbank- und Speicherebene."
                      },
                      {
                        "name": "guidance",
                        "value": "Einmal jährlich wird ein spezialisierter Penetrationstest beauftragt, dessen Ziel es ist, die Mandantengrenzen zu durchbrechen. Die Ergebnisse des Tests werden zur Verbesserung des Konzepts und der Implementierung genutzt. Alle Findings werden in einem Ticketsystem nachverfolgt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Berichte der letzten Penetrationstests zur Mandantentrennung. Es wird geprüft, ob die Tests einen angemessenen Umfang hatten und ob alle identifizierten Schwachstellen nachweislich und zeitnah behoben wurden. Der Prozess zur Beauftragung und Auswertung der Tests wird ebenfalls bewertet."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a4-m5",
                    "uuid": "e6eff252-548d-49a8-8972-689541b59db4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Mandantentrennung wird wo immer möglich durch kryptografische Mechanismen und hardwarebasierte Sicherheitstechnologien (z.B. Confidential Computing, HSMs für mandantenspezifische Schlüssel) durchgesetzt. Die korrekte Konfiguration und Wirksamkeit der Trennung wird durch automatisierte Systeme kontinuierlich überwacht und verifiziert."
                      },
                      {
                        "name": "guidance",
                        "value": "Cloud-native Technologien wie Confidential Containers (z.B. auf Basis von AMD SEV oder Intel TDX) werden eingesetzt, um die Laufzeitumgebungen der Mandanten zu isolieren. Jeder Mandant erhält eigene kryptografische Schlüssel in einem HSM, sodass eine Vermischung von Daten selbst auf Speicherebene ausgeschlossen ist. Konfigurations-Scanner prüfen permanent die Einhaltung der Trennungsregeln."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Architektur der hardwarebasierten Trennung und die Konfiguration der kryptografischen Kontrollen. Es wird die Funktionsweise der kontinuierlichen Konfigurationsüberwachung geprüft. Anhand von Audit-Logs des HSMs und der Confidential-Computing-Plattform wird die strikte Trennung der mandantenspezifischen Operationen verifiziert. Ein `terraform plan` oder `ansible --check` kann zur Überprüfung der deklarierten Konfiguration genutzt werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "7042745c-6dc3-49cf-937c-3e47fc6dfb5b",
                "control-id": "BES.4.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Treatment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ISGA",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ops.3.2.a1-m1",
                    "uuid": "e06ff1f9-9726-4cd2-b44f-6f5999d732a4",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Schutzziele der Informationssicherheit werden nur für ausgewählte, als besonders kritisch eingestufte Kunden oder nur teilweise (z. B. nur Verfügbarkeit) berücksichtigt. Gesetzliche oder regulatorische Anforderungen werden nur reaktiv bei expliziter Aufforderung durch den Kunden beachtet."
                      },
                      {
                        "name": "guidance",
                        "value": "In diesem Reifegrad erfolgt die Berücksichtigung der Schutzziele ad hoc und ist nicht in einem standardisierten Prozess verankert. Oft konzentriert sich die Umsetzung auf leicht zu erfüllende Aspekte, während komplexere Anforderungen wie Vertraulichkeit oder spezifische regulatorische Vorgaben vernachlässigt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch Stichproben bei verschiedenen Kundenverträgen fest, ob und in welchem Umfang Schutzziele und regulatorische Aspekte berücksichtigt wurden. Es wird geprüft, ob ein Muster erkennbar ist, das auf eine systematische Vernachlässigung bestimmter Schutzziele oder Kundengruppen hindeutet."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a1-m2",
                    "uuid": "c2d3b1a2-b7c4-46b3-b6c4-ba23cdf4c817",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Schutzbedarfskategorien Vertraulichkeit, Integrität und Verfügbarkeit werden bei allen Kunden grundsätzlich erfasst und dokumentiert. Die Einhaltung der Schutzziele basiert jedoch auf informellen Prozessen und dem individuellen Wissen der zuständigen Mitarbeiter."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Erfassung des Schutzbedarfs erfolgt typischerweise über eine einfache Checkliste im Onboarding-Prozess. Es gibt jedoch keinen formalen Prozess, der sicherstellt, dass die identifizierten Schutzziele systematisch in technische und organisatorische Maßnahmen überführt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, ob für alle Kunden eine Schutzbedarfsfeststellung dokumentiert ist. Anschließend wird durch Interviews mit Mitarbeitern und die Einsicht in Systemkonfigurationen geprüft, ob die dokumentierten Schutzziele nachvollziehbar umgesetzt wurden, auch wenn der Prozess informell ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a1-m3",
                    "uuid": "5fac4a4b-dd1a-4f30-a18e-8eb076aabfc1",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Schutzbedarf für Vertraulichkeit, Integrität und Verfügbarkeit von Nutzenden von Outsourcing MUSS im Outsourcing-Prozess berücksichtigt werden. Dabei MUSS sichergestellt werden, dass das von den Nutzenden von Outsourcing geforderte Minimum an Informationssicherheit eingehalten wird. Zudem MÜSSEN die geltenden regulatorischen und gesetzlichen Aspekte berücksichtigt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein definierter Prozess etabliert, um den Schutzbedarf jedes Kunden systematisch zu erfassen, zu dokumentieren und in konkrete Sicherheitsanforderungen zu überführen. Dieser Prozess ist wiederholbar und stellt sicher, dass alle relevanten Aspekte (Schutzziele, gesetzliche Vorgaben) konsistent behandelt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Prozessdokumentation zur Schutzbedarfsermittlung und -umsetzung. Anhand von mehreren Kundenbeispielen wird die korrekte Durchführung des Prozesses von der Anforderungserhebung bis zur Umsetzung und Überprüfung der Maßnahmen nachvollzogen. Die Dokumentation muss vollständig und konsistent sein."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a1-m4",
                    "uuid": "52029660-71a8-4b01-b6e0-5df3ed0b282a",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Prozess zur Einhaltung der Schutzziele ist formalisiert und wird regelmäßig, mindestens jährlich, gemeinsam mit dem Kunden überprüft und bei Bedarf angepasst. Es existiert ein strukturierter Prozess zur Überwachung von regulatorischen und gesetzlichen Änderungen, der proaktiv Anpassungen an den Sicherheitsmaßnahmen anstößt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Ergebnisse der regelmäßigen Überprüfungen mit den Kunden werden protokolliert und über ein Change-Management-System in die Sicherheitskonzepte eingesteuert. Für die Beobachtung der Rechtslage werden spezialisierte Feeds oder Dienstleister genutzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Protokolle der jährlichen Reviews mit Kunden sowie die Nachweise aus dem Prozess zur Rechtslagenüberwachung. Es wird verifiziert, dass identifizierte Änderungen an Schutzzielen oder rechtlichen Rahmenbedingungen nachweislich zu Anpassungen der Sicherheitsmaßnahmen geführt haben."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a1-m5",
                    "uuid": "dbb6eec9-d587-43d3-abc0-0b048c766f44",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der gesamte Prozess zur Steuerung der Informationssicherheit ist in ein zertifiziertes ISMS (z.B. nach ISO 27001) integriert. Das erreichte Sicherheitsniveau wird kontinuierlich mit automatisierten Werkzeugen überwacht (Continuous Controls Monitoring). Kunden erhalten über ein Portal Echtzeit-Einblick in die Einhaltung ihrer Schutzziele und relevanter Compliance-Vorgaben."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein GRC-Tool (Governance, Risk, Compliance) wird eingesetzt, um die Schutzziele der Kunden mit konkreten Kontrollen und deren Umsetzungsstatus zu verknüpfen. Automatisierte Scans und Agenten überprüfen Konfigurationen permanent gegen die definierten Soll-Werte. Das Kundenportal ist direkt an dieses System angebunden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert das gültige ISMS-Zertifikat. Die Funktionsweise des GRC-Tools und der automatisierten Überwachung wird überprüft, indem Testfälle (z.B. absichtliche Fehlkonfiguration) eingespielt und deren korrekte Erkennung und Alarmierung im System nachvollzogen werden. Die Korrektheit der im Kundenportal angezeigten Daten wird stichprobenartig validiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ea2a1bbe-cb3b-4b9a-99e0-8e30ea562dbc",
                "control-id": "BES.5.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Treatment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DOCS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ops.3.2.a5-m1",
                    "uuid": "293fa411-1c10-43f5-b98f-3d11975a9dfa",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert nur ein sehr allgemeines, hoch-abstraktes Sicherheitsdokument, das nicht auf die spezifischen Dienstleistungen und Technologien eingeht. Kundenspezifische Sicherheitsanforderungen werden nicht systematisch in einem Konzept erfasst."
                      },
                      {
                        "name": "guidance",
                        "value": "Oft handelt es sich um ein Marketingdokument, das allgemeine Sicherheitsaussagen trifft, aber keine konkreten, überprüfbaren Maßnahmen beschreibt. Es gibt keinen Prozess, um die Sicherheitsanforderungen eines neuen Kunden zu erfassen und zu dokumentieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, dass das vorgelegte Dokument den Charakter eines Sicherheitskonzepts verfehlt, da es keine detaillierten technischen und organisatorischen Maßnahmen beschreibt. Das Fehlen von kundenspezifischen Konzepten wird als Mangel bewertet."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a5-m2",
                    "uuid": "0cee4517-c6c0-4978-8804-25a4bb902046",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein allgemeines Sicherheitskonzept für die Dienstleistung existiert und beschreibt die grundlegenden Maßnahmen. Kundenspezifische Anforderungen werden als informelle Anhänge oder Notizen ergänzt, aber nicht in ein schlüssiges Gesamtsystem integriert. Überprüfungen der Umsetzung erfolgen ad hoc."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt ein Basis-Dokument, das von der Technikabteilung gepflegt wird. Wenn ein Kunde besondere Anforderungen hat, werden diese in einem separaten Dokument festgehalten. Es gibt jedoch keine Garantie, dass diese beiden Dokumente konsistent sind oder dass die Umsetzung der Maßnahmen regelmäßig überprüft wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das allgemeine Sicherheitskonzept und die kundenspezifischen Ergänzungen. Es werden Inkonsistenzen oder Widersprüche festgestellt. Es kann nicht nachgewiesen werden, dass die Umsetzung des Konzepts regelmäßig und systematisch geprüft wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a5-m3",
                    "uuid": "fc9137f6-d3ea-4da5-81e9-85f31b171179",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anbietenden von Outsourcing MÜSSEN für ihre Dienstleistungen ein Sicherheitskonzept erstellen. Für individuelle Outsourcing-Vorhaben MÜSSEN zusätzlich spezifische Sicherheitskonzepte erstellt werden, die auf den Sicherheitsanforderungen der Nutzenden basieren. Das Sicherheitskonzept der Anbietenden und dessen Umsetzung SOLLTE zu einem gesamten Sicherheitskonzept zusammengeführt werden. Anbietende und Nutzende MÜSSEN gemeinsam Sicherheitsziele erarbeiten und diese dokumentieren. Es MUSS außerdem eine gemeinsame Klassifikation für alle schutzbedürftigen Informationen erstellt werden. Darüber hinaus MÜSSEN die Anbietenden regelmäßig überprüfen, ob das Sicherheitskonzept umgesetzt wurde."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine modulare Struktur für Sicherheitskonzepte etabliert: Ein allgemeines Konzept beschreibt die Basis-Sicherheit für alle Kunden. Darauf aufbauend werden kundenspezifische Konzepte erstellt, die die individuellen Anforderungen und die gemeinsam erarbeiteten Sicherheitsziele dokumentieren. Ein definierter Prozess stellt die regelmäßige Überprüfung der Umsetzung sicher."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Existenz und Struktur des allgemeinen sowie eines beispielhaften kundenspezifischen Sicherheitskonzepts. Es wird kontrolliert, ob die Dokumentation der gemeinsam erarbeiteten Sicherheitsziele und der Klassifikation von Informationen vorliegt. Die Protokolle der regelmäßigen Überprüfungen der Umsetzung werden eingesehen und bewertet."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a5-m4",
                    "uuid": "eed0029b-86d2-4c36-8802-b4f4213915cb",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Sicherheitskonzept ist ein lebendes Dokument, das mindestens jährlich oder bei wesentlichen Änderungen formal überprüft und aktualisiert wird. Der Review-Prozess involviert alle relevanten Stakeholder, einschließlich des Kunden. Die Umsetzung der im Konzept beschriebenen Maßnahmen wird durch interne Audits verifiziert."
                      },
                      {
                        "name": "guidance",
                        "value": "Änderungen am Sicherheitskonzept werden über ein formales Change-Management-System gesteuert. Für die Überprüfung der Umsetzung wird ein jährlicher interner Auditplan erstellt und durchgeführt. Die Ergebnisse der Audits werden dem Management berichtet und fließen in den kontinuierlichen Verbesserungsprozess ein."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet den Auditplan und die Berichte der internen Audits zur Umsetzung des Sicherheitskonzepts. Es wird geprüft, ob die Audits alle wesentlichen Aspekte des Konzepts abdecken und ob die festgestellten Mängel nachverfolgt und behoben werden. Die Protokolle der jährlichen Reviews des Konzepts werden ebenfalls geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a5-m5",
                    "uuid": "0636ed0e-bc52-425c-9988-580e58f9a12c",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Sicherheitskonzept und der Status seiner Umsetzung werden in einem GRC-Tool (Governance, Risk, Compliance) verwaltet. Die Konformität mit dem Konzept wird durch automatisierte 'Policy as Code'-Mechanismen kontinuierlich überwacht. Abweichungen vom Soll-Zustand lösen automatische Alarme und, wo möglich, selbstheilende Aktionen aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Sicherheitsanforderungen werden als Code (z.B. mit Open Policy Agent) definiert und in die CI/CD-Pipeline integriert. Dadurch wird verhindert, dass nicht konforme Konfigurationen überhaupt erst in die Produktion gelangen. Laufende Systeme werden permanent gegen diese Policies geprüft. Das GRC-Tool aggregiert die Ergebnisse und stellt ein Live-Dashboard zum Konformitätsstatus bereit."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die in Code definierten Sicherheits-Policies und ihre Integration in die Entwicklungspipeline. (`opa test .` oder ähnliches). Es wird die Konfiguration der kontinuierlichen Überwachung geprüft und nachvollzogen, wie Abweichungen im GRC-Tool dargestellt und behandelt werden. Die Wirksamkeit wird durch einen Testfall (z.B. Commit einer non-konformen Konfiguration) verifiziert, der von der Pipeline korrekt blockiert werden muss."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "577937ce-aaec-4614-8883-b5050a4b3843",
                "control-id": "BES.5.6.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Treatment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DLS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ops.3.2.a3-m1",
                    "uuid": "c2b5f4b1-3c04-48da-a526-01364d011213",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Weitergabe von vertraglichen Verpflichtungen an Sub-Dienstleistende erfolgt nur für als kritisch erachtete Sub-Dienstleister. Für weniger kritische Dienstleister wird auf eine formelle Weitergabe der Bestimmungen verzichtet."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt keine systematische Klassifizierung von Sub-Dienstleistern. Die Entscheidung, ob Verpflichtungen weitergegeben werden, trifft der Einkauf oder das Projektmanagement fallbasiert und oft ohne Einbeziehung der Sicherheitsabteilung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die Liste der Sub-Dienstleister mit den Verträgen, die mit ihnen geschlossen wurden. Es wird festgestellt, dass Sicherheitsklauseln und andere Verpflichtungen aus den Kundenverträgen inkonsistent oder gar nicht an die Sub-Dienstleister weitergegeben wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a3-m2",
                    "uuid": "efff520f-d4be-4910-8269-1727279baa9a",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Verpflichtungen aus Kundenverträgen werden grundsätzlich an Sub-Dienstleistende weitergegeben, typischerweise durch einen Standard-Anhang zum Vertrag. Es gibt jedoch keinen Prozess, um die Einhaltung dieser Verpflichtungen durch den Sub-Dienstleister zu überprüfen."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Einkaufsabteilung liegt ein Standarddokument für Sub-Dienstleisterverträge vor, das die Weitergabe von Verpflichtungen regelt. Die Einhaltung wird jedoch nicht aktiv kontrolliert; man verlässt sich auf die vertragliche Zusage des Sub-Dienstleisters."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass die Verträge mit Sub-Dienstleistern die erforderlichen Klauseln zur Weitergabe der Verpflichtungen enthalten. Anschließend wird durch Nachfrage beim zuständigen Management festgestellt, dass keine Überprüfungsmechanismen (z.B. Audits, Anforderung von Nachweisen) implementiert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a3-m3",
                    "uuid": "7484c0e3-4efc-4a90-af42-c6a8face1b73",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Werden Prozesse von Anbietenden von Outsourcing weiter an Sub-Dienstleistende verlagert, MÜSSEN die vertraglichen Bestimmungen mit den Nutzenden von Outsourcing an die Sub-Dienstleistenden weitergegeben werden. Dies MUSS in den Verträgen mit den Sub-Dienstleistenden entsprechend festgelegt und durchgesetzt werden. Auf Nachfrage von Nutzenden von Outsourcing MÜSSEN diese Verträge vorgelegt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein Standardprozess für das Management von Sub-Dienstleistern etabliert. Dieser Prozess stellt sicher, dass alle relevanten Verpflichtungen aus den Kundenverträgen in die Verträge mit den Sub-Dienstleistern übernommen werden. Die Verträge enthalten eine Klausel, die dem Anbieter das Recht einräumt, die Einhaltung zu prüfen und dem Endkunden auf Anfrage Einblick in den Vertrag zu gewähren (ggf. in geschwärzter Form)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich den Prozess zum Sub-Dienstleister-Management vorlegen. Anhand eines Beispiels (z.B. ein Kunde mit hohem Schutzbedarf und ein daran geknüpfter Sub-Dienstleister) wird die Kette der Vertragsgestaltung nachvollzogen. Es wird geprüft, ob die Verpflichtungen konsistent weitergegeben wurden und ob die Verträge die geforderten Klauseln enthalten."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a3-m4",
                    "uuid": "040478b5-4897-4ea6-b73b-171473ee984f",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein formalisierter Prozess zur Überprüfung der Einhaltung der weitergegebenen Bestimmungen bei Sub-Dienstleistern ist etabliert. Dieser Prozess umfasst die regelmäßige Anforderung von Nachweisen (z.B. Zertifikate, Auditberichte) sowie, bei kritischen Sub-Dienstleistern, die Durchführung eigener Audits."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Sub-Dienstleister-Management-Prozess wird ein jährlicher Review-Zyklus definiert. Je nach Kritikalität des Sub-Dienstleisters werden spezifische Nachweise (z.B. ISO 27001-Zertifikat, SOC 2-Report, Ergebnisse von Penetrationstests) angefordert und bewertet. Die Ergebnisse werden dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Sub-Dienstleister-Register und die Dokumentation der durchgeführten Überprüfungen. Es wird stichprobenartig kontrolliert, ob für kritische Sub-Dienstleister aktuelle Nachweise vorliegen und ob diese plausibel bewertet wurden. Die Planung und Durchführung von Audits wird ebenfalls geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a3-m5",
                    "uuid": "5d2b30a2-1b48-450a-9575-a74498c69068",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein umfassendes 'Supply Chain Security Management'-Programm ist etabliert, das durch Werkzeuge unterstützt wird. Die Sicherheitslage der Sub-Dienstleister wird kontinuierlich oder in kurzen Abständen bewertet (z.B. durch Security-Rating-Dienste). Die Verträge erlauben eine kurzfristige Beendigung oder einen Wechsel, falls ein Sub-Dienstleister die Sicherheitsanforderungen nicht mehr erfüllt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein Security-Rating-Dienst abonniert, der kontinuierlich die externe Angriffsfläche der Sub-Dienstleister bewertet. Die Ergebnisse fließen in eine dynamische Risikobewertung ein. Unterschreitet ein Dienstleister einen definierten Schwellenwert, wird automatisch ein Eskalationsprozess gestartet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration und die Berichte des Security-Rating-Dienstes. Es wird geprüft, ob die definierten Schwellenwerte angemessen sind und ob der Eskalationsprozess bei deren Unterschreitung wie dokumentiert funktioniert. Anhand von Beispielen wird die Reaktion auf eine Verschlechterung des Ratings eines Sub-Dienstleisters nachvollzogen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "8f598fbe-5ff8-484f-9e28-51ae1742cbdd",
                "control-id": "BES.8.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DLS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "ops.3.2.a6-m1",
                    "uuid": "ad87c6f5-f1b1-400b-81ca-69b2875fff74",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert ein informeller Prozess zur Rückgabe von Kundendaten bei Vertragsende. Eine garantierte und dokumentierte sichere Löschung der verbleibenden Datenbestände findet nicht statt. Die systematische Entziehung von Zugriffsrechten wird vernachlässigt."
                      },
                      {
                        "name": "guidance",
                        "value": "Nach Vertragsende wird ein Export der Kundendaten erstellt und dem Kunden übergeben. Die produktiven Systeme werden abgeschaltet, aber die Backups, die Kundendaten enthalten, werden nicht gezielt gelöscht, sondern laufen mit der normalen Aufbewahrungsfrist aus. Benutzerkonten werden oft nur deaktiviert, nicht gelöscht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer befragt die zuständigen Mitarbeiter zum Offboarding-Prozess und stellt fest, dass dieser nicht formal dokumentiert ist. Es kann kein Nachweis über die sichere Löschung von Daten (z.B. Löschprotokoll) vorgelegt werden. Eine Prüfung der verwaisten Konten im System zeigt, dass Zugriffsrechte nicht konsequent entzogen wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a6-m2",
                    "uuid": "4f13ba14-96ca-4081-81a5-2e222303ffb2",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert eine grundlegende Offboarding-Checkliste, die die Rückgabe von Daten und die Löschung von Restdaten vorsieht. Der Prozess ist jedoch manuell, nicht durchgängig dokumentiert und es fehlt eine formale Verifizierung der erfolgreichen Löschung."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Administrator arbeitet nach Vertragsende eine Checkliste ab. Die Löschung der Daten auf den Speichersystemen wird durchgeführt, aber es wird kein detailliertes Protokoll erstellt, das die Löschung für jede einzelne Ressource nachweist. Die Überprüfung der Rechteentziehung ist Teil der Checkliste, aber die Umsetzung wird nicht doppelt kontrolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Offboarding-Checkliste. Anhand eines kürzlich beendeten Vertrags wird versucht, die Abarbeitung der Checkliste nachzuvollziehen. Es wird festgestellt, dass die Dokumentation lückenhaft ist und kein fälschungssicherer Nachweis für die sichere Löschung erbracht werden kann."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a6-m3",
                    "uuid": "1b2b68fd-6141-4355-b0fd-bb1bb2219a49",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MÜSSEN Regelungen getroffen werden, wie verfahren wird, wenn Outsourcing-Verhältnisse geplant oder ungeplant beendet werden. Es MUSS festgelegt werden, wie alle Informationen, Daten und Hardware der Nutzenden zurückgegeben werden. Anschließend MÜSSEN die verbleibenden Datenbestände nach Ablauf der gesetzlichen Vorgaben sicher gelöscht werden. Dies MUSS durch die Anbietenden dokumentiert werden. Ferner SOLLTE überprüft werden, ob die Zugangs-, Zutritts- und Zugriffsrechte für die Nutzenden aufgehoben wurden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein detaillierter und formalisierter Offboarding-Prozess wird definiert und dokumentiert. Dieser Prozess ist vertraglich verankert und beschreibt die Schritte zur Datenrückgabe, die Methoden zur sicheren Löschung (gemäß BSI- oder NIST-Standards) und die Prozedur zur Deaktivierung und Löschung aller zugehörigen Konten und Rechte. Jeder Schritt wird in einem Offboarding-Protokoll dokumentiert und von einer zweiten Person (Vier-Augen-Prinzip) gegengezeichnet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Prozessdokumentation für das Offboarding. Anhand der Offboarding-Protokolle von mehreren beendeten Verträgen wird die korrekte und vollständige Durchführung des Prozesses verifiziert. Insbesondere wird das Vorhandensein von Nachweisen zur sicheren Löschung und zur Deaktivierung der Zugriffsrechte kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a6-m4",
                    "uuid": "1a7dee6e-a26f-44f3-a42b-a15da4761a2c",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Exit-Prozess ist detailliert vertraglich mit dem Kunden vereinbart und umfasst einen genauen Plan für die Datenmigration, Zeitpläne und Verantwortlichkeiten. Die sichere Löschung der Daten wird durch ein technisches Verfahren nachgewiesen (z.B. Nachweis der Zerstörung kryptografischer Schlüssel) oder durch einen unabhängigen Dritten bestätigt."
                      },
                      {
                        "name": "guidance",
                        "value": "Für jeden Kunden wird bei Vertragsbeginn ein individueller Exit-Plan als Anhang zum Vertrag erstellt. Bei Vertragsende wird dieser Plan aktiviert. Für die Datenlöschung wird kryptografisches Löschen (Crypto-Shredding) eingesetzt, bei dem nur der Schlüssel vernichtet werden muss. Die Vernichtung des Schlüssels, z.B. in einem HSM, wird protokolliert und dient als Nachweis."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet den vertraglich vereinbarten Exit-Plan und vergleicht ihn mit dem tatsächlich durchgeführten Prozess. Das Protokoll der Schlüsselvernichtung aus dem HSM wird als Nachweis für die sichere Löschung geprüft. Alternativ wird der Bericht des unabhängigen Dritten eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "ops.3.2.a6-m5",
                    "uuid": "c8b7afec-1009-4968-b5c6-1d6b2d6a61ba",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der gesamte Offboarding-Prozess ist weitgehend automatisiert. Die Datenrückgabe erfolgt über vordefinierte, sichere Kanäle. Die Löschung der Daten und die Entziehung aller Identitäten und Zugriffsrechte werden durch einen automatisierten Workflow im IAM-System ausgelöst, sobald der Vertragsstatus auf 'beendet' gesetzt wird. Der Abschluss des Prozesses wird automatisch protokolliert und dem Kunden gemeldet."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Skript oder ein Runbook in einem Automatisierungstool (z.B. Ansible, Terraform) wird entwickelt, das alle Schritte des Offboardings durchführt: Datenexport, Zerstörung der mandantenspezifischen VMs/Container, Löschung der zugehörigen Schlüssel im KMS/HSM und Entfernung der Benutzerkonten und Gruppen aus dem IAM-System. Der Trigger für diesen Lauf ist die Statusänderung im CRM-System."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das Automatisierungsskript oder Runbook und verifiziert dessen Korrektheit und Vollständigkeit. (`ansible-lint`, `terraform validate`). Anhand der Ausführungsprotokolle des Automatisierungstools und der Audit-Logs der Zielsysteme (IAM, KMS, Cloud-Plattform) wird nachvollzogen, dass der Prozess für einen beendeten Vertrag vollständig und erfolgreich durchgelaufen ist."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}