{
  "component-definition": {
    "uuid": "18a7a205-df71-4ad6-8b85-6392cf82f6ea",
    "metadata": {
      "title": "INF.2 Serverräume - Benutzerdefiniert",
      "last-modified": "2025-11-14T19:05:39.275032+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "3e913129-842b-4e86-b951-cbb937ba3c23",
        "type": "physical",
        "title": "INF.2 Serverräume",
        "description": "This component represents the implementation of all controls for Baustein INF.2.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Heute werden fast alle strategischen und operativen Funktionen und Aufgaben durch Informationstechnik (IT) maßgeblich unterstützt oder sind ohne IT nicht ausführbar. Dadurch steigen die Anforderungen an die Leistungsfähigkeit und Verfügbarkeit der IT-Systeme und deren Anbindung an die Netzumgebung stetig. Um diesem Leistungsbedarf gerecht zu werden, um entsprechende Reserven vorzuhalten und um die IT auch wirtschaftlich betreiben zu können, konzentrieren Institutionen jeglicher Größe ihre IT-Landschaft in Rechenzentren.<BR><BR>Ein Rechenzentrum (RZ) ist wie folgt definiert:<BR>1. Hat eine IT-nutzende Institution nur einen zentralen IT-Betriebsbereich, ist dieser gemeinsam mit den erforderlichen Supportbereichen grundsätzlich immer wie ein RZ entsprechend dem Schutzbedarf zu behandeln. Unter „IT-Betriebsbereich“ sind Räume zu verstehen, in denen die Hardware aufgebaut ist und betrieben wird, die der Bereitstellung von Diensten und Daten dient. Das RZ umfasst neben dem IT-Betriebsbereich alle weiteren technischen Supportbereiche (z. B. Stromversorgung, Kälteversorgung, Löschtechnik, Sicherheitstechnik), die dem bestimmungsgemäßen Betrieb und der Sicherheit des IT-Betriebsbereichs dienen.<BR>2. Wird die IT der Institution innerhalb eines Gebäudes oder einer Liegenschaft verteilt in mehreren Bereichen betrieben und sind diese Bereiche untereinander und zu den IT-Benutzenden hin durch hauseigene LAN-Verbindungen angeschlossen, ist mindestens der funktional bedeutendste dieser Bereiche als RZ zu behandeln. Des Weiteren sind Bereiche, von deren ordnungsgemäßem Betrieb 50 % und mehr IT-Benutzenden abhängig sind oder aus denen heraus 50% und mehr an Diensten und Daten (gemessen an der Gesamtheit der Bereiche) bereitgestellt werden, als RZ zu behandeln.<BR>3. Ist die IT-nutzende Institution an mehreren räumlich voneinander getrennten Standorten angesiedelt und sind diese durch andere als hauseigene LAN-Verbindungen miteinander gekoppelt, ist jeder der Standorte entsprechend (1) separat zu betrachten und zu behandeln.<BR>4. Ein IT-Betriebsbereich, in dem für kritische Geschäftsprozesse (Prozesse, deren Störung oder Ausfall zu wesentlichen Beeinträchtigungen der Erledigung primärer Aufgaben einer Institution führen) erforderliche IT angesiedelt ist, ist immer als RZ zu behandeln, unabhängig von Größe oder Anteilsregeln aus Nummer (2).<BR>5. IT-Betriebsbereiche, aus denen heraus Dienste oder Dienstleistungen für Dritte erbracht werden, sind immer als Teil eines RZ zu betrachten. Dabei ist es unerheblich, ob dies gegen Entgelt erfolgt oder nicht.<BR>6. Besteht ein begründetes Interesse, einen IT-Betriebsbereich gemeinsam mit seinem Supportbereich abweichend von den vorgenannten Regelungen als Serverraum zu behandeln, ist dies samt den sich daraus ergebenden Reduzierungen von Sicherheitsanforderungen zu begründen.<BR><BR>Die Auflistung der sechs Punkte bedeutet nicht, dass alle Punkte gemeinsam erfüllt sein müssen, damit ein Bereich als Rechenzentrum betrachtet wird. Vielmehr werden verschiedene Möglichkeiten beschrieben, wann ein Bereich als RZ anzusehen ist. Weicht ein Rechenzentrum von dieser Definition ab, wird der betrachtete IT-Betriebsbereich als Serverraum bezeichnet. Diese Definition orientiert sich ausschließlich an der Bedeutung der IT-Struktur für die Aufgabenerfüllung der nutzenden Institution und steht damit im methodischen Einklang mit der DIN EN 50600.<BR><BR>Soll ein Serverraum abgesichert werden, können die Anforderungen dieses Bausteins entsprechend reduziert werden. Dies muss jedoch stichhaltig und nachvollziehbar begründet werden (6) und es müssen mindestens die Basis-Anforderungen umgesetzt werden."
          },
          {
            "name": "Zielsetzung",
            "value": "Dieser Baustein richtet sich einerseits an Institutionen, die ein Rechenzentrum betreiben und im Rahmen einer Revision prüfen möchten, ob sie geeignete Sicherheitsmaßnahmen umgesetzt haben. Andererseits kann der Baustein auch dazu benutzt werden, die Sicherheitsmaßnahmen abzuschätzen, die umgesetzt werden müssen, wenn die IT in einem Rechenzentrum zentralisiert werden soll. Das oberste Ziel der in diesem Baustein beschriebenen Anforderungen ist es, den sicheren Betrieb des Rechenzentrums zu gewährleisten."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein INF.2 Rechenzentrum sowie Serverraum ist auf jedes Rechenzentrum und jeden Serverraum anzuwenden.<BR><BR>Der vorliegende Baustein eignet sich nicht für kleine Informationsverbünde mit z. B. nur einem oder sehr wenigen Servern oder IT-Systemen. Ein Beispiel dafür ist eine kleine Institution mit wenigen IT-Arbeitsplätzen und einem Server, der in einem separaten Raum betrieben wird. In solchen Fällen genügt es oft, den Baustein INF.5 Raum sowie Schrank für technische Infrastruktur umzusetzen.<BR><BR>Anforderungen an Gebäude und die Verkabelung im Allgemeinen sind nicht Teil dieses Bausteins. Diese sind in den Bausteinen INF.1 Allgemeines Gebäude und INF.12 Verkabelung zu finden, die immer auf Räume und Gebäude bzw. die Verkabelung anzuwenden sind.<BR><BR>Um den Baustein überschaubar zu halten, wurde bewusst auf technische Details und planerische Größen verzichtet. Nähere Informationen liefern einschlägige Normen und weitere Veröffentlichungen des BSI."
          },
          {
            "name": "2.1. Fehlerhafte Planung",
            "value": "Wenn ein Rechenzentrum konzipiert und dabei nicht berücksichtigt wird, es gegen elementare Gefährdungen abzusichern, besteht ein sehr hohes Ausfallrisiko. So können z. B. Standortrisiken wie Luftverkehr, Erdbeben oder Hochwasser die Betriebssicherheit und Verfügbarkeit gefährden. Ebenso massiv kann es sich auf den Betrieb eines Rechenzentrums auswirken, wenn durch eine fehlerhafte Konzeptionierung nicht genügend Bandbreite verfügbar ist oder die Energieversorgung am gewählten Standort nicht ausreicht."
          },
          {
            "name": "2.2. Fehlende oder fehlerhafte Zutrittskontrollen",
            "value": "Fehlen Zutrittskontrollen oder sind diese unzureichend, erhöht sich die Gefahr, dass unberechtigte Personen das Rechenzentrum betreten und dort fahrlässig, z. B. aufgrund mangelnder Fachkenntnisse, oder vorsätzlich Schaden anrichten. Angreifende können so z. B. schützenswerte Daten entwenden, Geräte stehlen oder Server manipulieren. Unzureichende Zutrittskontrollen wirken sich somit auf die Verfügbarkeit, Vertraulichkeit und die Integrität von Daten und IT-Komponenten aus."
          },
          {
            "name": "2.3. Unzureichende Überwachung",
            "value": "Wird die im Rechenzentrum betriebene IT und Infrastruktur unzureichend überwacht und betreut, können Komponenten unbemerkt ausfallen. Dadurch wird eventuell die Verfügbarkeit und fehlerfreie Funktion des Rechenzentrums stark beeinträchtigt. Ausfälle treten zudem oftmals schleichend ein. Ohne eine aktive Überwachung könnten diese zu spät bemerkt werden. Es ist dann oft nicht mehr möglich, rechtzeitig zu reagieren."
          },
          {
            "name": "2.4. Unzureichende Klimatisierung im Rechenzentrum",
            "value": "IT-Komponenten benötigen bestimmte Betriebsbedingungen, um zuverlässig zu funktionieren. Auch setzen sie die von ihnen aufgenommene elektrische Leistung in zusätzliche Wärme um. Wenn in einem IT-Betriebsbereich die Temperatur, die Luftfeuchte oder der Schwebestoffanteil nicht innerhalb der von den Geräteherstellenden vorgegebenen Grenzwerte gehalten werden, kann dies dazu führen, dass technische Komponenten nicht mehr richtig funktionieren oder ausfallen."
          },
          {
            "name": "2.5. Feuer",
            "value": "Feuer ist zwar eine Gefahr, die eher selten eintritt. Entsteht aber tatsächlich ein Brand, hat dieser meist schwerwiegende Auswirkungen. Denn durch Feuer und Rauch können große Schäden entstehen. Während innerhalb des IT-Betriebsbereichs Elektrobrände die häufigste Ursache für Feuer sind, kann ein Feuer außerhalb des IT-Betriebsbereichs und insbesondere in Supportbereichen, wie der Energieversorgung (inklusive NEA und USV) oder der Klimaanlage, zahlreiche weitere Ursachen haben. Haben der IT-Betriebsbereich oder die Supportbereiche sowie andere Nachbarbereiche keinen oder nur einen unzureichenden Brandschutz, kann sich ein Feuer schnell ausbreiten. Zudem könnten außerhalb entstehende Brände auf das Rechenzentrum übergreifen."
          },
          {
            "name": "2.6. Wasser",
            "value": "Durch undichte Wasserleitungen, Hochwasser, Rohrbruch, defekte Sprinkler- oder Klimaanlagen kann Wasser in das Rechenzentrum eintreten. Hierdurch können Geräte beschädigt werden und nicht mehr funktionieren. Es kann auch ein Kurzschluss ausgelöst werden, durch den einzelne Bereiche des Rechenzentrums ausfallen oder ein Brand entstehen könnte."
          },
          {
            "name": "2.7. Fehlender oder unzureichender Einbruchschutz",
            "value": "Selbst wenn eine gut funktionierende Zutrittskontrolle eingerichtet ist, können unbefugte Personen in ein Rechenzentrum eindringen, sofern es nicht ausreichend vor Einbrüchen geschützt wird. Täter und Täterinnen könnten so z. B. IT-Komponenten stehlen oder manipulieren und an vertrauliche Informationen gelangen. Auch könnten sie die Geräte zerstören oder das Rechenzentrum insgesamt beschädigen."
          },
          {
            "name": "2.8. Ausfall der Stromversorgung",
            "value": "Wenn der Strom ausfällt, kann der Betriebsablauf eines Rechenzentrums und damit der Institution erheblich gestört werden. So sind bei einem Stromausfall eventuell die vom Rechenzentrum bereitgestellten IT-Services plötzlich nicht mehr erreichbar. Ebenso können Daten verloren gehen. Zudem ist es möglich, dass durch einen plötzlichen Stromausfall IT-Systeme, TK-Systeme oder Überwachungstechnik beschädigt werden."
          },
          {
            "name": "2.9. Verschmutzung",
            "value": "Staub und andere Verschmutzungen in einem Rechenzentrum können dazu führen, dass technische Komponenten (z. B. Lüfter) nicht mehr funktionieren. Durch Verschmutzungen verschleißen Geräte früher und fallen häufiger aus."
          }
        ],
        "control-implementations": [
          {
            "uuid": "e0ca8555-5795-4899-a248-08d23f1cdefb",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/serverrume_profile.json",
            "description": "Implementation for all controls in Baustein INF.2",
            "implemented-requirements": [
              {
                "uuid": "6ddcc713-db30-4f5e-bc5c-104b49159b6e",
                "control-id": "GEB.1.3.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BES",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a1-m1",
                    "uuid": "65dbe041-7b8c-4472-8dec-4ec002b4f2e3",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Nur grundlegende, informelle und meist undokumentierte Anforderungen an die Sicherheit des Rechenzentrums oder Serverraums existieren. Ein Konzept für Sicherheitszonen fehlt gänzlich oder wird nicht durchgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Anforderungen werden ad hoc im Gespräch festgelegt. Es gibt keine formale Dokumentation oder einen Genehmigungsprozess. Die Trennung von Bereichen wie Logistik und IT-Betrieb erfolgt willkürlich und ohne sicherheitstechnische Begründung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen, ob schriftliche und genehmigte Anforderungsdokumente für das Rechenzentrum existieren. Interviews mit dem Personal durchführen, um festzustellen, ob die Anforderungen bekannt und verstanden sind. Überprüfen, ob eine physische oder logische Zoneneinteilung erkennbar ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a1-m2",
                    "uuid": "c86bf815-c986-4d21-98ec-3845c17f5687",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die grundlegenden technischen und organisatorischen Anforderungen an das Rechenzentrum sind dokumentiert, aber oft generisch und nicht spezifisch auf den Schutzbedarf zugeschnitten. Eine einfache Einteilung in einen gesicherten IT-Bereich und einen ungesicherten Außenbereich ist vorhanden, aber eine feingranulare Zonierung fehlt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Dokument beschreibt allgemeine Vorgaben (z. B. 'der Raum muss gekühlt sein'). Dieses Dokument wird jedoch nicht regelmäßig überprüft oder aktualisiert. Der IT-Betriebsbereich ist durch eine verschlossene Tür gesichert, aber Support- und Logistikbereiche befinden sich im selben Sicherheitsbereich."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anfordern des Dokuments mit den RZ-Anforderungen. Prüfen, ob dieses Dokument den grundlegenden Betriebsanforderungen (Strom, Klima) gerecht wird. Begehung der Räumlichkeiten zur Prüfung der grundlegenden physischen Trennung zwischen dem IT-Bereich und öffentlichen Bereichen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a1-m3",
                    "uuid": "3c1a173e-1c9b-4e88-91cc-3eeb818b9629",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für ein Rechenzentrum MÜSSEN angemessene technische und organisatorische Vorgaben definiert und umgesetzt werden. Wenn ein Rechenzentrum geplant wird oder geeignete Räumlichkeiten ausgewählt werden, MÜSSEN auch geeignete Sicherheitsmaßnahmen unter Berücksichtigung des Schutzbedarfs der IT-Komponenten (insbesondere der Verfügbarkeit) mit geplant werden. Ein Rechenzentrum MUSS insgesamt als geschlossener Sicherheitsbereich konzipiert werden. Es MUSS zudem unterschiedliche Sicherheitszonen aufweisen. Dafür MÜSSEN z. B. Verwaltungs-, Logistik-, IT-Betriebs- und Support-Bereiche klar voneinander getrennt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Anforderungen werden in einem dedizierten Sicherheitskonzept für das Rechenzentrum formal dokumentiert. Dieses Konzept definiert klare Sicherheitszonen (z.B. Zone 1: Logistik, Zone 2: Support/Technikräume, Zone 3: IT-Betriebsraum) mit jeweils spezifischen Sicherheitsmaßnahmen für Zutritt, Brandschutz und Umgebungsbedingungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anfordern des RZ-Sicherheitskonzepts. Prüfen, ob das Konzept die Trennung von Verwaltungs-, Logistik-, IT-Betriebs- und Support-Bereichen vorsieht. Bei einer Begehung verifizieren, ob die im Konzept definierten Zonen physisch umgesetzt und die Trennung wirksam ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a1-m4",
                    "uuid": "5c04dfdc-6200-4044-9ed1-65e801563aaf",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die definierten Anforderungen werden formal überprüft, versioniert und sind direkt an die Business-Continuity-Pläne der Institution gekoppelt. Für Serverräume SOLLTE geprüft werden, ob unterschiedliche Sicherheitszonen eingerichtet werden können. Das Zonenkonzept ist detailliert ausgearbeitet und berücksichtigt auch die Schutzwirkung der baulichen Hülle der jeweiligen Zonen."
                      },
                      {
                        "name": "guidance",
                        "value": "Das RZ-Sicherheitskonzept wird jährlich oder bei wesentlichen Änderungen überprüft und durch die Leitungsebene genehmigt. Für Serverräume wird eine Risikoanalyse durchgeführt, um zu entscheiden, ob eine Unterteilung in verschiedene Zonen (z.B. für kritische vs. unkritische Systeme) sinnvoll ist. Die Widerstandsklassen der Türen und Wände zwischen den Zonen sind dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen der Genehmigungs- und Revisionshistorie des RZ-Sicherheitskonzepts. Einsicht in die Risikoanalyse für Serverräume nehmen, falls vorhanden. Überprüfen, ob die dokumentierten Widerstandsklassen der Bauelemente zwischen den Zonen plausibel sind und den Anforderungen entsprechen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a1-m5",
                    "uuid": "469afa89-8e2e-4050-bc0c-1f4c4ac892f9",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anforderungen basieren auf einer formalen Risikoanalyse, die sich an internationalen Standards wie DIN EN 50600 oder ISO/IEC 27001 orientiert. Das Sicherheitszonenkonzept ist vollständig mit physischer und logischer Trennung umgesetzt, wird durch automatisierte Systeme (z. B. Zutrittskontrolle, Videoüberwachung) überwacht und die Wirksamkeit wird regelmäßig durch Audits und Tests verifiziert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Ausgestaltung der Sicherheitszonen ist direkt aus den Schutzbedarfsfeststellungen der Geschäftsprozesse abgeleitet. Der Übergang zwischen Zonen wird durch Schleusen (Mantraps) kontrolliert. Die Einhaltung der Zonenregeln wird durch ein Security Information and Event Management (SIEM) System überwacht, das Alarme bei unautorisierten Zutrittsversuchen oder Zonenüberschreitungen generiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anfordern der Risikoanalyse und des Abgleichs mit DIN EN 50600. Überprüfen der Konfiguration des Zutrittskontroll- und SIEM-Systems hinsichtlich der Zonenüberwachung. Beobachtung des Betriebs von Personenschleusen und Überprüfung der Alarmierung bei Regelverstößen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "239d9de6-ae94-4d8e-a031-1d362ef5b968",
                "control-id": "GEB.10.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a3-m1",
                    "uuid": "1e74fcfc-8ceb-47ae-8c89-c8ce86b589ed",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Einzelne, kleine USV-Systeme (Desktop-Klasse) werden sporadisch für einige wenige, als kritisch erachtete Server eingesetzt. Netzwerkkomponenten, Speichersysteme oder die Steuerung der Klimaanlage sind nicht abgesichert."
                      },
                      {
                        "name": "guidance",
                        "value": "Mitarbeiter beschaffen bei Bedarf kleine USV-Geräte für ihre Systeme. Es gibt keine zentrale Planung, Überwachung oder Wartung dieser Geräte. Die Batterien werden nie getestet oder ausgetauscht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung der Racks auf das Vorhandensein von USV-Systemen. Prüfen, ob auch Infrastrukturkomponenten (Switches etc.) an einer USV angeschlossen sind. Befragen der Administratoren nach dem Prozess für Wartung und Batterietausch."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a3-m2",
                    "uuid": "4ed4423b-247d-4a35-844f-69bce1942b1b",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine zentrale USV ist installiert, die die IT-Lasten versorgt. Ihre Kapazität wird jedoch nicht regelmäßig an den tatsächlichen Verbrauch angepasst, was das Risiko einer Überlastung birgt. Die Klimaanlage ist nicht an die USV angeschlossen. Für einen Serverraum wird die Notwendigkeit einer USV nur auf Basis der Verfügbarkeitsanforderungen geprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine einzelne, zentrale USV wurde bei der Einrichtung des Raumes installiert. Seitdem wurden viele neue Server hinzugefügt, ohne die USV-Auslastung zu überprüfen. Bei einem Stromausfall würde die IT weiterlaufen, aber die Klimatisierung ausfallen, was schnell zu einer Überhitzung führen würde."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen der aktuellen Lastanzeige der USV und Vergleich mit ihrer Nennkapazität. Überprüfen des Schaltplans, um festzustellen, ob die Steuerung der Klimaanlage von der USV versorgt wird. Für Serverräume, anfordern der Analyse, die zur Entscheidung für oder gegen eine USV geführt hat."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a3-m3",
                    "uuid": "a6ffa2a7-f362-414a-85f4-a282fa0c895f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für alle betriebsrelevanten Komponenten des Rechenzentrums MUSS eine unterbrechungsfreie Stromversorgung (USV) installiert werden. Die USV MUSS ausreichend dimensioniert sein. Mindestens die Steuerung der Klimaanlagen MUSS an die USV angeschlossen werden. Die USV MUSS regelmäßig gemäß Herstellervorgaben gewartet und auf Funktionsfähigkeit getestet werden. Bei USV-Systemen mit Batterie als Energiespeicher MUSS die Batterie im erforderlichen Temperaturbereich gehalten werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist eine zentral geplante USV im Einsatz, deren Kapazität den aktuellen Bedarf mit einem Sicherheitsaufschlag abdeckt. Ein Wartungsvertrag mit dem Hersteller ist abgeschlossen, und die jährliche Wartung wird protokolliert. Die Umgebungstemperatur des Batterieraums wird überwacht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anfordern der Planungsunterlagen der USV und Vergleich der Nennleistung mit dem aktuellen Verbrauch. Anfordern der Wartungsprotokolle der letzten Jahre. Überprüfung der Einhaltung der Herstellervorgaben für die Wartungsintervalle. Prüfen der Temperaturaufzeichnungen des Batterieraums."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a3-m4",
                    "uuid": "84efa9ac-785e-4ce0-96db-4e56500b12ad",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Batterie der USV SOLLTE vorzugsweise räumlich getrennt von der Leistungselektronik der USV platziert werden, um die gegenseitige Beeinflussung (z.B. durch Wärme oder im Brandfall) zu minimieren. Die Auslastung der USV wird kontinuierlich überwacht, und es werden automatische Warnungen generiert, wenn sich die Last einem Grenzwert nähert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die USV-Batterien sind in einem separaten, klimatisierten Raum untergebracht, der als eigener Brandabschnitt ausgebildet ist. Die USV ist an ein Überwachungssystem angebunden, das bei Erreichen von 80% der Nennlast eine Benachrichtigung an die IT-Abteilung sendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Begehung der Räumlichkeiten zur Überprüfung der räumlichen Trennung von USV-Elektronik und Batterien. Prüfen der Konfiguration des Überwachungssystems und der definierten Schwellenwerte für die Lastauswertung."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a3-m5",
                    "uuid": "595c7f51-8061-4f36-8363-c59f811d307a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird ein modulares, redundantes (z. B. N+1) USV-System eingesetzt, bei dem der Ausfall einer Komponente unterbrechungsfrei kompensiert wird. Die USV führt wöchentlich automatisierte Selbsttests und halbjährlich automatisierte Lasttests durch, deren Ergebnisse protokolliert und zentral ausgewertet werden. Dies gewährleistet eine konstant hohe Verfügbarkeit und Zuverlässigkeit."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine USV-Anlage mit drei Leistungsmodulen versorgt eine Last, für die zwei Module ausreichen würden (N+1-Redundanz). Die Firmware der USV ist so konfiguriert, dass jeden Sonntag um 3 Uhr ein Batterietest und am ersten Tag jedes Quartals ein Test unter Last (über den Bypass) durchgeführt wird. Die Protokolle werden automatisch an das zentrale Log-Management-System gesendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Systemarchitektur der USV auf Modularität und Redundanz. Anfordern der Konfigurationsdateien und der automatisierten Testprotokolle der USV aus dem Log-Management-System für die letzten 12 Monate."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "84551aa8-d7bf-41ac-8ddb-90e0fd3a3885",
                "control-id": "GEB.10.1.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a25-m1",
                    "uuid": "587ab502-72e6-4ce1-a183-9a71b8446a75",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist keine USV im Einsatz. Die IT-Systeme sind direkt an das öffentliche Stromnetz angeschlossen und fallen bei jeder Störung sofort aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Die PDUs in den Racks sind direkt mit der normalen Gebäude-Elektroinstallation verbunden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung des Single-Line-Diagramms der Stromversorgung. Sichtprüfung der Stromverteilung in den Racks und Technikräumen auf das Vorhandensein von USV-Anlagen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a25-m2",
                    "uuid": "abd52538-4463-4335-8fe1-b25befc1393f",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine einzelne (nicht-redundante) USV-Anlage ist installiert. Sie verfügt nicht über einen Wartungsbypass, was bedeutet, dass für Wartungsarbeiten die gesamte angeschlossene IT abgeschaltet werden muss."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine monolithische USV versorgt das Rechenzentrum. Für den jährlichen Batterietausch oder die Wartung muss ein nächtliches Wartungsfenster mit Komplettabschaltung geplant werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der USV-Architektur. Prüfen, ob ein externer oder interner Wartungsbypass vorhanden ist, der einen unterbrechungsfreien Service ermöglicht."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a25-m3",
                    "uuid": "819acdfb-4591-4345-bc4b-43339074f85e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine einzelne USV-Anlage ist installiert, die jedoch über einen internen oder externen Wartungsbypass verfügt. Dies ermöglicht Wartungsarbeiten an der USV, ohne die angeschlossenen Verbraucher abschalten zu müssen, obwohl diese während der Wartung ungeschützt sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Die USV ist mit einem manuellen Bypass-Schalter ausgestattet. Bei Wartungsarbeiten wird die Last direkt auf das Netz umgelegt. Dies wird im Voraus geplant und kommuniziert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Dokumentation der USV und des Bypass-Schaltplans. Überprüfung der Prozessbeschreibung für Wartungsarbeiten im Bypass-Betrieb."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a25-m4",
                    "uuid": "d03fe86b-cbc1-46a8-915c-620664068b03",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "USV-Systeme SOLLTEN modular und so aufgebaut sein, dass der Ausfall durch ein redundantes Modul unterbrechungsfrei kompensiert wird (N+1-Redundanz). Dies erhöht die Verfügbarkeit und vereinfacht die Wartung erheblich."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine modulare USV ist im Einsatz, die aus vier Leistungsmodulen besteht, obwohl drei für die maximale Last ausreichen würden. Fällt ein Modul aus oder wird zur Wartung entnommen, läuft die USV unterbrechungsfrei mit den verbleibenden drei Modulen weiter."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Konfiguration der USV-Anlage. Vergleich der Anzahl der installierten Leistungsmodule mit der für die Last benötigten Anzahl, um die N+1-Redundanz zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a25-m5",
                    "uuid": "1993901e-975f-47e1-bb77-32902a48d2ee",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Sofern für die IT-Betriebsbereiche eine zweizügige sogenannte A-B-Versorgung aufgebaut ist, SOLLTE jeder der beiden Strompfade mit einem eigenständigen USV-System ausgestattet sein (2N-Redundanz). Dies stellt die höchste Stufe der Fehlertoleranz dar."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Rechenzentrum wird von zwei vollständig unabhängigen Stromversorgungspfaden (A und B) versorgt. Jeder Pfad hat eine eigene Hauptverteilung, eine eigene NEA und eine eigene USV-Anlage. Server mit zwei Netzteilen werden an beide Pfade angeschlossen. Der Ausfall eines kompletten Pfades (z.B. durch einen Brand in der A-Verteilung) hat keine Auswirkung auf den Betrieb."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des Single-Line-Diagramms der Stromversorgung. Überprüfung auf die durchgängige 2N-Redundanz von der Einspeisung bis zur PDU im Rack. Sichtprüfung der getrennten Führung der A- und B-Strompfade."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "237fd16d-a5a0-43d8-a887-31e18e34fc5f",
                "control-id": "GEB.10.1.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a14-m1",
                    "uuid": "32881c8c-b4b4-4292-b329-dfc21e91bea2",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein mobiles Notstromaggregat ist vorhanden, aber nicht fest angeschlossen oder wird nicht regelmäßig getestet. Im Notfall ist ein manuelles Anschließen und Starten erforderlich, was zu langen Ausfallzeiten führt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Dieselgenerator auf einem Anhänger steht in der Garage. Die Kabel für den Anschluss liegen daneben. Niemand hat den Anschluss und Start seit der Anschaffung geübt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung des Aggregats und der Anschlussvorrichtungen. Anforderung von Testprotokollen und Prozessbeschreibungen für den Notfall. Befragung des Personals nach dem Vorgehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a14-m2",
                    "uuid": "6eed2665-f7e8-45c2-adc7-357f1681862e",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine fest installierte Netzersatzanlage (NEA) ist vorhanden und wird wöchentlich im Leerlauf getestet. Es finden jedoch keine Tests unter Last statt, sodass unklar ist, ob die NEA im Ernstfall die volle Last des Rechenzentrums tragen kann."
                      },
                      {
                        "name": "guidance",
                        "value": "Die NEA startet jeden Montag um 10 Uhr automatisch und läuft für 15 Minuten ohne Last. Die Betriebsstunden und der Kraftstoffstand werden protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Protokolle der wöchentlichen Testläufe. Prüfen, ob in den Protokollen auch Lasttests dokumentiert sind. Wenn nicht, ist die Anforderung nur grundlegend erfüllt."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a14-m3",
                    "uuid": "70868b93-99ce-4107-89f5-fae316f717b6",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Energieversorgung eines Rechenzentrums SOLLTE um eine Netzersatzanlage (NEA) ergänzt werden. Wird eine NEA verwendet, MUSS sie regelmäßig gewartet werden. Der Betriebsmittelvorrat einer NEA MUSS regelmäßig daraufhin überprüft werden, ob er ausreichend ist und noch verwendbar ist. Für einen Serverraum SOLLTE alternativ eine USV mit angemessener Autonomiezeit realisiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine NEA ist installiert, die für mindestens 24 Stunden Volllastbetrieb ausreichend Kraftstoff bevorratet. Es besteht ein Wartungsvertrag, der jährliche Inspektionen vorsieht. Der Kraftstoffstand wird monatlich geprüft. Jährlich wird eine Probe des Kraftstoffs auf Verunreinigungen (z.B. Dieselpest) untersucht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des NEA-Konzepts und der Wartungs- und Prüfprotokolle. Überprüfung der Protokolle der Kraftstoffstand- und Qualitätsprüfungen. Für Serverräume: Überprüfung der Auslegung und Autonomiezeit der alternativen USV-Lösung."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a14-m4",
                    "uuid": "5472bcba-c798-42d6-8b9b-b729abe4d143",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei den regelmäßigen Wartungen MÜSSEN auch Belastungs- und Funktionstests sowie Testläufe unter Last durchgeführt werden. Die Tankvorgänge von Brennstoffen MÜSSEN protokolliert werden, einschließlich Art des Brennstoffs, genutzter Additive, Tankdatum und Menge. Nach Möglichkeit SOLLTE statt Diesel-Kraftstoff schwefelarmes Heizöl verwendet werden, um die sogenannte Dieselpest zu vermeiden."
                      },
                      {
                        "name": "guidance",
                        "value": "Mindestens einmal jährlich wird ein Lasttest durchgeführt, bei dem die NEA die tatsächliche Last des Rechenzentrums für mindestens eine Stunde übernimmt. Dies geschieht durch eine geplante Umschaltung. Ein detailliertes Tankprotokoll wird geführt. Es wird ausschließlich schwefelarmes Heizöl verwendet und ein Biozid-Additiv beigemischt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Protokolle der jährlichen Lasttests. Überprüfung des Tankprotokolls auf Vollständigkeit und Nachvollziehbarkeit. Prüfen, welcher Kraftstofftyp verwendet wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a14-m5",
                    "uuid": "c5409474-5fae-4496-a272-d1d2b85d4bbf",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Rechenzentrum verfügt über zwei oder mehr redundante Netzersatzanlagen in einer 2N-Konfiguration. Der Kraftstoff wird durch eine automatische Filter- und Polieranlage permanent in einem sauberen Zustand gehalten. Die monatlichen Lasttests werden unter Volllast des Rechenzentrums über einen längeren Zeitraum (z.B. 4 Stunden) durchgeführt."
                      },
                      {
                        "name": "guidance",
                        "value": "Zwei identische NEAs sind installiert, von denen jede die gesamte RZ-Last tragen kann. Eine automatische Kraftstoffaufbereitungsanlage zirkuliert den Kraftstoff kontinuierlich durch Filter und Wasserabscheider. Die monatlichen Tests werden vollautomatisch durchgeführt und die Ergebnisse (Spannung, Frequenz, Last) werden im DCIM-System protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Architektur der Stromversorgung auf NEA-Redundanz (2N). Anforderung der Spezifikation und der Betriebsprotokolle der Kraftstoffaufbereitungsanlage. Analyse der Protokolle der monatlichen 4-Stunden-Volllasttests."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "6411f89f-ebc6-4391-8404-ac1d69f66c97",
                "control-id": "GEB.10.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "TEST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a19-m1",
                    "uuid": "69523b94-1bdc-493c-aaa2-68469ee60f3b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Funktionstests werden nur reaktiv durchgeführt, nachdem ein Vorfall eine Schwachstelle im Zusammenspiel der Systeme aufgedeckt hat."
                      },
                      {
                        "name": "guidance",
                        "value": "Nachdem bei einem Stromausfall die NEA nicht ansprang, wurde ein Test durchgeführt. Es gibt keine regelmäßigen, proaktiven Tests."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung von Protokollen geplanter, regelmäßiger Funktionstests. Vergleich der Daten von Störungsmeldungen und nachträglichen Tests."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a19-m2",
                    "uuid": "5730eb89-2304-4095-b5d5-589219c28616",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden regelmäßige Funktionstests einzelner Komponenten durchgeführt (z. B. ein USV-Test, ein NEA-Leerlauftest). Das Zusammenspiel der Systeme in einer vollständigen Reaktionskette wird jedoch nicht getestet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die USV wird monatlich getestet und die NEA wöchentlich. Es wurde aber nie getestet, ob die USV die Last lange genug hält, bis die NEA gestartet ist und die Last übernommen hat."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Testprotokolle. Überprüfung, ob die Tests nur einzelne Komponenten oder das Zusammenspiel mehrerer Systeme umfassen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a19-m3",
                    "uuid": "f8b066c4-b153-4dc1-bdbd-8257cd6e5461",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die technische Infrastruktur eines Rechenzentrums SOLLTE regelmäßig (zumindest ein- bis zweimal jährlich) sowie nach Systemumbauten und umfangreichen Reparaturen getestet werden. Die Ergebnisse SOLLTEN dokumentiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Halbjährlich werden geplante Funktionstests der wichtigsten Infrastrukturkomponenten durchgeführt. Nach dem Austausch eines USV-Moduls wird ein außerplanmäßiger Test angesetzt. Alle Tests und ihre Ergebnisse werden in einem zentralen Protokoll dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des Testplans und der Testprotokolle der letzten zwei Jahre. Überprüfung, ob nach größeren Änderungen an der Infrastruktur zusätzliche Tests durchgeführt wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a19-m4",
                    "uuid": "0fbef771-be5b-463e-a22a-d9d9f12ec942",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Besonders ganze Reaktionsketten SOLLTEN einem echten Funktionstest unterzogen werden. Die Tests sind umfassend und simulieren beispielsweise einen Ausfall der öffentlichen Stromversorgung, um den nahtlosen Übergang von Netz auf USV und dann auf NEA und zurück zu verifizieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Einmal jährlich wird ein 'Pull-the-Plug'-Test durchgeführt, bei dem die Hauptstromversorgung des Rechenzentrums geplant abgeschaltet wird. Dabei wird die gesamte Reaktionskette (Umschaltung auf USV, Start der NEA, Lastübernahme durch NEA, Synchronisation und Rückschaltung auf Netz) unter realer Last getestet und die Zeiten und Parameter werden genau protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der detaillierten Testpläne und -protokolle für die Tests der vollständigen Reaktionsketten. Überprüfung der aufgezeichneten Parameter (z.B. Umschaltzeiten, Spannungs- und Frequenzstabilität) auf Einhaltung der Sollwerte."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a19-m5",
                    "uuid": "60e64a33-d208-4d32-b80e-92306eeb8f4b",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden jährlich 'Black Building'-Tests durchgeführt, bei denen die Stromversorgung des gesamten Gebäudes unterbrochen wird, um die Reaktion aller redundanten Systeme (Strom, Klima, Sicherheitstechnik) unter Volllast zu testen. Diese Tests werden als formales Projekt mit detaillierten Ablaufplänen (Method of Procedure, MOP) und der Einbeziehung aller Stakeholder geplant und durchgeführt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der jährliche Black-Building-Test wird monatelang im Voraus geplant. Ein detailliertes MOP beschreibt jeden Schritt, jede erwartete Reaktion und jeden Rollback-Plan. Alle beteiligten Teams (IT, Facility Management, Sicherheitsdienst) sind vor Ort und kommunizieren über einen dedizierten Kanal. Die Ergebnisse werden analysiert und führen zu konkreten Verbesserungsmaßnahmen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Projektdokumentation für den letzten Black-Building-Test, einschließlich des MOP, der Teilnehmerlisten, der Kommunikationspläne und des Abschlussberichts mit den 'Lessons Learned'."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "3c94bca3-b36a-4f7e-8256-d6c34f0cf9ce",
                "control-id": "GEB.10.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "REA",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a4-m1",
                    "uuid": "2bc2996f-03b6-4162-bb6f-95c9d8a1e335",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein einziger, ungeschützter Not-Aus-Schalter ist vorhanden, der bei Betätigung das gesamte Rechenzentrum inklusive USV und sicherheitsrelevanter Systeme (z. B. Notbeleuchtung) abschaltet. Dies stellt ein hohes Risiko für Datenverlust und Folgeschäden dar."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein roter Pilzknopf ist neben der Tür installiert. Er ist nicht abgedeckt und kann leicht versehentlich betätigt werden. Seine Betätigung führt zu einem kompletten Stromausfall im gesamten Bereich."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung des Not-Aus-Schalters auf Schutzvorrichtungen (z.B. Abdeckklappe). Anforderung des Schaltplans, um die Auswirkungen der Betätigung zu verstehen. Befragung des Personals, ob bekannt ist, was der Schalter bewirkt."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a4-m2",
                    "uuid": "93c9cbca-ed98-4258-b286-c9d1dce8bef7",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es sind Not-Aus-Schalter vorhanden, aber sie sind nicht eindeutig beschriftet oder ausreichend gegen Fehlbedienung geschützt. Es ist unklar, welche Bereiche oder Systeme von welchem Schalter betroffen sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Mehrere Not-Aus-Schalter sind im und um den Serverraum verteilt. Ihre Beschriftung ist verblasst oder fehlt. Das Personal ist unsicher über die genaue Funktion jedes einzelnen Schalters."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung der Not-Aus-Schalter auf klare und verständliche Beschriftung und auf Schutzabdeckungen. Interviews mit dem Betriebspersonal, um deren Kenntnisstand über die Funktion der Schalter zu ermitteln."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a4-m3",
                    "uuid": "4adaf82d-3d14-4c44-b798-e6b0da329133",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS geeignete Möglichkeiten geben, elektrische Verbraucher im Rechenzentrum spannungsfrei zu schalten. Dabei MUSS darauf geachtet werden, ob und wie eine vorhandene USV eingebunden ist. Werden klassische Not-Aus-Schalter eingesetzt, MUSS darauf geachtet werden, dass darüber nicht das komplette Rechenzentrum abgeschaltet wird. Die Notabschaltung MUSS sinnvoll parzelliert und zielgerichtet erfolgen. Alle Not-Aus-Schalter MÜSSEN so geschützt sein, dass sie nicht unbeabsichtigt oder unbefugt betätigt werden können."
                      },
                      {
                        "name": "guidance",
                        "value": "An den Ein- und Ausgängen des Rechenzentrums sind Not-Aus-Taster installiert, die durch eine Klappe vor versehentlicher Betätigung geschützt sind. Die Taster sind klar beschriftet (z.B. 'NOT-AUS IT-RAUM', 'NOT-AUS KLIMA'). Ihre Betätigung schaltet gezielt nur die jeweiligen Verbrauchergruppen ab, während z.B. die USV-gestützte Notbeleuchtung aktiv bleibt. Das Konzept ist dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anfordern des Konzepts für die Notabschaltung. Überprüfung der Beschriftung und des Schutzes der Not-Aus-Schalter vor Ort. Vergleich der im Konzept beschriebenen Parzellierung mit den tatsächlichen Schaltungen (anhand von Schaltplänen)."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a4-m4",
                    "uuid": "2745cd50-1c86-4391-ac17-fe431e160d42",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Not-Aus-System (in Deutschland als NOT-HALT bezeichnet) ist zoniert und ermöglicht das gezielte Abschalten einzelner Bereiche (z. B. einer Rack-Reihe) oder Systeme (z. B. der Kälteerzeugung). Das System ist klar dokumentiert, und das Personal wird regelmäßig in seiner Anwendung geschult, um im Notfall korrekt und ohne Zögern handeln zu können."
                      },
                      {
                        "name": "guidance",
                        "value": "Für jede Rack-Reihe gibt es einen eigenen, klar gekennzeichneten Not-Aus-Schalter. Die Dokumentation enthält einen detaillierten Plan, welche Systeme von welchem Schalter betroffen sind. Jährliche Sicherheitsschulungen beinhalten ein Modul zur Notabschaltung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen der Dokumentation des zonierten Not-Aus-Systems. Einsicht in die Schulungsunterlagen und -nachweise des Personals. Überprüfung der Kennzeichnung und Anordnung der Schalter im Rechenzentrum."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a4-m5",
                    "uuid": "1ca091a7-29a5-4753-9470-58cae0293ec4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Not-Aus-System ist in die Brandmelde- und Löschanlage integriert. Eine Auslösung wird über ein zentrales Gebäudemanagementsystem verwaltet und erfordert zur Vermeidung von Fehlbedienungen eine Bestätigung durch zwei Faktoren (z.B. Tasterbetätigung und Software-Bestätigung durch eine zweite Person)."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei Auslösung der Gaslöschanlage wird automatisch und gezielt die Stromversorgung im betroffenen Bereich abgeschaltet, um Kurzschlüsse und erneute Entzündung zu verhindern. Eine manuelle Auslösung über einen Taster muss innerhalb von 60 Sekunden im Gebäudemanagementsystem von einer autorisierten Person bestätigt werden, ansonsten verfällt der Befehl."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der technischen Dokumentation der Kopplung von Brandmeldeanlage und Not-Aus-System. Überprüfung der Konfiguration des Workflows für die 2-Faktor-Bestätigung im Gebäudemanagementsystem. Analyse der Protokolle von Integrationstests."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e83221f9-616e-44f6-be90-ee59f941b5da",
                "control-id": "GEB.10.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a15-m1",
                    "uuid": "bb2661a2-2dc5-4aa4-961b-cbd897c60771",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ausschließlich handelsübliche Überspannungsschutz-Steckdosenleisten werden für die IT-Geräte verwendet. Ein übergeordnetes Schutzkonzept existiert nicht."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Server sind an Steckdosenleisten mit integriertem Überspannungsschutz angeschlossen. Die Elektroinstallation des Gebäudes selbst verfügt über keinen Schutz."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung der Racks und der Stromverteilung. Überprüfung der Elektroverteilung auf das Vorhandensein von zentralen Überspannungsschutzgeräten (SPDs)."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a15-m2",
                    "uuid": "2e546547-bc93-4a4f-97f1-789b8eff842a",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Am Gebäudeeingang ist ein Grobschutz (Typ 1 SPD) installiert. Es fehlt jedoch ein koordiniertes System mit Mittel- (Typ 2) und Feinschutz (Typ 3) näher an den Endgeräten. Dies kann dazu führen, dass die Schutzwirkung unzureichend ist."
                      },
                      {
                        "name": "guidance",
                        "value": "In der Hauptverteilung des Gebäudes ist ein Blitzstromableiter (Typ 1) verbaut. In den Unterverteilungen für das Rechenzentrum und an den Racks selbst fehlen jedoch weitere Schutzstufen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Haupt- und Unterverteilungen auf das Vorhandensein von SPDs der Typen 1, 2 und 3. Prüfen, ob ein koordiniertes Schutzkonzept vorliegt."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a15-m3",
                    "uuid": "ca7140b8-5540-4958-b614-b130cc6695c1",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird ein grundlegendes, aber dokumentiertes Überspannungsschutzkonzept umgesetzt. Dies beinhaltet mindestens einen koordinierten Grob- und Mittelschutz (Typ 1 und Typ 2 SPD) für die Stromversorgung des Rechenzentrums. Alle Einrichtungen des Überspannungsschutzes werden regelmäßig einer Sichtprüfung unterzogen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Elektrofachbetrieb hat ein einfaches Schutzkonzept erstellt und umgesetzt. In der Hauptverteilung ist ein Kombi-Ableiter Typ 1+2 installiert. Die Funktion der SPDs wird im Rahmen der jährlichen Elektroprüfung kontrolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des Überspannungsschutzkonzepts und der Protokolle der Elektroprüfungen. Überprüfung der Dokumentation auf die Koordination der Schutzstufen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a15-m4",
                    "uuid": "2b00d2db-87f3-46ed-a895-b16e084e3af4",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE auf Basis der aktuell gültigen Norm (DIN EN 62305 Teil 1 bis 4) ein Blitz- und Überspannungsschutzkonzept erstellt werden. Dabei sind die für den ordnungsgemäßen Betrieb des RZ erforderlichen Blitzschutzzonen (LPZ) festzulegen. Für alle erforderlichen Einrichtungen SOLLTE das mindestens die LPZ 2 sein. Alle Einrichtungen des Überspannungsschutzes SOLLTEN gemäß DIN EN 62305-3, Tabelle E.2 ein Mal im Jahr einer umfassenden Prüfung unterzogen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Elektrofachkraft für Blitzschutz hat ein detailliertes Schutzkonzept nach DIN EN 62305 erstellt. Dieses definiert die Blitzschutzzonen LPZ 0A, 0B, 1 und 2. Ein koordiniertes System aus Typ 1, 2 und 3 SPDs ist für alle ins RZ führenden Leitungen (Strom, Daten, Klima) installiert. Die jährliche Prüfung durch eine Fachfirma wird dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des detaillierten Blitz- und Überspannungsschutzkonzepts nach DIN EN 62305. Überprüfung der Planungsunterlagen auf die Festlegung der LPZ. Anforderung der Protokolle der jährlichen, umfassenden Prüfung."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a15-m5",
                    "uuid": "fbe588b0-b8e3-4a80-bf17-f54b413d6548",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Schutzkonzept ist vollständig mit koordinierten SPDs der Typen 1, 2 und 3 umgesetzt. Alle SPDs sind mit einer Fernsignalisierung ausgestattet, die ihren Funktions- bzw. Defektstatus an das GMS/DCIM-System meldet. Dies ermöglicht einen proaktiven Austausch von defekten Schutzmodulen, bevor die Schutzwirkung beeinträchtigt ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle verbauten SPDs verfügen über einen Meldekontakt. Dieser ist mit dem zentralen Monitoringsystem verbunden. Fällt ein SPD aus oder erreicht sein Lebensende, wird automatisch ein Störungsticket für den Austausch generiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der technischen Spezifikation der SPDs auf das Vorhandensein von Fernmeldekontakten. Kontrolle der Konfiguration des Monitoringsystems zur Überwachung dieser Kontakte. Simulieren eines Ausfalls (falls möglich), um die Meldungskette zu testen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "3b2e43c3-1b12-4c68-a6ed-0d5e5667cbf8",
                "control-id": "GEB.10.5.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a23-m1",
                    "uuid": "c11deae4-2ac2-4d8b-a1d4-b508ce5fd979",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Im Rechenzentrum herrscht 'Kabel-Spaghetti'. Strom- und Datenkabel werden ungetrennt und ungeordnet verlegt. Dies führt zu Störungen, erschwert die Wartung und erhöht die Brandlast."
                      },
                      {
                        "name": "guidance",
                        "value": "Kabel werden auf dem kürzesten Weg direkt über den Boden oder durch die Racks gezogen. Alte, nicht mehr genutzte Kabel werden nicht entfernt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung der Verkabelung im Rechenzentrum, insbesondere unter dem Doppelboden und in den Racks. Überprüfung auf Ordnung, Trennung von Strom- und Datenkabeln und Entfernung von Totholz-Kabeln."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a23-m2",
                    "uuid": "3b7f137c-2280-47ab-85b2-17da83a1bd43",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Kabel werden in Kabeltrassen geführt, um eine grundlegende Ordnung zu schaffen. Strom- und Datenkabel teilen sich jedoch dieselben Trassen, und eine klare Beschriftung der Kabel fehlt."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Gitterrinne unter der Decke dient zur Führung aller Kabel. Es gibt keine Trennstege. Die Kabel sind nicht beschriftet, was die Fehlersuche erschwert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung der Kabeltrassen. Überprüfung, ob eine physische Trennung von Strom- und Datenkabeln innerhalb der Trassen existiert. Stichprobenartige Kontrolle, ob Kabel an beiden Enden beschriftet sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a23-m3",
                    "uuid": "ac564403-dd07-4869-a580-60bfa984f156",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Strom- und Datenkabel werden konsequent in getrennten Kabeltrassen geführt, um elektromagnetische Störungen zu vermeiden. Kabelmanagement-Systeme in den Racks sorgen für eine saubere und geordnete Verkabelung. Alle Kabel sind an beiden Enden eindeutig beschriftet."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt separate Kabeltrassen für Starkstrom, Schwachstrom und Datenleitungen (Kupfer und LWL). In den Racks werden horizontale und vertikale Rangierpanel verwendet. Jedes Kabel ist mit einem Etikett versehen, das seinen Start- und Endpunkt angibt. Die Verkabelung ist in einer Datenbank dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der physischen Trennung der Kabeltrassen. Kontrolle der Ordnung und Beschriftung der Kabel in den Racks. Anforderung der Verkabelungsdokumentation und stichprobenartiger Abgleich mit der Realität."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a23-m4",
                    "uuid": "c15cf0e7-555e-4f2e-a2c8-b5d35d1c72e8",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Kabeltrassen in Rechenzentren SOLLTEN sorgfältig geplant und ausgeführt werden. Trassen SOLLTEN hinsichtlich Anordnung und Dimensionierung so ausgelegt sein, dass eine Trennung der Spannungsebenen sowie eine sinnvolle Verteilung von Kabeln auf den Trassen möglich ist und dass auch für zukünftige Bedarfsmehrung ausreichend Platz zur Verfügung steht."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Kabeltrassen wurden mit einer Kapazitätsreserve von mindestens 30% geplant. Die Planung berücksichtigt zukünftige Erweiterungen und sorgt dafür, dass neue Kabel ohne Beeinträchtigung des Bestands verlegt werden können. Das Verkabelungskonzept ist Teil des Gesamtsicherheitskonzepts des Rechenzentrums."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Planungsunterlagen für die Kabeltrassen. Überprüfung der Auslastung der Trassen und der geplanten Reserven. Prüfen, ob das Verkabelungskonzept dokumentiert und aktuell ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a23-m5",
                    "uuid": "427c0821-d630-4a50-b010-dd1d3637be64",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zur optimalen Versorgung von IT-Hardware, die über zwei Netzteile verfügt, SOLLTE ab der Niederspannungshauptverteilung für die IT-Betriebsbereiche eine zweizügige sogenannte A-B-Versorgung aufgebaut werden. Einander Redundanz gebende Leitungen (z. B. der A- und B-Stromversorgung) SOLLTEN über getrennte Trassen verlegt werden, um eine maximale Verfügbarkeit sicherzustellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Rechenzentrum verfügt über zwei komplett getrennte Stromversorgungspfade (A- und B-Strang), von der Hauptverteilung über die USV bis zu den PDU (Power Distribution Unit) in den Racks. Die Kabeltrasse für den A-Strang verläuft auf der linken Seite der Rack-Reihen, die für den B-Strang auf der rechten Seite. Ein Ausfall eines kompletten Versorgungspfades führt zu keinem Ausfall der IT-Systeme."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des Single-Line-Diagramms der Stromversorgung zur Überprüfung der durchgängigen A/B-Redundanz. Überprüfung der physischen Trennung der Kabelwege vor Ort. Prüfen, ob in den Racks die Netzteile der Server korrekt auf die A- und B-PDUs aufgeteilt sind."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "8a8b892c-3bb4-444a-bdd2-865a504a5bb8",
                "control-id": "GEB.10.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a29-m1",
                    "uuid": "4e218bfe-1ea9-47e2-8964-3ea6cd045ff8",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wasser-, Abwasser- oder Gasleitungen, die nicht der Versorgung des Rechenzentrums dienen, verlaufen ungeschützt direkt über oder neben den IT-Racks. Das von diesen Leitungen ausgehende Risiko wird ignoriert."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Abwasserleitung aus den oberen Stockwerken verläuft quer durch den Serverraum unter der Decke. Es gibt keine Schutzwanne oder Überwachung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung der Decken und Wände im Rechenzentrum auf das Vorhandensein von fremden Versorgungsleitungen. Überprüfung, ob Schutzmaßnahmen gegen Leckagen vorhanden sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a29-m2",
                    "uuid": "391a11af-45e3-4219-a7b3-e325086b97a0",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Vorhandensein von fremden Versorgungsleitungen ist bekannt und dokumentiert. Es wurden jedoch keine spezifischen Maßnahmen zur Risikominimierung ergriffen."
                      },
                      {
                        "name": "guidance",
                        "value": "In den Bauplänen ist vermerkt, dass eine Heizungsleitung den Raum durchquert. Es wurden aber weder eine Einhausung noch Leckagesensoren installiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Dokumentation über fremde Versorgungsleitungen. Abgleich der Dokumentation mit den Gegebenheiten vor Ort. Prüfen, ob Maßnahmen zur Risikominimierung beschrieben und umgesetzt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a29-m3",
                    "uuid": "6811f74c-eb4f-483a-af76-dc39382522f0",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In einem Rechenzentrum DÜRFEN NUR Leitungen verlegt werden, die der unmittelbaren Versorgung der im Rechenzentrum aufgebauten Technik dienen. Ist es aus baulichen Gründen unabwendbar, Leitungen durch das Rechenzentrum zu führen, MUSS dies einschließlich Begründung dokumentiert werden. Die Risiken, die von solchen Leitungen ausgehen, MÜSSEN durch geeignete Maßnahmen minimiert werden, z. B. durch Einhausung und Überwachung. Durch Serverräume dürfen vorgenannte Leitungen geführt werden, diese MÜSSEN aber genauso behandelt werden. Meldungen aus der Überwachung der Leitungen MÜSSEN unverzüglich geprüft und bewertet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Fremde, wasserführende Leitungen sind in einer geschweißten Edelstahlwanne verlegt. Innerhalb der Wanne ist ein Leckage-Sensorkabel installiert, das an die zentrale Überwachung angebunden ist. Die Notwendigkeit der Leitungsführung ist schriftlich begründet und vom Management genehmigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Genehmigungsdokumentation für die Führung fremder Leitungen. Überprüfung der Umsetzung der risikominimierenden Maßnahmen (z.B. Einhausung, Sensoren). Auslösung eines Testalarms am Leckagesensor zur Überprüfung der Meldungskette."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a29-m4",
                    "uuid": "0e7e68f4-8c41-4c90-b4cc-32a340350941",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle fremden Leitungen (insbesondere wasserführende) werden in dedizierten, versiegelten Einhausungen oder Schächten geführt. Diese sind mit Leckagesensoren ausgestattet, die an das zentrale Überwachungssystem angeschlossen sind. Die Überwachung ist rund um die Uhr sichergestellt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein separater Installationsschacht wurde für die fremden Leitungen errichtet. Dieser Schacht ist als eigener Brandabschnitt ausgebildet und wird auf Leckagen überwacht. Der Zutritt zum Schacht ist nur für autorisiertes Personal möglich."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der baulichen Ausführung des Installationsschachts. Kontrolle der Anbindung der Sensoren an das 24/7-Überwachungssystem. Prüfung des Zutrittskonzepts für den Schacht."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a29-m5",
                    "uuid": "1838f857-285b-4b77-be92-d16157bad66a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Planung des Rechenzentrums verbietet grundsätzlich die Durchleitung von nicht betriebsnotwendigen Versorgungsleitungen durch die IT-Betriebsräume. Notwendige Leitungen, wie z.B. für die Kaltwasserversorgung der Klimaanlage oder für die Löschanlage, sind doppelwandig ausgeführt und werden permanent auf Druckabfall überwacht, um Leckagen sofort zu erkennen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Kaltwasserleitungen der Klimaanlage sind als doppelwandiges Rohrsystem realisiert. Der Zwischenraum wird durch Drucksensoren überwacht. Ein Druckabfall im äußeren oder inneren Rohr löst sofort einen Alarm aus, lange bevor Wasser austreten kann."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Planungsrichtlinien für das Rechenzentrum, die fremde Leitungen verbieten. Überprüfung der technischen Spezifikation und der Überwachungskonfiguration der doppelwandigen Rohrsysteme."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "dad6463e-ec9c-4955-8441-cd25225f35c6",
                "control-id": "GEB.11.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "REAL",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a13-m1",
                    "uuid": "4fd6a660-088d-464d-b529-c24c02363f7e",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Einzelne Gefahrenmelder (z.B. ein Wassermelder) sind installiert, lösen aber nur einen lokalen, akustischen Alarm aus und sind nicht Teil eines Gesamtkonzepts."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Keller unter dem Serverraum liegt ein Wassermelder auf dem Boden, der bei Kontakt mit Wasser zu piepen beginnt. Es gibt keine Weiterleitung des Alarms."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung auf das Vorhandensein von einzelnen Gefahrenmeldern. Überprüfung, ob diese an eine zentrale Anlage angeschlossen sind. Simulieren eines Alarms (z.B. durch Befeuchten des Wassermelders), um die Reaktion zu testen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a13-m2",
                    "uuid": "0aa0109e-1d2b-4327-b6f4-154dea5e7916",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine zentrale Gefahrenmeldeanlage (GMA) ist installiert, aber der Übertragungsweg zur externen Alarmempfangsstelle ist nicht redundant ausgelegt (z. B. nur über eine Internetverbindung). Bei Ausfall dieses Weges bleiben Alarme unbemerkt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Einbruch- und Wassermelder sind an eine GMA angeschlossen. Diese übermittelt Alarme über den Internetanschluss des Unternehmens an eine Leitstelle. Fällt das Internet aus, ist die Alarmübertragung unterbrochen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des Konzepts der GMA. Überprüfung der technischen Auslegung des Übertragungsweges. Fragen nach dem Vorgehen bei einem Ausfall des primären Übertragungsweges."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a13-m3",
                    "uuid": "6f9189a5-cbe7-4712-ba5e-af9354dfb010",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Basierend auf dem Sicherheitskonzept des Gebäudes wird geplant, welche Gefahrenmeldeanlagen (GMA) für welche Bereiche benötigt werden. Der Umgang mit Alarmmeldungen wird festgelegt. Es wird eine zum Einsatzzweck passende GMA installiert. Die Meldungen der GMA werden an eine Alarmempfangsstelle aufgeschaltet, die jederzeit erreichbar sein MUSS und geeignet auf die Gefährdung reagieren kann."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein GMA-Konzept definiert, dass Einbruch, Wasser und unbefugter Zutritt überwacht werden. Die GMA ist an eine zertifizierte Notruf- und Serviceleitstelle (NSL) aufgeschaltet. Der Vertrag mit der NSL definiert klare Maßnahmenpläne für jeden Alarmtyp. Das Konzept wird bei Nutzungsänderungen von Räumen angepasst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des GMA-Konzepts und des Vertrags mit der NSL inklusive der Maßnahmenpläne. Überprüfung, ob das Konzept aktuell ist und zur Gebäudenutzung passt. Auslösung eines Testalarms zur Verifizierung der Reaktion der NSL."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a13-m4",
                    "uuid": "2deaa007-51fb-4440-bed4-2950b8f229e2",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Übertragungsweg zwischen der eingesetzten GMA und der Alarmempfangsstelle SOLLTE entsprechend den Technischen Anschlussbedingungen (TAB) und nach Möglichkeit redundant ausgelegt werden. Alle vorhandenen Übertragungswege MÜSSEN regelmäßig getestet werden. Das Konzept SOLLTE immer angepasst werden, wenn sich die Nutzung der Gebäudebereiche verändert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die GMA ist über zwei unabhängige Wege mit der NSL verbunden, z.B. primär über eine Standleitung (IP) und sekundär über das Mobilfunknetz (4G/5G). Das System testet beide Übertragungswege täglich automatisch. Die Ergebnisse der Tests werden protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der technischen Auslegung der GMA auf redundante Übertragungswege. Anforderung der Protokolle der automatischen Wegtests. Simulieren des Ausfalls des primären Weges, um die automatische Umschaltung auf den sekundären Weg zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a13-m5",
                    "uuid": "035e2aff-0f31-4f5a-a579-3ae0df9b2091",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird eine hochwertige, zertifizierte GMA (z. B. VdS-Klasse C) eingesetzt. Alarme werden nicht nur an eine externe Stelle weitergeleitet, sondern lösen über eine Integration mit anderen Sicherheitssystemen auch automatisierte lokale Reaktionen aus, wie z. B. die Aktivierung von Videoaufzeichnungen, die Verriegelung von Bereichen oder das Einschalten von zusätzlicher Beleuchtung."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei einem Einbruchsalarm in der Nacht werden automatisch alle Lichter im betroffenen Bereich eingeschaltet, alle Außentüren verriegelt und die PTZ-Kameras zeichnen den Bereich auf. Diese Kopplung maximiert die Chancen der Beweissicherung und Täteridentifikation."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Zertifizierungsurkunde für die GMA. Überprüfung der Konfiguration der Kopplungen zwischen GMA und anderen Systemen (z.B. Video, Zutritt). Durchführung eines Integrationstests, um die korrekte Auslösung der automatisierten lokalen Reaktionen zu verifizieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "feb6c488-b427-4bd6-a8ff-3797ecbf17d2",
                "control-id": "GEB.11.1.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a2-m1",
                    "uuid": "099e69ba-720a-4d09-abd3-f770b5eed124",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ausschließlich die gesetzlich vorgeschriebenen, minimalen Brandschutzanforderungen sind umgesetzt, ohne besondere Berücksichtigung des Schutzes der IT-Systeme oder der Verfügbarkeit. Bestehende Brandabschnitte weisen möglicherweise unversiegelte Durchbrüche auf."
                      },
                      {
                        "name": "guidance",
                        "value": "Während der Bauphase wurden die baurechtlichen Vorgaben erfüllt, aber spätere Kabeldurchführungen wurden nicht fachgerecht verschottet. Es gibt keine spezifische Planung, um den IT-Betriebsbereich als separaten Brandabschnitt zu schützen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung der Wände und Decken auf unversiegelte Kabel- und Rohrdurchführungen. Vergleich der Baupläne mit den gesetzlichen Mindestanforderungen zum Zeitpunkt der Errichtung."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a2-m2",
                    "uuid": "4370a6d0-9f8b-42df-8abf-9467d1fd82c7",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der zentrale IT-Betriebsraum ist als eigenständiger Brandabschnitt ausgebildet. Supportbereiche wie Technik- oder Lagerräume sind jedoch nicht durch separate Brandabschnitte geschützt und stellen ein Risiko dar."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Serverraum ist mit F30- oder F90-Wänden und einer T30-Tür umschlossen. Die angrenzenden Räume, in denen sich beispielsweise die USV oder die Klimaanlage befindet, sind jedoch Teil des allgemeinen Gebäude-Brandabschnitts."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Baupläne und des Brandschutzkonzepts, um die Grenzen der Brandabschnitte zu identifizieren. Prüfen, ob der IT-Betriebsraum einen eigenen Brandabschnitt bildet und wie die Supportbereiche brandschutztechnisch behandelt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a2-m3",
                    "uuid": "1c187ad7-4064-42f4-b976-d58f1c8e92b8",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MÜSSEN geeignete Brand- und Rauchabschnitte für die Räumlichkeiten eines Rechenzentrums festgelegt werden. Die Brand- und Rauchabschnitte MÜSSEN über den baurechtlich vorgeschriebenen Rahmen hinaus auch Schutz für die darin befindlichen technischen Einrichtungen und deren Verfügbarkeit bieten. Es MUSS verhindert werden, dass sich Brand und Rauch ausbreiten."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Brandschutzkonzept definiert separate Brandabschnitte für den IT-Betriebsbereich, die wesentlichen Supportbereiche (z. B. Elektroraum, USV-Raum) und Logistikbereiche. Alle Durchdringungen werden fachgerecht mit zertifizierten Schottungen verschlossen und dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anfordern des Brandschutzkonzepts. Prüfen, ob für alle kritischen RZ-Bereiche eigene Brandabschnitte definiert sind. Stichprobenartige Überprüfung der Brandabschottungen und ihrer Dokumentation (z. B. Übereinstimmungserklärung)."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a2-m4",
                    "uuid": "0e03b2f8-d909-4406-810b-efeb191b6bdc",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Im Falle eines Serverraums SOLLTE geprüft werden, ob geeignete Brand- und Rauchabschnitte für die Räumlichkeiten umsetzbar sind. Die Feuerwiderstandsklasse der Wände, Türen und Schottungen ist explizit dokumentiert und wird regelmäßig auf Unversehrtheit überprüft, insbesondere nach Baumaßnahmen."
                      },
                      {
                        "name": "guidance",
                        "value": "Für Serverräume wird eine Analyse durchgeführt, die die Machbarkeit und den Nutzen der Einrichtung separater Brandabschnitte bewertet. Es wird ein Kataster aller Brandabschottungen geführt, das bei jeder Änderung aktualisiert wird. Nach jeder Baumaßnahme erfolgt eine formale Abnahme der neu installierten oder veränderten Schottungen durch einen Brandschutzbeauftragten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Einsichtnahme in die Analyse zur Bildung von Brandabschnitten für Serverräume. Anforderung des Schottungskatasters und Vergleich mit den bei einer Begehung festgestellten Gegebenheiten. Überprüfung der Prozessdokumentation für die Abnahme von Brandschutzmaßnahmen nach Umbauten."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a2-m5",
                    "uuid": "f8c37d39-fdf3-48cb-bea8-e1e19cd49a5e",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Brandabschnitte sind mit einer höheren Feuerwiderstandsklasse (z. B. F90/F120) als gesetzlich gefordert ausgelegt. Lüftungsleitungen, die Brandabschnitte durchdringen, sind mit automatischen Brandschutzklappen ausgestattet, die von der Brandmeldeanlage angesteuert werden, um die Ausbreitung von Rauch und Feuer aktiv zu verhindern."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Auslegung der Brandabschnitte basiert auf einer Risikoanalyse, die auch das Szenario eines voll entwickelten Brandes in einem Nachbarbereich berücksichtigt. Die Brandschutzklappen werden in die regelmäßigen Tests der Brandmeldeanlage einbezogen, um ihre korrekte Funktion sicherzustellen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen der Risikoanalyse und des Brandschutzkonzepts auf die Begründung für die gewählte Feuerwiderstandsklasse. Anfordern der Testprotokolle der Brandmeldeanlage und explizite Überprüfung, ob die Ansteuerung der Brandschutzklappen Teil der Tests war."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "197ffd0c-61ef-4b27-9328-3cdd6d325446",
                "control-id": "GEB.11.1.6",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a8-m1",
                    "uuid": "e7a19f77-c43c-4a8d-ac48-3a2e0b88b556",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es sind nur die standardmäßigen, batteriebetriebenen Rauchmelder vorhanden, die von der Bauordnung gefordert werden. Diese sind nicht vernetzt und lösen nur einen lokalen akustischen Alarm aus."
                      },
                      {
                        "name": "guidance",
                        "value": "In den Räumen sind einfache Rauchmelder aus dem Baumarkt installiert. Es findet keine Weiterleitung eines Alarms statt. Wenn niemand vor Ort ist, wird ein Brand nicht bemerkt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung der installierten Rauchmelder. Prüfen, ob eine Verbindung zu einer zentralen Brandmeldezentrale besteht. Überprüfung der Test- und Wartungsnachweise für die Melder (z.B. Batteriewechsel)."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a8-m2",
                    "uuid": "6958783f-1f49-4166-a70e-348f2f918a7d",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine zentrale Brandmeldeanlage (BMA) ist installiert, überwacht aber nur den Haupt-IT-Raum. Supportbereiche wie Elektroräume oder USV-Räume sind nicht an die BMA angeschlossen."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Serverraum sind automatische Brandmelder installiert, die an eine Brandmeldezentrale (BMZ) im Gebäude angeschlossen sind. Die angrenzenden Technikräume, von denen oft eine höhere Brandgefahr ausgeht, sind nicht mit Meldern ausgestattet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Meldergruppen-Übersicht der BMA. Abgleich der überwachten Bereiche mit dem Grundriss des Rechenzentrums. Identifizierung kritischer Bereiche, die nicht überwacht werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a8-m3",
                    "uuid": "cb075190-77fe-47e3-83d1-14981df7a354",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In einem Rechenzentrum MUSS eine Brandmeldeanlage installiert sein. Diese MUSS alle Flächen überwachen. Alle Meldungen der Brandmeldeanlage MÜSSEN geeignet weitergeleitet werden. Die Brandmeldeanlage MUSS regelmäßig gewartet werden. Es MUSS sichergestellt werden, dass in Räumen des Rechenzentrums keine besonderen Brandlasten vorhanden sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine flächendeckende Brandmeldeanlage ist installiert, die den IT-Betriebsbereich, Doppelböden, abgehängte Decken und alle Supportbereiche überwacht. Meldungen werden an eine ständig besetzte Stelle (z.B. Pforte, externer Dienstleister) weitergeleitet. Es besteht ein Wartungsvertrag gemäß DIN 14675. Organisatorische Regeln verbieten die Lagerung von brennbaren Materialien (z.B. Kartonagen) in den Technikräumen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des Konzepts und der Wartungsprotokolle der BMA. Überprüfung des Alarmierungs- und Interventionsplans. Begehung der Räume zur Kontrolle auf unzulässige Brandlasten."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a8-m4",
                    "uuid": "dfb1089f-7ac5-44a6-a21a-97953de4cc39",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Brandmeldeanlage ist adressierbar, d.h. sie kann den exakten Melder, der den Alarm ausgelöst hat, auf einem Display anzeigen. Dies ermöglicht eine schnelle Lokalisierung des Brandherdes. Die Anlage ist an eine zertifizierte Notruf- und Serviceleitstelle (NSL) aufgeschaltet."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei einem Alarm wird auf dem Display der BMZ die genaue Meldernummer und eine Klartextbezeichnung des Ortes angezeigt (z.B. 'Rauchmelder 14, RZ Doppelboden Reihe 3'). Die Aufschaltung zur NSL erfolgt über einen zertifizierten Übertragungsweg."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der technischen Spezifikation der BMA auf Adressierbarkeit. Anforderung des Vertrags und der Konformitätsbescheinigung für die Aufschaltung zur NSL. Auslösung eines Testalarms zur Überprüfung der korrekten Anzeige an der BMZ und der Meldung bei der NSL."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a8-m5",
                    "uuid": "99864993-aee9-4da3-bb2a-446dab01dddf",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird ein Rauchansaugsystem (RAS), auch als Brandfrühesterkennungsanlage bekannt, eingesetzt. Dieses System detektiert Brandpartikel in der Luft, lange bevor ein herkömmlicher Rauchmelder auslösen würde. Das RAS ist in die Löschanlagensteuerung und das Not-Aus-System integriert, um automatisierte Gegenmaßnahmen einzuleiten."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein VESDA-System (Very Early Smoke Detection Apparatus) mit mehreren Alarmstufen ist installiert. Bei der ersten Stufe (Information) wird eine Meldung an die Administratoren gesendet. Bei der zweiten Stufe (Voralarm) wird die Feuerwehr alarmiert. Bei der dritten Stufe (Hauptalarm) wird die Gaslöschanlage ausgelöst und die Stromversorgung im betroffenen Bereich abgeschaltet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des Konzepts und der Projektierungsunterlagen des Rauchansaugsystems. Überprüfung der Konfiguration der verschiedenen Alarmstufen und der damit verbundenen Aktionen. Analyse der Protokolle von Integrationstests der gesamten Wirkkette (Detektion, Alarmierung, Löschung, Abschaltung)."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c69fa1ee-be5d-4652-9bed-6d15da1e7181",
                "control-id": "GEB.11.1.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a9-m1",
                    "uuid": "75ddf582-87c3-4433-aa7d-cc1f0fb68d5a",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es sind einige wenige Handfeuerlöscher vorhanden, die jedoch für Brände in elektrischen Anlagen ungeeignet sind (z. B. Wasserlöscher). Das Personal ist nicht in deren Gebrauch geschult."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Flur vor dem Serverraum hängt ein einzelner Pulverlöscher, dessen Einsatz im Serverraum zu massiven Folgeschäden an der IT führen würde. Eine Einweisung der Mitarbeiter hat nie stattgefunden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung der vorhandenen Feuerlöscher auf ihre Eignung für Elektrobrände (Kennzeichnung beachten). Anforderung von Schulungsnachweisen für den Umgang mit Feuerlöschern."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a9-m2",
                    "uuid": "9259d746-6b63-404a-b21a-892351f11864",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es sind ausreichend Handfeuerlöscher mit geeignetem Löschmittel (z. B. CO2) vorhanden und diese werden regelmäßig gewartet. Das Personal hat eine grundlegende Einweisung erhalten. Es gibt jedoch keine automatische Löschanlage oder ein definiertes Team für eine schnelle Reaktion."
                      },
                      {
                        "name": "guidance",
                        "value": "In und vor dem Serverraum sind CO2-Löscher gut sichtbar angebracht. Die Prüfplaketten sind aktuell. Alle Mitarbeiter haben an einer allgemeinen Brandschutzunterweisung teilgenommen, die auch den Umgang mit Feuerlöschern umfasste."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Anzahl, Platzierung und des Wartungszustands der Feuerlöscher. Anforderung der Teilnehmerlisten der letzten Brandschutzunterweisung."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a9-m3",
                    "uuid": "a00979a5-effe-4671-adda-8e4b5f003e3c",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In einem Rechenzentrum MUSS entweder eine Lösch- oder Brandvermeidungsanlage nach aktuellem Stand der Technik installiert sein ODER durch technische (insbesondere eine flächendeckende Brandfrüherkennung gemäß INF.2.A17) und organisatorische Maßnahmen (geschultes Personal und Reaktionspläne) MUSS sichergestellt sein, dass unmittelbar (innerhalb von maximal 3 Minuten) auf Meldungen der Brandfrüherkennung reagiert wird. In Serverräumen ohne solche Anlagen MÜSSEN Handfeuerlöscher mit geeigneten Löschmitteln in ausreichender Zahl und Größe vorhanden sein und alle Mitarbeitenden MÜSSEN in deren Benutzung eingewiesen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Da keine automatische Löschanlage vorhanden ist, wurde ein detaillierter Reaktionsplan erstellt. Die Brandfrüherkennung (RAS) ist an eine ständig besetzte Stelle gekoppelt. Das dortige Personal ist als Brandschutzhelfer geschult und hat die Anweisung, bei einem Alarm sofort mit CO2-Löschern zum Serverraum zu eilen. Die maximale Reaktionszeit von 3 Minuten wird durch regelmäßige Übungen sichergestellt und protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des Reaktionsplans und der Schulungsnachweise der Brandschutzhelfer. Überprüfung der Protokolle der letzten Übungen zur Einhaltung der 3-Minuten-Frist. Falls eine Löschanlage vorhanden ist: Anforderung der Planungs- und Abnahmeunterlagen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a9-m4",
                    "uuid": "9aa0a8f7-c235-4093-8318-02dbc452f131",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In den primären IT-Betriebsbereichen ist eine automatische Gaslöschanlage (z.B. mit Inertgasen wie Argon oder Stickstoff oder chemischen Löschmitteln wie Novec 1230) installiert. Die Reaktionspläne für eine Auslösung werden vierteljährlich geübt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Serverraum ist mit einer Argon-Gaslöschanlage ausgestattet. Vor dem Auslösen gibt es eine optische und akustische Vorwarnzeit, um Personen das Verlassen des Raumes zu ermöglichen. Die Übungen zur Evakuierung und zum Verhalten nach einer Löschung werden protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Planungs-, Abnahme- und Wartungsdokumentation der Gaslöschanlage. Anforderung der Protokolle der letzten Evakuierungsübungen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a9-m5",
                    "uuid": "46d5a3e1-233c-429b-853f-baa31b5e3dfd",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist eine Brandvermeidungsanlage mittels Sauerstoffreduktion installiert. Diese Anlage schafft permanent eine Atmosphäre, in der sich ein Brand gar nicht erst entzünden kann. Das System wird kontinuierlich überwacht und stellt das höchste Schutzniveau dar, da es Brände proaktiv verhindert statt sie nur zu bekämpfen."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Anlage zur hypoxischen Lufttechnologie reichert die Raumluft permanent mit Stickstoff an und senkt den Sauerstoffgehalt auf ca. 15 %. Dieser Wert wird durch redundante Sensoren permanent überwacht. Ein Betreten des Raumes durch Personal ist weiterhin sicher möglich. Das System verhindert die Brandentstehung und vermeidet so jegliche Ausfallzeiten oder Schäden durch Feuer oder Löschmittel."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Planungs- und Sicherheitsdokumentation der Brandvermeidungsanlage, einschließlich der Nachweise zur gesundheitlichen Unbedenklichkeit. Überprüfung der historischen Daten der Sauerstoffsensoren zur Kontrolle der Einhaltung des Sollwerts."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "5d4098ca-7244-472c-bbbe-dba8d82c9683",
                "control-id": "GEB.11.1.8",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "PERF",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a10-m1",
                    "uuid": "0b2ab717-09ac-4806-98ef-50ddb9088529",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wartungs- und Inspektionsarbeiten werden rein reaktiv durchgeführt, also erst dann, wenn eine Komponente bereits ausgefallen ist. Es gibt keine präventive Instandhaltung."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Klimaanlage wird erst repariert, wenn sie nicht mehr kühlt. Ein defektes Brandschott wird erst bei der nächsten Baumaßnahme zufällig entdeckt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung von Wartungsplänen und -protokollen. Wenn keine existieren, ist die Anforderung nicht erfüllt. Überprüfung von Störungstickets, um zu sehen, ob Wartungen immer auf Ausfälle folgen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a10-m2",
                    "uuid": "d99a4fcf-2f8c-4cf6-81bd-de3b213a46b9",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert ein grundlegender Wartungsplan für die wichtigsten Systeme wie USV und Klimaanlage. Dieser wird jedoch nicht immer strikt befolgt oder lückenhaft dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine Checkliste für die jährliche Wartung, aber die Termine werden manchmal um Monate verschoben, wenn andere Aufgaben wichtiger erscheinen. Die Protokolle werden nur unvollständig ausgefüllt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des Wartungsplans und der zugehörigen Protokolle. Vergleich der geplanten mit den tatsächlichen Wartungsterminen. Prüfung der Protokolle auf Vollständigkeit."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a10-m3",
                    "uuid": "4d8bace3-6fd5-46a0-b506-8c8913ed1d58",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für alle Komponenten der baulich-technischen Infrastruktur MÜSSEN mindestens die vom herstellenden Unternehmen empfohlenen oder durch Normen festgelegten Intervalle und Vorschriften für Inspektion und Wartung eingehalten werden. Inspektionen und Wartungsarbeiten MÜSSEN protokolliert werden. Brandschotten MÜSSEN daraufhin geprüft werden, ob sie unversehrt sind. Die Ergebnisse MÜSSEN dokumentiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es bestehen Wartungsverträge für alle wesentlichen Infrastrukturkomponenten (Klima, USV, NEA, BMA, Löschanlage). Die Wartungsintervalle entsprechen den Vorgaben der Hersteller und der relevanten Normen (z.B. DIN VDE). Alle durchgeführten Arbeiten und Prüfungen, einschließlich der Sichtprüfung der Brandschotts, werden in einem zentralen Wartungsprotokoll erfasst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Wartungsverträge und der zentralen Wartungsdokumentation. Stichprobenartiger Vergleich der Intervalle mit den Herstellervorgaben. Überprüfung der Protokolle auf Vollständigkeit und Nachvollziehbarkeit, insbesondere die Prüfung der Brandschotts."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a10-m4",
                    "uuid": "d9dd4e95-0d99-4941-bd5d-e8e21c6d72b8",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zur Planung, Steuerung und Dokumentation aller Wartungsaktivitäten wird ein computergestütztes Instandhaltungsplanungssystem (IPS) oder ein Computerized Maintenance Management System (CMMS) eingesetzt. Dieses System generiert automatisch Wartungsaufträge und eskaliert überfällige Arbeiten."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle Infrastrukturanlagen sind mit ihren Wartungsplänen in einem CMMS erfasst. Das System erstellt automatisch Tickets für fällige Wartungen und weist sie den zuständigen Technikern zu. Der Status aller Wartungsarbeiten ist jederzeit transparent einsehbar."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung eines Auszugs aus dem CMMS, der die Wartungshistorie einer ausgewählten Anlage (z.B. Klimaanlage) der letzten zwei Jahre zeigt. Überprüfung der Konfiguration der automatischen Auftragserstellung und Eskalation."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a10-m5",
                    "uuid": "dec1d34b-706b-4107-bb33-d6ee060771c1",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden vorausschauende Wartungstechniken (Predictive Maintenance) eingesetzt. Anhand von Sensordaten (z. B. Schwingungen, Temperaturen, Laufzeiten) und Analysen werden Ausfälle vorhergesagt, bevor sie auftreten, und Wartungsarbeiten proaktiv und bedarfsgerecht geplant."
                      },
                      {
                        "name": "guidance",
                        "value": "An den Motoren der Klimaanlagen sind Schwingungssensoren angebracht. Eine Analysesoftware überwacht die Schwingungsmuster und meldet, wenn ein Lagerverschleiß wahrscheinlich wird, sodass das Lager ausgetauscht werden kann, bevor es zu einem Ausfall kommt. Ähnliche Verfahren werden für USV-Batterien (Impedanzmessung) und andere kritische Komponenten verwendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Konzepte für Predictive Maintenance. Überprüfung der Analysesoftware und der historischen Sensordaten. Anforderung von Beispielen, bei denen eine Wartung aufgrund einer Vorhersage erfolgreich durchgeführt wurde."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c2743ecd-c65a-497f-8ffb-ba52bc2c3ff2",
                "control-id": "GEB.11.2.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a11-m1",
                    "uuid": "ca794ea7-f99f-4674-805b-b7f438929113",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt keine automatische Überwachung. Die Funktionsfähigkeit der Infrastruktur wird nur durch manuelle Kontrollgänge oder bei einem Ausfall festgestellt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Leck wird erst bemerkt, wenn Wasser auf dem Boden sichtbar ist. Ein USV-Fehler wird erst bei einem Stromausfall bemerkt, wenn die IT-Systeme trotzdem ausfallen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Fragen nach dem Prozess zur Überwachung von Infrastrukturkomponenten. Wenn dieser rein manuell ist, ist die Anforderung nicht erfüllt. Überprüfung der Checklisten für Kontrollgänge, falls vorhanden."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a11-m2",
                    "uuid": "c838810f-f8b2-4c4f-9ba3-17d2a68c0212",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Einige Systeme, wie z. B. die USV, verfügen über lokale Alarme (z. B. eine rote Lampe oder ein Piepton). Es gibt jedoch keine zentrale Überwachung oder ein automatisches Benachrichtigungssystem, das die Alarme an zuständiges Personal weiterleitet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die USV piept, wenn sie auf Batteriebetrieb umschaltet. Wenn aber niemand im Raum ist, der dies hört, wird die Störung nicht bemerkt. Es gibt keine Anbindung an ein Netzwerk-Monitoringsystem."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung der Infrastrukturkomponenten auf lokale Alarmanzeigen. Überprüfung, ob diese Alarme an ein zentrales System (z.B. per SNMP oder Modbus) angebunden sind. Simulieren eines Alarms (falls möglich), um zu sehen, was passiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a11-m3",
                    "uuid": "c6730cb5-11c2-4de0-b7b3-c83c3600b5a1",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Einrichtungen der Infrastruktur, wie z. B. Leckageüberwachung, Klima-, Strom- und USV-Anlagen, MÜSSEN automatisch überwacht werden. Erkannte Störungen MÜSSEN schnellstmöglich in geeigneter Weise weitergeleitet und bearbeitet werden. Die verantwortlichen Mitarbeitenden MÜSSEN zeitnah alarmiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle kritischen Infrastruktursysteme sind über potenzialfreie Kontakte oder Netzwerkschnittstellen (z.B. SNMP) an ein zentrales Monitoringsystem angebunden. Bei einer Störung wird automatisch ein Ticket im Ticketsystem erstellt und eine E-Mail an den Bereitschaftsdienst gesendet. Die Reaktionszeiten sind in einem SLA definiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des Konzepts für die Infrastrukturüberwachung. Überprüfung der Konfiguration des Monitoringsystems und der Alarmierungskette. Analyse von Störungstickets, um die Einhaltung der definierten Reaktionszeiten zu kontrollieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a11-m4",
                    "uuid": "177e6680-b108-471f-8b18-e36a6e5497c4",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Im Falle eines Serverraums SOLLTEN IT- und Supportgeräte, die nicht oder nur selten von einer Person bedient werden müssen, mit einer Fernanzeige für Störungen ausgestattet werden. Ein zentrales Gebäudemanagementsystem (GMS) oder ein Data Center Infrastructure Management (DCIM) Tool fasst alle Alarme zusammen und bietet ein einheitliches Dashboard für den schnellen Überblick."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein DCIM-System visualisiert den Zustand aller Infrastrukturkomponenten auf einem Dashboard. Neben Alarmen werden auch Betriebsparameter wie Stromverbrauch, Temperaturen und USV-Last in Echtzeit angezeigt. Dies ermöglicht eine schnelle Ursachenanalyse bei Störungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Live-Demonstration des GMS oder DCIM-Dashboards. Überprüfung, welche Systeme angebunden sind und welche Informationen visualisiert werden. Prüfen, ob die Fernanzeige auch für Geräte in Serverräumen umgesetzt ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a11-m5",
                    "uuid": "f05256ec-4c15-4d0a-a496-3976cda88735",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Überwachungssystem nutzt KI/ML-basierte Verfahren, um Ereignisse aus verschiedenen Systemen zu korrelieren, die eigentliche Ursache (Root Cause) zu identifizieren und potenzielle zukünftige Ausfälle auf der Grundlage von Mustern geringfügiger Alarme vorherzusagen (AIOps)."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine AIOps-Plattform analysiert die Logs und Metriken aller Infrastruktur- und IT-Systeme. Wenn die Temperatur in einem Rack langsam ansteigt und gleichzeitig die CPU-Last auf den Servern in diesem Rack zunimmt, korreliert das System diese Ereignisse und schlägt proaktiv vor, die Kühlung für diesen Bereich zu erhöhen, bevor ein Temperaturalarm ausgelöst wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des Konzepts und der Architektur der AIOps-Plattform. Überprüfung der implementierten Korrelationsregeln und Analysemodelle. Anforderung von Berichten, die zeigen, wie das System in der Vergangenheit proaktiv Probleme identifiziert und zur Lösung beigetragen hat."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "d402b665-bb8a-49cb-bf27-bfe4d14e166f",
                "control-id": "GEB.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a12-m1",
                    "uuid": "db91863a-f5a3-46dd-a37a-80de9743f3fe",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist kein klar definierter Perimeter um das Rechenzentrumsgebäude vorhanden. Die Grundstücksgrenze ist unmarkiert und frei zugänglich."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Rechenzentrum befindet sich auf einem Firmengelände, das nicht eingezäunt ist. Es gibt keine sichtbare Abgrenzung zum öffentlichen Raum."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Begehung des Außengeländes zur Überprüfung auf das Vorhandensein von Zäunen, Toren oder anderen Markierungen der Grundstücksgrenze."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a12-m2",
                    "uuid": "a3e6674e-9aa5-46a1-8d35-5f2ec65663c1",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein einfacher Zaun (z. B. Maschendraht) ist als physische Barriere um das Grundstück installiert. Es gibt jedoch keine zusätzliche Überwachung des Perimeters."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein 2 Meter hoher Maschendrahtzaun umgibt das Gelände. Tore sind mit einem einfachen Vorhängeschloss gesichert. Es gibt keine Kameras oder Bewegungsmelder am Zaun."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung des Zauns auf Zustand und Höhe. Überprüfung, ob zusätzliche Überwachungstechnik wie Kameras oder Detektionssysteme am Zaun installiert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a12-m3",
                    "uuid": "00d9e0f6-e9bb-47c5-b30f-fad868bba415",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert ein definierter Perimeter mit physischen Barrieren (z. B. ein stabiler Zaun). Es sind Schilder vorhanden, die Unbefugte vom Betreten abhalten und auf eine Überwachung hinweisen. Der Zugang wird über kontrollierte Tore oder Pforten geregelt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Stabgitterzaun sichert das Gelände. An den Toren ist eine Video-Gegensprechanlage installiert, die mit der Pforte verbunden ist. Schilder weisen darauf hin, dass das Gelände videoüberwacht wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Ausführung des Zauns und der Zugangstore. Kontrolle der Beschilderung. Test der Funktionalität der Gegensprechanlage am Tor."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a12-m4",
                    "uuid": "e984543e-4b8a-4f63-85da-07df2648d09f",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für Rechenzentren SOLLTE ein Perimeterschutz existieren. Je nach festgelegtem Schutzbedarf SOLLTE der Perimeterschutz aus folgenden Komponenten bestehen: äußere Umschließung, Sicherungsmaßnahmen gegen unbeabsichtigtes und beabsichtigtes gewaltloses Überwinden der Grundstücksgrenze, Freiland-Sicherungsmaßnahmen (z. B. Videoüberwachung), äußere Personen- und Fahrzeugdetektion und automatische Alarmierung."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein hoher Sicherheitszaun mit Unterkriechschutz ist installiert. Der Außenbereich wird durch Kameras mit Bewegungserkennung überwacht. Bei Detektion einer Bewegung im gesicherten Bereich wird automatisch ein Alarm an eine Sicherheitsleitstelle gesendet und die entsprechende Kamera aufgeschaltet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des Konzepts für den Perimeterschutz. Überprüfung der technischen Umsetzung der verschiedenen Komponenten (Zaun, Kameras, Detektion). Durchführung eines Tests, indem eine Person den detektierten Bereich betritt, und Überprüfung der Alarmierungskette."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a12-m5",
                    "uuid": "412f7db5-8b8e-471d-9184-27798692c6c4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Perimeterschutz umfasst mehrere gestaffelte Verteidigungslinien und Maßnahmen gegen beabsichtigtes gewaltsames Überwinden. Dies beinhaltet einen übersteigsicheren Zaun mit integrierter Detektionstechnik, eine sterile Zone mit Mikrowellen- oder Infrarotbarrieren und eine lückenlose Abdeckung durch PTZ-Kameras (Pan-Tilt-Zoom), die Eindringlinge automatisch verfolgen können (Auto-Tracking)."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein 3 Meter hoher Zaun ist mit einem faseroptischen Detektionssystem ausgestattet, das Kletterversuche meldet. Dahinter befindet sich eine 5 Meter breite, freigehaltene Zone, die von Infrarot-Lichtschranken überwacht wird. Löst ein Sensor aus, schwenkt die nächstgelegene PTZ-Kamera auf den Punkt, zoomt heran und verfolgt das Ziel automatisch."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des detaillierten Konzepts für den mehrstufigen Perimeterschutz. Überprüfung der Spezifikationen und der Konfiguration der verschiedenen Detektionssysteme und der PTZ-Kameras. Analyse der Protokolle von Integrationstests der Gesamtanlage."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "af236e1c-2633-4b9b-a457-ddb7993c38de",
                "control-id": "GEB.3.1.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a24-m1",
                    "uuid": "3a4bfaed-4362-43ae-8992-1c695623490e",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden Attrappen von Videokameras eingesetzt, die keine echte Überwachungsfunktion haben. Eine Beweissicherung ist nicht möglich."
                      },
                      {
                        "name": "guidance",
                        "value": "An den Eingängen sind leere Kameragehäuse montiert, um eine abschreckende Wirkung zu erzielen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung der Kameras. Überprüfung, ob Kabel zu den Kameras führen. Anforderung von Zugriff auf das Video-Management-System, um die Existenz von Live-Bildern oder Aufzeichnungen zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a24-m2",
                    "uuid": "e5ff2930-c8fc-43e2-8f12-a5f0889c3a04",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein CCTV-System mit Live-Bildern ist vorhanden, es werden jedoch keine Aufzeichnungen gespeichert. Eine nachträgliche Auswertung von Vorfällen ist nicht möglich."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Monitor in der Pforte zeigt die Live-Bilder von mehreren Kameras. Es ist jedoch kein Videorekorder (NVR/DVR) angeschlossen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung des Videoüberwachungssystems. Anforderung von aufgezeichnetem Material von einem bestimmten Zeitpunkt in der Vergangenheit."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a24-m3",
                    "uuid": "baddec0f-8e7b-403b-80df-d93d8d027142",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Videokameras sind an Ein- und Ausgängen sowie an anderen strategischen Punkten installiert. Die Aufzeichnungen werden für einen definierten Zeitraum (z. B. 72 Stunden) gespeichert, bevor sie überschrieben werden. Der Einsatz der Videoüberwachung wurde mit dem Datenschutzbeauftragten abgestimmt und die Mitarbeiter wurden informiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Kameras überwachen den Eingangsbereich, die Laderampe und die Gänge zwischen den Racks. Die Aufzeichnungen werden auf einem Network Video Recorder (NVR) gespeichert. Der Betriebsrat hat zugestimmt und der Datenschutzbeauftragte hat eine entsprechende Verfahrensdokumentation freigegeben. Hinweisschilder sind angebracht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Freigabedokumentation durch den Datenschutzbeauftragten. Überprüfung der Konfiguration des NVR bezüglich der Aufzeichnungsdauer. Kontrolle der Hinweisschilder vor Ort."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a24-m4",
                    "uuid": "403befe3-e7fd-48bd-976c-7d9f70344e92",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Zutrittskontrolle und die Einbruchmeldung SOLLTEN durch Videoüberwachungsanlagen ergänzt werden. Eine Videoüberwachung SOLLTE in das gesamte Sicherheitskonzept eingebettet werden. Bei der Planung, Konzeption und eventuellen Auswertung von Videoaufzeichnungen MUSS der Datenschutzbeauftragte immer mit einbezogen werden. Die für eine Videoüberwachung benötigten zentralen Technikkomponenten SOLLTEN geschützt aufgestellt werden. Es SOLLTE regelmäßig überprüft werden, ob die Anlage korrekt funktioniert und ob die abgestimmten Blickwinkel eingehalten werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Videoüberwachung ist integraler Bestandteil des Sicherheitskonzepts. Der NVR ist in einem separaten, abschließbaren Rack untergebracht. Jede Auswertung von Videomaterial wird nach dem Vier-Augen-Prinzip und unter Einbeziehung des Datenschutzbeauftragten oder Betriebsrats durchgeführt und protokolliert. Jährlich wird die korrekte Ausrichtung der Kameras überprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des Sicherheitskonzepts und Überprüfung des Kapitels zur Videoüberwachung. Anforderung der Protokolle von Videoauswertungen. Überprüfung der Prüfprotokolle zur Kameraausrichtung."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a24-m5",
                    "uuid": "fe524062-95e5-4fee-a37a-6c80d66834d8",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein hochauflösendes Videoüberwachungssystem ist mit dem Zutrittskontrollsystem gekoppelt. Wenn eine Zutrittskarte verwendet wird oder ein Einbruchalarm ausgelöst wird, zeichnen die relevanten Kameras automatisch in höherer Qualität auf und markieren das Ereignis. Das Videomaterial wird mit KI-basierter Analyse auf Anomalien (z. B. eine Person, die sich verdächtig lange in einem Bereich aufhält, zurückgelassene Objekte) überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei jeder Türbuchung wird ein Lesezeichen in der Videoaufzeichnung gesetzt, das ein Standbild der Person zeigt. Eine Videoanalyse-Software ist so konfiguriert, dass sie einen Alarm auslöst, wenn eine Person länger als 10 Minuten im Kaltgang verweilt, ohne eine Tätigkeit am Rack auszuführen ('loitering detection')."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Konfiguration der Kopplung zwischen Zutrittskontrolle und Videoüberwachung. Anforderung der Spezifikation und Konfiguration der Videoanalyse-Software. Analyse der Alarmprotokolle der Videoanalyse."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "7efd170c-a806-4961-a516-598047d29205",
                "control-id": "GEB.3.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a6-m1",
                    "uuid": "87daf6c5-086e-4c94-9cb5-0a7c146c3267",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Tür zum Serverraum ist mit einem einfachen mechanischen Schloss gesichert. Schlüssel wurden an eine unbestimmte Anzahl von Personen ohne formale Dokumentation oder Rückgabeprozess ausgegeben."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein Standard-Profilzylinder verwendet. Wer alles einen Schlüssel besitzt, ist nicht mehr nachvollziehbar. Es gibt keine Protokollierung, wer den Raum wann betritt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Schlüsselausgabeliste. Wenn keine Liste existiert, ist die Anforderung nicht erfüllt. Befragung von Mitarbeitern, wer Zutritt hat und wie dieser geregelt ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a6-m2",
                    "uuid": "47753bdc-da79-4427-8f7f-22dcabafea7a",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Am Haupteingang des Rechenzentrums ist ein elektronisches Zutrittskontrollsystem (z. B. mit Kartenleser) installiert. Die Zutrittsprotokolle werden jedoch nicht regelmäßig oder nur bei einem konkreten Verdacht ausgewertet."
                      },
                      {
                        "name": "guidance",
                        "value": "Mitarbeiter erhalten Transponder-Karten für den Zutritt. Das System protokolliert alle Buchungen. Es gibt jedoch keinen Prozess zur regelmäßigen Überprüfung der Protokolle auf unautorisierte oder ungewöhnliche Zutrittsversuche."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Funktionalität des elektronischen Zutrittskontrollsystems. Anforderung der Zutrittsprotokolle der letzten 30 Tage. Befragung der Verantwortlichen nach dem Prozess zur Überprüfung dieser Protokolle."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a6-m3",
                    "uuid": "a8a1a53e-53d5-446d-a037-6953ce9c5e2d",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zutritt zum Rechenzentrum MUSS kontrolliert werden. Zutrittsrechte MÜSSEN gemäß der Vorgaben des Bausteins ORP.4 Identitäts- und Berechtigungsmanagement vergeben werden. Für im Rechenzentrum tätige Personen MUSS sichergestellt werden, dass diese keinen Zutritt zu IT-Systemen außerhalb ihres Tätigkeitsbereiches erhalten. Alle Zutrittsmöglichkeiten zum Rechenzentrum MÜSSEN mit Zutrittskontrolleinrichtungen ausgestattet sein. Jeder Zutritt zum Rechenzentrum MUSS von der Zutrittskontrolle individuell erfasst werden. Es MUSS regelmäßig kontrolliert werden, ob die Regelungen eingehalten werden. Die Anforderungen MÜSSEN in einem Konzept dokumentiert sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein dokumentiertes Zutrittskonzept legt fest, wer aus welchem Grund Zutritt erhält. Die Vergabe von Zutrittsberechtigungen folgt einem formalen Genehmigungsprozess. Alle Türen, einschließlich Notausgänge, sind mit Lesern und Kontakten versehen. Die Protokolle werden wöchentlich auf Auffälligkeiten geprüft. Der Entzug von Berechtigungen bei Personalwechsel ist sichergestellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anfordern des Zutrittskonzepts und der Prozessbeschreibung für die Rechtevergabe. Überprüfung der Zutrittsprotokolle und der Protokolle der Überprüfungen. Abgleich der Liste der Zutrittsberechtigten mit der aktuellen Personal- und Rollenliste der Institution."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a6-m4",
                    "uuid": "690cffcb-a94a-46fd-8da2-62d4b9dd59dc",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Im Falle eines Serverraums SOLLTE geprüft werden, ob eine Überwachung aller Zutrittsmöglichkeiten sinnvoll ist. Für besonders schutzbedürftige Bereiche innerhalb des Rechenzentrums wird ein Zwei-Faktor-Authentisierungssystem (z.B. Karte + PIN) eingesetzt. Die Überprüfung der Zutrittsberechtigungen (Re-Zertifizierung) wird mindestens vierteljährlich durchgeführt."
                      },
                      {
                        "name": "guidance",
                        "value": "Für den Haupt-Serverraum wird ein Kartenleser mit PIN-Pad verwendet. Fenster oder andere mögliche Zugänge werden per Magnetkontakt überwacht. Alle drei Monate wird den jeweiligen Vorgesetzten eine Liste ihrer zutrittsberechtigten Mitarbeiter zur Bestätigung vorgelegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der technischen Umsetzung der Zwei-Faktor-Authentisierung. Anfordern der Analyse zur Überwachung aller Zutrittsmöglichkeiten. Einsehen der Protokolle der letzten Re-Zertifizierungsrunden."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a6-m5",
                    "uuid": "ae482771-6883-4549-a6f9-66336130d1af",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zutritt wird durch biometrische Merkmale in Kombination mit Personenschleusen (Mantraps) kontrolliert, um Tailgating (das unerlaubte Hindurchschlüpfen einer zweiten Person) wirksam zu verhindern. Die Zutrittsprotokolle werden in Echtzeit automatisiert auf anomale Muster (z.B. Zutritt zu ungewöhnlichen Zeiten, wiederholte abgelehnte Versuche) analysiert, und bei Verdacht werden Sicherheitsalarme ausgelöst."
                      },
                      {
                        "name": "guidance",
                        "value": "Am Eingang zum IT-Betriebsbereich ist eine Personenschleuse mit integriertem Fingerabdruckleser und Gewichtssensorik installiert. Die Zutrittsdaten werden an ein SIEM-System gestreamt, das mit Regeln zur Anomalieerkennung konfiguriert ist. Ein Alarm wird direkt an den Sicherheitsdienst weitergeleitet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Beobachtung der Funktion der Personenschleuse im Betrieb. Überprüfung der Konfiguration der Anomalieerkennungsregeln im SIEM. Analyse der Alarmierungsprotokolle der letzten drei Monate auf generierte und bearbeitete Sicherheitsvorfälle."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c281eff1-da6e-4778-9436-999daf20ca19",
                "control-id": "GEB.3.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a7-m1",
                    "uuid": "a52ade41-02f1-4ec4-b2f7-07dc58454fe8",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Türen zum Serverraum werden aus Bequemlichkeit oft offengelassen oder mit Keilen blockiert, insbesondere während Wartungsarbeiten."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt keine verbindliche Anweisung oder Kultur, die Türen stets geschlossen zu halten. Das Personal empfindet das ständige Öffnen und Schließen als hinderlich."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Unangekündigte Begehung der Räumlichkeiten zu verschiedenen Tageszeiten, um zu prüfen, ob Türen offenstehen. Befragung des Personals nach den geltenden Regeln."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a7-m2",
                    "uuid": "eca516c8-0437-4140-b4c4-d863ef474244",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Türen und Fenster werden geschlossen gehalten, sind aber in Standardbauweise ausgeführt und bieten nur minimalen Widerstand gegen gewaltsames Eindringen. Ein Sichtschutz fehlt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Standard-Innentüren und normale Fenster verwendet. Von außen kann man durch die Fenster in den Raum und auf die Geräte blicken."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung der Bauart der Türen und Fenster. Überprüfung, ob von außen Einblick in den Raum möglich ist. Anforderung der Baubeschreibung zur Prüfung der Widerstandsklassen, falls vorhanden."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a7-m3",
                    "uuid": "cbc3e888-9b95-4a0f-b1ee-5513664580a5",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Türen des Rechenzentrums MÜSSEN stets verschlossen gehalten werden. Fenster MÜSSEN möglichst schon bei der Planung vermieden werden. Falls sie doch vorhanden sind, MÜSSEN sie ebenso wie die Türen stets verschlossen gehalten werden. Türen und Fenster MÜSSEN einen dem Sicherheitsniveau angemessenen Schutz gegen Angriffe und Umgebungseinflüsse bieten. Sie MÜSSEN mit einem Sichtschutz versehen sein. Dabei MUSS beachtet werden, dass die bauliche Ausführung aller raumbildenden Elemente in Bezug auf die erforderliche Schutzwirkung gleichwertig sein muss."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle Türen sind selbstschließend und -verriegelnd. Eventuell vorhandene Fenster sind mit Milchglasfolie versehen, um die Einsicht zu verhindern. Die Widerstandsfähigkeit der Wände, Decken, Böden und Türen ist aufeinander abgestimmt und im Sicherheitskonzept dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung, ob alle Türen mit Türschließern ausgestattet sind und korrekt schließen. Kontrolle des Sichtschutzes an Fenstern. Anforderung des Sicherheitskonzepts zur Überprüfung der definierten und abgestimmten Schutzwirkung der Raumelemente."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a7-m4",
                    "uuid": "d826ca5d-e0d8-4ea4-aa53-a1f708b9e2dc",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Türen und Fenster sind nach einer definierten Widerstandsklasse (z. B. RC 2 nach DIN EN 1627) zertifiziert. Es sind Türöffnungssensoren installiert, die überwacht werden und einen Alarm auslösen, wenn eine Tür zu lange offensteht (Tür-offen-Alarm)."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Türen sind als RC-2-Türen zertifiziert und entsprechend gekennzeichnet. Das Zutrittskontrollsystem ist so konfiguriert, dass nach 60 Sekunden Offenstand einer Tür ein Alarm an die Sicherheitszentrale gesendet wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfung der Zertifikate oder Kennzeichnungen der Türen und Fenster. Auslösung eines Test-Alarms, indem eine Tür absichtlich offengehalten wird, und Überprüfung der Alarmierungskette."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a7-m5",
                    "uuid": "19836c10-01ca-4162-9beb-efd65f6816f4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Hüllflächenelemente (Wände, Türen, Fenster) sind nach einer hohen Widerstandsklasse (z. B. RC 3 oder höher) zertifiziert. Zusätzlich sind Einbruchmeldeanlagen (z. B. Bewegungsmelder, Glasbruchsensoren) installiert und an eine zentrale Alarmanlage aufgeschaltet, die einen Einbruchsversuch detektiert und meldet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die gesamte Außenhülle des Rechenzentrums ist in RC-3-Bauweise ausgeführt. Der Innenraum wird durch Infrarot-Bewegungsmelder überwacht, die bei unbefugter Anwesenheit (außerhalb der normalen Betriebszeiten oder wenn der Raum als 'leer' deklariert ist) einen stillen Alarm an einen externen Sicherheitsdienstleister senden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Zertifizierungsdokumente für die Hüllflächenelemente auf die hohe Widerstandsklasse. Anforderung des Konzepts der Einbruchmeldeanlage. Durchführung eines Funktionstests der Einbruchmelder in Abstimmung mit dem Sicherheitsdienstleister."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "5a752cb7-416f-47c2-a244-24512d4c3833",
                "control-id": "GEB.3.6",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a28-m1",
                    "uuid": "b756f8d8-7612-403f-9442-2857446742d9",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden Gefahrenmelder aus dem Consumer-Bereich (z.B. batteriebetriebene Rauchmelder aus dem Baumarkt) eingesetzt. Diese bieten keine ausreichende Zuverlässigkeit für ein Rechenzentrum."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Serverraum sind einfache, nicht-zertifizierte Rauch- und Wassermelder installiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung der installierten Melder. Überprüfung der Typenschilder auf Zertifizierungen (z.B. VdS, EN)."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a28-m2",
                    "uuid": "980bf136-2a8c-4dc8-a09d-82b31ccf4804",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist eine kommerzielle, aber nicht nach VdS oder einer vergleichbaren Norm zertifizierte Gefahrenmeldeanlage installiert. Ihre Zuverlässigkeit und Sabotagesicherheit ist nicht nachgewiesen."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine proprietäre Alarmanlage eines lokalen Errichters ist im Einsatz. Das System hat keine anerkannte Zertifizierung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der technischen Dokumentation der Gefahrenmeldeanlage. Überprüfung, ob die Anlage oder ihre Komponenten über anerkannte Zertifikate verfügen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a28-m3",
                    "uuid": "57de350a-45fa-406f-aa71-2ae5f93c87de",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird eine Gefahrenmeldeanlage eingesetzt, deren Komponenten nach relevanten EN-Normen zertifiziert sind. Die Anlage bietet ein definiertes und nachvollziehbares Sicherheitsniveau."
                      },
                      {
                        "name": "guidance",
                        "value": "Die installierte Einbruchmeldeanlage ist nach EN 50131 Grad 2 zertifiziert. Dies stellt einen soliden Basisschutz dar."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Konformitätserklärungen und Zertifikate für die Komponenten der Gefahrenmeldeanlage. Überprüfung der Übereinstimmung mit den relevanten EN-Normen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a28-m4",
                    "uuid": "e512cfba-33b4-48e2-838f-a370d4ce8016",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird eine nach VdS (Vertrauen durch Sicherheit) zertifizierte Gefahrenmeldeanlage der Klassen A oder B eingesetzt. Diese bieten eine höhere Zuverlässigkeit und einen besseren Schutz gegen Sabotage als nicht-zertifizierte Systeme."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine VdS-zertifizierte Einbruchmeldeanlage der Klasse B ist installiert. Die Installation wurde von einem VdS-anerkannten Errichter durchgeführt und abgenommen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des VdS-Attests für die installierte Gefahrenmeldeanlage. Überprüfung, ob die Installation durch einen zertifizierten Errichter erfolgte."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a28-m5",
                    "uuid": "9cb201c5-0c38-4b58-ae91-ccaf0d094de3",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für Rechenzentrumsbereiche mit erhöhtem Schutzbedarf SOLLTEN ausschließlich Gefahrenmeldeanlagen der VdS-Klasse C (gemäß VdS-Richtlinie 2311) eingesetzt werden. Diese Klasse bietet das höchste Niveau an Sicherheit, Zuverlässigkeit und Sabotageschutz."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Einbruchmeldeanlage, die das gesamte Rechenzentrum sichert, ist nach VdS-Klasse C zertifiziert. Dies ist oft eine Anforderung von Versicherungen für hochkritische Risiken. Die Anlage verfügt über erweiterte Überwachungsfunktionen für alle Komponenten und Übertragungswege."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung des VdS-Attests, das die Zertifizierung der Anlage nach Klasse C bestätigt. Überprüfung der Systemdokumentation auf die Umsetzung der spezifischen Anforderungen der Klasse C, wie z.B. erweiterte Sabotageüberwachung."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "9e9fe828-8ca3-4af4-9045-5abfe7864f7a",
                "control-id": "GEB.4.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a16-m1",
                    "uuid": "0b733c13-80e8-43ef-bcfb-804ce8688540",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird Komfort-Klimatisierung (übliche Büro-Klimaanlagen) eingesetzt, die nicht für den 24/7-Dauerbetrieb oder die hohe sensible Wärmelast von IT-Geräten ausgelegt ist. Dies führt oft zu Ausfällen und unzureichender Kühlung."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein mobiles Klimagerät oder eine Split-Klimaanlage aus dem Baumarkt wird zur Kühlung verwendet. Das Kondenswasser muss manuell entleert werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung der installierten Klimageräte. Überprüfung der technischen Daten, um festzustellen, ob es sich um Präzisionsklimageräte für den IT-Einsatz handelt."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a16-m2",
                    "uuid": "4bf64546-45e9-4c25-afd5-a22eae3de6cf",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein dediziertes Präzisionsklimagerät ist installiert, es ist jedoch nur ein einzelnes Gerät ohne Redundanz (N-Konfiguration) vorhanden. Bei einem Ausfall dieses Geräts fällt die gesamte Kühlung aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein einzelnes, aber für den IT-Betrieb ausgelegtes Klimagerät kühlt den Serverraum. Es gibt kein Ersatzgerät. Ein Ausfall führt unweigerlich zu einer schnellen Überhitzung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Anzahl der installierten Klimageräte. Anforderung des Klimakonzepts, um die Redundanzauslegung zu prüfen. Wenn nur ein Gerät vorhanden ist, ist die Anforderung nur grundlegend erfüllt."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a16-m3",
                    "uuid": "55f604b7-d101-4fcf-b230-78889478f925",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE sichergestellt werden, dass im Rechenzentrum geeignete klimatische Bedingungen geschaffen und aufrechterhalten werden. Die Klimatisierung SOLLTE für das Rechenzentrum ausreichend dimensioniert sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Es sind Präzisionsklimageräte installiert, deren Gesamtkapazität die berechnete maximale Wärmelast des Rechenzentrums mit einem Sicherheitsaufschlag abdeckt. Die Auslegung ist dokumentiert. Die Luftführung ist so gestaltet, dass eine gleichmäßige Kühlung der Racks erreicht wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Planungsunterlagen für die Klimatisierung, einschließlich der Wärmelastberechnung. Vergleich der berechneten Last mit der installierten Kühlkapazität. Überprüfung der Luftführung im Rechenzentrum auf Plausibilität."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a16-m4",
                    "uuid": "d08ea1a8-cc8e-43ea-8a3c-19a8a986bc1e",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle relevanten Werte (Temperatur, Feuchte) SOLLTEN ständig überwacht werden. Weicht ein Wert von der Norm ab, SOLLTE automatisch alarmiert werden. Die Klimaanlagen SOLLTEN in IT-Betriebsbereichen möglichst ausfallsicher, z.B. durch eine N+1 Redundanz, ausgelegt sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Es sind drei Klimageräte installiert, obwohl zwei für die maximale Last ausreichen würden (N+1). Fällt ein Gerät aus, übernehmen die beiden anderen die volle Last. Die Temperatur wird an mehreren Stellen im Raum überwacht und bei Abweichungen wird eine automatische Benachrichtigung an den Bereitschaftsdienst ausgelöst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung des Redundanzkonzepts (N+1) der Klimaanlage. Kontrolle der Konfiguration der Überwachung und Alarmierung. Simulieren des Ausfalls eines Klimageräts (falls möglich), um die Lastübernahme und Alarmierung zu testen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a16-m5",
                    "uuid": "a7ca364e-215e-4b0e-8e0e-3ebdbf566416",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein vollständig redundantes (2N) Kühlsystem ist im Einsatz, das oft unterschiedliche Technologien kombiniert (z. B. Kaltwassersatz und Direktverdampfung). Zur Maximierung der Effizienz ist eine Kaltgang- oder Warmgangeinhausung implementiert. Das gesamte System wird von einer DCIM-Plattform basierend auf Echtzeit-Temperaturdaten auf Rack-Ebene dynamisch gesteuert."
                      },
                      {
                        "name": "guidance",
                        "value": "Zwei komplett unabhängige Kühlsysteme (A- und B-Versorgung) versorgen das Rechenzentrum. Die Kaltgänge sind physisch eingehaust. Die DCIM-Software regelt die Klimageräte so, dass die Zulufttemperatur an den Rack-Fronten konstant bei 22°C liegt, was die Energieeffizienz maximiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Anforderung der Planungsunterlagen des 2N-Kühlsystems und der Einhausung. Überprüfung der Konfiguration der DCIM-Steuerung. Analyse der historischen Temperatur- und Effizienzdaten (PUE), um die Wirksamkeit der Regelung zu beurteilen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e7081995-368a-48b8-9601-07a0431231b7",
                "control-id": "GEB.4.1.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.2.a5-m1",
                    "uuid": "d5d36d98-3fc9-4f6c-9663-d7f22a9d195e",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist eine Klimatisierung vorhanden, diese wird jedoch nicht überwacht. Die Temperatur wird nur sporadisch und manuell (z.B. durch Fühlen) kontrolliert, ohne systematische Erfassung."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein einfaches Klimagerät läuft im Dauerbetrieb. Es gibt kein Thermometer im Raum. Ob es zu warm oder zu kalt ist, wird nach persönlichem Empfinden der Mitarbeiter beurteilt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Sichtprüfung, ob ein Thermometer und ein Hygrometer im Raum vorhanden sind. Befragung der Mitarbeiter, wie und wie oft Temperatur und Luftfeuchtigkeit überprüft werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a5-m2",
                    "uuid": "b54dc001-d936-4f29-85d0-b97ff6eef889",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Temperatur und Luftfeuchtigkeit werden durch Sensoren überwacht, es gibt jedoch keine automatisierte Aufzeichnung der Werte oder eine Alarmierung bei Grenzwertüberschreitungen. Die Werte müssen manuell von einem Display abgelesen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein digitales Thermometer/Hygrometer mit Display ist im Raum installiert. Die Mitarbeiter sind angewiesen, bei ihren täglichen Kontrollgängen auf die Werte zu achten. Es gibt keine Langzeitaufzeichnung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung des Vorhandenseins von Überwachungsgeräten mit Display. Anforderung von manuell geführten Logbüchern oder Checklisten, in denen die Werte eingetragen werden. Prüfen, ob es Anweisungen für den Fall einer Abweichung gibt."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a5-m3",
                    "uuid": "9633b16a-65db-4516-b9c2-accd7df71517",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS sichergestellt werden, dass die Lufttemperatur und Luftfeuchtigkeit im IT-Betriebsbereich innerhalb der von den Herstellern vorgeschriebenen Grenzwerte liegen. Die tatsächliche Wärmelast in den gekühlten Bereichen MUSS in regelmäßigen Abständen überprüft werden. Eine vorhandene Klimatisierung MUSS regelmäßig gewartet werden. Die Parameter Temperatur und Feuchtigkeit MÜSSEN mindestens so aufgezeichnet werden, dass sich rückwirkend erkennen lässt, ob Grenzwerte überschritten wurden."
                      },
                      {
                        "name": "guidance",
                        "value": "Sensoren für Temperatur und Luftfeuchtigkeit sind installiert. Ihre Werte werden in einem zentralen System (z.B. Monitoring-Software wie Nagios oder Zabbix) minütlich erfasst und für mindestens 30 Tage gespeichert. Die Wärmelast wird halbjährlich durch Messung der Stromaufnahme der Racks neu bewertet. Es besteht ein Wartungsvertrag für die Klimaanlage."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Einsichtnahme in die historischen Daten des Überwachungssystems, um die Einhaltung der Grenzwerte in der Vergangenheit zu prüfen. Anforderung der Dokumentation zur letzten Wärmelastberechnung. Überprüfung der Wartungsprotokolle der Klimaanlage."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a5-m4",
                    "uuid": "fc8b884e-4d4e-4663-bf5a-91e0eaa9e354",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist eine automatische Alarmierung bei jeder Abweichung von den definierten Schwellenwerten für Temperatur und Luftfeuchtigkeit eingerichtet. Die aufgezeichneten Daten werden regelmäßig analysiert, um Trends zu erkennen und die Kühlleistung proaktiv anzupassen, bevor es zu Problemen kommt."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Monitoringsystem sendet bei Grenzwertüberschreitung automatisch eine E-Mail und eine SMS an den Bereitschaftsdienst. Quartalsweise werden die aufgezeichneten Temperaturverläufe ausgewertet, um Hotspots oder schleichende Temperaturanstiege zu identifizieren und die Luftführung oder die Solltemperatur der Klimageräte anzupassen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Konfiguration der Alarmierungsregeln im Überwachungssystem. Auslösung eines Testalarms zur Verifizierung der Benachrichtigungskette. Anforderung der Berichte aus der quartalsweisen Trendanalyse."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.2.a5-m5",
                    "uuid": "257a669c-dd3d-4df4-8886-090d6b8f2ab1",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein hochentwickeltes Umgebungsüberwachungssystem mit Sensoren an mehreren strategischen Punkten (z. B. Lufteinlass und -auslass jedes Racks, im Kalt- und Warmgang) ist im Einsatz. Das System ist in ein Gebäudemanagementsystem (GMS) oder DCIM (Data Center Infrastructure Management) integriert und ermöglicht die automatisierte, dynamische Steuerung und Optimierung der Kühlsysteme, beispielsweise durch Kaltgangeinhausung."
                      },
                      {
                        "name": "guidance",
                        "value": "In jedem Rack sind vorne und hinten Temperatursensoren installiert. Diese Daten werden von einer DCIM-Software erfasst. Die Software regelt die Drehzahl der Lüfter in den Klimageräten dynamisch, um die Temperatur im Kaltgang exakt auf dem Sollwert zu halten und so den Energieverbrauch zu minimieren. Die Kaltgänge sind physisch eingehaust, um eine Vermischung von kalter und warmer Luft zu verhindern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung des Sensor-Layouts im Rechenzentrum und in den Racks. Anforderung der Konfigurations- und Regelungsdokumentation des DCIM/GMS. Analyse der historischen Daten zur Effizienz der Kühlung (z.B. PUE-Wert) und der Stabilität der Temperaturen an den Rack-Einlässen."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}