{
  "component-definition": {
    "uuid": "dae2d94c-6f71-420a-9835-506d67c82885",
    "metadata": {
      "title": "APP.2.2 Active Directory Domain Services - Benutzerdefiniert",
      "last-modified": "2025-11-14T22:08:53.934907+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "2d58797c-d96f-4db3-8f99-8d48821a0fab",
        "type": "software",
        "title": "APP.2.2 Active Directory Domain Services",
        "description": "This component represents the implementation of all controls for Baustein APP.2.2.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Active Directory (AD) ist ein Sammelbegriff für verschiedene von Microsoft für Windows Server entwickelte Serverrollen. Die Serverrolle Active Directory Domain Services (AD DS) aggregiert sowohl Funktionalitäten eines Verzeichnis-, als auch Authentifizierungs- und Autorisierungsdienstes sowie einer zentralen Konfigurationsverwaltung für Windows-Infrastrukturen.<BR>Active Directory Domain Services wird hauptsächlich in Netzen eingesetzt, die vorrangig von Microsoft-basierten Betriebssystemen geprägt sind. Ein AD DS speichert und verwaltet Informationen zu Netzressourcen (z. B. Benutzende, Computer und Geräte). Bei Bedarf können diese Informationen, wie in LDAP-Verzeichnisdiensten üblich, auch um anwendungsspezifische Daten erweitert werden. Es dient Anwendenden und Administrierenden dazu, diese Informationen in einer hierarchischen Struktur zu organisieren, bereitzustellen und zu nutzen. Dabei strukturiert AD DS die Objekte in Namensräumen, die als Gesamtstrukturen, Domänen und Organisationseinheiten bezeichnet werden. Eine Gesamtstruktur bildet eine hierarchische Sammlung von Domänen, die jeweils mehrere Organisationseinheiten enthalten können. Die erste und damit in der Hierarchie oben angeordnete Domäne, die in einer Gesamtstruktur angelegt wird, übernimmt systembedingt die Rolle der „Gesamtstruktur Stammdomäne“ (englisch „forest root domain“) und beinhaltet die administrativen Gruppen, die für gesamtstrukturweite Verwaltungsaufgaben wie beispielsweise das Hinzufügen weiterer Domänen oder Schemaänderungen zuständig sind. Alle Domänen innerhalb einer Gesamtstruktur sind implizit durch bidirektionale, transitive Vertrauensstellungen miteinander verknüpft, so dass die Gesamtstruktur eine logische Sicherheitsgrenze darstellt.<BR>Als Authentisierungsprotokoll nutzt AD DS im Standard Kerberos v5 (in einer durch Microsoft erweiterten Implementierung). Zusätzlich steht weiterhin auch noch das Protokoll NTLM (New Technology LAN Manager) zur Verfügung. NTLM kann dabei einfacher von Angreifenden ausgenutzt werden. Windows Server mit der Serverrolle AD DS werden als Domänencontroller bezeichnet. Aus Verfügbarkeitsgründen werden häufig mehrere Domänencontroller verteilt eingesetzt. Das AD DS bietet außerdem die Möglichkeit eines „Read-Only-Betriebs“ eines Domänencontrollers, der für Standorte mit erhöhtem Risiko für die physische Sicherheit vorgesehen ist."
          },
          {
            "name": "Zielsetzung",
            "value": "Das Ziel dieses Bausteins ist es, Active Directory Domain Services im Regelbetrieb einer Institution abzusichern, die AD DS zur Verwaltung von Windows-Systemen (Client und Server) sowie zur zentralen Authentifizierung und Autorisierung einsetzt."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein APP.2.2 Active Directory Domain Services ist für alle verwendeten Verzeichnisdienste anzuwenden, die auf Microsoft Active Directory Domain Services basieren. Er kann zusätzlich für die Modellierung von Active Directory Lightweight Directory Services (AD LDS), die einen reduzierten Funktionsumfang von AD DS bieten, in Teilen verwendet werden.<BR>In diesem Baustein werden die für Active Directory Domain Services spezifischen Gefährdungen und Anforderungen betrachtet. Allgemeine Sicherheitsempfehlungen zu Verzeichnisdiensten finden sich im Baustein APP.2.1 Allgemeiner Verzeichnisdienst. Die dort beschriebenen allgemeinen Anforderungen werden im vorliegenden Baustein konkretisiert und ergänzt. Dieser Baustein wiederholt nicht die Anforderungen zur Absicherung der Betriebssysteme der Server und Clients, die für den Betrieb und die Verwaltung des AD DS genutzt werden, wie z. B. SYS.1.2.3 Windows Server oder SYS.2.2.3 Clients unter Windows. Dieser Baustein geht auch nicht erneut auf die Anforderungen der zugrundeliegenden Netzinfrastruktur ein.<BR>Active Directory Domain Services sollte nicht losgelöst von den Bausteinen ORP.4 Identitäts- und Berechtigungsmanagement, OPS.1.1.3 Patch- und Änderungsmanagement, CON.3 Datensicherungskonzept, OPS.1.2.2 Archivierung, OPS.1.1.5 Protokollierung, sowie OPS.1.1.2 Ordnungsgemäße IT-Administration, OPS.1.2.5 Fernwartung, DER.1 Detektion von sicherheitsrelevanten Ereignissen, DER.2 Security Incident Management, DER.4 Notfallmanagement und APP.3.6 DNS-Server modelliert werden. Es ist davon auszugehen, dass sich die Anforderungen dieser Bausteine wechselseitig beeinflussen."
          },
          {
            "name": "2.1. Unzureichende Planung der Sicherheitsgrenzen",
            "value": "In AD DS existieren verschiedene Arten von Grenzen. Diese Grenzen definieren die Gesamtstruktur (englisch Forest), die Domäne, die Standorttopologie und die Zuweisung von Rechten. Eine AD-DS-Instanz erzeugt zunächst eine Gesamtstruktur (engl. Forest) als Container auf höchster Ebene für alle Domänen dieser Instanz. Eine Gesamtstruktur kann ein oder mehrere Domänen-Containerobjekte enthalten, die über eine gemeinsame logische Struktur, einen Global Catalog, ein Schema und automatische bidirektionale, transitive Vertrauensbeziehungen verfügen. Dies bedeutet, dass zwischen Domänen innerhalb einer Gesamtstruktur sowohl das Vertrauen zueinander, also auch der Zugriff aufeinander, beidseitig möglich ist. Die Gesamtstruktur stellt also systembedingt die Sicherheitsgrenze dar, innerhalb derer Informationen standardmäßig im AD DS weitergegeben werden. Eine Domäne bildet dabei nur eine Verwaltungsgrenze. Werden Sicherheitsgrenzen nicht entlang der Gesamtstrukturgrenzen realisiert, kann eine Kompromittierung ein höheres Schadensausmaß als erwartet erzeugen, da sie zu einer Kompromittierung aller IT-Systeme in der Gesamtstruktur führen kann. Diese Gefährdung ist eine Besonderheit beim AD DS, da sich die Planung einer Partitionierung im Verzeichnisdienst produktbedingt nicht vollständig umsetzen lässt. Eine vollständige Kompromittierung einer Gesamtstruktur bedeutet, dass Angreifende Kontrolle über alle Objekte, die zu den enthaltenen Domänen gehören, also unter anderem alle Konten und alle IT-Systeme, haben. Damit haben diese potentiell auch Kontrolle über die zugehörigen IT-Systeme und Dienste."
          },
          {
            "name": "2.2. Zu viele oder nachlässige Vertrauensbeziehungen",
            "value": "Vertrauensbeziehungen zwischen Domänen und zwischen Gesamtstrukturen ermöglichen es, Konten einer anderen Domäne oder Gesamtstruktur Zugriff auf Ressourcen innerhalb der eigenen Domäne oder Gesamtstruktur zu gewähren. Werden die Vertrauensbeziehungen zwischen Gesamtstrukturen und zwischen Domänen nicht initial und regelmäßig daraufhin evaluiert, ob sie benötigt werden und ob die Sicherheitskontrollen rund um diese Vertrauensbeziehungen ausreichend sind, können Probleme mit Berechtigungen auftreten und Informationen abfließen. Insbesondere wenn die standardmäßig aktive SID-(Security Identifier)-Filterung deaktiviert wird, können komplexe, schwer zu durchschauende Konfigurationsfehler, die zu einer missbräuchlich Nutzung der Vertrauensstellung und zu weitreichenden Zugriffsrechten führen können, auftreten. Gleiches gilt, wenn auf „Selective Authentication“ bei Vertrauensbeziehungen zwischen Gesamtstrukturen verzichtet wird."
          },
          {
            "name": "2.3. Fehlende Sicherheitsfunktionen durch ältere Betriebssysteme und Domänen- und Gesamtstruktur-Funktionsebenen",
            "value": "Bis einschließlich Windows Server 2016 bringt jede neue Generation des Betriebssystems Windows Server zusätzliche Sicherheitsfunktionen und -erweiterungen in Bezug auf AD DS in Form von Domänen- bzw. Gesamtstruktur-Funktionsebenen mit. Werden ältere Betriebssysteme als Domänencontroller bzw. veraltete Domänen- oder Gesamtstruktur-Funktionsebenen eingesetzt, können zeitgemäße Sicherheitsfunktionen nicht genutzt werden. Dies erhöht die Gefahr unsicherer Standardeinstellungen. Eine unsicher konfigurierte Gesamtstruktur oder Domäne gefährdet die darin verarbeiteten Informationen und erleichtert Angriffe durch Dritte."
          },
          {
            "name": "2.4. Betrieb weiterer Rollen und Dienste auf Domänencontrollern",
            "value": "Werden neben AD DS auf einem Domänencontroller noch weitere Dienste betrieben, erhöht dies, neben den durch AD DS sowieso schon stark kumulierten Diensten, zusätzlich die Angriffsfläche dieser zentralen Komponente durch mögliche zusätzliche Schwachstellen und Fehlkonfigurationen. Solche Dienste können bewusst oder unbewusst missbraucht werden, um z. B. Informationen unberechtigt zu kopieren, zu verändern oder, im Fall von Schwachstellen oder Fehlkonfigurationen, die zur Kompromittierung des Domänencontrollers führen, die Domäne oder Gesamtstruktur zu übernehmen."
          },
          {
            "name": "2.5. Unzureichende Überwachung und Dokumentation von delegierten Rechten",
            "value": "Wenn die Bildung unternehmensspezifischer Gruppen und die Delegation von Rechten an diese Gruppen- oder an einzelne Benutzendenobjekte nicht systematisch geplant und umgesetzt wird, kann die Delegation nur noch schwer kontrolliert werden. Sie könnte dann etwa viel mehr Zugriffe einräumen als vorgesehen, was durch Dritte missbraucht werden kann. Eine fehlende regelmäßige Auditierung der Zugriffsrechte von Gruppen- und einzelnen Benutzendenobjekte kann das Problem zusätzlich verschärfen. Auch wenn Standardgruppen genutzt und ihre Rechte an eigene Gruppen delegiert werden, etwa bei der Delegation von „Account Operators“ / „Konten-Operatoren“ an Helpdesk-Mitarbeitende, werden in der Regel mehr Rechte gewährt als tatsächlich benötigt werden."
          },
          {
            "name": "2.6. Unsichere Authentisierung",
            "value": "Sogenannte „Legacy“- (also historische) Authentisierungsmechanismen im Bereich AD DS wie LAN Manager (LM) und NT LAN Manager (NTLM) v1 sind unsicher und können bei Angriffen unter bestimmten Bedingungen missbraucht werden. Angreifende können beispielsweise ohne Kenntnis der Klartextpasswörter Rechte erhalten und missbrauchen und so Teile der Domäne, die Domäne selbst oder sogar die Gesamtstruktur kompromittieren."
          },
          {
            "name": "2.7. Zu mächtige oder schwach gesicherte Konten",
            "value": "Anwendungssoftware setzt manchmal Rechte hochprivilegierter Gruppen (beispielsweise von sogenannten Domänenadministratoren) für Dienstkonten voraus, um die Produkte einfacher testen und ausbringen zu können, obwohl für den Betrieb deutlich weniger Rechte notwendig sind. Ein besonderes Risiko besteht, wenn diese Dienstkonten mit schwachen Passwörtern gesichert sind. Auch Konten, die nicht Mitglied einer hoch privilegierten Gruppe sind, können administrative Berechtigungen beispielsweise auf einer großen Anzahl von Servern und Clients zugewiesen sein. Damit besitzen sie ähnlich umfangreiche Rechte wie Mitglieder hoch privilegierten Gruppen im AD DS. Die weitreichenden Rechte dieser Konten können von Angreifenden missbraucht werden, um sich in der Domäne weiterzubewegen."
          },
          {
            "name": "2.8. Nutzung desselben lokalen Administrierendenpassworts auf mehreren IT-Systemen",
            "value": "Auch bei Domänenzugehörigkeit eines IT-Systems ist eine Anmeldung mit lokalen Konten an diesem IT-System weiterhin möglich. Werden dieselben lokalen Anmeldeinformationen auf mehreren IT-Systemen verwendet, kann eine Anmeldung mit diesen unter anderem mit dem lokalen Built-In-Konto Administrator auf mehreren IT-Systemen erfolgen. Dies erleichtert Angreifenden die laterale Bewegung und damit die Ausbreitung in der Infrastruktur. Damit steigt das Risiko, dass Angreifende auf einem der IT-Systeme Anmeldeinformationen eines Domänenkontos mit höheren Rechten finden und diese missbrauchen können, um die Domäne und potentiell die Gesamtstruktur zu kompromittieren."
          },
          {
            "name": "2.9. Unsichere Speicherung von Passwörtern",
            "value": "Die Speicherung der Passwörter erfolgt in der zentralen AD-DS-Datenbank (ntds.dit) auf dem Domänencontroller produktbedingt unter anderem mittels MD4-Hashfunktion ohne Salt. Diese Hashfunktion erfüllt nicht die Anforderungen der Technischen Richtlinie TR-02102-1 „Kryptografische Verfahren: Empfehlungen und Schlüssellängen“ des BSI. Unautorisierte lesende Zugriffe auf die gespeicherten Passwörter sind daher besonders kritisch. Aufgrund der weiten Verbreitung von AD DS existieren viele Werkzeuge, um die Hashes der Passwörter zu extrahieren. Die AD-DS-Datenbank kann beispielsweise unter Verwendung weiterer auf dem Domänencontroller hinterlegter Schlüssel offline entschlüsselt werden und den Zugriff auf die Hashes ermöglichen. Zudem ist durch die schwache Hashfunktion ein Ermitteln der Klartextpasswörter möglich."
          },
          {
            "name": "2.10. Unzureichende Absicherung von Domänencontrollern",
            "value": "Jeder (Read-Write)-Domänencontroller einer Domäne hält ein vollständiges Replikat der zentralen AD-DS-Datenbank (ntds.dit) vor, in der die Passwörter unsicher gespeichert sind. Neben dem unzureichenden Schutz vor Zugriff durch Dritte auf die Domänencontroller im Betrieb kann auch ein ungeeignetes Backupverfahren zum Abgreifen der zentralen AD-DS-Datenbank und in Folge zum Abfluss von Informationen und der Kompromittierung der Domäne und potentiell der Gesamtstruktur führen. Auch der Betrieb von virtualisierten Domänencontrollern gemeinsam mit weniger schützenswerten virtuellen Maschinen auf einem physischen Virtualisierungshost kann zu einer Kompromittierung des AD DS führen. Dies gilt auch, wenn die administrativen Konten des Virtualisierungshosts, die durch ihre administrativen Tätigkeiten Vollzugriff auf AD DS besitzen, nicht angemessen geschützt werden."
          },
          {
            "name": "2.11. Hinterlassen von hochprivilegierten Anmeldeinformationen auf Domänenmitgliedsservern und -clients",
            "value": "Erfolgt eine Anmeldung oder Dienstnutzung mit hochprivilegierten Konten auf einem Server oder Client der Domäne, so werden die zugehörigen Anmeldeinformationen auf diesem zwischengespeichert (z. B. im Speicher des Local Security Authority Subsystem / LSASS). Im Fall einer Kompromittierung können Angreifende diese dort extrahieren. Dadurch kann die Kompromittierung eines einzelnen Servers oder Clients der Domäne dazu führen, dass die gesamte Domäne und potentiell die Gesamtstruktur kompromittiert wird."
          },
          {
            "name": "2.12. Hinzufügen nicht vertrauenswürdiger IT-Systemen zur Windows-Domäne",
            "value": "In den voreingestellten Konfigurationen dürfen alle im AD DS authentifizierten Benutzenden bis zu zehn IT-Systeme zu der Domäne hinzufügen, auch, wenn sie keine administrativen Berechtigungen im AD DS besitzen. Dadurch können sie IT-Systeme in die Domäne hinzufügen, auf denen sie hohe Privilegien besitzen. Diese Privilegien können als Ausgangspunkt für weitere Angriffe verwendet werden. Da das Hinzufügen von IT-Systemen zu einer Domäne eine Verwaltungsaufgabe ist, die typischerweise in einen IT-Prozess eingebettet ist, können hier schwer vorhersehbare Seiteneffekt entstehen, wenn IT-Systeme unkontrolliert der Domäne beitreten, ohne diesen Prozess korrekt zu durchlaufen."
          },
          {
            "name": "2.13. Vermaschung von administrativen Privilegien durch Integration von weiteren Anwendungen",
            "value": "Werden Anwendungen mit einer Integration in AD DS eingesetzt (beispielsweise Microsoft Exchange), können den durch diese Anwendungen angelegten AD-DS-Konten administrative Berechtigungen in AD DS zugewiesen sein. Dadurch können Sicherheitslücken in diesen Anwendungen dazu führen, dass Angreifende weitreichende Administrationsrechte bei IT-Systemen innerhalb der Gesamtstruktur erhalten. Ein Beispiel hierfür ist die Sicherheitslücke CVE-2019-0686 (PrivExchange) in Microsoft Exchange."
          }
        ],
        "control-implementations": [
          {
            "uuid": "eb47b336-2955-4a1e-9c00-fa7de7f5f10e",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/verzeichnisdienste_profile.json",
            "description": "Implementation for all controls in Baustein APP.2.2",
            "implemented-requirements": [
              {
                "uuid": "c117335e-e76d-45d2-899d-52a6bdd83d57",
                "control-id": "ARCH.8.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.2.3.A9-m1",
                    "uuid": "f2f5e5ac-3657-41fb-8a3a-acc984aeac88",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein einzelner Replikat-Server ist für ein grundlegendes Failover eingerichtet, aber der Replikationsmodus wird nicht basierend auf den Anforderungen an Netzwerk oder Verfügbarkeit ausgewählt. Die Partitionierung wird nicht genutzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein zweiter OpenLDAP-Server wird aufgesetzt und als einfacher Consumer konfiguriert (`olcSyncrepl`), oft im `refreshOnly`-Modus."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz des zweiten Servers und seiner `olcSyncrepl`-Konfiguration. Es wird festgestellt, dass die Konfiguration nicht für hohe Verfügbarkeit optimiert ist und keine Partitionierung zum Einsatz kommt."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A9-m2",
                    "uuid": "3a51d0e2-4584-4be2-8095-6cae9100ef42",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Multi-Provider-Replikation ist für hohe Verfügbarkeit eingerichtet. Der Replikationsmodus (z.B. sync, refreshAndPersist) wird ausgewählt, jedoch ohne eine tiefgehende Analyse seiner Auswirkungen."
                      },
                      {
                        "name": "guidance",
                        "value": "Mindestens zwei Server sind als Provider in einer Multi-Provider-Konfiguration eingerichtet, sodass jeder Server Schreibvorgänge akzeptieren kann. Der `refreshAndPersist`-Modus wird für die Replikation verwendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration auf allen Replikat-Servern und stellt sicher, dass eine Multi-Provider-Replikation korrekt eingerichtet ist. Es wird getestet, ob eine auf einem Server vorgenommene Änderung korrekt auf den anderen repliziert wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A9-m3",
                    "uuid": "c920afb4-5dbc-4d20-8c46-d70a73a84900",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei einer Partitionierung oder Replikation von OpenLDAP SOLLTE die Aufteilung geeignet für die Sicherheitsziele ausgewählt werden. Dabei SOLLTEN Veränderungen an den Daten durch Replikation zwischen den Servern ausgetauscht werden. Ein Replikationsmodus SOLLTE in Abhängigkeit von Netzverbindungen und Verfügbarkeitsanforderungen gewählt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Entscheidung für eine bestimmte Replikationstopologie (z.B. Multi-Provider vs. Provider/Consumer) und den Replikationsmodus (`olcSyncrepl`-Parameter) wird dokumentiert und basiert auf den Anforderungen an Ausfallsicherheit und Schreiblatenz. Wenn unterschiedliche Sicherheitsanforderungen an Daten bestehen, werden separate Datenbank-Backends (Partitionen) mit unterschiedlichen Replikationseinstellungen und ACLs verwendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Dokumentation zur Replikations- und Partitionierungsstrategie. Es wird geprüft, ob die gewählte Konfiguration den dokumentierten Zielen entspricht. Beispielsweise wird bei geografisch verteilten Standorten geprüft, ob ein Modus gewählt wurde, der mit höheren Netzwerklatenzen umgehen kann."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A9-m4",
                    "uuid": "2af3fea0-c0e6-47d7-b1e7-fd756741c57a",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Replikationstopologie ist zur Optimierung von Leistung und Verfügbarkeit konzipiert (z.B. geografisch verteilte Replikate). Der Replikationsverkehr wird verschlüsselt und auf Latenz und Fehler überwacht. Ein dokumentierter Notfallwiederherstellungsplan, der die Replikation nutzt, existiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Replikation zwischen den Servern erfolgt über TLS-gesicherte Verbindungen. Monitoring-Tools (z.B. Prometheus mit einem OpenLDAP-Exporter) überwachen den Replikationsstatus (`contextCSN`) auf allen Replikaten und alarmieren bei zu großer Abweichung (Lag). Der DR-Plan beschreibt die Schritte, um den Dienst nach dem Ausfall eines gesamten Rechenzentrums wiederherzustellen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die TLS-Konfiguration für die Replikation. Die Konfiguration und die Daten des Monitoring-Systems werden analysiert. Der Notfallwiederherstellungsplan wird auf Vollständigkeit und Plausibilität geprüft. Idealerweise wird die Durchführung einer DR-Übung nachgewiesen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A9-m5",
                    "uuid": "eef593aa-e1ef-436f-b435-559f90b9c91a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein vollständig automatisierter Failover-Mechanismus ist implementiert. Das System kann die Anzahl der Replikate dynamisch an die Last anpassen. Der Replikationsstatus wird kontinuierlich überwacht, und jede Verzögerung oder Inkonsistenz löst eine automatisierte Warnung und potenziell eine Korrekturmaßnahme aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Load Balancer mit Health Checks leitet Anfragen automatisch von ausgefallenen Servern weg. In einer Cloud- oder containerisierten Umgebung wird ein Autoscaling-Mechanismus verwendet, um bei hoher Last zusätzliche schreibgeschützte Replikate zu starten. Ein Skript prüft kontinuierlich die `contextCSN` aller Server und versucht bei Inkonsistenzen, die Replikation auf dem betroffenen Knoten neu zu initialisieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer testet den Failover-Mechanismus, indem er einen OpenLDAP-Server gezielt stoppt und beobachtet, ob der Dienst ohne Unterbrechung weiterläuft. Die Konfiguration des Autoscalings und der automatisierten Korrekturmaßnahmen wird überprüft. Die Protokolle dieser Systeme werden auf ihre Wirksamkeit hin analysiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "502faaf0-3b61-4148-99d5-d7c3c62233a3",
                "control-id": "DEV.2.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.2.3.A1-m1",
                    "uuid": "2b3bf0f1-19d9-4021-b9b3-6c375ed3030f",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Planung für den OpenLDAP-Einsatz ist rudimentär und konzentriert sich nur auf die grundlegende Funktionalität für eine einzelne Anwendung. Die Auswahl von Backends und Overlays erfolgt ad-hoc, ohne Berücksichtigung von Kompatibilität oder der korrekten Reihenfolge der Overlays."
                      },
                      {
                        "name": "guidance",
                        "value": "In der Regel wird das Standard-Backend der Distribution ohne weitere Anpassungen verwendet. Overlays werden, wenn überhaupt, nur für einzelne, offensichtliche Anforderungen wie das Setzen von Passwortrichtlinien genutzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, ob überhaupt ein Planungsdokument existiert. Es wird geprüft, ob die Konfiguration des OpenLDAP-Servers auf Standardwerten beruht und ob die Auswahl der Komponenten dokumentiert wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A1-m2",
                    "uuid": "018d0fd9-89c0-43fd-839f-73e200015911",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Planung für den OpenLDAP-Einsatz liegt vor. Backends und Overlays werden bewusst ausgewählt, und die Kompatibilität der Datenbankversion wird sichergestellt. Die Reihenfolge der Overlays wird berücksichtigt, jedoch ohne tiefgehende Analyse der Wechselwirkungen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein einfaches Planungsdokument wird erstellt, das die Auswahl des Backends (z. B. MDB) und der wichtigsten Overlays (z. B. `ppolicy`, `auditlog`) begründet. Die Kompatibilität mit den primären Client-Anwendungen wird überprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Planungsdokument. Es wird verifiziert, dass die Version der Datenbank kompatibel ist und dass die wichtigsten Overlays in einer logischen Reihenfolge konfiguriert sind. Es wird stichprobenartig geprüft, ob die Client-Anwendungen funktionieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A1-m3",
                    "uuid": "9e38e278-c4ce-4920-845e-9461732d28d0",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Einsatz von OpenLDAP in einer Institution MUSS sorgfältig geplant werden. Soll OpenLDAP gemeinsam mit anderen Anwendungen verwendet werden, so MÜSSEN die Planung, Konfiguration und Installation der Anwendungen mit OpenLDAP aufeinander abgestimmt werden. Für die zur Datenhaltung verwendete Datenbank MUSS sichergestellt werden, dass die verwendete Version kompatibel ist. Backends und Overlays für OpenLDAP MÜSSEN restriktiv selektiert werden. Dazu MUSS sichergestellt werden, dass die OpenLDAP-Overlays in der korrekten Reihenfolge eingesetzt werden. Bei der Planung von OpenLDAP MÜSSEN die auszuwählenden und unterstützten Client-Anwendungen berücksichtigt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein detailliertes Konzeptdokument wird erstellt, das die Architektur, das gewählte Backend (z.B. MDB), alle verwendeten Overlays in ihrer exakten Reihenfolge und deren Konfiguration beschreibt. Es enthält eine Liste der kompatiblen und unterstützten Client-Anwendungen und deren Versionen. Die Auswahl wird durch Anforderungen an Sicherheit, Performance und Funktionalität begründet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die Live-Konfiguration des OpenLDAP-Servers mit dem Konzeptdokument. Es wird geprüft, ob alle MUSS-Anforderungen erfüllt sind: die Abstimmung mit angebundenen Anwendungen, die Kompatibilität der Datenbankversion, die restriktive Auswahl von Backends/Overlays, die korrekte Reihenfolge der Overlays und die Berücksichtigung der Client-Anwendungen. Dies kann durch Auslesen der Konfiguration (`cn=config`) erfolgen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A1-m4",
                    "uuid": "30a422dd-19bc-448c-9ec7-13b4ded534e6",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Planungsprozess ist formalisiert und wird regelmäßig überprüft. Die Auswahl von Backends und Overlays basiert auf Leistungs- und Skalierbarkeitstests, die in einer Testumgebung durchgeführt werden. Es wird ein Katalog der genehmigten Client-Anwendungen und -Versionen gepflegt."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor der Einführung neuer Overlays oder einer Änderung des Backends werden Lasttests mit Werkzeugen wie `slapd-slapadd` oder `slap-bench` durchgeführt, um die Auswirkungen auf die Performance zu bewerten. Die Ergebnisse fließen in die Planungsdokumentation ein."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Dokumentation der durchgeführten Leistungs- und Kompatibilitätstests an. Es wird geprüft, ob ein formaler Prozess zur Genehmigung und Aufnahme von Client-Anwendungen in den Katalog existiert und eingehalten wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A1-m5",
                    "uuid": "598176e8-fbed-4361-ac11-680a9ea206ea",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der gesamte Planungs- und Auswahlprozess ist in das zentrale Change-Management-System integriert. Automatisierte Tests verifizieren die Client-Kompatibilität und die korrekte Funktionalität der Overlay-Kette vor jeder Bereitstellung. Die Auswahl von Backends und Overlays basiert auf einer formalen Risikobewertung und kontinuierlichen Leistungsbenchmarks im Produktivbetrieb."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine CI/CD-Pipeline wird für die OpenLDAP-Konfiguration genutzt. Jede Änderung am Konfigurations-Backend (`cn=config`) löst eine Reihe automatisierter Tests aus, die die Funktionalität, Sicherheit und Leistung verifizieren, bevor die Änderung in die Produktion übernommen wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Protokolle des Change-Management-Systems und der CI/CD-Pipeline. Es wird verifiziert, dass keine Konfigurationsänderung ohne erfolgreiche automatisierte Tests und formale Freigabe in die Produktion gelangt ist. Anhand von Monitoring-Daten wird die Einhaltung der Leistungs-SLAs überprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "abd237cf-7aed-4c80-9dde-ec2104a26d55",
                "control-id": "DEV.2.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.2.3.A11-m1",
                    "uuid": "847ae6e2-4a4d-49c6-b4aa-ffdbace43973",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der slapd-Server läuft als nicht-privilegierter Benutzer, es werden jedoch keine weiteren Einschränkungen auf die Laufzeitumgebung angewendet."
                      },
                      {
                        "name": "guidance",
                        "value": "Der `slapd`-Prozess wird als Benutzer `ldap` gestartet, hat aber ansonsten vollen Zugriff auf das Dateisystem und die Netzwerkressourcen des Hosts, soweit es die Benutzerrechte zulassen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert mit `ps aux | grep slapd`, dass der Prozess als nicht-privilegierter Benutzer läuft. Es wird festgestellt, dass keine weiteren Sicherheitsmechanismen wie chroot oder AppArmor aktiv sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A11-m2",
                    "uuid": "bbad8188-b45e-46d1-902f-44e6dd1c5d2f",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der slapd-Server wird in einem einfachen Container oder auf einem dedizierten Server mit Standard-Betriebssystemhärtung betrieben. Es werden grundlegende Einschränkungen angewendet."
                      },
                      {
                        "name": "guidance",
                        "value": "OpenLDAP wird in einem Standard-Docker-Container betrieben oder auf einem Server installiert, auf dem ein grundlegendes Härtungsskript für das Betriebssystem ausgeführt wurde. Es werden keine speziellen Profile für den Container oder den Dienst erstellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, dass der Dienst containerisiert ist oder auf einem gehärteten System läuft. Es wird jedoch verifiziert, dass keine spezifischen Sicherheitsprofile (z.B. seccomp, AppArmor) für den OpenLDAP-Prozess selbst konfiguriert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A11-m3",
                    "uuid": "0d3bcbdf-d244-41a5-919c-bad92568d7bb",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Laufzeitumgebung des slapd-Servers SOLLTE, möglichst mit Mitteln des Betriebssystems, auf die minimal benötigten Dateien, Verzeichnisse und vom Betriebssystem bereitgestellten Funktionen eingeschränkt werden. Werden hierfür Containerisierungstechniken eingesetzt, SOLLTEN diese unter Berücksichtigung von SYS.1.6 Containerisierung genutzt werden. Wird der slapd-Server als exklusiver Dienst auf einem dedizierten Server betrieben, SOLLTE dieser ausreichend gehärtet sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein spezifisches Sicherheits-Profil für den slapd-Prozess erstellt und angewendet, z.B. mittels AppArmor oder SELinux. Dieses Profil beschränkt den Dateisystemzugriff auf die benötigten Verzeichnisse (`/etc/ldap`, `/var/lib/ldap`) und verbietet die Ausführung von externen Programmen. Bei Einsatz von Containern wird ein gehärtetes Basis-Image verwendet und die Container-Funktionen gemäß den Empfehlungen aus SYS.1.6 eingeschränkt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Aktivität und den Inhalt des AppArmor-/SELinux-Profils für slapd (z.B. mit `aa-status`). Es wird verifiziert, dass das Profil den Zugriff auf das Notwendigste beschränkt. Bei Containern wird die Konfiguration (`docker inspect`) auf Sicherheitseinstellungen wie `security_opt` oder `cap_drop` geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A11-m4",
                    "uuid": "c17113d2-0cd9-48c4-a240-0f1529c1e00e",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird ein gehärtetes Container-Image verwendet, aus dem alle unnötigen Binärdateien und Bibliotheken entfernt wurden. Ein striktes Sicherheitsprofil (z.B. AppArmor, seccomp) wird durchgesetzt, das die Systemaufrufe (syscalls) auf das absolut notwendige Minimum beschränkt. Der Netzwerkzugriff wird über Firewall-Regeln strikt kontrolliert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein benutzerdefiniertes, minimalistisches Container-Image erstellt. Ein `seccomp`-Profil wird generiert (z.B. mit `strace`), das nur die von slapd tatsächlich genutzten Systemaufrufe erlaubt. Host-basierte Firewall-Regeln (iptables, nftables) erlauben nur eingehende Verbindungen auf den LDAP(S)-Ports von definierten IP-Adressbereichen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das Dockerfile des verwendeten Images auf seine Minimalität. Das `seccomp`-Profil wird auf Vollständigkeit und Korrektheit geprüft. Die Firewall-Regeln, die den slapd-Prozess oder Container betreffen, werden analysiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A11-m5",
                    "uuid": "a7111b54-4cdd-4ab0-89b9-c82f7bcbfc37",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der slapd-Server läuft in einem minimalen, 'distroless' Container. Alle Interaktionen mit dem Host-Betriebssystem werden protokolliert und auf Anomalien überwacht. Die Integrität des Containers wird zur Laufzeit überprüft. Die gesamte Umgebung ist als Code definiert und wird automatisch bereitgestellt und auditiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Das OpenLDAP-Binary wird in ein 'distroless' oder Scratch-Image kopiert, das keine Shell oder andere Werkzeuge enthält. Ein Laufzeit-Sicherheitstool (z.B. Falco, Sysdig) überwacht die Systemaufrufe des Containers in Echtzeit und meldet verdächtige Aktivitäten. Die gesamte Umgebungsdefinition (Container, Netzwerk, Profile) wird in einem Git-Repository verwaltet und über eine CI/CD-Pipeline bereitgestellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Verwendung eines 'distroless' Images. Die Konfiguration und die Alarmierungsregeln des Laufzeit-Sicherheitstools werden analysiert. Es wird geprüft, ob ein Versuch, eine Shell im Container zu starten, erkannt und gemeldet wird. Die CI/CD-Pipeline und die zugehörigen Konfigurationsdateien werden auditiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "8f58e668-2da8-436b-a459-ae3ad687db71",
                "control-id": "KONF.10.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.2.3.A3-m1",
                    "uuid": "1975e240-2d7c-432a-95c7-ad592b1da37d",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Nur der slapd-Server selbst wird mit einigen grundlegenden Sicherheitseinstellungen konfiguriert. Konfigurationen von Client-Anwendungen oder Berechtigungen auf Betriebssystemebene werden ignoriert."
                      },
                      {
                        "name": "guidance",
                        "value": "Typischerweise werden nur die offensichtlichsten Konfigurationsparameter wie der Servername angepasst. Zeit- und Größenbeschränkungen für Suchen werden nicht gesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft stichprobenartig die slapd-Konfiguration auf grundlegende Einstellungen. Es wird festgestellt, dass keine Konfigurationsrichtlinien für Clients oder das Betriebssystem existieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A3-m2",
                    "uuid": "05c9cea3-fe97-4dcf-9c28-fb5994ff23c7",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der slapd-Server und die Client-Anwendungen werden gemäß den Herstellerempfehlungen (Standardwerte) konfiguriert. Die Berechtigungen im Betriebssystem werden gesetzt, aber nicht auf Minimalprinzip überprüft. Die Konfiguration wird nur bei der Ersteinrichtung geprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Konfiguration erfolgt nach dem Prinzip 'installieren und starten'. Die Standardvorgabewerte für Limits (`sizelimit`, `timelimit`) werden beibehalten. Die Dateiberechtigungen werden so belassen, wie sie vom Paketmanager gesetzt wurden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die Konfiguration mit den dokumentierten Standardwerten des Herstellers. Es wird geprüft, ob die Betriebssystemberechtigungen den Standardvorgaben entsprechen. Es wird festgestellt, dass keine regelmäßigen Konfigurationsprüfungen stattfinden."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A3-m3",
                    "uuid": "314e2add-caba-4532-97ad-20ddb726612f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die sichere Konfiguration von OpenLDAP MUSS der slapd-Server korrekt konfiguriert werden. Es MÜSSEN auch die verwendeten Client-Anwendungen sicher konfiguriert werden. Bei der Konfiguration von OpenLDAP MUSS darauf geachtet werden, dass im Betriebssystem die Berechtigungen korrekt gesetzt sind. Die Vorgabewerte aller relevanten Konfigurationsdirektiven von OpenLDAP MÜSSEN geprüft und gegebenenfalls angepasst werden. Die Backends und Overlays von OpenLDAP MÜSSEN in die Konfiguration einbezogen werden. Für die Suche innerhalb von OpenLDAP MÜSSEN angemessene Zeit- und Größenbeschränkungen festgelegt werden. Die Konfiguration am slapd-Server MUSS nach jeder Änderung geprüft werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine Konfigurationsrichtlinie erstellt, die sichere Werte für `sizelimit`, `timelimit` und andere sicherheitsrelevante Direktiven festlegt. Die Dateiberechtigungen im Betriebssystem werden explizit so gesetzt, dass nur der OpenLDAP-Dienstbenutzer Lese- und Schreibzugriff auf die Datenbank- und Konfigurationsdateien hat. Nach jeder Änderung wird die Konfiguration mittels `slaptest` auf syntaktische Korrektheit geprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration des slapd-Servers (`cn=config`) und vergleicht sie mit den dokumentierten Richtlinien. Insbesondere werden die Werte für `olcSizeLimit` und `olcTimeLimit` geprüft. Die Berechtigungen des Datenbankverzeichnisses werden mit `ls -l` kontrolliert. Es wird geprüft, ob Protokolle von Konfigurationsänderungen und den darauf folgenden Tests vorliegen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A3-m4",
                    "uuid": "a7b1764e-7270-406a-b14c-e4e971ed9f87",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird eine dokumentierte Konfigurations-Baseline (Härtungsstandard) für OpenLDAP erstellt und konsequent angewendet. Konfigurationsänderungen werden über einen Change-Control-Prozess gesteuert. Automatisierte Skripte werden eingesetzt, um die Konfiguration regelmäßig mit der Baseline abzugleichen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Konfigurationsmanagement-Tool (z.B. Ansible, Puppet) wird verwendet, um die OpenLDAP-Konfiguration basierend auf einer Vorlage (Template) konsistent auf allen Servern auszurollen. Ein Cron-Job führt wöchentlich ein Skript aus, das die aktuelle Konfiguration ausliest und mit der definierten Baseline vergleicht, und meldet Abweichungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Härtungsdokument und die Berichte der automatisierten Konfigurationsprüfungen. Es wird geprüft, ob ein Change-Management-Prozess für Konfigurationsänderungen existiert und eingehalten wird, z.B. durch Einsicht in die entsprechenden Tickets."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A3-m5",
                    "uuid": "33906129-ade5-49b5-a9c8-16d0faae938f",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Konfiguration wird vollständig als Configuration-as-Code verwaltet und versioniert. Jede Abweichung vom definierten Zustand wird automatisch erkannt und entweder gemeldet oder korrigiert. Die Konfiguration wird kontinuierlich überwacht, und Compliance-Berichte werden automatisch generiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die gesamte OpenLDAP-Konfiguration wird in einem Git-Repository als LDIF-Dateien gespeichert. Ein CI/CD-System wendet Änderungen automatisch an, nachdem sie einen Review- und Testprozess durchlaufen haben. Ein Intrusion Detection System oder ein Konfigurations-Monitoring-Tool überwacht die Konfiguration (`cn=config`) in Echtzeit auf unerlaubte Änderungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Git-Historie der Konfigurationsdateien und die Protokolle der CI/CD-Pipeline. Es wird geprüft, ob der Prozess der automatischen Korrektur (Self-Healing) funktioniert, indem eine manuelle, nicht autorisierte Änderung vorgenommen und deren Rückgängigmachung beobachtet wird. Die automatisch generierten Compliance-Berichte werden eingesehen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "0ce011c2-a3a1-4a60-9705-ac50343a2a78",
                "control-id": "KONF.11.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.2.3.A6-m1",
                    "uuid": "3e714814-01e9-4e0e-b532-056c0cd97e2b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Authentisierung ist zwar erforderlich, aber die Kommunikation erfolgt möglicherweise unverschlüsselt (Simple Bind über Klartext-LDAP). Passwörter werden als Hashes gespeichert, jedoch mit einem veralteten Algorithmus wie MD5."
                      },
                      {
                        "name": "guidance",
                        "value": "Clients verbinden sich über `ldap://` (Port 389) und senden Passwörter im Klartext oder als Teil eines ungeschützten Simple Binds. Das Attribut `userPassword` enthält Hashes im `{MD5}`-Format."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Serverkonfiguration auf aktive unverschlüsselte Listener. Mittels `ldapsearch` wird geprüft, welche Passwort-Hashing-Algorithmen verwendet werden. Ein Netzwerkmitschnitt würde die unverschlüsselte Übertragung von Anmeldedaten zeigen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A6-m2",
                    "uuid": "ce8553a9-862a-46a8-b20e-02633c931ba2",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die gesamte Authentisierungskommunikation ist verschlüsselt (LDAPS oder STARTTLS). Es wird ein moderner Hashing-Algorithmus verwendet, der jedoch möglicherweise nicht der stärkste empfohlene ist (z.B. SSHA-1)."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Server ist so konfiguriert, dass er Verbindungen über `ldaps://` (Port 636) oder über STARTTLS auf dem Standardport akzeptiert. Passwörter werden mindestens als `{SSHA}` (salted SHA-1) gespeichert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration der TLS-Zertifikate und -Protokolle des Servers. Es wird mittels `ldapsearch` geprüft, dass ausschließlich moderne, gesalzene Hashing-Algorithmen für Passwörter verwendet werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A6-m3",
                    "uuid": "5256f46a-9e6d-443a-a6e8-fbaf097dea04",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wenn der Verzeichnisdienst zwischen verschiedenen Benutzenden unterscheiden soll, MÜSSEN sich diese geeignet authentisieren. Die Authentisierung zwischen dem slapd-Server und den Kommunikationsbeteiligten MUSS verschlüsselt werden. Es SOLLTEN NUR die Hashwerte von Passwörtern auf den Clients und Servern abgespeichert werden. Es MUSS ein geeigneter Hashing-Algorithmus verwendet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Serverkonfiguration erzwingt TLS für alle Verbindungen, die eine Authentifizierung erfordern. Als Hashing-Algorithmus wird ein starker, aus der SHA-2-Familie stammender Algorithmus (z.B. `{SSHA256}` oder `{SSHA512}`) konfiguriert und für alle neuen Passwörter verwendet. Es wird sichergestellt, dass keine Klartextpasswörter im Verzeichnis oder in Protokolldateien gespeichert werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert durch Auslesen der Konfiguration (`olcSecurity`), dass eine Verschlüsselung erzwungen wird. Mittels `ldapsearch` wird stichprobenartig geprüft, dass alle `userPassword`-Attribute einen Hash-Präfix wie `{SSHA256}` aufweisen. Es wird geprüft, ob es eine Richtlinie gibt, die das Speichern von Klartextpasswörtern verbietet."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A6-m4",
                    "uuid": "2b9188f2-6e24-4b51-892c-02a7e6ddf76a",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Verwendung von starken, passwortbasierten Schlüsselableitungsfunktionen (z.B. Argon2, scrypt, PBKDF2) wird als Hashing-Algorithmus durchgesetzt. Simple Binds werden zugunsten von SASL-Mechanismen (z.B. DIGEST-MD5, GSSAPI) nach Möglichkeit vermieden. Serverzertifikate werden ordnungsgemäß von den Clients validiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Das `argon2`-Modul wird in OpenLDAP geladen und als Standard-Hashing-Mechanismus konfiguriert. Clients werden angewiesen, sich über SASL/GSSAPI (Kerberos) zu authentifizieren, falls eine entsprechende Infrastruktur vorhanden ist. Die TLS-Konfiguration des Servers wird gehärtet (z.B. nur TLS 1.2+ mit starken Cipher-Suiten)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass das `argon2` oder ein vergleichbares Modul geladen und konfiguriert ist. Die `olcAuthzRegexp`-Direktiven werden überprüft, um festzustellen, ob sie SASL-Mechanismen erzwingen. Die TLS-Konfiguration des Servers wird mit Tools wie `testssl.sh` auf Schwachstellen geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A6-m5",
                    "uuid": "26b58b1a-d8ef-40b2-b703-e5c8166c0254",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für privilegierte Benutzer wird eine Multi-Faktor-Authentifizierung (MFA) erzwungen. Für die Kommunikation zwischen Diensten wird eine zertifikatsbasierte Client-Authentifizierung (SASL EXTERNAL) verwendet. Anonyme Binds sind vollständig deaktiviert."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine MFA-Lösung wird integriert, z. B. über ein RADIUS-Backend oder ein benutzerdefiniertes Overlay, das Einmalpasswörter (TOTP) prüft. Service-Accounts erhalten Client-Zertifikate, mit denen sie sich über SASL EXTERNAL authentifizieren. Die globale ACL wird so konfiguriert, dass anonyme Zugriffe vollständig unterbunden werden (`access to * by anonymous auth`)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer testet den Anmeldevorgang für einen privilegierten Account und verifiziert, dass ein zweiter Faktor abgefragt wird. Es wird die Konfiguration für SASL EXTERNAL und die zugehörigen ACLs geprüft. Es wird verifiziert, dass ein anonymer `ldapsearch`-Befehl fehlschlägt."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "44fef523-f88c-47eb-b7dc-5a38a5ccfaeb",
                "control-id": "KONF.12.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.2.3.A8-m1",
                    "uuid": "9143ccd6-1d51-49f7-81bf-fe147b103abd",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden nur für ein einzelnes, kritisches Attribut Einschränkungen implementiert, z. B. die Sicherstellung, dass die Benutzer-ID (`uid`) eindeutig ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Das `unique`-Overlay wird für das `uid`-Attribut konfiguriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer versucht, einen Benutzer mit einer bereits vorhandenen `uid` anzulegen, und erwartet, dass die Operation fehlschlägt. Es wird festgestellt, dass keine weiteren Einschränkungen existieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A8-m2",
                    "uuid": "a25f53b9-d0f3-4cd7-8ecd-172c79f40426",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das `constraint`-Overlay wird verwendet, um die Eindeutigkeit und das Format der Werte für mehrere wichtige Attribute (z.B. `uid`, `mail`) durchzusetzen. Die Einschränkungen gelten für alle Objekttypen."
                      },
                      {
                        "name": "guidance",
                        "value": "Das `constraint`-Overlay wird mit einfachen regulären Ausdrücken für E-Mail-Adressen und Regeln für die Eindeutigkeit von `uid` und `mail` konfiguriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration des `constraint`-Overlays (`olcConstraintAttribute`). Es wird versucht, Objekte mit ungültigen oder doppelten Attributwerten anzulegen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A8-m3",
                    "uuid": "fed6dd00-1e75-421b-9759-d9d7491fdad6",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Anhand von Overlays SOLLTEN die Attribute in OpenLDAP eingeschränkt werden. OpenLDAP SOLLTE so angepasst werden, dass Werte im Verzeichnisdienst nur einem bestimmten regulären Ausdruck entsprechen. Zudem SOLLTE mit Hilfe von Overlays sichergestellt werden, dass ausgesuchte Werte nur einmal im Verzeichnisbaum vorhanden sind. Solche Restriktionen SOLLTEN ausschließlich auf Daten von Nutzenden angewendet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Das `constraint`-Overlay wird gezielt eingesetzt, um Datenqualität sicherzustellen. Es werden URI-basierte Einschränkungen (`olcConstraintURI`) verwendet, um die Regeln nur auf bestimmte Teile des Verzeichnisbaums (z.B. die `ou=people`) und bestimmte Objekttypen (`objectClass=inetOrgPerson`) anzuwenden. Dies verhindert, dass die Einschränkungen versehentlich auf Dienst- oder Konfigurationskonten wirken."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des `constraint`-Overlays und verifiziert, dass die `olcConstraintURI`-Direktiven korrekt gesetzt sind, um den Geltungsbereich der Einschränkungen wie gefordert auf Benutzerdaten zu begrenzen. Es wird getestet, ob das Anlegen eines Benutzers mit einer ungültigen E-Mail-Adresse fehlschlägt, während ein Dienstkonto mit einem anders formatierten Attribut angelegt werden kann."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A8-m4",
                    "uuid": "221521cf-3e2c-4503-80d4-3463827e81f0",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Verwendung von Attributbeschränkungen ist ein Standardbestandteil des Schema-Designs. Reguläre Ausdrücke zur Wertvalidierung sind komplex und decken alle relevanten Datenformate ab. Eine Richtlinie legt fest, welche Attribute eindeutig sein oder bestimmten Formaten entsprechen müssen."
                      },
                      {
                        "name": "guidance",
                        "value": "Für jedes neue Attribut im Schema wird im Rahmen des Designprozesses geprüft, ob eine Beschränkung (Eindeutigkeit, Format, Wertebereich) erforderlich ist. Diese Anforderungen werden in einer zentralen Richtlinie dokumentiert und im `constraint`-Overlay umgesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Schema- und Attribut-Richtlinie. Es wird stichprobenartig geprüft, ob die in der Richtlinie definierten Einschränkungen korrekt im `constraint`-Overlay implementiert sind und wirksam greifen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A8-m5",
                    "uuid": "0d48d1f4-83e3-4d8f-a054-ea22d5652790",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Attributbeschränkungen werden dynamisch durchgesetzt und überwacht. Ein automatisierter Prozess validiert das gesamte Verzeichnis regelmäßig gegen die Beschränkungsrichtlinien und meldet alle Verstöße. Das `constraint`-Overlay wird mit anderen Overlays (z.B. `ppolicy`) für eine umfassende Durchsetzung von Datenqualität und Sicherheit kombiniert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Skript durchläuft nächtlich das gesamte LDAP-Verzeichnis und prüft jeden Eintrag gegen die im `constraint`-Overlay definierten Regeln. Dies dient dazu, eventuell vor der Einführung der Regeln erstellte inkonsistente Daten zu finden. Verstöße werden in einem Bericht erfasst und einem Dateneigner zur Korrektur zugewiesen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Berichte des automatisierten Validierungsprozesses. Es wird geprüft, ob ein Prozess zur Behebung der gemeldeten Inkonsistenzen existiert und befolgt wird. Die Kombination der Overlays wird auf logische Korrektheit und Vollständigkeit geprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "42e7ae39-58b3-4f17-96d3-4c163c768fa0",
                "control-id": "KONF.6.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.2.3.A5-m1",
                    "uuid": "6142b41d-c201-4b11-98e3-fab6f9afce95",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist nur eine einfache globale Zugriffssteuerungsliste (ACL) definiert, die oft breiten Lesezugriff für anonyme oder authentifizierte Benutzer gewährt. Spezifische Zugriffsrechte werden nicht umgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine typische ACL wäre `access to * by * read`, die jedem alles zum Lesen freigibt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer liest die globale `olcAccess`-Direktive aus und stellt fest, dass sie zu permissiv ist und keine differenzierten Regeln enthält."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A5-m2",
                    "uuid": "8abf4823-67df-4cd3-979a-33f6cc38c199",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden sowohl globale als auch datenbankspezifische ACLs verwendet, diese sind jedoch möglicherweise noch zu freizügig. Die Vorrangregel (datenbankspezifisch vor global) ist bekannt, wird aber nicht gezielt zur Erstellung granularer Richtlinien genutzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine globale ACL und eine zusätzliche ACL für die Hauptdatenbank, die einige Schreibzugriffe regelt. Oft werden Berechtigungen aber breiter als nötig vergeben, z.B. Schreibzugriff auf den gesamten eigenen Eintrag anstatt nur auf bestimmte Attribute."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert sowohl die globalen (`olcAccess`) als auch die datenbankspezifischen (`olcDbAccess`) ACLs und identifiziert übermäßig freizügige Regeln."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A5-m3",
                    "uuid": "54b9e1c6-9033-4683-beec-23fea00ae65b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die in OpenLDAP geführten globalen und datenbankspezifischen Zugriffskontrolllisten (Access Control Lists) MÜSSEN beim Einsatz von OpenLDAP korrekt berücksichtigt werden. Datenbank-Direktiven MÜSSEN Vorrang vor globalen Direktiven haben."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine standardmäßige, restriktive globale ACL definiert (z.B. nur Authentifizierung und Selbstleserecht). Spezifische Berechtigungen für Anwendungen oder Administratoren werden gezielt in den jeweiligen Datenbank-ACLs (`olcDbAccess`) vergeben. Dadurch wird sichergestellt, dass die spezifischen Regeln die globalen überschreiben und das Prinzip der geringsten Rechte umgesetzt wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass die globalen ACLs eine restriktive Basis bilden und spezifische, benötigte Zugriffsrechte ausschließlich in den datenbankspezifischen ACLs definiert sind. Es wird durch Testabfragen geprüft, ob die ACL-Hierarchie wie erwartet funktioniert."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A5-m4",
                    "uuid": "9f52d5fe-7c45-4f92-b219-d49260b448cb",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "ACLs werden regelmäßig überprüft und auditiert. Es existiert eine dokumentierte Richtlinie für Zugriffsrechte. Komplexe ACLs, die Funktionen wie Gruppenmitgliedschaft, Attributwerte oder Verbindungseigenschaften nutzen, werden zur Durchsetzung von fein-granularem Zugriff verwendet."
                      },
                      {
                        "name": "guidance",
                        "value": "ACLs verwenden fortgeschrittene Klauseln wie `group.exact` oder `val.exact`, um Zugriffsrechte sehr spezifisch zu gestalten. Zum Beispiel darf ein Benutzer nur das `telephoneNumber`-Attribut ändern, aber nicht das `userPassword`. Diese Richtlinien werden in einem Dokument festgehalten und jährlich überprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Zugriffsrechterichtlinie und vergleicht sie mit den implementierten ACLs. Es wird geprüft, ob die regelmäßigen Reviews der ACLs stattgefunden haben und dokumentiert sind. Es werden komplexe Testabfragen durchgeführt, um die Wirksamkeit der granularen Regeln zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A5-m5",
                    "uuid": "a329e641-a820-43dc-9a5a-f3d65a246d59",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "ACLs werden als Code verwaltet und versioniert. Automatisierte Werkzeuge werden verwendet, um die ACLs gegen einen Satz vordefinierter Sicherheitsrichtlinien zu testen. Jede Änderung an den ACLs löst einen automatisierten Überprüfungs- und Genehmigungsworkflow aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Die `olcAccess`-Attribute werden in LDIF-Dateien in einem Git-Repository gespeichert. Eine CI/CD-Pipeline führt bei jeder Änderung ein Test-Framework aus, das eine Reihe von LDAP-Abfragen durchführt und prüft, ob die Zugriffe dem erwarteten Ergebnis (erlaubt/verboten) entsprechen. Nur nach erfolgreichen Tests kann die Änderung ausgerollt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Git-Historie der ACL-Dateien und die Protokolle der CI/CD-Pipeline. Es wird geprüft, ob das Test-Framework eine umfassende Abdeckung der Sicherheitsrichtlinien bietet. Der Genehmigungsworkflow wird auf seine Wirksamkeit hin überprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "3a0f1662-0c19-4abc-8e8e-32931e5b0384",
                "control-id": "KONF.8.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "APP.2.3.A10-m1",
                    "uuid": "be38fa8a-f761-4cf6-ad57-68987de104b9",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Updates werden sporadisch angewendet, ohne auf Kompatibilitätsprobleme mit Backends, Overlays oder benutzerdefinierten Skripten zu prüfen."
                      },
                      {
                        "name": "guidance",
                        "value": "Updates werden nur dann durchgeführt, wenn ein Problem auftritt oder eine neue Funktion benötigt wird. Die Release Notes werden nicht gelesen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, dass auf dem System eine veraltete, potenziell verwundbare Version von OpenLDAP läuft. Es gibt keine Dokumentation über durchgeführte Updates."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A10-m2",
                    "uuid": "a0e810a0-26a3-493e-b623-d8d451bbd68c",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Updates werden regelmäßig angewendet. Eine manuelle Prüfung auf größere Kompatibilitätsprobleme (z.B. veraltete Overlays) wird durch das Lesen der Release Notes durchgeführt. Die Konfiguration wird nach dem Update manuell geprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Rahmen des regulären Patch-Managements wird OpenLDAP aktualisiert. Der Administrator liest die Release Notes, um festzustellen, ob verwendete Funktionen entfernt wurden. Nach dem Update wird der Dienst neu gestartet und eine einfache Testabfrage durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert anhand der Systemprotokolle oder des Patch-Management-Systems, dass Updates regelmäßig angewendet werden. Es wird geprüft, ob ein Prozess existiert, bei dem die Release Notes vor einem Update geprüft werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A10-m3",
                    "uuid": "c2b9be7d-20c3-4533-ad69-fc05beee1da6",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei Updates SOLLTE darauf geachtet werden, ob die Änderungen eingesetzte Backends oder Overlays sowie Softwareabhängigkeiten betreffen. Beim Update auf neue Releases SOLLTE geprüft werden, ob die verwendeten Overlays und Backends in der neuen Version weiterhin zur Verfügung stehen. Ist dies nicht der Fall, SOLLTEN geeignete Migrationspfade ausgewählt werden. Setzen Administrierende eigene Skripte ein, SOLLTEN sie daraufhin überprüft werden, ob sie mit der aktualisierten Version von OpenLDAP problemlos zusammenarbeiten. Die Konfiguration und die Zugriffsrechte SOLLTEN nach einer Aktualisierung sorgfältig geprüft werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor einem Update wird eine Checkliste abgearbeitet. Diese beinhaltet die Prüfung der Release Notes auf Änderungen bei verwendeten Backends und Overlays, die Überprüfung der Kompatibilität von angebundenen Anwendungen und eigenen Administrationsskripten. Nach dem Update wird die Konfiguration explizit geprüft (`slaptest`) und die Funktionsfähigkeit durch eine Reihe definierter Testfälle verifiziert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Checkliste und die Dokumentation der letzten Updates an. Es wird geprüft, ob alle in der Anforderung genannten Punkte (Backends, Overlays, Skripte, Konfiguration, Zugriffsrechte) berücksichtigt wurden. Die Ergebnisse der Tests nach dem Update werden eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A10-m4",
                    "uuid": "98fb5a53-14ce-4b85-b4a6-9aa340c2db97",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Updates werden zuerst in einer dedizierten Testumgebung, die die Produktionsumgebung spiegelt, getestet. Für jedes Update wird ein dokumentierter Rollback-Plan erstellt. Benutzerdefinierte Skripte werden mit einer automatisierten Testsuite überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor dem Rollout in der Produktion wird das Update auf einem Staging-System installiert, das eine aktuelle Kopie der Produktionsdatenbank und -konfiguration enthält. Eine automatisierte Testsuite, die typische Lese- und Schreiboperationen durchführt, wird ausgeführt. Der Rollback-Plan beschreibt, wie die alte Version der Software und der Datenbank aus einem Backup wiederhergestellt werden kann."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz und den Zustand der Testumgebung. Die Dokumentation der Testläufe und der Rollback-Pläne für die letzten Updates wird eingesehen. Es wird geprüft, ob die automatisierte Testsuite eine angemessene Testabdeckung bietet."
                      }
                    ]
                  },
                  {
                    "statement-id": "APP.2.3.A10-m5",
                    "uuid": "a2226bfd-fd89-4efc-8016-2fbeb4113704",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der gesamte Aktualisierungsprozess ist automatisiert. Es wird eine Canary-Deployment-Strategie verwendet, um das Update zunächst auf eine Teilmenge der Replikate auszurollen. Automatisierte Gesundheits- und Funktionstests werden nach dem Update ausgeführt, um die Integrität des Systems zu überprüfen, bevor die Einführung abgeschlossen wird."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine CI/CD-Pipeline holt neue OpenLDAP-Versionen, baut ein neues Container-Image und rollt dieses zuerst auf einem Replikat aus (Canary). Der Load Balancer leitet nur einen kleinen Teil des Traffics auf dieses Replikat. Automatisierte End-to-End-Tests und das Monitoring von Fehlerraten entscheiden automatisch, ob das Update auf alle anderen Replikate ausgeweitet oder zurückgerollt wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration und die Protokolle der CI/CD-Pipeline. Es wird die Konfiguration des Canary-Deployments und der automatisierten Tests überprüft. Die Metriken und Dashboards des Monitorings werden eingesehen, um die Wirksamkeit der automatisierten Gesundheitschecks zu bewerten."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}