{
  "component-definition": {
    "uuid": "f8b21495-a4e9-4364-9f89-22764c82022a",
    "metadata": {
      "title": "SYS.1.6 Containerisierung - Benutzerdefiniert",
      "last-modified": "2025-11-14T22:08:57.114081+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "09e201d7-f528-4f39-80d5-6730bf5bcf5b",
        "type": "hardware",
        "title": "SYS.1.6 Containerisierung",
        "description": "This component represents the implementation of all controls for Baustein SYS.1.6.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Der Begriff Containerisierung bezeichnet ein Konzept, bei dem Ressourcen eines Betriebssystems partitioniert werden, um Ausführungsumgebungen für Prozesse zu schaffen. Hierbei können je nach verwendetem Betriebssystem unterschiedliche Techniken zum Einsatz kommen, die sich in Funktionsumfang und Sicherheitseigenschaften unterscheiden. Oft wird auch von einer „Betriebssystemvirtualisierung\" gesprochen. Es wird jedoch kein vollständiges Betriebssystem virtualisiert, sondern es werden lediglich bestimmte Ressourcen durch einen geteilten Kernel zur Verfügung gestellt. Allgemein wird der Begriff Container verwendet, um das entstehende Konstrukt zu bezeichnen.<BR>Bevor leichtfertig komplexe Container-Umgebungen gebaut und verwendet werden, sollte zunächst gründlich abgewogen werden, ob der Aufwand für die Erstellung und den Betrieb einer Container-Umgebungen in einem geeigneten Verhältnis zum tatsächlichen Nutzen steht. Der sachgerechte Betrieb von Container-Umgebungen ist sehr komplex und es sind viele Anforderungen zu beachten. Container können genutzt werden, um als zusätzlicher Trennungsmechanismus eine Härtung der Umgebung zu erreichen, sofern die Art der Containertechnik und die vorgenommene Konfiguration hierfür sachgerecht und geeignet sind.<BR>Es findet eine Unterscheidung zwischen Applikations-Containern (z. B. nach der Spezifikation der Open Container Initiative / OCI) und System-Containern statt. System-Container sind der älteste Typ von Containern, wie z. B. FreeBSD Jails, Solaris Zones, OpenVZ, LXC und LXD. Sie stellen eine Umgebung zur Verfügung, die sich ähnlich einem eigenständigen Betriebssystem verhält, entsprechende Dienste anbieten und mehrere Anwendungen ausführen kann. Applikations-Container hingegen sind speziell für den Fall gedacht, eine einzelne Anwendung auszuführen. Sie folgen dem Lebenszyklus der Anwendung, bieten aber auch innerhalb des Containers keine betriebssystemspezifischen Dienste an. Aus technischer Sicht setzen diese beiden Typen jedoch auf den gleichen Mechanismus zur Trennung, also die Prozessisolation durch den Kernel.<BR>Beim Beispiel Linux-Container (LXC) werden dazu hauptsächlich die Mechanismen Namespaces und cgroups verwendet, um die Prozessisolation noch zu ergänzen.<BR><BR>• Über Namespaces wird kontrolliert, welche Ressourcen ein Prozess sehen kann. Es gibt sieben unterschiedliche Namespaces: Mount (mnt), Prozess-ID (pid), Netz (net), Interprozess-Kommunikation (ipc), UTS (uts), User ID (user) und Control Group (cgroup).<BR><BR>• Über cgroups wird kontrolliert, welche Ressourcen bzw. welchen Anteil einer Ressource ein Prozess benutzen kann. Zu Ressourcen zählen insbesondere Memory, CPU, BLKIO oder PIDS.<BR>Bei der Verwendung von Namespaces und cgroups sind viele Einzelheiten zu beachten. Unter anderem spielt die Reihenfolge, in der Namespaces geteilt werden, eine entscheidende Rolle. Für diesen Zweck wurden Container-Runtimes entwickelt, wie etwa runc, crun, railcar oder auch katacontainers. Die Hauptaufgabe von Container-Runtimes ist das Erstellen einer besonderen Ausführungsumgebung für Prozesse. Sie kommunizieren mit dem Kernel und rufen Syscalls mit den entsprechenden Parametern sowie in der korrekten Reihenfolge auf, um die gewünschte Ausführungsumgebung zu erhalten.<BR>Üblicherweise benötigen Container analog zu einem Betriebssystem ein Dateisystem, in dem die auszuführenden Programme abgelegt werden. Im Container-Umfeld haben sich bestimmte Dateiformate etabliert, um diese Dateisysteme zu beschreiben. Diese werden als Image, fälschlicherweise aber teilweise ebenfalls als Container bezeichnet. Abhängig vom verwendeten Container-Typ kann der Inhalt dieser Images von einer einzelnen statisch kompilierten Anwendung bis hin zum vollständigen Inhalt eines Betriebssystems inklusive diverser Ausführungsumgebungen und sonstiger Abhängigkeiten reichen. Images sind transportable, abgeschlossene Einheiten, die in einer Container-Umgebung ausgebracht werden können und alle Komponenten für die Funktionsfähigkeit enthalten.<BR>Neben der Runtime gibt es Container-Engines wie z. B. Docker, Rocket oder CRI-O, die viele Verwaltungsaufgaben übernehmen. In erster Linie bilden sie die Schnittstelle zu Benutzenden und verarbeiten übergebene Befehle. Sie sorgen dafür, dass die benötigten Images zur Verfügung stehen und entsprechende Metadaten vorbereitet sind. Schließlich ruft die Container-Engine die Container-Runtime mit entsprechenden Parametern auf. Die Container-Engine ist damit nicht Teil des Mechanismus Containerisierung, sondern übernimmt hier eine Verwaltungsfunktion.<BR>Weiterhin gibt es unterschiedliche Arten von Containern. Diese unterscheiden sich anhand des Einsatzszenarios und des Lebenszyklus eines Containers. Als persistenter Container wird ein Container bezeichnet, der für einen längeren Einsatz gedacht ist. Es kann durchaus valide Gründe geben, in Containern dauerhaft Daten zu speichern. Besonders im Cloud-Umfeld sind jedoch häufig volatile Container anzutreffen. Dort haben Container in der Regel eine viel kürzere Lebensdauer, die zudem oft von Orchestrierungswerkzeugen bestimmt wird.<BR>Aus der OCI gibt es Bestrebungen, Standards und Referenzimplementierung zur Verfügung zu stellen. Beispielsweise ist runc die Standard-Referenzimplementierung einer Container-Runtime. Andere Container-Runtimes, die kompatibel zum OCI-Standard sind, können somit weitgehend ausgetauscht und verwendet werden."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist der Schutz von Informationen, die in, von oder mit Containern verarbeitet, angeboten oder darüber übertragen werden. Der Baustein behandelt, wie Container grundsätzlich abgesichert werden können. Dabei wird unterschieden zwischen den Diensten zum Betrieb der Container, also der Software, die für Konfiguration und Verwaltung der Container zuständig ist, sowie den Applikationen und Diensten, die innerhalb der Container ausgeführt werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein SYS.1.6 Containerisierung ist immer anzuwenden, sobald Dienste oder Anwendungen in Containern betrieben werden.<BR>Dieser Baustein betrachtet Container unabhängig von konkreten Produkten. Die Anforderungen orientieren sich an den Fähigkeiten derzeit am Markt verfügbarer Implementierungen. Bei der Produktauswahl ist der Baustein APP.6 Allgemeine Software zu berücksichtigen.<BR>Der Baustein ergänzt die Aspekte, die in den Bausteinen SYS.1.1 Allgemeiner Server und SYS.1.3 Server unter Linux und Unix behandelt werden, um Spezifika von Containerisierung. Die Anforderungen dieser Bausteine sollten vom Host-System erfüllt werden, unabhängig davon, ob dieses auf physischen Servern ausgeführt wird oder virtualisiert ist. Weiterhin gelten die Anforderungen dieser Bausteine ebenfalls für jede der im Rahmen der Containerisierung erzeugten Userspace-Umgebung. Dabei müssen regelmäßig weitere Bausteine wie z. B. CON.8 Software-Entwicklung oder die Bausteine der Teilschicht OPS.1.1 Kern-IT-Betrieb berücksichtigt werden. Dies trifft vor allem auf die Erstellung von Images zu.<BR>Typischerweise kommunizieren Container durch virtuelle Netze auf dem Host-System miteinander. Die Bausteine der Teilschichten NET.1 Netze und NET.3 Netzkomponenten müssen entsprechend berücksichtigt werden.<BR>Sicherheitsanforderungen möglicher Dienste, wie z. B. Webserver (APP.3.2 Webserver) oder Webanwendungen (APP.3.1 Webanwendungen und Webservices) sind Gegenstand eigener Bausteine, die zusätzlich anzuwenden sind. Sollte das Host-System virtualisiert sein, ist der Baustein SYS.1.5 Virtualisierung zu modellieren.<BR>Sollten die Container und die darunterliegende Infrastruktur nicht vollständig selber betrieben und alleinig genutzt werden, sondern werden Teile hiervon durch Dritte bereitgestellt oder von Dritten genutzt, sind zusätzliche Anforderungen der Bausteine OPS.2.3 Nutzung von Outsourcing und OPS.2.2 Cloud-Nutzung sowie OPS.3.2 Anbieten von Outsourcing zu berücksichtigen.<BR>Der Baustein enthält grundsätzliche Anforderungen zur Einrichtung und zum Betrieb von Containerisierung. Die weiteren im Themenumfeld üblichen Dienste, wie z. B. Orchestrierung von Containern, Speichersysteme, virtuelle Netze, Automatisierung für CI/CD-Pipelines oder der Betrieb von Image-Registries, werden hier nicht betrachtet. Ebenso wenig trifft dieser Bausteine Aussagen zu Anforderungen, die für den Bau von Images gelten. Für Anforderungen zur Orchestrierung von Containern mit Kubernetes ist der Baustein APP.4.4 Kubernetes zu betrachten."
          },
          {
            "name": "2.1. Schwachstellen oder Schadsoftware in Images",
            "value": "Container werden vorrangig auf Basis von vorgefertigten Images erstellt, die selbst erstellt, aber auch häufig aus dem Internet bezogen werden. Des Weiteren wird Software zunehmend in Form von Images ausgeliefert. Diese Images kann der IT-Betrieb auch für die Erstellung seiner eigenen Images nutzen, indem er Software oder Konfigurationen ergänzt, verändert oder auch entfernt.<BR>Die in den Images enthaltene Software könnte verwundbar und die aus dem Image gestarteten Container könnten dadurch angreifbar sein. Solche Schwachstellen können dem IT-Betrieb auch häufig nicht bekannt sein, da die in den Images enthaltene Software oft nicht in der eigenen Software-Verwaltung erfasst ist. Der IT-Betrieb muss sich grundsätzlich darauf verlassen, dass Updates über den Prozess der Image-Erstellung verfügbar gemacht werden. Von außen betrachtet ist häufig nur aufwendig zu ermitteln, welche Software-Pakete in diesen Images vorhanden sind.<BR>Zudem könnten Images absichtlich integrierte Schadsoftware enthalten, wie z. B. Ransomware oder Kryptominer. Da ein einzelnes Image oft in einer großen Anzahl von Containern ausgebracht wird, kann der resultierende Schaden immens sein."
          },
          {
            "name": "2.2. Administrative Zugänge ohne Absicherung",
            "value": "Um Container-Dienste auf einem Host zu verwalten, werden administrative Zugänge benötigt. Diese Zugänge sind oft als Dienste realisiert, die entweder lokal oder über das Netz angesprochen werden können. Mechanismen zur Authentisierung und Verschlüsselung der administrativen Zugänge sind häufig vorhanden, aber nicht bei allen Produkten standardmäßig aktiviert.<BR>Wenn Unbefugte auf die Netzsockets oder das Host-System zugreifen können, können sie über ungeschützte administrative Zugänge Befehle ausführen, die zum Verlust der Vertraulichkeit, Integrität und Verfügbarkeit aller auf diesem Host ausgeführten Container führen können."
          },
          {
            "name": "2.3. Ressourcenkonflikte auf dem Host",
            "value": "Einzelne Container können den Host überlasten und so die Verfügbarkeit aller anderen Container auf dem Host oder auch den Betrieb des Host-Systems selbst gefährden."
          },
          {
            "name": "2.4. Unberechtigte Kommunikation",
            "value": "Alle Container auf einem Host sind grundsätzlich in der Lage, miteinander, mit dem Host sowie beliebigen anderen Hosts zu kommunizieren. Sofern diese Kommunikation nicht eingeschränkt wird, kann dies ausgenutzt werden, um z. B. andere Container oder Hosts anzugreifen.<BR>Weiterhin besteht die Gefahr, dass Container von außen erreichbar sind, auch wenn dies nicht erwünscht ist. So könnte ein Angriff gegen Dienste, die eigentlich nur intern erreichbar sein sollten, von außen erfolgen. Diese Gefährdung erhöht sich durch die geringere Aufmerksamkeit, die solchen internen Diensten oft entgegengebracht wird. Wird z. B. eine Verwundbarkeit auf einem nur intern eingesetzten Dienst toleriert und ist dieser auch von außen erreichbar, kann dies den gesamten Betrieb erheblich gefährden."
          },
          {
            "name": "2.5. Ausbruch aus dem Container auf das Host-System",
            "value": "Besteht die Möglichkeit, im Container eigenen Code auszuführen, kann bei einem Angriff möglicherweise die Isolation des Containers gegenüber anderen Containern oder dem Host überwunden und auf andere Container, das Host-System oder die Infrastruktur zugegriffen werden. Es wird auch von einem „Container-Ausbruch\" gesprochen. Dieser Angriff kann z. B. über Schwachstellen in Prozessoren, im Betriebssystem-Kernel oder in lokal angebotenen Infrastruktur-Diensten wie z. B. DNS oder SSH erfolgen.<BR>Somit könnte bei einem Angriff die Kontrolle über das Host-System oder andere Systeme aus der Infrastruktur übernommen werden. Es droht der Verlust der Vertraulichkeit, Integrität und Verfügbarkeit aller auf diesem Host ausgeführten Container sowie auf dem Host selbst, falls dort ebenfalls erhöhte Privilegien erlangt werden können."
          },
          {
            "name": "2.6. Datenverluste durch das Container-Management",
            "value": "Im Rahmen der Verwaltung von Containern können diese ausgeschaltet werden, ohne darin gerade ausgeführter Software die Gelegenheit zu geben, z. B. aktuelle Schreibprozesse abzuschließen (nicht ordnungsgemäßes Herunterfahren). Sollten zu diesen Zeitpunkten Daten durch den Container verarbeitet werden, sind alle diese Daten verloren. Auch Daten, die persistent im Container gespeichert sind, können so dauerhaft verloren gehen."
          },
          {
            "name": "2.7. Vertraulichkeitsverlust von Zugangsdaten",
            "value": "Die Prinzipien des Aufbaus und der Erstellung von Images für Container setzen voraus, dass Zugangsdaten, z. B. für Datenbanken, im Container verfügbar sind. Über die Images selbst, die Skripte zur Erstellung der Images oder die Versionskontrolle der Skripte können solche Zugangsdaten in unbefugte Hände gelangen.<BR>Oft werden Zugangsdaten auch zum Erstellungszeitpunkt des Containers als Umgebungsvariable verfügbar gemacht. Hier droht ebenfalls der Vertraulichkeitsverlust dieser Daten."
          },
          {
            "name": "2.8. Ungeordnete Bereitstellung und Verteilung von Images",
            "value": "Im Gegensatz zu klassischen Installationen durch den IT-Betrieb, wo die Kontrolle über die ausgebrachten Anwendungen, Komponenten und Diensten vollständig beim IT-Betrieb selbst liegt, geht diese bei z. B. bei Automatisierung durch CI/CD in Container-Umgebungen verloren. Vielmehr stellt der IT-Betrieb nur eine Plattform bereit, in die Entwickelnde direkt ihre Anwendungen inklusive sämtlicher Abhängigkeiten einbringen und jederzeit verändern können."
          }
        ],
        "control-implementations": [
          {
            "uuid": "ad536cca-3954-4d1f-a935-3345cdd1e22b",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/virtualisierungslsungen_profile.json",
            "description": "Implementation for all controls in Baustein SYS.1.6",
            "implemented-requirements": [
              {
                "uuid": "c453f5a2-7cc5-4216-8478-d91aa1c0c244",
                "control-id": "ARCH.7.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.2.6.a6-m3",
                    "uuid": "8f68cf56-7786-4b61-aa49-3797eb8bb30c",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Falls die VDI-Komponenten virtualisiert betrieben werden, SOLLTEN sie auf einer dedizierten Virtualisierungsinfrastruktur betrieben werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die virtuellen Maschinen, auf denen die VDI-Management-Komponenten (z. B. Connection Broker, Datenbank, Lizenzserver) laufen, werden auf einem separaten Cluster von Hypervisor-Hosts betrieben. Dieser Management-Cluster wird nicht für die Ausführung der regulären virtuellen Clients oder anderer Server-Workloads verwendet, um Ressourcenkonflikte und Sicherheitsrisiken durch Kompromittierung anderer Systeme zu vermeiden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert in der Managementkonsole der Virtualisierungsplattform, dass ein dedizierter Cluster für die VDI-Management-Komponenten existiert. Es wird geprüft, ob auf den Hosts dieses Clusters ausschließlich die vorgesehenen Management-VMs und keine anderen Workloads laufen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a6-m4",
                    "uuid": "0bdc213a-a841-49d9-b71e-e02c91d80dcd",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Nicht nur die Hypervisoren, sondern auch die zugrundeliegende Storage- und Netzwerkinfrastruktur für die VDI-Managementkomponenten sind physisch oder logisch strikt von der Infrastruktur getrennt, die die virtuellen Clients und andere Anwendungen versorgt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der VDI-Management-Cluster verwendet dedizierte Storage-LUNs oder -Volumes und ist an separate Switch-Ports angeschlossen. Der Netzwerkverkehr des Management-Clusters wird über dedizierte VLANs geleitet, die von den VLANs der virtuellen Client-Workloads getrennt sind. Dies verhindert Performance-Engpässe ('Noisy Neighbor'-Problem) und verbessert die Sicherheit."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer untersucht die Konfiguration der Storage- und Netzwerkinfrastruktur. Es wird verifiziert, ob dedizierte Ressourcen (LUNs, VLANs, Switch-Ports) für den VDI-Management-Cluster zugewiesen sind. Die Netzwerk- und Storage-Architekturdiagramme werden auf eine korrekte Trennung geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a6-m5",
                    "uuid": "7861d67b-b7ac-46a3-b5b6-35b99a0f0348",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die VDI-Management-Ebene wird in einer dedizierten Hochsicherheitszone betrieben, idealerweise auf dedizierter physischer Hardware, mit strikten physischen und logischen Zugangskontrollen und intensiver Überwachung. Sie wird als kritische Infrastruktur behandelt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Server für die VDI-Management-Komponenten sind in einem separaten, zugangsgeschützten Rack im Rechenzentrum untergebracht. Der administrative Zugriff auf diese Systeme ist auf wenige, spezialisierte Administratoren beschränkt und erfordert Multi-Faktor-Authentifizierung und eine Privileged Access Management (PAM)-Lösung. Jegliche Aktivität auf diesen Systemen wird lückenlos protokolliert und analysiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die physischen Sicherheitsmaßnahmen für die VDI-Management-Hardware. Die Konfiguration der PAM-Lösung und die Zugriffsberechtigungen werden kontrolliert. Die Protokolle werden auf Vollständigkeit und auf die Analyse durch ein SIEM-System geprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "74bbe2e3-ab78-4b9a-ac72-8b194b5702be",
                "control-id": "ARCH.8.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.2.6.a15-m3",
                    "uuid": "e60309ad-c24d-4e7a-af8e-c8b9b1f0d5a3",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die VDI-Komponenten SOLLTEN redundant ausgelegt werden. Jede Komponente SOLLTE darüber hinaus redundant an die relevanten Netze angeschlossen werden. Falls die VDI-Komponenten auf physischen IT-Systemen betrieben werden, SOLLTEN diese IT-Systeme über redundante Stromversorgung und Datenspeicher verfügen. Falls die VDI-Komponenten virtualisiert betrieben werden, SOLLTEN Mechanismen der Virtualisierungsinfrastruktur für die Hochverfügbarkeit eingesetzt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Kritische VDI-Komponenten wie Connection Broker und Gateways werden als Cluster mit mindestens zwei Knoten betrieben. Diese werden entweder in einem Aktiv/Aktiv-Modus hinter einem Load Balancer oder in einem Aktiv/Passiv-Cluster mit automatischem Failover betrieben. Bei virtualisierten Komponenten wird die Hochverfügbarkeitsfunktion der Virtualisierungsplattform (z. B. VMware HA, Hyper-V Failover Clustering) genutzt, um die VMs bei einem Host-Ausfall automatisch auf einem anderen Host neu zu starten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Architektur der VDI-Umgebung und verifiziert, dass kritische Komponenten redundant ausgelegt sind. Die Konfiguration des Load Balancers oder des Failover-Clusters wird geprüft. Bei virtualisierten Umgebungen wird die Konfiguration der Hochverfügbarkeitsfunktion des Hypervisors kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a15-m4",
                    "uuid": "a4fc5129-09e1-4617-b853-825a87b56230",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die VDI-Lösung ist auf zwei physisch getrennte Rechenzentren in einer Stretched-Cluster-Konfiguration verteilt, was eine standortbezogene Ausfallsicherheit bietet. Der Failover-Prozess wird im Rahmen eines formalen Disaster-Recovery-Plans regelmäßig (z.B. halbjährlich) getestet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die VDI-Infrastruktur erstreckt sich über zwei Standorte mit einer synchronen Speicherspiegelung und einem ausfallsicheren Netzwerk. Im Falle des Ausfalls eines kompletten Standorts kann die VDI-Lösung am verbleibenden Standort weiterbetrieben werden. Die DR-Tests beinhalten einen kontrollierten Failover und Failback der gesamten Umgebung und werden protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert den Disaster-Recovery-Plan an und überprüft die Protokolle der letzten DR-Tests. Die Konfiguration der standortübergreifenden Cluster und der Speicherspiegelung wird analysiert. Es wird geprüft, ob die Tests erfolgreich waren und welche Lehren daraus gezogen wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a15-m5",
                    "uuid": "8721fd77-44d8-40c5-8af8-01b9cdd6343a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine standortübergreifende Aktiv-Aktiv-Architektur mit Global Server Load Balancing (GSLB) ist implementiert. Benutzer werden automatisch und transparent zum nächstgelegenen oder leistungsfähigsten Rechenzentrum geleitet. Das System kann den Totalausfall eines Standorts ohne Datenverlust und mit nur minimaler oder keiner Serviceunterbrechung für die Benutzer verkraften."
                      },
                      {
                        "name": "guidance",
                        "value": "An beiden Standorten läuft eine vollständige, aktive VDI-Umgebung. Ein GSLB-Dienst (z. B. F5 GTM, Cloudflare Load Balancing) verteilt die eingehenden Benutzeranfragen basierend auf geografischer Nähe, Latenz und Systemgesundheit auf die beiden Standorte. Die Benutzerdaten werden mittels asynchroner Replikation oder einer globalen Dateisystemtechnologie zwischen den Standorten aktuell gehalten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration des GSLB-Dienstes und die Routing-Richtlinien. Die Architektur wird auf eine echte Aktiv-Aktiv-Fähigkeit geprüft. Es wird ein simulierter Standortausfall durchgeführt (z. B. durch Deaktivieren des GSLB-Endpunkts für einen Standort), um zu beobachten, ob der Datenverkehr automatisch und nahtlos auf den verbleibenden Standort umgeleitet wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "f7abdc01-2c46-4738-93e7-e64134e10452",
                "control-id": "BES.2.1.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.2.6.a1-m1",
                    "uuid": "b3598f51-3e2d-468a-8bab-bf93e5d75877",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Planung für den VDI-Einsatz erfolgt ad-hoc und konzentriert sich nur auf einen unmittelbaren, begrenzten Anwendungsfall, wie z. B. ein Pilotprojekt. Eine langfristige Strategie oder die Anforderungen der gesamten Benutzerbasis werden nicht berücksichtigt. Leistungsanforderungen werden nur grob geschätzt."
                      },
                      {
                        "name": "guidance",
                        "value": "In dieser Phase werden oft nur die Anzahl der initialen Benutzer und die benötigten Standardanwendungen erfasst. Die Planung wird typischerweise in einem einfachen Dokument oder einer Kalkulationstabelle festgehalten, ohne formale Analyse von Wachstumsraten oder Support-Lebenszyklen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, ob überhaupt Planungsdokumente existieren. Es wird geprüft, ob die Planung über eine einfache Auflistung von Benutzern und Software hinausgeht und ob grundlegende Aspekte wie Server-Dimensionierung, wenn auch nur oberflächlich, bedacht wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a1-m2",
                    "uuid": "49cc6163-dcc9-4b2c-bf47-2752620f0dfc",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Planung für den VDI-Einsatz ist vorhanden. Die Anzahl der zu versorgenden virtuellen Clients und deren generelle Leistungsanforderungen (z.B. für Office-Arbeitsplätze) sind identifiziert. Die Planung ist jedoch nicht detailliert und berücksichtigt Aspekte wie zukünftiges Wachstum oder den Support-Lebenszyklus der Lösung nur am Rande."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Planung umfasst eine initiale Dimensionierung für Server, Storage und Netzwerk basierend auf den aktuellen Benutzerzahlen. Es gibt eine grundlegende Abstimmung zwischen den VDI-Komponenten und der Virtualisierungsplattform, meist basierend auf den Standardempfehlungen des Herstellers."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz eines Planungsdokuments, das die Anzahl der Clients und die grundlegenden Leistungsanforderungen definiert. Es wird geprüft, ob eine initiale Dimensionierung der VDI-Komponenten vorgenommen wurde und ob der geplante Supportzeitraum erwähnt wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a1-m3",
                    "uuid": "908534ae-a102-48cd-83d4-7545e130a22f",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Leistungsanforderungen und Anzahl der benötigten virtuellen Clients sowie die daraus resultierenden Anforderungen an die Dimensionierung der VDI MÜSSEN identifiziert werden. Die VDI-Komponenten MÜSSEN anhand dieser Dimensionierungsanforderungen bedarfsgerecht geplant werden. Die VDI-Komponenten und die genutzte Virtualisierungsinfrastruktur MÜSSEN aufeinander abgestimmt geplant werden. Der Support MUSS für den gesamten geplanten Einsatzzeitraum der VDI-Lösung bei der Planung mitberücksichtigt werden. Die Anzahl virtueller Clients und deren benötigte Leistung pro Virtualisierungsserver MUSS festgelegt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein formales Dokument zur Kapazitätsplanung wird erstellt. Dieses Dokument listet die verschiedenen Benutzerprofile (z. B. Office, Power-User, Entwickler) und deren spezifische Anforderungen an CPU, RAM, GPU und Storage auf. Die Planung berücksichtigt auch die Anforderungen an die Netzwerkinfrastruktur, wie Bandbreite und Latenz. Die Supportverträge für Hard- und Software werden geprüft und auf den geplanten Einsatzzeitraum abgestimmt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert das Planungsdokument auf Vollständigkeit. Es wird verifiziert, ob die Leistungsanforderungen für verschiedene Client-Typen definiert sind, ob die VDI-Komponenten entsprechend dimensioniert sind und ob ein gültiger Supportvertrag für den geplanten Einsatzzeitraum existiert. Stichprobenartig wird geprüft, ob die Festlegung der maximalen Client-Anzahl pro Server auf nachvollziehbaren Kriterien beruht."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a1-m4",
                    "uuid": "068d9624-3f0a-4f38-8ef6-c619725db902",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Planung umfasst ein detailliertes Kapazitätsmanagement, das Prognosen für Benutzerwachstum und sich ändernde Anwendungsanforderungen über den gesamten Lebenszyklus der VDI-Lösung beinhaltet. Ein formaler Kapazitätsplan wird erstellt und periodisch (z. B. jährlich) überprüft und angepasst, um sicherzustellen, dass die Ressourcen auch zukünftig ausreichen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Kapazitätsplanung basiert nicht nur auf Schätzungen, sondern auch auf den Ergebnissen von Pilotphasen oder Messungen bestehender Systeme. Die Planung berücksichtigt auch Lastspitzen und definiert klare Schwellenwerte, bei deren Erreichen eine Erweiterung der Infrastruktur eingeleitet werden muss. Der Plan wird im Configuration Management Board (CMB) genehmigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz eines formalen und genehmigten Kapazitätsplans. Es wird geprüft, ob der Plan Prognosen für zukünftiges Wachstum enthält und ob es einen definierten Prozess zur regelmäßigen Überprüfung und Anpassung des Plans gibt. Protokolle von Überprüfungen werden eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a1-m5",
                    "uuid": "493aea5c-f14f-419a-ab9a-26cd218b1c01",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die VDI-Planung ist vollständig in die strategische IT-Planung und das Finanzcontrolling integriert. Es werden automatisierte Werkzeuge zur Kapazitätsprognose eingesetzt, die auf Echtzeit-Nutzungsdaten und Trendanalysen basieren. Der Planungsprozess beinhaltet die Simulation von \"Was-wäre-wenn\"-Szenarien, um die Auswirkungen größerer Geschäftsveränderungen (z. B. Firmenzukäufe) proaktiv zu bewerten."
                      },
                      {
                        "name": "guidance",
                        "value": "Spezialisierte Monitoring-Tools sammeln kontinuierlich Leistungs- und Nutzungsdaten der VDI-Umgebung. Diese Daten fließen in ein Prognose-Tool ein, das maschinelles Lernen verwendet, um den zukünftigen Ressourcenbedarf vorherzusagen. Die Ergebnisse werden in einem Management-Dashboard visualisiert und dienen als Grundlage für Investitionsentscheidungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer untersucht die Integration des VDI-Planungsprozesses in die übergeordneten Unternehmensprozesse. Es wird die Nutzung von automatisierten Prognose-Werkzeugen verifiziert und geprüft, ob die Ergebnisse der Simulation von Szenarien dokumentiert und bei strategischen Entscheidungen berücksichtigt werden. Ein Auditor kann die Ausführung eines automatisierten Berichts zur Kapazitätsprognose anfordern: `Show-VDIUsageForecast -Period 12Months`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c6889b53-a911-4059-9d80-5a6b5c884bdd",
                "control-id": "DET.3.1.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.2.6.a11-m3",
                    "uuid": "ae5e866a-f516-47db-b69f-2a015c15c52c",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die VDI-Komponenten SOLLTEN mindestens die folgenden Ereignisse an ein zentrales Monitoring weitergeleitet werden: erfolgreiche und fehlgeschlagene Anmeldeversuche, Konfigurationsänderungen an VDI-Komponenten oder virtuellen Clients, erfolgreiche und fehlgeschlagene Updates an VDI-Komponenten, fehlgeschlagene Updates an virtuellen Clients. Die VDI-Komponenten SOLLTEN regelmäßig auf Schwachstellen überprüft werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Audit-Protokollierung auf allen VDI-Komponenten wird aktiviert, um die geforderten Ereignisse zu erfassen. Ein Log-Forwarding-Agent (z. B. Winlogbeat, Syslog-ng) wird auf den Komponenten installiert, um diese Ereignisse an einen zentralen Log-Management-Server (z. B. ELK-Stack, Graylog) zu senden. Es werden regelmäßige, authentifizierte Schwachstellen-Scans gegen die VDI-Komponenten durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Logging-Konfiguration der VDI-Komponenten und des Log-Forwarding-Agenten. Im zentralen Log-Management-System wird stichprobenartig geprüft, ob die geforderten Ereignisse ankommen. Die Konfiguration und die Berichte der letzten Schwachstellen-Scans werden eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a11-m4",
                    "uuid": "f6a22788-c35e-40c8-bd48-6e3763fef88e",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die gesammelten Protokolldaten werden in einem Security Information and Event Management (SIEM) System mit anderen Datenquellen (z. B. Firewall-Logs, Active Directory-Logs) korreliert. Es sind grundlegende Alarmierungsregeln konfiguriert, um auf verdächtige Ereignisse (z. B. übermäßig viele fehlgeschlagene Anmeldungen von einer IP-Adresse, Konfigurationsänderung außerhalb eines Wartungsfensters) hinzuweisen."
                      },
                      {
                        "name": "guidance",
                        "value": "Im SIEM (z. B. Splunk, QRadar) werden spezielle Parser für die VDI-Logs entwickelt oder importiert. Korrelationsregeln werden erstellt, um einfache Angriffsmuster zu erkennen, z. B. 'Brute-Force-Angriff: 10 fehlgeschlagene Anmeldungen für einen Benutzer innerhalb von 5 Minuten' oder 'Verdächtige Konfigurationsänderung: Administrator ändert eine Richtlinie außerhalb der Geschäftszeiten'."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer untersucht die Konfiguration des SIEM, insbesondere die Parser und Korrelationsregeln für die VDI-Umgebung. Die Alarmierungshistorie wird auf relevante Sicherheitsereignisse und deren Untersuchung durch das Sicherheitsteam geprüft. Es wird verifiziert, ob die Regeln dokumentiert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a11-m5",
                    "uuid": "2316f3f7-aa69-44c5-be8d-594f7e82f7bc",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden User and Entity Behavior Analytics (UEBA) auf die VDI-Protokolldaten angewendet, um anomale Aktivitäten zu erkennen, die von regelbasierten Systemen nicht erfasst werden. Die Ergebnisse von Schwachstellen-Scans werden automatisch in ein Ticketing-System eingespeist, um die Behebung nachzuverfolgen und zu eskalieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein UEBA-Modul im SIEM oder ein eigenständiges Tool lernt das normale Verhalten von Benutzern und Systemen (z. B. übliche Anmeldezeiten, genutzte Anwendungen, Datenzugriffsmuster). Es alarmiert bei Abweichungen, wie z. B. einem Administrator, der sich nachts von einem ungewöhnlichen Ort aus anmeldet und große Datenmengen herunterlädt. Die Integration des Schwachstellen-Scanners mit dem ITSM-Tool (z. B. Jira, ServiceNow) erstellt automatisch Tickets für gefundene Schwachstellen und weist sie den zuständigen Teams zu."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration und Funktionsweise des UEBA-Systems. Es werden Beispiel-Alarme für anomales Verhalten analysiert. Die Integration zwischen Schwachstellen-Scanner und Ticketing-System wird geprüft, indem der Lebenszyklus eines Tickets von der Entdeckung einer Schwachstelle bis zu ihrer Behebung nachverfolgt wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "12b907fe-bfd8-4561-adaa-57b9388132a4",
                "control-id": "DET.4.15",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "PERF",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.2.6.a10-m3",
                    "uuid": "8a402358-e7ba-4efd-b70d-cad6fbca6c80",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zustand der VDI-Komponenten SOLLTE zentral überwacht werden. Es SOLLTEN mindestens folgende Parameter für jede VDI-Komponente überwacht werden: Erreichbarkeit der benötigten Netzschnittstellen, Verfügbarkeit der von der VDI-Komponente bereitgestellten Dienste, Auslastung der CPU und des Arbeitsspeichers."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein zentrales Monitoring-System (z. B. Nagios, Zabbix, Prometheus) wird verwendet, um die definierten Parameter zu überwachen. Für jede VDI-Komponente (Broker, Gateway, Datenbank etc.) werden Checks eingerichtet, die regelmäßig die Netzwerk-Erreichbarkeit (Ping), die Verfügbarkeit der spezifischen Dienste (z. B. Port-Check auf dem Broker-Port) und die Basisauslastung von CPU und RAM abfragen. Es sind grundlegende Schwellenwerte definiert, bei deren Überschreitung eine Benachrichtigung an die Administratoren erfolgt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Konfiguration des Monitoring-Systems. Es wird verifiziert, ob alle VDI-Komponenten im Monitoring erfasst sind und ob die geforderten Parameter (Netzwerk, Dienste, CPU, RAM) überwacht werden. Es wird geprüft, ob Alarmierungsregeln konfiguriert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a10-m4",
                    "uuid": "a15e0599-e3db-4d56-ab1e-613238276085",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Monitoring umfasst anwendungsspezifische Gesundheitsprüfungen (Health Checks) für die VDI-Dienste. Es sind detaillierte Schwellenwerte für Leistungskennzahlen (z.B. Anmeldedauer, Protokolllatenz) definiert, bei deren Überschreitung automatisch Alarme ausgelöst werden. Ein zentrales Dashboard bietet eine Echtzeit-Übersicht über den Gesundheitszustand der gesamten VDI-Umgebung."
                      },
                      {
                        "name": "guidance",
                        "value": "Spezielle Management-Packs oder Plugins für die VDI-Lösung werden im Monitoring-System eingesetzt. Diese führen tiefergehende Prüfungen durch, z. B. die Abfrage von Datenbank-Verbindungspools oder die Messung der Lizenzserver-Antwortzeit. Das Dashboard (z. B. in Grafana) visualisiert die wichtigsten Metriken und den Gesamtstatus der Umgebung auf einen Blick."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer untersucht das Monitoring-Dashboard und die Konfiguration der anwendungsspezifischen Checks. Es wird geprüft, ob die Schwellenwerte für Leistungskennzahlen sinnvoll und dokumentiert sind. Die Alarmierungshistorie wird auf relevante Ereignisse und deren Bearbeitung geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a10-m5",
                    "uuid": "8bc03885-d8be-495e-9686-25460c9e4443",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird prädiktives Monitoring eingesetzt. Das System analysiert Trends in der Ressourcennutzung, um potenzielle Engpässe vorauszusagen, bevor sie die Benutzer beeinträchtigen. Synthetische Benutzeranmeldungen werden kontinuierlich von verschiedenen Standorten aus durchgeführt, um die End-to-End-Leistung und -Verfügbarkeit proaktiv zu überwachen."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Monitoring-Lösung mit AIOps-Funktionen (AI for IT Operations) wird verwendet. Diese analysiert historische Daten, um normale Verhaltensmuster zu lernen und Anomalien zu erkennen. Dedizierte Probes (z. B. LoginVSI, eG Innovations) simulieren rund um die Uhr Benutzeranmeldungen und Anwendungsstarts und messen die Performance. Bei Abweichungen wird proaktiv ein Ticket im ITSM-System erstellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration der prädiktiven Analyse- und Synthetik-Monitoring-Tools. Es wird geprüft, ob die Trendanalysen und die Ergebnisse der synthetischen Tests für die Kapazitätsplanung und proaktive Fehlerbehebung genutzt werden. Die Protokolle der letzten simulierten Anmeldungen werden eingesehen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "4abaaaea-b7b2-46bb-967b-e26504ae5abb",
                "control-id": "KONF.10.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.2.6.a2-m1",
                    "uuid": "560e7f72-9b1d-4559-a643-bfffe2600eee",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Installation der VDI-Komponenten erfolgt mit den Standardeinstellungen des Herstellers („Next, Next, Finish“). Sicherheitsaspekte werden nur minimal oder gar nicht berücksichtigt. Eine Dokumentation der Konfiguration ist lückenhaft oder nicht vorhanden."
                      },
                      {
                        "name": "guidance",
                        "value": "Administratoren installieren die Software oft unter Zeitdruck und ohne die Sicherheitsleitfäden des Herstellers zu lesen. Es werden Standard-Dienstkonten mit übermäßigen Berechtigungen verwendet und die Kommunikation zwischen den Komponenten erfolgt unverschlüsselt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, ob die Konfiguration der VDI-Komponenten von den unsicheren Standardeinstellungen abweicht. Es wird geprüft, ob eine Dokumentation der vorgenommenen Einstellungen existiert, selbst wenn sie unvollständig ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a2-m2",
                    "uuid": "5b75416b-c3d7-4cc1-a68a-aa9962cf268b",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Installation der VDI-Komponenten folgt den grundlegenden Installationsanleitungen des Herstellers. Einige offensichtliche Sicherheitseinstellungen, wie das Ändern von Standardpasswörtern, werden vorgenommen. Die Konfiguration ist jedoch nicht systematisch gehärtet oder auf das Notwendige beschränkt. Eine grundlegende Dokumentation der Installation ist vorhanden."
                      },
                      {
                        "name": "guidance",
                        "value": "Während der Installation werden die wichtigsten Sicherheitsempfehlungen aus der Schnellstart-Anleitung des Herstellers umgesetzt. Die Zuweisung von Clients an Benutzer erfolgt, aber die Absicherung der Kommunikationskanäle wird möglicherweise noch nicht konsequent umgesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, ob die grundlegenden Sicherheitsempfehlungen des Herstellers (z. B. aus dem „Getting Started Guide“) umgesetzt wurden. Es wird geprüft, ob die Konfiguration dokumentiert ist und ob Standardpasswörter geändert wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a2-m3",
                    "uuid": "b65a1d92-58b9-421e-a030-0d346a1bf849",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wenn die VDI-Komponenten installiert und konfiguriert werden, MUSS mindestens berücksichtigt werden, wie auf betrieblich und technisch notwendige Funktionen beschränkt wird, die Kommunikation zwischen VDI-Komponenten abgesichert wird sowie virtuelle Clients sicher den Benutzenden oder Gruppen hiervon zugewiesen werden. Empfehlungen von dem herstellenden Unternehmen der VDI-Lösung für die sichere Konfiguration MÜSSEN berücksichtigt werden. Die Konfigurationen der VDI-Komponenten MÜSSEN geeignet dokumentiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine Installations-Checkliste verwendet, die auf den Härtungsempfehlungen des Herstellers basiert. Nicht benötigte Dienste und API-Endpunkte der VDI-Komponenten werden deaktiviert. Die Kommunikation zwischen den Komponenten wird durch TLS erzwungen. Die Zuweisungsregeln für virtuelle Clients werden sorgfältig konfiguriert und dokumentiert. Die Dokumentation erfolgt in einem zentralen System wie einem Wiki oder einer CMDB."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Konfiguration der VDI-Komponenten anhand der Härtungsleitfäden des Herstellers und der internen Dokumentation. Es wird geprüft, ob die Kommunikation verschlüsselt ist, ob der Funktionsumfang eingeschränkt wurde und ob die Zuweisungsregeln korrekt implementiert sind. Die Qualität und Aktualität der Dokumentation wird bewertet."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a2-m4",
                    "uuid": "5de45e1b-02da-406c-8ff5-adfb5a38c24f",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wurde ein formeller Härtungsleitfaden für die VDI-Komponenten entwickelt, der über die Herstellerempfehlungen hinausgeht und auf etablierten Benchmarks (z. B. CIS) basiert. Die Konfigurationen werden zentral in einem Konfigurationsmanagementsystem (z. B. Ansible, Puppet) verwaltet und versioniert. Automatisierte Skripte werden verwendet, um die konsistente Anwendung der Sicherheitseinstellungen sicherzustellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Konfiguration der VDI-Komponenten wird als Code (Infrastructure as Code) behandelt. Jede Änderung an der Konfiguration erfordert einen Review- und Genehmigungsprozess. Die Automatisierungsskripte werden regelmäßig ausgeführt, um die Konfiguration zu überprüfen und Konfigurationsdrift zu korrigieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert den internen Härtungsleitfaden an und vergleicht ihn mit der implementierten Konfiguration. Die Code-Repositories für die Konfigurationsautomatisierung werden eingesehen. Es wird geprüft, ob ein Change-Management-Prozess für Konfigurationsänderungen etabliert ist. Ein Auditor kann die Ausführung eines Konformitätsprüfungs-Skripts anfordern: `Test-VDIComponentHardening -Profile 'CIS_Level_1'`."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a2-m5",
                    "uuid": "23a9a760-c817-4046-8cfc-849407ccfe9e",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der gesamte Installations- und Konfigurationsprozess ist vollständig automatisiert (Zero-Touch-Provisioning). Sicherheitskonfigurationen werden kontinuierlich mit Policy-as-Code-Werkzeugen überwacht und durchgesetzt. Jede Abweichung von der definierten Sicherheitsbaseline löst sofort einen Alarm und eine automatisierte Wiederherstellung des Soll-Zustands aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Werkzeug wie HashiCorp Terraform wird für die Bereitstellung der Infrastruktur und ein Werkzeug wie Open Policy Agent (OPA) für die kontinuierliche Validierung der Konfiguration verwendet. Die Sicherheitsrichtlinien (Policies) sind ebenfalls als Code definiert und versioniert. Die Ergebnisse der Konformitätsprüfungen werden in Echtzeit auf einem Sicherheits-Dashboard angezeigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Automatisierungs- und Policy-as-Code-Infrastruktur. Es wird verifiziert, dass der Prozess von der Bereitstellung bis zur Überwachung lückenlos ist. Der Prüfer führt testweise eine nicht autorisierte Konfigurationsänderung durch, um zu beobachten, ob diese automatisch erkannt und korrigiert wird und ob ein entsprechender Alarm ausgelöst wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "92166689-664f-431e-8ba2-917f873e1a8b",
                "control-id": "KONF.10.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.2.6.a7-m3",
                    "uuid": "90ab46c6-600e-49ed-85ea-dac5626ef842",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Möglichkeiten der VDI-Lösung SOLLTEN für die Härtung der virtuellen Clients entsprechend den Anforderungen des Bausteins SYS.2.5 Client-Virtualisierung genutzt werden. Die Betriebssysteme der Clients SOLLTEN ausschließlich über die Managementkomponente der VDI-Lösung konfiguriert werden. Eine individuelle Konfiguration bestehender virtueller Clients über die Virtualisierungsinfrastruktur SOLLTE mit technischen Mitteln unterbunden werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Hardening-Richtlinien werden zentral in der VDI-Managementkonsole definiert und auf die Client-Pools angewendet. Dies umfasst beispielsweise das Deaktivieren von USB-Ports, das Einschränken von Systemeinstellungen oder das Konfigurieren der Windows-Firewall. Der direkte Zugriff auf die Konsole der virtuellen Maschinen über den Hypervisor-Client wird für Administratoren eingeschränkt, um manuelle Änderungen zu verhindern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die in der VDI-Lösung definierten Härtungsrichtlinien. Es wird stichprobenartig auf einem virtuellen Client geprüft, ob diese Richtlinien korrekt angewendet werden. Die Berechtigungen auf der Virtualisierungsplattform werden verifiziert, um sicherzustellen, dass manuelle Konfigurationsänderungen an den VMs unterbunden sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a7-m4",
                    "uuid": "531a1cb2-f68f-47a8-b29f-9e6caa3cac8d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Härtungsrichtlinien innerhalb der VDI-Lösung sind umfassend, basieren auf anerkannten Benchmarks (z. B. CIS Benchmarks, DISA STIGs) und werden versioniert. Es werden regelmäßige, automatisierte Audits durchgeführt, um die Konformität der virtuellen Clients mit diesen Richtlinien zu überprüfen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Master-Images werden mit Skripten gehärtet, die auf CIS-Benchmarks basieren. Zusätzlich werden VDI-Richtlinien verwendet, um dynamische Einstellungen zu erzwingen. Ein Konformitäts-Scan-Tool prüft regelmäßig alle laufenden virtuellen Clients auf Abweichungen von der Baseline. Die Ergebnisse werden in einem Dashboard angezeigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die implementierten Härtungsrichtlinien mit dem gewählten externen Benchmark. Die Ergebnisse der automatisierten Konformitäts-Audits werden eingesehen und auf nicht behobene Abweichungen geprüft. Ein Auditor kann die Ausführung eines Konformitätsscans für eine zufällige VM anfordern: `Invoke-VMComplianceScan -VMName 'Finance-Client-05' -Benchmark 'CIS_Windows11_v1.0'`."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a7-m5",
                    "uuid": "8cb3f151-e372-447e-8795-6fabb0562f47",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird ein Desired State Configuration (DSC) Management verwendet. Die Härtung der virtuellen Clients wird kontinuierlich durchgesetzt. Jede unautorisierte Änderung an der Konfiguration eines virtuellen Clients wird automatisch erkannt, protokolliert und sofort auf den definierten Soll-Zustand zurückgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Technologien wie PowerShell DSC, Ansible oder Puppet werden eingesetzt, um den gewünschten Konfigurationszustand zu definieren. Ein Agent auf jedem virtuellen Client stellt sicher, dass dieser Zustand permanent beibehalten wird. Jeder Versuch einer manuellen Änderung (z. B. das Aktivieren eines Dienstes) wird innerhalb von Minuten automatisch korrigiert. Die Korrekturversuche werden an ein zentrales Logging-System gemeldet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer untersucht die Konfiguration des DSC-Management-Systems. Es wird testweise eine Konfigurationsänderung auf einem virtuellen Client vorgenommen, um zu verifizieren, dass diese automatisch zurückgesetzt wird. Die Protokolle werden geprüft, um festzustellen, ob der Korrekturvorgang korrekt gemeldet wurde."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "98be9e0c-f197-48e7-b067-f5cc0a7f0c91",
                "control-id": "KONF.10.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.2.6.a14-m3",
                    "uuid": "af9221e8-83e5-4fb4-8f31-0f8412202434",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Nachdem sie benutzt wurden oder zu einem definierten Zeitpunkt SOLLTEN die virtuellen Clients auf ihren Grundzustand, d. h. auf das zugrundeliegende Template, zurückgesetzt oder bei Bedarf neu provisioniert werden. Diese Zeitfenster SOLLTEN dokumentiert und an die Betroffenen kommuniziert werden. Nicht zurückgesetzte virtuelle Clients SOLLTEN NICHT von mehreren unterschiedlichen Benutzenden verwendet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Für Anwendungsfälle, die keine persistenten Daten auf dem Client erfordern (z. B. Call-Center, Schulungsräume), werden nicht-persistente Desktop-Pools eingerichtet. Die VDI-Lösung ist so konfiguriert, dass die virtuellen Maschinen nach der Abmeldung des Benutzers automatisch zurückgesetzt oder gelöscht und neu aus dem Master-Template erstellt werden. Die Benutzer werden darüber informiert, dass alle auf dem Desktop gespeicherten Daten verloren gehen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Konfiguration der Desktop-Pools in der VDI-Managementkonsole. Es wird verifiziert, ob die Option zum Zurücksetzen/Löschen nach Abmeldung für die entsprechenden Pools aktiviert ist. Die Kommunikationsunterlagen für die Benutzer werden auf entsprechende Hinweise geprüft. Es wird kontrolliert, ob sichergestellt ist, dass nachfolgende Benutzer eine saubere VM erhalten."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a14-m4",
                    "uuid": "f36348ab-2d0e-489f-9d6d-af73e717b500",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Clients werden nach jeder Abmeldung automatisch zurückgesetzt. Es sind robuste Mechanismen zur Umleitung von Benutzerprofilen und -daten (z. B. auf einen Netzwerkspeicher) implementiert, um eine nahtlose Benutzererfahrung zu gewährleisten und gleichzeitig die Zustandslosigkeit des Client-Betriebssystems beizubehalten."
                      },
                      {
                        "name": "guidance",
                        "value": "Technologien wie FSLogix Profile Containers oder VMware Dynamic Environment Manager werden verwendet, um das Benutzerprofil und benutzerspezifische Daten in eine virtuelle Festplattendatei (VHDX) auf einem schnellen Dateiserver auszulagern. Beim Anmelden wird diese Datei in den ansonsten zustandslosen Client eingehängt, sodass der Benutzer seine personalisierte Umgebung vorfindet. Nach der Abmeldung wird die Maschine dennoch zurückgesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration der Profilmanagement-Lösung. Es wird geprüft, ob die Zurücksetzungsrichtlinie für die Clients konsequent auf 'bei Abmeldung' gesetzt ist. Testweise wird eine Datei auf dem Desktop gespeichert, eine Ab- und Neuanmeldung durchgeführt und geprüft, ob die Datei im neuen Client wieder vorhanden ist (was die Profilpersistenz belegt) und der Client selbst zurückgesetzt wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a14-m5",
                    "uuid": "b7332523-2f20-4d28-b5cb-0b638850cbdb",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die gesamte Benutzersitzung, einschließlich der Anwendungen, wird containerisiert. Nach der Abmeldung wird der Container vollständig zerstört, wodurch keine Spuren der Sitzung auf dem virtuellen Client zurückbleiben. Dies wird mit einer erzwungenen täglichen Neuanmeldung kombiniert, um sicherzustellen, dass jeder Benutzer jeden Tag mit einer sauberen, neu bereitgestellten Umgebung beginnt."
                      },
                      {
                        "name": "guidance",
                        "value": "Anwendungs-Virtualisierungs- oder Layering-Technologien (z. B. VMware App Volumes, Citrix App Layering) werden verwendet, um Anwendungen zur Laufzeit dynamisch an einen Basis-Client anzuhängen, ohne sie zu installieren. Nach der Abmeldung werden diese Anwendungs-Layer wieder entfernt und die Basis-VM zurückgesetzt. Sitzungszeitlimits in der VDI-Richtlinie erzwingen die tägliche Abmeldung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer untersucht die Konfiguration der Anwendungs-Layering-Lösung und die Zuweisungsregeln. Es wird verifiziert, dass die Basis-VMs keine installierten Anwendungen enthalten. Die Konfiguration der Sitzungszeitlimits wird kontrolliert. Es wird geprüft, ob die Protokolle die Zerstörung und Neuerstellung der Sitzungs-Container nach jeder Abmeldung bestätigen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "f6fdb60e-9b8b-4735-8892-3c1eb455cbc3",
                "control-id": "KONF.11.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.2.6.a8-m3",
                    "uuid": "ced39917-d8d0-46d4-ba5f-b4046bb93573",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine automatische Anmeldung an der VDI SOLLTE nicht möglich sein. Die Authentisierung SOLLTE nur erfolgen, nachdem die Benutzenden mit der VDI interagiert haben."
                      },
                      {
                        "name": "guidance",
                        "value": "Funktionen wie 'Pass-Through-Authentifizierung' vom Endgerät oder das Speichern von Anmeldeinformationen im VDI-Client werden deaktiviert. Der Benutzer muss bei jeder neuen Verbindung zum VDI-Gateway aktiv seine Anmeldeinformationen (z. B. Benutzername und Passwort) eingeben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Konfiguration des VDI-Gateways und der VDI-Client-Richtlinien. Es wird verifiziert, dass Optionen für die automatische Anmeldung oder das Speichern von Passwörtern deaktiviert sind. Testweise wird versucht, eine Sitzung zu starten, um zu bestätigen, dass eine manuelle Interaktion zur Authentisierung erforderlich ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a8-m4",
                    "uuid": "66336854-b205-4194-baf3-3200a6b7ab2e",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die VDI-Lösung ist so konfiguriert, dass für jede neue Sitzung eine erneute Authentifizierung erforderlich ist, selbst wenn der Benutzer bereits an seinem Endgerät angemeldet ist und eine gültige Single-Sign-On-Sitzung hat. Single-Sign-On wird nur so konfiguriert, dass der Benutzername vorausgefüllt wird, aber das Passwort oder ein zweiter Faktor aktiv eingegeben werden muss."
                      },
                      {
                        "name": "guidance",
                        "value": "In den Richtlinien des VDI-Gateways wird die Anforderung zur erneuten Authentifizierung erzwungen. Die Lebensdauer von Authentifizierungs-Tokens für die VDI-Sitzung wird auf einen kurzen Zeitraum begrenzt, sodass auch bei einer erneuten Verbindung nach kurzer Inaktivität eine neue Anmeldung erforderlich ist."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Authentifizierungsrichtlinien des VDI-Systems. Es wird getestet, ob nach einer Abmeldung und sofortigen Neuanmeldung eine erneute Eingabe von Anmeldeinformationen verlangt wird. Die Konfiguration der Token-Lebensdauer wird kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a8-m5",
                    "uuid": "dd2c84b3-ef81-448a-bac4-62ac06b652de",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für jeden Anmeldeversuch am VDI-Gateway wird eine Multi-Faktor-Authentifizierung (MFA) erzwungen. Das System ist zusätzlich gegen Angriffe wie Session Hijacking und Replay-Angriffe gehärtet, beispielsweise durch die Verwendung von kryptografisch gebundenen Tokens."
                      },
                      {
                        "name": "guidance",
                        "value": "Das VDI-Gateway ist mit einem modernen Identity Provider (z. B. Azure AD Conditional Access, Okta) integriert, der adaptive MFA erzwingt. Für die Sitzungsverwaltung werden Protokolle wie OpenID Connect mit Proof Key for Code Exchange (PKCE) verwendet, um Replay-Angriffe zu verhindern. Die Sitzungstoken werden an die IP-Adresse des Clients gebunden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die MFA-Konfiguration im Identity Provider und dessen Anbindung an das VDI-Gateway. Es wird geprüft, ob MFA für alle Benutzergruppen erzwungen wird. Die Konfiguration des Sitzungsmanagements wird auf den Einsatz moderner, sicherer Protokolle und Mechanismen wie Token Binding überprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "3a89477e-0a5f-45f6-8a27-6d3c5fd7382e",
                "control-id": "KONF.15.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.2.6.a12-m3",
                    "uuid": "28b42825-9ee0-49c6-8ef4-529e1077a99a",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Pro Virtualisierungsserver SOLLTE die maximale Leistung festgelegt werden, die dieser für virtuelle Clients zur Verfügung stellen darf. Diese Grenzwerte SOLLTEN in der VDI-Managementkomponente genutzt werden, um bei hoher Auslastung die virtuellen Clients auf verschiedene Virtualisierungsserver zu verteilen."
                      },
                      {
                        "name": "guidance",
                        "value": "In der VDI-Managementkonsole werden für jeden Host oder Cluster maximale Werte für die Anzahl der VMs, die CPU- oder die Speicherauslastung festgelegt. Diese Schwellenwerte basieren auf der Kapazitätsplanung und verhindern eine übermäßige Überbuchung der Ressourcen. Die VDI-Lösung verwendet diese Grenzwerte, um neue VMs auf dem am wenigsten ausgelasteten Host zu platzieren und so eine grundlegende Lastverteilung zu gewährleisten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert in der VDI-Managementkonsole, ob Grenzwerte für die Host-Auslastung oder die Anzahl der VMs pro Host definiert sind. Es wird geprüft, ob diese Werte mit der Kapazitätsplanung übereinstimmen und ob die Lastverteilungsfunktion aktiviert ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a12-m4",
                    "uuid": "af5493d1-fb78-4468-9a1c-14e96b87ee55",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Lastverteilungsmechanismus wird basierend auf historischen Leistungsdaten feinjustiert. Bei Platzierungsentscheidungen werden nicht nur CPU und RAM, sondern auch weitere Metriken wie Storage-I/O und Netzwerkbandbreite berücksichtigt, um eine ausgewogenere Verteilung und bessere Performance zu erzielen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die VDI-Lösung oder ein integriertes Tool der Virtualisierungsplattform (z. B. VMware DRS) wird so konfiguriert, dass es bei seinen Entscheidungen auch die Auslastung der Datastores und der Netzwerkadapter berücksichtigt. Die Gewichtung der verschiedenen Metriken wird so angepasst, dass sie den spezifischen Anforderungen der Workloads entspricht (z. B. höhere Gewichtung von I/O für datenbankintensive Anwendungen)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer untersucht die erweiterte Konfiguration des Lastverteilungsmechanismus. Es wird verifiziert, dass Metriken über CPU/RAM hinaus (wie Storage I/O und Netzwerk) in die Entscheidungsfindung einbezogen werden. Die Konfiguration wird auf Plausibilität und Dokumentation geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a12-m5",
                    "uuid": "d8b687db-9073-49f1-bb9e-12b9fe181157",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein vollständig automatisierter, richtliniengesteuerter Ressourcenplaner (Scheduler) wird verwendet. Dieser migriert virtuelle Clients in Echtzeit dynamisch zwischen den Hosts, um die Leistung zu optimieren und die Servicequalität für alle Benutzer gemäß vordefinierten Service Level Agreements (SLAs) sicherzustellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein fortschrittliches Ressourcenmanagement-Tool (z. B. VMware vRealize Operations, Turbonomic) ist mit der VDI- und Virtualisierungsplattform integriert. Es analysiert kontinuierlich die Auslastung und prognostiziert Engpässe. Basierend auf definierten SLAs (z. B. 'Finanzanwendungen müssen eine Latenz von <5ms haben') führt es proaktiv Live-Migrationen von VMs durch, um Leistungsabfälle zu verhindern, bevor sie auftreten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration des automatisierten Ressourcenplaners. Es wird kontrolliert, ob SLAs für verschiedene Anwendungskategorien definiert sind. Die Protokolle des Tools werden eingesehen, um die durchgeführten Optimierungsaktionen (z. B. Live-Migrationen) und deren Begründung nachzuvollziehen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "a2dee746-c955-41da-bd0e-a541a064fbb5",
                "control-id": "KONF.6.16",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.2.6.a4-m1",
                    "uuid": "e3c17a70-b315-4667-b176-4151708277f0",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle VDI-Komponenten (Management, Broker, Gateways) und die virtuellen Clients befinden sich in einem einzigen, großen Netzwerksegment. Es gibt keine interne Segmentierung."
                      },
                      {
                        "name": "guidance",
                        "value": "In einer schnellen oder initialen Bereitstellung werden oft alle Systeme in einem vorhandenen Server-VLAN platziert, um die Komplexität der Netzwerkkonfiguration zu minimieren. Dies ermöglicht uneingeschränkte Kommunikation zwischen allen Komponenten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die IP-Konfiguration der VDI-Komponenten und einiger Beispiel-Clients. Es wird festgestellt, ob sich alle Systeme im selben Subnetz befinden und ob es zwischen ihnen Firewall-Regeln gibt."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a4-m2",
                    "uuid": "a4515dd9-5930-4472-af3f-1c5e818a133c",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Trennung ist vorhanden, indem das VDI-Verwaltungsnetz vom allgemeinen Benutzernetz getrennt wird. Die virtuellen Clients selbst sind jedoch nicht weiter voneinander segmentiert und befinden sich in einem gemeinsamen Netz."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein separates VLAN für die Management-Interfaces der VDI-Server eingerichtet. Die virtuellen Clients werden in einem oder mehreren größeren VLANs platziert, die von den Management-Komponenten getrennt sind, aber keine weitere Unterteilung nach Risikostufen oder Benutzergruppen aufweisen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Netzwerkarchitektur-Dokumentation. Es wird geprüft, ob separate VLANs für Management und virtuelle Clients existieren. Mittels Netzwerk-Scans wird kontrolliert, ob Clients unterschiedlicher Benutzergruppen sich gegenseitig im Netzwerk erreichen können."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a4-m3",
                    "uuid": "4e97506f-1353-458a-b0d8-1466799ca0fb",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die VDI-Komponenten inklusive der virtuellen Clients SOLLTEN bei der Netzsegmentierung gesondert berücksichtigt werden. Netze SOLLTEN dabei mindestens mit Hilfe der Virtualisierungsinfrastruktur getrennt werden. Dedizierte Netzsegmente SOLLTEN mindestens für das Administrationsnetz der VDI-Komponenten und für die Netze der internen Kommunikation zwischen VDI-Komponenten eingerichtet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Netzwerkarchitektur sieht separate virtuelle Switche oder Portgruppen für verschiedene Zonen vor: ein Administrationsnetz für den Zugriff auf die Managementkonsolen, ein internes Kommunikationsnetz für den Datenaustausch zwischen den VDI-Komponenten (z. B. Datenbankzugriffe) und ein oder mehrere Netze für die virtuellen Clients. Der Datenverkehr zwischen diesen Segmenten wird durch eine Firewall kontrolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Konfiguration der virtuellen Netzwerk-Infrastruktur im Hypervisor. Es wird verifiziert, ob dedizierte Netzsegmente für Administration, interne Kommunikation und Client-Verkehr existieren. Die Firewall-Regeln zwischen diesen Segmenten werden auf Korrektheit und das Prinzip der geringsten Rechte geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a4-m4",
                    "uuid": "8cdbd4ab-ec4c-423f-9313-82f8d4649863",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird Mikrosegmentierung eingesetzt, um unterschiedliche Gruppen von virtuellen Clients basierend auf ihrem Sicherheitsprofil oder ihrer Benutzergruppe (z. B. Personalabteilung, Entwicklung, externe Partner) in eigene Netzwerkzonen zu trennen. Die Firewall-Regeln zwischen diesen Zonen folgen strikt dem Prinzip der geringsten Rechte (Least Privilege)."
                      },
                      {
                        "name": "guidance",
                        "value": "Technologien wie VMware NSX oder Windows Defender Firewall mit Advanced Security werden verwendet, um dynamisch Sicherheitsgruppen für virtuelle Clients zu erstellen. Die Regeln erlauben beispielsweise nur die Kommunikation von Entwickler-Clients mit den Entwicklungsservern und blockieren jeglichen direkten Kontakt zu Clients der Personalabteilung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der Mikrosegmentierungslösung. Es wird geprüft, ob die Segmentierung auf logischen Gruppen basiert und ob die Firewall-Regeln den definierten Kommunikationsbeziehungen entsprechen. Testweise wird versucht, eine unerlaubte Verbindung zwischen Clients verschiedener Segmente aufzubauen. Ein Auditor kann die effektiven Firewall-Regeln für eine zufällige VM abfragen: `Get-VMNetworkPolicy -VMName 'HR-Client-01'`."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a4-m5",
                    "uuid": "14c3a62a-7280-4087-8804-7df0f2711a39",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Zero-Trust-Netzwerkarchitektur ist implementiert. Der gesamte Netzwerkverkehr zwischen VDI-Komponenten sowie zwischen den virtuellen Clients und zu den Zielanwendungen wird standardmäßig blockiert, authentifiziert und verschlüsselt. Netzwerkrichtlinien werden dynamisch basierend auf der Identität des Benutzers, dem Zustand des Geräts und dem Kontext des Zugriffs angewendet."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Zero-Trust-Plattform (z.B. Zscaler Private Access, Appgate SDP) wird eingesetzt. Jede Verbindungsanfrage von einem virtuellen Client wird am Gateway terminiert und gegen eine Richtlinie geprüft, die Benutzeridentität (via IdP), Geräte-Compliance (via EDR) und die angefragte Anwendung berücksichtigt. Erst nach erfolgreicher Prüfung wird eine kurzlebige, verschlüsselte 1:1-Verbindung zum Ziel aufgebaut."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer untersucht die Konfiguration der Zero-Trust-Plattform. Es wird die Richtliniendefinition geprüft und verifiziert, ob der Standard-Regelsatz 'Deny All' ist. Die Integration mit dem Identity Provider und der Endpoint-Security-Lösung wird kontrolliert. Es wird geprüft, ob der gesamte Datenverkehr verschlüsselt wird und ob die Protokollierung eine lückenlose Nachverfolgung aller Verbindungsversuche ermöglicht."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "71ec3b53-8bb6-4db6-a04e-879116a6229d",
                "control-id": "KONF.6.6.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Treatment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.2.6.a13-m3",
                    "uuid": "ce404501-ee63-4dee-a917-68ceb0d8348b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE geprüft werden, ob es Benutzendengruppen gibt, die sich in ihren Berechtigungen so stark unterscheiden, dass die Nutzung einer gemeinsamen VDI-Lösung nicht sinnvoll ist. In diesem Fall SOLLTE jeweils eine eigene VDI-Lösung pro Benutzendengruppe verwendet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Risikoanalyse identifiziert Benutzergruppen mit stark abweichenden Sicherheitsanforderungen, z. B. Standard-Büroanwender, privilegierte Administratoren und externe Entwickler. Basierend auf dieser Analyse wird die Entscheidung getroffen, für diese Gruppen separate VDI-Umgebungen (d. h. getrennte Sets von Brokern, Gateways, Datenbanken) aufzubauen, um eine logische Trennung zu gewährleisten und das Risiko einer Ausweitung von Kompromittierungen zu minimieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Risikoanalyse an und prüft, ob die Identifizierung von Benutzergruppen mit unterschiedlichen Schutzbedarfen stattgefunden hat. Es wird verifiziert, ob die dokumentierte Architektur separate VDI-Instanzen für diese Gruppen vorsieht. Die Konfiguration wird überprüft, um sicherzustellen, dass die Benutzer korrekt den jeweiligen VDI-Lösungen zugeordnet sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a13-m4",
                    "uuid": "ab5a60f8-778f-490a-bf77-374352d4b9b2",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die separaten VDI-Umgebungen werden in vollständig isolierten Netzwerksegmenten bereitgestellt und von unterschiedlichen Administratorenteams verwaltet, um eine strikte Funktionstrennung (Separation of Duties) durchzusetzen."
                      },
                      {
                        "name": "guidance",
                        "value": "Jede VDI-Instanz hat ihre eigenen, dedizierten VLANs für Management, interne Kommunikation und Client-Zugriff. Der Netzwerkverkehr zwischen den VDI-Instanzen ist vollständig blockiert. Die administrativen Aufgaben für die hochsichere VDI-Umgebung (z. B. für Administratoren) werden von einem anderen Team wahrgenommen als die der Standard-VDI-Umgebung, was durch unterschiedliche Berechtigungen im Active Directory und auf den Systemen umgesetzt wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer untersucht die Netzwerkarchitektur und die Firewall-Regeln, um die vollständige Isolation der VDI-Instanzen zu verifizieren. Die administrativen Berechtigungen werden kontrolliert, um die Umsetzung der Funktionstrennung zu bestätigen. Es wird geprüft, ob unterschiedliche Administratorenkonten für die Verwaltung der verschiedenen Umgebungen verwendet werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a13-m5",
                    "uuid": "12fb9eae-6cca-4774-9c16-4dc9d7cae821",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die separaten VDI-Lösungen sind physisch getrennt (Air-Gapped) oder verwenden hardware-erzwungene Trennungsmechanismen (z. B. separate Hypervisor-Cluster, Storage-Systeme und Netzwerk-Hardware), um die höchstmögliche Sicherheitsgarantie zu bieten."
                      },
                      {
                        "name": "guidance",
                        "value": "Die VDI-Umgebung für hochprivilegierte Benutzer läuft auf einem komplett eigenen Satz physischer Server, die in einem separaten, hochsicheren Bereich des Rechenzentrums stehen. Es gibt keine gemeinsamen Infrastrukturkomponenten (kein gemeinsamer Hypervisor, kein gemeinsames Storage-Array, keine gemeinsame Netzwerk-Core-Switch) mit der Standard-VDI-Umgebung. Der Zugriff erfolgt über eine separate, dedizierte Zugriffslösung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die physische Trennung der Hardware durch Einsichtnahme in die RZ-Dokumentation und Rack-Pläne. Die Inventarlisten der Hardware werden geprüft, um sicherzustellen, dass keine Komponenten zwischen den Umgebungen geteilt werden. Netzwerkdiagramme werden analysiert, um die physische Trennung der Kommunikationswege zu bestätigen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "18ac979c-7c6d-4a70-9194-e85538176868",
                "control-id": "KONF.6.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.2.6.a5-m3",
                    "uuid": "a7541805-4b11-4222-bfa5-a841e68c6d4e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Mechanismen und Dienste der VDI-Lösung SOLLTEN genutzt werden, um die Zugriffe auf die virtuellen Clients zu steuern und abzusichern. Falls eine zusätzliche Software für diese Zugriffe auf den zugreifenden Clients eingesetzt wird, SOLLTE diese Software standardisiert und zentralisiert bereitgestellt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Zugriff auf die virtuellen Desktops erfolgt ausschließlich über das vom VDI-Hersteller bereitgestellte Gateway und die zugehörige Client-Software. Die Client-Software wird über ein zentrales Softwareverteilungssystem an die Endgeräte der Benutzer verteilt. Direkte RDP- oder SSH-Verbindungen zu den virtuellen Clients werden auf Netzwerkebene blockiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass der Zugriff auf die VDI-Umgebung über einen definierten Zugriffspunkt (Gateway) erfolgt. Es wird geprüft, ob die Client-Software zentral bereitgestellt und verwaltet wird. Firewall-Regeln werden kontrolliert, um sicherzustellen, dass direkte Verbindungen zu den virtuellen Clients unterbunden sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a5-m4",
                    "uuid": "77f8de98-6ea5-4a45-8a53-1b9f0032e4a3",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Verwendung des standardisierten VDI-Clients ist obligatorisch und wird technisch erzwungen. Seine Konfiguration wird zentral über Gruppenrichtlinien oder eine Endpoint-Management-Lösung verwaltet, um konsistente Sicherheitseinstellungen (z.B. Deaktivierung der Zwischenablage, keine Laufwerks- oder USB-Umleitung) auf allen Endgeräten sicherzustellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Gruppenrichtlinien (GPOs) oder Richtlinien in einer UEM-Lösung (Unified Endpoint Management) wie Intune oder Workspace ONE verwendet, um die Konfiguration der VDI-Client-Software vorzugeben. Benutzer können diese sicherheitsrelevanten Einstellungen nicht ändern. Je nach Benutzergruppe können unterschiedliche Richtlinien zur Anwendung kommen (z.B. Entwickler dürfen die Zwischenablage nutzen, Sachbearbeiter nicht)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die konfigurierten Gruppenrichtlinien oder UEM-Richtlinien für den VDI-Client. Auf einem Beispiel-Client wird verifiziert, dass die Einstellungen korrekt angewendet wurden und vom Benutzer nicht geändert werden können. Es wird geprüft, ob die Richtlinien dokumentiert und nach dem Prinzip der geringsten Rechte konzipiert sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a5-m5",
                    "uuid": "7b753b18-9598-49a6-a169-940d12886df4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zugriff wird über ein sicheres Gateway gesteuert, das vor dem Verbindungsaufbau eine Multi-Faktor-Authentifizierung (MFA) und eine Überprüfung des Gerätezustands (Device Posture Check) erzwingt. Die VDI-Client-Software selbst wird auf dem Endgerät in einer containerisierten oder gehärteten, schreibgeschützten Umgebung ausgeführt, um Angriffe auf den Client zu verhindern."
                      },
                      {
                        "name": "guidance",
                        "value": "Das VDI-Gateway ist mit einem Identity Provider (z.B. Azure AD, Okta) für MFA und einer Endpoint-Security-Lösung (z.B. CrowdStrike, Microsoft Defender for Endpoint) für Posture-Checks integriert. Ein Zugriff wird nur gewährt, wenn der Benutzer MFA bereitstellt UND das Endgerät als konform (z.B. Antivirus aktuell, Festplattenverschlüsselung aktiv) gemeldet wird. Die Client-Software wird als App-V-Paket oder in einem Docker-Container auf dem Endgerät bereitgestellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration des VDI-Gateways und dessen Integration mit dem IdP und der Endpoint-Security-Lösung. Es wird testweise versucht, eine Verbindung mit einem nicht-konformen Gerät oder ohne MFA herzustellen. Es wird geprüft, wie die VDI-Client-Software auf den Endgeräten isoliert wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "7ee62c24-acce-4f94-9bde-5877015aefda",
                "control-id": "KONF.8.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "TEST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "sys.2.6.a9-m3",
                    "uuid": "232cf6a5-0f52-44e6-82be-12782973d3de",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die virtuellen Clients SOLLTEN, wenn möglich, zentral über die Managementkomponenten der VDI-Lösung verwaltet werden. Die virtuellen Clients SOLLTEN auch im ausgeschalteten Zustand gepatcht werden, falls dies von der VDI-Lösung unterstützt wird. Die Templates, aus denen virtuelle Clients erzeugt werden, SOLLTEN regelmäßig aktualisiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein definierter Prozess für das Patch-Management von VDI-Clients ist etabliert. Dieser Prozess beinhaltet die regelmäßige (z.B. monatliche) Aktualisierung der Master-Images/Templates. Für persistente Clients wird ein herkömmliches Patch-Management-Tool verwendet. Falls die VDI-Lösung das Patchen von ausgeschalteten VMs unterstützt, wird diese Funktion genutzt, um sicherzustellen, dass auch selten genutzte Clients aktuell bleiben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert den Patch-Management-Prozess für VDI-Clients. Es wird das Datum der letzten Aktualisierung der Master-Templates verifiziert. Stichprobenartig wird der Patch-Stand von laufenden und ausgeschalteten virtuellen Clients überprüft. Es wird geprüft, ob die Funktion zum Patchen im ausgeschalteten Zustand konfiguriert ist, falls verfügbar."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a9-m4",
                    "uuid": "108b9399-5014-4cad-8ef5-c3e5fa7d1713",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Patch-Prozess ist weitgehend automatisiert. Die Veröffentlichung neuer Sicherheitspatches durch Hersteller löst einen automatisierten Workflow aus, der das Master-Template aktualisiert, eine Test-VM zur Validierung erstellt und nach erfolgreichem Test einen gestaffelten Rollout des aktualisierten Images an die virtuellen Client-Pools durchführt."
                      },
                      {
                        "name": "guidance",
                        "value": "Automatisierungsskripte (z. B. PowerShell, Ansible) überwachen Patch-Quellen. Bei neuen Patches wird das Master-Image automatisch gestartet, gepatcht, heruntergefahren und ein neuer Snapshot erstellt. Anschließend wird eine Testgruppe von Clients mit dem neuen Image aktualisiert. Wenn keine Probleme auftreten, wird das Image schrittweise für alle Benutzer ausgerollt (z. B. zuerst IT, dann Pilotgruppen, dann alle)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer untersucht den automatisierten Patch-Workflow. Es wird die Konfiguration der Automatisierungsskripte und die Definition der Rollout-Gruppen geprüft. Die Protokolle des Workflows werden eingesehen, um die erfolgreiche Durchführung der letzten Patch-Zyklen zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "sys.2.6.a9-m5",
                    "uuid": "0ec303a6-ce28-45a5-88c2-563afbee330e",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für nicht-persistente Desktops wird eine regelmäßige (z. B. tägliche) Abmeldung der Benutzer erzwungen, um sicherzustellen, dass sie bei der nächsten Anmeldung einen frischen, vollständig gepatchten Client aus dem neuesten Template erhalten. Für persistente Desktops wird die Patch-Konformität kontinuierlich überwacht, und nicht-konforme Systeme werden automatisch aus dem produktiven Netz isoliert (Quarantäne), bis sie gepatcht sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Sitzungszeitlimits in der VDI-Lösung erzwingen eine tägliche Neuanmeldung. Die Patch-Management-Lösung ist mit dem Network Access Control (NAC)-System integriert. Meldet ein Client einen veralteten Patch-Stand, wird er vom NAC-System automatisch in ein Quarantäne-VLAN verschoben, wo er nur noch den Patch-Server erreichen kann. Nach erfolgreicher Aktualisierung wird der Zugriff wieder freigegeben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration der Sitzungszeitlimits. Es wird die Integration zwischen Patch-Management und NAC-System geprüft. Testweise wird ein Client mit einem veralteten Patch-Stand simuliert, um zu beobachten, ob die Quarantäne-Funktion korrekt ausgelöst wird. Ein Auditor kann den Status eines Clients abfragen: `Get-ClientComplianceState -ClientName 'Sales-Client-02'`."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}