{
  "component-definition": {
    "uuid": "106f096c-d03a-4aba-8c23-ee61e3e7b986",
    "metadata": {
      "title": "APP.1.2 Webbrowser - Benutzerdefiniert",
      "last-modified": "2025-11-14T19:05:31.320400+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "eb6f28cc-91b5-4f3e-b201-a10c1109df24",
        "type": "software",
        "title": "APP.1.2 Webbrowser",
        "description": "This component represents the implementation of all controls for Baustein APP.1.2.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Webbrowser sind Anwendungsprogramme, die (Hypertext-) Dokumente, Bilder, Video-, Audio- und andere Datenformate aus dem Internet abrufen, verarbeiten, darstellen, ausgeben und auf lokalen IT-Systemen speichern können. Ebenso können Webbrowser auch Daten ins Internet übertragen.<BR>Stationäre und mobile Clients sind heute ohne Webbrowser nicht vorstellbar, weil sehr viele private und geschäftliche Anwendungen entsprechende Inhalte nutzen. Gleichzeitig werden diese Inhalte im Internet immer vielfältiger. Die meisten Webseiten nutzen eingebettete Videos, animierte Elemente und andere aktive Inhalte. Moderne Webbrowser decken zudem eine große Bandbreite an Zusatzfunktionen ab, indem sie Plug-ins und externe Bibliotheken einbinden. Hinzu kommen Erweiterungen für bestimmte Funktionen, Datenformate und Inhalte. Die Komplexität moderner Webbrowser bietet ein hohes Potenzial für gravierende konzeptionelle Fehler und programmtechnische Schwachstellen. Sie erhöht nicht nur die möglichen Gefahren für Angriffe aus dem Internet, sondern birgt zusätzliche Risiken durch Programmier- und Bedienungsfehler.<BR>Die Risiken für die Vertraulichkeit und Integrität von Daten sind erheblich. Ebenso ist die Verfügbarkeit des gesamten IT-Systems durch solche Schwachstellen bedroht. Internetinhalte müssen demzufolge aus Sicht des Webbrowsers grundsätzlich als nicht vertrauenswürdig angesehen werden."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es, Sicherheitsanforderungen für Webbrowser, die auf Clients, also auf stationären und mobilen IT-Systemen sowie auch auf Tablets und Smartphones, eingesetzt werden, zu beschreiben."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein APP.1.2 Webbrowser ist auf jeden Webbrowser einmal anzuwenden.<BR>Er enthält grundsätzliche Sicherheitsanforderungen, die bei der Installation und dem Betrieb von Webbrowsern für den Zugriff auf Daten aus dem Internet zu beachten und zu erfüllen sind.<BR>Webbrowser sind eine der am häufigsten genutzten Anwendungen. Sie greifen auf ungeprüfte, potentiell schädliche Daten im Internet zu und stellen damit ein Einfallstor für Angriffe dar, oft mit dem Ziel, sich weiter auf das Betriebssystem auszubreiten. Um die Betriebssysteme abzusichern, sollten daher die Anforderungen der Bausteine der Schichten SYS.2 Desktop-Systeme und SYS.3.2 Tablet und Smartphone erfüllt werden.<BR>Mit Browsern genutzte Webanwendungen sowie zuständige Server werden in den Bausteinen APP.3.1 Webanwendungen und Webservices und APP.3.2 Webserver behandelt.<BR>Allgemeine Anforderungen an den sicheren Einsatz von Software sind in diesem Baustein nicht enthalten. Sie sind im Baustein APP.6 Allgemeine Software zu finden, der zusätzlich zu diesem Baustein anzuwenden ist."
          },
          {
            "name": "2.1. Ausführung von Schadcode durch Webbrowser",
            "value": "Webbrowser laden regelmäßig Daten aus nicht vertrauenswürdigen Quellen. Solche Daten können ausführbaren Schadcode enthalten, der Schwachstellen ausnutzen kann und das IT-System der Benutzenden ohne deren Kenntnis infiziert.<BR>Dabei kann es sich um Code handeln, der durch den Webbrowser direkt ausgeführt werden kann, wie etwa JavaScript oder WebAssembly. Ebenso kann es auch ausführbarer Code eines Plug-ins oder einer Erweiterung im Kontext des Browsers sein, wie etwa Java oder Bestandteile von PDF-Dokumenten. Schließlich kann es sich auch um Code handeln, der vom Webbrowser auf den Client geladen und dort außerhalb des Browser-Prozesses ausgeführt wird. Werden die grundlegenden Schutzmechanismen moderner Webbrowser nicht ausreichend angewendet, werden die Vertraulichkeit, Integrität oder Verfügbarkeit von Informationen oder Diensten des Clients oder möglicherweise sogar der mit ihm verbundenen Netze bedroht."
          },
          {
            "name": "2.2. Exploit Kits",
            "value": "Schwachstellenlisten und sogenannte Exploit Kits erleichtern die Entwicklung individueller Schadsoftware erheblich. Cyberangriffe können automatisiert werden, um Drive-by-Downloads oder andere Verbreitungswege leicht und ohne Expertenwissen zu nutzen. Angreifende können ihnen bekannte Schwachstellen der Webbrowser, der verbundenen Ressourcen oder Erweiterungen ausnutzen, um Folgeangriffe vorzubereiten oder Code mit Schadfunktion auf den Clients zu laden und zu installieren. Oft wird durch den so auf den Clients geladenen Schadcode weitere Schadsoftware nachgeladen, die dann auf den Clients mit den Rechten der Benutzenden ausgeführt wird."
          },
          {
            "name": "2.3. Mitlesen der Internetkommunikation",
            "value": "Die grundlegende Sicherheit der Kommunikation im Internet hängt wesentlich vom eingesetzten Authentisierungsverfahren und von der Verschlüsselung der Daten auf dem Transportweg ab.<BR>Fehlerhafte Implementierungen der entsprechenden Verfahren sind möglich und verhindern eine wirkungsvolle Authentisierung und Verschlüsselung. Viele Webdienste bieten außerdem immer noch veraltete Verschlüsselungsverfahren an. Somit kann bei einem Angriff die Authentisierung von Servern unterlaufen werden oder die Kommunikation bzw. die Daten werden nicht wirkungsvoll verschlüsselt. Hierdurch können Informationen auf dem Übertragungsweg mitgelesen oder verändert werden. In der Vergangenheit wurden außerdem Zertifizierungsstellen kompromittiert. Angreifende könnten so an Zertifikate für fremde Websites gelangen."
          },
          {
            "name": "2.4. Integritätsverlust in Webbrowsern",
            "value": "Werden Webbrowser, Plug-ins oder Erweiterungen aus nicht vertrauenswürdigen Quellen bezogen, können unabsichtlich und unbemerkt Schadfunktionen ausgeführt werden. Angreifende können beispielsweise Browserkomponenten wie Toolbars fälschen, um die Benutzenden auf manipulierte Kopien von Webseiten zu locken, mit deren Hilfe Phishing-Angriffe durchgeführt werden. Bösartige Erweiterungen können Inhalte der betrachteten Webseiten manipulieren oder Daten ausspionieren und an die Angreifenden senden."
          },
          {
            "name": "2.5. Verlust der Privatsphäre",
            "value": "Werden Webbrowser unsicher konfiguriert, können vertrauenswürdige Daten zufällig oder böswillig unbefugten Dritten zugänglich gemacht werden. Auch Passwörter können ungewollt weitergegeben werden. Werden Cookies, Passwörter, Historien, Eingabedaten und Suchanfragen gespeichert oder unnötige Erweiterungen aktiviert, können Daten von Dritten oder von Schadprogrammen leichter missbräuchlich ausgelesen werden."
          }
        ],
        "control-implementations": [
          {
            "uuid": "898397e9-3a88-4e5b-8896-0d148efdeded",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Kompendien/Grundschutz++-Kompendium/profile/webbrowser_profile.json",
            "description": "Implementation for all controls in Baustein APP.1.2",
            "implemented-requirements": [
              {
                "uuid": "e802b711-82b1-4119-b138-04cf74e26f76",
                "control-id": "KONF.10.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.1.2.a13-m1",
                    "uuid": "0b2a1c48-8599-4e1f-b840-1971655cce9c",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die DNS-over-HTTPS (DoH)-Einstellung wird den Standardeinstellungen des Browsers überlassen. Dies führt dazu, dass Browser möglicherweise ohne Wissen der IT DoH aktivieren und öffentliche Resolver verwenden, wodurch interne DNS-Richtlinien und -Filter umgangen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt keine bewusste Entscheidung oder Konfiguration bezüglich DoH. Die IT-Abteilung ist sich der Funktion und ihrer Auswirkungen möglicherweise nicht bewusst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Standardeinstellungen für DoH in den verwendeten Browserversionen. Auf einem Client wird der Netzwerkverkehr analysiert, um festzustellen, ob DNS-Anfragen an den vom Betriebssystem konfigurierten DNS-Server oder an einen öffentlichen DoH-Resolver des Browserherstellers gesendet werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a13-m2",
                    "uuid": "1d649ff2-29bf-4d52-9fa6-0bc7cf6c9271",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wurde eine Entscheidung über die Nutzung von DoH getroffen, diese wird aber nicht technisch durchgesetzt. Die IT empfiehlt den Benutzern, DoH manuell zu deaktivieren, um die Verwendung des internen DNS-Resolvers sicherzustellen, aber es gibt keine Garantie für die Einhaltung."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Anleitung zur Deaktivierung von DoH wird im Intranet veröffentlicht. Die Umsetzung bleibt jedoch dem einzelnen Benutzer überlassen, was zu einer inkonsistenten Konfiguration in der gesamten Organisation führt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor befragt Benutzer und prüft stichprobenartig Client-Systeme, um die Konfiguration der DoH-Einstellungen zu verifizieren. Es wird eine hohe Rate an Abweichungen von der empfohlenen Konfiguration festgestellt."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a13-m3",
                    "uuid": "329186d1-8827-4340-8a0d-4bce46f6bbbe",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution MUSS eine dokumentierte Entscheidung treffen, ob die verwendeten Browser DNS-over-HTTPS (DoH) verwenden sollen oder nicht. Die Browser MÜSSEN entsprechend dieser Entscheidung zentral konfiguriert werden. Falls ein interner DNS-Resolver verwendet wird, MUSS dieser auch vom Browser genutzt werden (entweder durch Deaktivierung von DoH oder durch Konfiguration des Browsers, den internen Resolver als DoH-Endpunkt zu nutzen)."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Entscheidung wird in einer Sicherheitsrichtlinie festgehalten. Die Konfiguration wird über eine zentrale Verwaltung (GPO, MDM) durchgesetzt. Wenn DoH deaktiviert wird, wird die entsprechende Richtlinie (`DnsOverHttpsMode` auf `off`) gesetzt. Wenn ein interner DoH-Resolver genutzt wird, wird dessen URI in der Richtlinie (`DnsOverHttpsTemplates`) eingetragen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die Existenz der schriftlichen Richtlinie zur DoH-Nutzung. Anschließend wird die Konfiguration in der zentralen Verwaltungskonsole verifiziert. Auf Client-Systemen wird über die Browser-Diagnoseseiten (`chrome://policy`) geprüft, ob die Richtlinie korrekt angewendet wird. Ein Netzwerk-Sniffer kann bestätigen, dass DNS-Anfragen an das korrekte Ziel (interner DNS oder interner DoH-Resolver) gesendet werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a13-m4",
                    "uuid": "abec7f7d-1979-40d2-8d2b-1058abce4a69",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zur zentralen Konfiguration werden Netzwerk-Kontrollen implementiert, um die Umgehung der DoH-Richtlinie zu verhindern. Der Netzwerk-Gateway (Firewall) wird so konfiguriert, dass er die IP-Adressen bekannter öffentlicher DoH-Resolver blockiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Liste bekannter öffentlicher DoH-Provider wird gepflegt und in die Blacklists der Firewall eingetragen. Diese Liste wird regelmäßig aktualisiert. Dies verhindert, dass auch nicht verwaltete Geräte oder Anwendungen die internen DNS-Richtlinien umgehen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die Konfiguration der Firewall-Regeln. Von einem Test-Client aus wird versucht, eine DNS-Anfrage an einen blockierten öffentlichen DoH-Resolver zu senden (z.B. mittels `curl https://chrome.cloudflare-dns.com/dns-query`). Dieser Versuch muss fehlschlagen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a13-m5",
                    "uuid": "7d47cdb0-7587-47f4-8507-7392dd664cf2",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die gesamte DNS-Infrastruktur, einschließlich des verwendeten DoH-Resolvers, ist durch DNSSEC abgesichert. Ausgehender Netzwerkverkehr wird aktiv auf DoH-Anfragen zu nicht autorisierten Endpunkten überwacht (z.B. durch Analyse von SNI-Headern in TLS-Verbindungen). Verdächtige Aktivitäten lösen einen Alarm aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Der interne DNS-Server (oder DoH-Resolver) ist so konfiguriert, dass er DNSSEC-Signaturen validiert. Ein Intrusion Detection System (IDS) oder eine Next-Generation Firewall (NGFW) wird mit Regeln zur Erkennung von DoH-Verkehr zu nicht genehmigten Zielen ausgestattet. Diese Regeln können auf IP-Listen, aber auch auf Mustern im TLS-Handshake basieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die DNSSEC-Konfiguration des internen Resolvers. Die Regeln und Alarme im IDS/NGFW-System werden eingesehen. Es wird ein Testfall durchgeführt, bei dem ein Client versucht, eine DoH-Verbindung zu einem unbekannten, nicht blockierten Resolver aufzubauen. Dieser Versuch muss vom Überwachungssystem erkannt und gemeldet werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "711cac00-7191-4cc2-b40c-fe1de94a2856",
                "control-id": "KONF.12.1.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.1.2.a3-m1",
                    "uuid": "f23b98bd-ef7b-4c50-bb92-e1965e29a503",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webbrowser führt eine grundlegende Zertifikatsprüfung durch, aber Benutzer können Warnungen vor ungültigen, abgelaufenen oder selbstsignierten Zertifikaten einfach ignorieren und die Verbindung fortsetzen. Der Trust Store des Browsers oder des Betriebssystems wird nicht aktiv verwaltet."
                      },
                      {
                        "name": "guidance",
                        "value": "Dieser Zustand ist typisch für unmanaged Umgebungen. Es gibt keine Richtlinien, die das Hinzufügen von Ausnahmen für Zertifikatsfehler verhindern. Benutzer werden nicht darin geschult, die Bedeutung von Zertifikatswarnungen zu verstehen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor navigiert zu einer Webseite mit einem ungültigen Zertifikat (z.B. expired.badssl.com) und stellt fest, wie einfach es ist, die Warnung zu umgehen und auf die Seite zuzugreifen. Es wird geprüft, ob Benutzer ohne Administratorrechte eigene Root-Zertifikate zum Trust Store hinzufügen können."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a3-m2",
                    "uuid": "ff0e7a83-5e61-4f16-a3ad-dfb2d763926a",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webbrowser führt eine vollständige Prüfung der Zertifikatsgültigkeit (Gültigkeitszeitraum, Signaturkette) durch. Bei Fehlern wird eine deutliche Warnung angezeigt. Die Prüfung des Sperrstatus (Revocation) wird jedoch nicht zuverlässig durchgeführt oder ist nicht erzwungen."
                      },
                      {
                        "name": "guidance",
                        "value": "Moderne Browser führen standardmäßig eine gute Validierung durch. Das Problem in diesem Reifegrad ist oft, dass die Online-Sperrprüfung (OCSP) aus Performance-Gründen als 'Soft-Fail' implementiert ist, d.h., wenn der OCSP-Responder nicht erreichbar ist, wird das Zertifikat als gültig behandelt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft, ob der Browser Zertifikate mit abgelaufener Gültigkeit oder gebrochener Kette korrekt blockiert. Anschließend wird mit einer Seite mit einem zurückgerufenen Zertifikat (z.B. revoked.badssl.com) getestet. Es wird analysiert (z.B. mit Wireshark), ob eine OCSP-Abfrage stattfindet und wie der Browser reagiert, wenn der OCSP-Responder blockiert wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a3-m3",
                    "uuid": "7b46f311-a925-4216-8061-035dfe3d786d",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webbrowser MUSS die Gültigkeit der Server-Zertifikate vollständig prüfen, einschließlich des Sperrstatus (Revocation) und der gesamten Zertifikatskette. Der Trust Store (Liste der vertrauenswürdigen Wurzelzertifikate) wird durch den IT-Betrieb verwaltet und Benutzer können ihn nicht ändern. Der Browser MUSS den Benutzer eindeutig über den Verschlüsselungsstatus informieren, bei ungültigen Zertifikaten die Verbindung abbrechen und darf sie erst nach ausdrücklicher Bestätigung durch den Benutzer fortsetzen. Lokale Zertifikatssperrungen sind möglich."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Trust Store wird über zentrale Richtlinien (GPO, MDM) verwaltet. Unnötige oder nicht vertrauenswürdige Stammzertifizierungsstellen werden entfernt. Die Online-Sperrprüfung wird erzwungen (OCSP Must-Staple wird honoriert). Richtlinien verhindern das Ignorieren von Zertifikatsfehlern für externe Seiten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die zentralen Richtlinien zur Verwaltung des Trust Stores. Es wird verifiziert, dass Benutzer keine eigenen Root-CAs installieren können. Die Reaktion des Browsers auf verschiedene Arten von ungültigen Zertifikaten (abgelaufen, falscher Hostname, widerrufen) wird getestet. Es wird geprüft, ob die Verbindung wie gefordert abgebrochen wird. Automatisierte Prüfung kann durch Abfrage der relevanten Policies (`EnterpriseRoots`, `BlockUntrustedRoots`) erfolgen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a3-m4",
                    "uuid": "5a577369-ea4c-468b-8ef3-3de9a7f38eba",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zu den definierten Prüfungen wird die 'SOLLTE'-Anforderung umgesetzt: Der Webbrowser bietet dem Benutzer auf Anforderung eine einfache Möglichkeit, das verwendete Serverzertifikat und dessen Details anzuzeigen. OCSP-Stapling wird bevorzugt und, wo vom Server angeboten, für die Sperrprüfung genutzt, um die Privatsphäre und Performance zu verbessern."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden keine speziellen Konfigurationen benötigt, da moderne Browser diese Funktion bereitstellen. Wichtiger ist die Schulung der Benutzer und des Helpdesks, diese Funktion zur Fehleranalyse zu nutzen. Serverseitig wird sichergestellt, dass wichtige Webserver OCSP-Stapling anbieten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die Benutzeroberfläche des Browsers, um sicherzustellen, dass die Zertifikatsdetails leicht zugänglich sind. Mithilfe eines Netzwerk-Sniffers (wie Wireshark) wird bei einer Verbindung zu einem Testserver überprüft, ob der Browser OCSP-Stapling in seiner TLS-Handshake-Anfrage anfordert und die vom Server bereitgestellte Antwort korrekt verarbeitet."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a3-m5",
                    "uuid": "c677b649-2447-4452-a170-8023135ffc90",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Browser wird so konfiguriert, dass er OCSP Must-Staple erzwingt, wann immer dies von einem Zertifikat verlangt wird. Zusätzlich wird die Überprüfung von Certificate Transparency (CT)-Logs für alle öffentlichen Zertifikate erzwungen. Es wird ein minimaler, streng kuratierter Satz von vertrauenswürdigen Root-CAs durchgesetzt und alle anderen werden aktiv blockiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Spezifische Browser-Richtlinien zur Erzwingung von Certificate Transparency (`CertificateTransparencyEnforcementEnabled`) und zur Verwaltung der Root-CAs (`EnterpriseRoots`, `BlockUntrustedRoots`) werden auf das restriktivste Niveau gesetzt. Dies stellt sicher, dass nur Zertifikate von explizit genehmigten CAs und solche, die ordnungsgemäß in öffentlichen Logs registriert sind, akzeptiert werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die Wirksamkeit der CT-Erzwingung, indem er eine Verbindung zu einer Testseite mit einem Zertifikat herstellt, das nicht in den CT-Logs enthalten ist; die Verbindung muss fehlschlagen. Die Konfiguration des Trust Stores wird durch den Versuch, eine Verbindung zu einer Seite mit einem Zertifikat einer nicht vertrauenswürdigen CA herzustellen, überprüft. Die Konformität der Richtlinien kann automatisiert per Skript ausgelesen werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "94d4fd8c-2961-4b06-baaa-6b4e9af37893",
                "control-id": "KONF.12.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.1.2.a6-m1",
                    "uuid": "5f343450-1d85-40fc-9e58-e7c33af24fd3",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der integrierte Kennwortmanager des Webbrowsers wird verwendet, um Passwörter zu speichern, jedoch ohne die Verwendung eines Master-Kennworts. Die gespeicherten Passwörter sind auf dem System nur durch die Anmeldung am Betriebssystem geschützt."
                      },
                      {
                        "name": "guidance",
                        "value": "Benutzer aktivieren die Speicherfunktion aus Bequemlichkeit, ohne sich der Risiken bewusst zu sein. Es gibt keine organisatorische Vorgabe zur Absicherung des Passwortspeichers."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft auf einem Beispiel-Client, ob der Browser Passwörter speichert und ob auf diese ohne weitere Authentifizierung (also ohne Master-Kennwort) zugegriffen werden kann. Dies geschieht durch Aufrufen der Passwortverwaltungsseite im Browser (z.B. `chrome://settings/passwords`)."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a6-m2",
                    "uuid": "186c54dd-5421-49da-aa12-10f55162830f",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Verwendung eines Master-Kennworts wird den Benutzern empfohlen, um den Passwortspeicher des Browsers zu schützen. Die Umsetzung ist jedoch den Benutzern überlassen und wird nicht erzwungen oder überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Die IT-Abteilung kommuniziert eine Empfehlung per E-Mail oder im Intranet, aber es gibt keine technischen Maßnahmen, um die Einhaltung sicherzustellen. Die Benutzer können die Funktion weiterhin ohne Master-Kennwort nutzen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor befragt eine Auswahl von Benutzern, ob sie die Empfehlung kennen und umgesetzt haben. Eine technische Überprüfung auf Client-Systemen zeigt eine inkonsistente Nutzung des Master-Kennworts."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a6-m3",
                    "uuid": "68000885-e2bb-4351-9cdb-1c011c1e5c5e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wird ein Kennwortmanager im Webbrowser verwendet, MUSS er eine direkte und eindeutige Beziehung zwischen Webseite (Origin) und dem hierfür gespeicherten Kennwort herstellen. Der Kennwortspeicher MUSS die Passwörter verschlüsselt speichern. Es MUSS sichergestellt werden, dass auf die im Kennwortmanager gespeicherten Passwörter nur nach Eingabe eines Master-Kennworts zugegriffen werden kann. Die Authentisierung für den Zugriff ist nur für die aktuelle Sitzung gültig. Der IT-Betrieb MUSS sicherstellen, dass Benutzer gespeicherte Passwörter löschen können."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Verwendung des Master-Kennworts wird, falls technisch möglich, über eine Richtlinie erzwungen. Die Benutzer werden in der korrekten Verwendung des Kennwortmanagers geschult, einschließlich der Überprüfung des Website-Ursprungs vor der Eingabe des Master-Passworts. Die Funktionalität zum Löschen von Passwörtern wird sichergestellt und dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die Browser-Richtlinien, um festzustellen, ob die Nutzung des Master-Kennworts erzwungen wird. Es wird verifiziert, dass der Passwort-Manager Phishing-Versuche durch eine strikte Origin-Prüfung erschwert. Die Möglichkeit zum Löschen einzelner oder aller Passwörter wird getestet. Es wird geprüft, dass nach einer gewissen Inaktivität oder beim Neustart des Browsers das Master-Kennwort erneut abgefragt wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a6-m4",
                    "uuid": "a6ee05c6-09c9-4890-bc19-94961ba3b404",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Speicherung von Passwörtern im Browser ist entweder generell per Richtlinie deaktiviert oder es wird die Verwendung einer dedizierten, von der Organisation genehmigten Passwort-Manager-Erweiterung anstelle der integrierten Funktion vorgeschrieben. Die Komplexität des Master-Kennworts unterliegt den Passwortrichtlinien der Organisation."
                      },
                      {
                        "name": "guidance",
                        "value": "Durch eine zentrale Richtlinie (`PasswordManagerEnabled` auf `false`) wird die native Speicherfunktion des Browsers deaktiviert. Eine zugelassene und geprüfte Passwort-Manager-Erweiterung wird stattdessen zentral an die Browser verteilt. Diese bietet oft bessere Sicherheits- und Verwaltungsfunktionen als die integrierte Variante."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft auf den Clients, ob die integrierte Passwortverwaltung deaktiviert ist und die genehmigte Erweiterung installiert ist. Die Konfiguration der Erweiterung wird geprüft, um sicherzustellen, dass sie den organisatorischen Richtlinien (z.B. für das Master-Passwort) entspricht. Dies kann durch Auslesen der Browser-Richtlinien (`chrome://policy`) und Überprüfung der installierten Erweiterungen verifiziert werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a6-m5",
                    "uuid": "8a6d7c76-3d2d-460b-a5c6-a8ffbd3cadf9",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist ein zentral verwalteter Enterprise-Passwort-Manager im Einsatz, der als Browser-Erweiterung integriert ist. Dieser erzwingt die Passwortrichtlinien der Organisation, ermöglicht sicheres Teilen von Zugangsdaten in Teams, bietet detaillierte Audit-Logs und warnt proaktiv vor kompromittierten oder schwachen Passwörtern durch Anbindung an Breach-Datenbanken."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Enterprise-Lösung wie Bitwarden, 1Password oder KeePass mit zentraler Verwaltung wird implementiert. Die native Browserfunktion ist deaktiviert. Die Lösung wird so konfiguriert, dass sie regelmäßige Sicherheits-Audits der von den Benutzern gespeicherten Passwörter durchführt und Berichte für die IT-Sicherheit generiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Konfiguration der zentralen Verwaltungskonsole des Passwort-Managers. Es werden die Audit-Logs, die durchgesetzten Richtlinien und die Berichtsfunktionen eingesehen. Es wird verifiziert, dass ein Benutzer gewarnt wird, wenn er versucht, ein bekanntermaßen kompromittiertes Passwort zu verwenden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "fa589d0d-7a62-4bcd-8715-aab00590f4e1",
                "control-id": "KONF.12.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.1.2.a7-m1",
                    "uuid": "ecea6b09-f43b-45a8-896d-8233c3f0520e",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Benutzer sind sich der Privatsphäre-Einstellungen bewusst, verwalten diese aber nur sporadisch und inkonsistent. Einige Einstellungen wie das Blockieren von Drittanbieter-Cookies werden vielleicht vorgenommen, aber andere datenschutzrelevante Funktionen wie Browser-Synchronisation oder Telemetrie bleiben aktiv."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt keine organisatorischen Vorgaben. Das Datenschutzniveau hängt vollständig von der Initiative und dem technischen Verständnis des einzelnen Benutzers ab."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Eine stichprobenartige Überprüfung von Client-Browsern zeigt eine Vielzahl unterschiedlicher Konfigurationen. Viele Browser sind in den datenschutzrelevanten Einstellungen im Standardzustand."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a7-m2",
                    "uuid": "86af5d1b-1bbf-48d3-ab4d-37aec6b57bc9",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt eine organisatorische Empfehlung zur Konfiguration von Datenschutzeinstellungen. Benutzer werden angeleitet, Drittanbieter-Cookies zu blockieren und ihre Browserdaten regelmäßig manuell zu löschen. Die Umsetzung wird jedoch nicht technisch erzwungen."
                      },
                      {
                        "name": "guidance",
                        "value": "Anleitungen zur Verbesserung der Privatsphäre im Browser werden den Benutzern zur Verfügung gestellt. Die IT verlässt sich darauf, dass die Benutzer diese Empfehlungen befolgen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor befragt Benutzer und prüft Konfigurationen, um festzustellen, inwieweit die Empfehlungen umgesetzt wurden. Es wird eine teilweise, aber nicht durchgängige Umsetzung festgestellt."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a7-m3",
                    "uuid": "30fbeaeb-84a0-49dd-aa40-bf073cb17ed1",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Datenschutzkonfiguration wird definiert und zentral ausgerollt. Diese kann beispielsweise die Deaktivierung der Autovervollständigungsfunktion und der Browser-Synchronisation mit Cloud-Diensten umfassen. Die Benutzer werden geschult und angewiesen, Cookies von Drittanbietern zu blockieren und haben die Möglichkeit, ihre Browserdaten (Cookies, Historie) zu löschen."
                      },
                      {
                        "name": "guidance",
                        "value": "Mittels GPO oder MDM werden Richtlinien wie `AutoFillEnabled` und `SyncDisabled` auf `false` gesetzt. Die Benutzer erhalten klare Anweisungen zum Umgang mit Cookies und anderen Browserdaten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die zentralen Konfigurationsrichtlinien und vergleicht sie mit den Einstellungen auf den Client-Systemen. Es wird geprüft, ob die Benutzer die Möglichkeit haben, ihre Daten wie gefordert zu löschen. Die Schulungsunterlagen werden eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a7-m4",
                    "uuid": "eccf5145-fc36-48ab-9757-56cb7b2ef8aa",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle relevanten 'SOLLTE'-Anforderungen werden durch eine zentrale Richtlinie umgesetzt. Cookies von fremden Institutionen (Drittanbieter-Cookies) SOLLTEN blockiert werden. Telemetriefunktionen und das automatische Senden von Absturzberichten SOLLTEN deaktiviert werden. Der Zugriff auf Peripheriegeräte (Mikrofon, Webcam, Standort) SOLLTE standardmäßig blockiert und nur nach expliziter Genehmigung pro Seite erlaubt sein. Die Konfiguration von WebRTC, HSTS und JavaScript wird dem Benutzer ermöglicht oder ist restriktiv voreingestellt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die entsprechenden Browser-Richtlinien (`DefaultCookiesSetting`, `SendCrashReports`, `DefaultKameraSetting` etc.) werden zentral auf die restriktivsten Werte gesetzt. Beispielsweise wird das Blockieren von Drittanbieter-Cookies erzwungen (`BlockThirdPartyCookies` auf `true`)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die umfassenden Konfigurationsrichtlinien in der zentralen Verwaltungskonsole. Auf einem Client wird getestet, ob der Zugriff auf die Webcam blockiert ist und eine explizite Freigabe erfordert. Die Netzwerkkommunikation des Browsers wird überwacht, um sicherzustellen, dass keine Telemetriedaten an den Hersteller gesendet werden. Die Konformität kann mit `Get-ComputerPolicy` und dem Prüfen der entsprechenden Schlüssel in der Registry automatisiert werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a7-m5",
                    "uuid": "08f0d3f9-db94-47ab-8546-3cf1326c3c02",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine strikte Datenschutzkonfiguration ist erzwungen und kann von Benutzern nicht geändert werden. Dies beinhaltet das Blockieren aller Drittanbieter-Cookies, die Deaktivierung von Telemetrie und Synchronisation sowie die Aktivierung erweiterter Tracking-Schutzmaßnahmen auf der höchsten Stufe. Zusätzlich wird eine Richtlinie zum Löschen aller Browserdaten beim Schließen des Browsers durchgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Richtlinie `ClearBrowsingDataOnExit` wird aktiviert und konfiguriert, um alle relevanten Daten (Cookies, Cache, Historie) zu umfassen. Erweiterte Schutzfunktionen wie der 'Strict' Modus im Tracking-Schutz von Firefox werden per Richtlinie erzwungen. Jegliche Form von spekulativer Vorabladung von Inhalten (`pre-rendering`, `pre-fetching`) wird deaktiviert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor verifiziert, dass die strengen Datenschutzrichtlinien auf den Clients durchgesetzt und nicht veränderbar sind. Es wird ein Test durchgeführt: Der Benutzer surft auf mehreren Webseiten, schließt den Browser und öffnet ihn erneut. Die Browser-Historie, Cookies und der Cache müssen leer sein. Die Unveränderbarkeit der Einstellungen wird durch den Versuch, diese in der GUI zu ändern, geprüft (die Optionen müssen ausgegraut sein)."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "962dca7a-6e65-458f-b784-505630b72821",
                "control-id": "KONF.12.6",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.1.2.a10-m1",
                    "uuid": "ad83637f-033e-4938-bea1-73cf90435509",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Benutzer kennen den privaten Modus (Inkognito-Modus) des Browsers und verwenden ihn gelegentlich nach eigenem Ermessen, ohne dass es eine organisatorische Vorgabe gibt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Nutzung ist rein freiwillig und hängt vom Bewusstsein des einzelnen Benutzers ab. Es gibt keine Schulung oder Richtlinie dazu."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor stellt durch Befragung von Benutzern fest, dass es keine einheitliche Vorgehensweise zur Nutzung des privaten Modus gibt."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a10-m2",
                    "uuid": "2d120ab0-7485-4ed2-8738-238d1247707a",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert eine organisatorische Empfehlung, den privaten Modus für das Surfen auf nicht vertrauenswürdigen oder sensiblen Webseiten zu verwenden. Die Einhaltung wird jedoch nicht überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine entsprechende Empfehlung wird an die Mitarbeiter kommuniziert. Die Verantwortung für die Umsetzung liegt vollständig beim Benutzer."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die Kommunikationskanäle auf die Existenz der Empfehlung. Eine Befragung der Mitarbeiter zeigt, dass die Empfehlung bekannt ist, aber nicht immer befolgt wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a10-m3",
                    "uuid": "f8162863-fc14-472c-a30b-2dac40cdd291",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Richtlinie schreibt die Verwendung des privaten Modus für bestimmte Benutzergruppen oder Tätigkeiten mit erhöhtem Vertraulichkeitsbedarf vor. Die Benutzer werden entsprechend geschult."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Richtlinie wird formal dokumentiert und ist Teil der Sicherheitsschulungen. Obwohl die Nutzung nicht technisch erzwungen wird, ist sie eine klare Arbeitsanweisung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die Existenz der Richtlinie und der Schulungsunterlagen. Die Kenntnis der Richtlinie wird bei den betroffenen Mitarbeitern stichprobenartig abgefragt."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a10-m4",
                    "uuid": "fbfd3f77-96d9-4abf-8189-4ecbd6251007",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webbrowser SOLLTE bei erhöhten Anforderungen bezüglich der Vertraulichkeit im sogenannten privaten Modus ausgeführt werden. Der Browser SOLLTE so konfiguriert werden, dass lokale Inhalte beim Beenden gelöscht werden. Dies wird durch eine zentrale Richtlinie erzwungen, die den Browser für alle Benutzer oder definierte Gruppen standardmäßig im privaten Modus startet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die entsprechende Browser-Richtlinie (z.B. `IncognitoModeAvailability` oder `BrowserGuestModeEnabled`) wird über GPO oder MDM so konfiguriert, dass der Browser gezwungen wird, im privaten oder einem äquivalenten ephemeren Modus zu starten. Die Richtlinie `ClearBrowsingDataOnExit` wird ebenfalls aktiviert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die zentrale Konfigurationsrichtlinie. Auf einem Client-System wird der Browser gestartet und verifiziert, dass er direkt im privaten Modus öffnet. Es wird geprüft, dass nach dem Schließen und Neustarten keine Sitzungsdaten (Historie, Cookies) mehr vorhanden sind. Die Konformität kann automatisiert durch Auslesen der Richtlinie `chrome://policy` überprüft werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a10-m5",
                    "uuid": "adba8664-7133-4b0f-98d5-05e41085eaed",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Verwendung des privaten Modus wird mit einer Browser-Isolationslösung (siehe APP.1.2.A9) kombiniert. Die Browser-Sitzungen finden in einer entfernten, nicht-persistenten Instanz statt, die nach jeder Sitzung garantiert vollständig zerstört wird. Dies bietet ein höheres Maß an Sicherheit als der lokale private Modus."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Remote Browser Isolation (RBI) Lösung wird so konfiguriert, dass für jeden Benutzer bei jeder Sitzung eine neue, saubere Container- oder VM-Instanz gestartet und nach dem Schließen des Browser-Tabs oder -Fensters unwiderruflich vernichtet wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die Konfiguration der RBI-Plattform. Es wird verifiziert, dass die Sitzungen nicht-persistent sind, indem eine Datei in der Sitzung erstellt oder eine Einstellung geändert wird. Nach dem Schließen und erneuten Öffnen der Sitzung müssen diese Änderungen verschwunden sein. Die Logs der Plattform werden auf Nachweise der Sitzungszerstörung geprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e3fcca63-6388-4e19-b779-00e07ab02823",
                "control-id": "KONF.14.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.1.2.a2-m1",
                    "uuid": "c89b1ffe-fcce-41e2-bb7b-f8305bc46ef7",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webbrowser unterstützt zwar TLS, jedoch sind veraltete und unsichere Protokollversionen (SSLv3, TLS 1.0, TLS 1.1) weiterhin aktiviert und können für Verbindungen genutzt werden. HSTS wird nicht aktiv eingesetzt oder konfiguriert."
                      },
                      {
                        "name": "guidance",
                        "value": "Dieser Zustand entsteht oft durch die Verwendung von Standardeinstellungen älterer Browser oder Betriebssysteme, die aus Kompatibilitätsgründen unsichere Protokolle beibehalten. Es gibt keine aktive Verwaltung der Verschlüsselungsprotokolle."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Konfiguration des Webbrowsers auf einem Client-System, um festzustellen, welche TLS/SSL-Protokollversionen aktiviert sind. Dies kann mit Online-Testseiten (z.B. von Qualys SSL Labs) oder durch lokale Konfigurationsprüfungen erfolgen. Das Vorhandensein aktivierter, veralteter Protokolle ist ein Indikator für diesen Reifegrad."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a2-m2",
                    "uuid": "0bd5b2fa-3961-4c3e-be00-eb911fd3291a",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webbrowser ist so konfiguriert, dass er standardmäßig sichere TLS-Versionen (mindestens 1.2) für die Kommunikation nutzt. Verbindungen zu Webservern werden opportunistisch mit TLS verschlüsselt, wenn der Server dies anbietet. HSTS wird vom Browser unterstützt, aber nicht aktiv durch Richtlinien erzwungen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Konfiguration verlässt sich auf die Standardeinstellungen moderner Browser, die bereits eine sichere Grundkonfiguration bieten. Es werden keine zentralen Richtlinien zur Deaktivierung älterer Protokolle oder zur Verwaltung von HSTS durchgesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor verifiziert, dass der Browser bei Verbindungen zu modernen Servern standardmäßig TLS 1.2 oder höher verwendet. Es wird geprüft, ob der Browser HSTS-Header von Webseiten korrekt verarbeitet. Das Fehlen einer zentralen Richtlinie zur Deaktivierung unsicherer Protokolle kennzeichnet diesen Zustand. Automatisierte Scans können die Standard-Cipher-Suites und Protokoll-Einstellungen des Browsers überprüfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a2-m3",
                    "uuid": "4b139540-f6ef-452c-bc39-c2114c9469c4",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webbrowser MUSS Transport Layer Security (TLS) in einer sicheren Version unterstützen. Verbindungen zu Webservern MÜSSEN mit TLS verschlüsselt werden, falls dies vom Webserver unterstützt wird. Der Webbrowser MUSS den Sicherheitsmechanismus HTTP Strict Transport Security (HSTS) gemäß RFC 6797 unterstützen und einsetzen. Eine Richtlinie, die sichere Protokollversionen und Cipher Suites vorschreibt, ist dokumentiert und umgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Mittels zentraler Konfigurationsverwaltung (GPO, MDM) wird sichergestellt, dass nur sichere TLS-Versionen (1.2 und höher) und starke Cipher Suites verwendet werden. HSTS wird für wichtige interne und externe Domains per Richtlinie konfiguriert (z.B. über die 'HSTSPreloadList')."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die zentralen Konfigurationsrichtlinien für Webbrowser. Es wird verifiziert, dass diese Richtlinien die Verwendung sicherer TLS-Versionen und Cipher Suites erzwingen und HSTS korrekt konfiguriert ist. Die Konformität wird auf Client-Systemen stichprobenartig überprüft, z.B. durch Analyse der Netzwerkkonfiguration oder der Browser-Diagnoseseiten (`chrome://policy`)."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a2-m4",
                    "uuid": "0c743c00-e763-4b6b-b202-0a47f01fb3b4",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die 'SOLLTE'-Anforderung wird umgesetzt: Unsichere Versionen von TLS (insbesondere 1.0 und 1.1) sowie schwache Cipher Suites (z.B. solche mit RC4 oder 3DES) werden explizit und nachweislich durch eine zentrale Richtlinie deaktiviert. Die HSTS-Preload-Liste des Browsers wird aktiv genutzt, um wichtige Domains vor Downgrade-Angriffen zu schützen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Konfigurationsrichtlinien werden so verschärft, dass eine 'Whitelist' von erlaubten Protokollen (z.B. nur TLS 1.2, TLS 1.3) und Cipher Suites durchgesetzt wird. Eigene, kritische Domains der Organisation werden in die offizielle HSTS-Preload-Liste eingetragen und diese Information wird an die Browser der Organisation verteilt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Konfigurationsrichtlinien auf explizite Deaktivierungs- oder Whitelist-Einträge für Protokolle und Cipher Suites. Es wird verifiziert, dass Verbindungsversuche mit veralteten Protokollen fehlschlagen. Die HSTS-Konfiguration wird durch Überprüfung der Browser-internen Zustandsdaten (z.B. `chrome://net-internals/#hsts`) und der Preload-Listen kontrolliert. Ein automatisiertes Skript kann versuchen, eine Verbindung mit einer schwachen Chiffre (z. B. `openssl s_client -connect server:443 -tls1_1`) herzustellen, was fehlschlagen muss."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a2-m5",
                    "uuid": "10e4d8d9-bdd3-4f18-bb35-3e8e080b3879",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine strikte Richtlinie erzwingt ausschließlich TLS 1.3 für alle Verbindungen, wo dies technisch möglich ist. Die Konformität der Verschlüsselungskonfiguration wird kontinuierlich durch Endpoint-Security-Tools überwacht. Der Browser ist so konfiguriert, dass er Certificate Transparency (CT) für alle Verbindungen erzwingt, um die Ausstellung missbräuchlicher Zertifikate zu erkennen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Browser-Richtlinien werden auf das strikteste Niveau gesetzt (`SSLVersionMin` auf `tls1.3`). Ein Endpoint Detection and Response (EDR) oder ein Konfigurationsmanagement-Tool überwacht die relevanten Registry-Keys oder Konfigurationsdateien in Echtzeit und korrigiert Abweichungen automatisch. Die Richtlinien zur Erzwingung von Certificate Transparency (`CertificateTransparencyEnforcementEnabled`) werden aktiviert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die Konfiguration und die Alarmierungsregeln des EDR- oder Konfigurationsmanagement-Tools. Es wird ein Manipulationsversuch der TLS-Konfiguration auf einem Test-Client simuliert, der vom Tool erkannt und korrigiert werden muss. Die CT-Richtlinie wird durch Abfrage der Browser-Policies (`chrome://policy`) und durch Analyse des Netzwerkverkehrs bei Verbindungen zu Testseiten verifiziert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "3a4a2604-b02d-4b21-b673-1fb04567f9d7",
                "control-id": "KONF.6.14",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.1.2.a1-m1",
                    "uuid": "77898120-2c8c-478e-a1a1-e7ff14890ab0",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Nur einzelne grundlegende Sicherheitsmechanismen des Webbrowsers wie Sandboxing sind aktiviert. Andere wichtige Mechanismen wie eine Content Security Policy (CSP) sind nicht konfiguriert oder werden nicht durchgesetzt. Die Konfiguration ist über die verschiedenen Systeme der Organisation hinweg inkonsistent."
                      },
                      {
                        "name": "guidance",
                        "value": "In diesem Zustand wird der Browser oft mit seinen Standardeinstellungen betrieben, ohne dass eine zentrale Konfigurationsverwaltung die Aktivierung aller notwendigen Sicherheitsfunktionen wie Sandboxing, Same-Origin-Policy, Subresource Integrity und CSP sicherstellt. Dies führt zu einer lückenhaften und unzuverlässigen Sicherheitslage."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft stichprobenartig die Konfiguration von Webbrowsern auf verschiedenen Endgeräten. Es wird festgestellt, ob grundlegende Sicherheitsmechanismen (Sandboxing, SOP, SRI) aktiv sind und ob eine CSP, selbst eine grundlegende, definiert wurde. Inkonsistenzen in der Konfiguration zwischen den Systemen sind ein klares Indiz für diesen Reifegrad."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a1-m2",
                    "uuid": "d5e65b7d-4820-439c-bc48-afbe41192987",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die grundlegenden, im Browser integrierten Sicherheitsmechanismen wie Sandboxing, Same-Origin-Policy (SOP) und Subresource Integrity (SRI) sind durchgehend aktiviert. Eine Content Security Policy (CSP) ist jedoch noch nicht implementiert oder nur in einer sehr permissiven Konfiguration (z. B. im Report-Only-Modus) vorhanden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Aktivierung der Basis-Mechanismen erfolgt oft über eine grundlegende Gruppenrichtlinie oder ein MDM-Profil. Der Fokus liegt darauf, die standardmäßig vorhandenen Schutzfunktionen zu aktivieren, ohne jedoch eine anwendungsspezifische Härtung wie eine restriktive CSP vorzunehmen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft mittels zentraler Verwaltungskonsole oder durch Ausführung von Testskripten auf den Clients, ob Sandboxing, SOP und SRI für alle Benutzer und Systeme aktiv sind. Zusätzlich wird geprüft, ob eine CSP implementiert ist. Das Fehlen einer wirksamen CSP kennzeichnet diesen Reifegrad. Automatisierte Tools können die Browser-Konfigurationen scannen, um die Aktivierung der grundlegenden Mechanismen zu verifizieren (`chrome://sandbox`, `about:config` bei Firefox)."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a1-m3",
                    "uuid": "db100ec9-d055-4b5c-b092-293aa441a675",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der eingesetzte Webbrowser MUSS sicherstellen, dass jede Instanz und jeder Verarbeitungsprozess nur auf die eigenen Ressourcen zugreifen kann (Sandboxing). Webseiten MÜSSEN als eigenständige Prozesse oder mindestens als eigene Threads voneinander isoliert werden. Plug-ins und Erweiterungen MÜSSEN ebenfalls in isolierten Bereichen ausgeführt werden. Der verwendete Webbrowser MUSS die Content Security Policy (CSP) umsetzen. Der Browser MUSS Maßnahmen zur Same-Origin-Policy und Subresource Integrity unterstützen. Diese Konfigurationen sind dokumentiert und werden konsistent auf alle Systeme ausgerollt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Umsetzung erfolgt durch eine zentrale Konfigurationsverwaltung (z. B. GPO, MDM). Eine grundlegende, aber wirksame CSP wird definiert und im Enforce-Modus betrieben. Die Konfigurationen für Sandboxing, SOP und SRI werden überprüft und, falls notwendig, gehärtet. Die definierten Richtlinien werden allen IT-Mitarbeitern zur Verfügung gestellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor verifiziert die Existenz und Umsetzung der zentralen Konfigurationsrichtlinien. Es wird geprüft, ob Sandboxing, Thread-Isolierung, SOP, SRI und eine grundlegende CSP auf allen Zielsystemen aktiv und erzwungen werden. Die Konformität kann durch Auswertung der Konfigurationsdateien oder durch Abfrage der Browser-internen Diagnoseseiten (z.B. `chrome://policy`) überprüft werden. Zusätzlich wird die Dokumentation der Konfiguration eingesehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a1-m4",
                    "uuid": "3ab16f4e-7a96-4ca9-8fdb-dd49ca4ac045",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Aufbauend auf der definierten Konfiguration wird die 'SOLLTE'-Anforderung umgesetzt: Der aktuell höchste Level der Content Security Policy (CSP) wird erfüllt. Die CSP-Richtlinien sind restriktiv und spezifisch auf die genutzten Webanwendungen zugeschnitten. Die Konfigurationen der Sicherheitsmechanismen werden regelmäßig auf Verbesserungen und neue Features überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Die CSP (z.B. Level 3) wird implementiert, um Schutzmechanismen wie `script-src-elem`, `frame-ancestors` oder `trusted-types` zu nutzen. Ein Prozess zur Überprüfung und Anpassung der CSP für neue und bestehende Anwendungen wird etabliert. CSP-Verstöße werden an einen zentralen Endpunkt gemeldet und aktiv ausgewertet, um die Richtlinien zu verfeinern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft, ob die neueste Version der CSP-Spezifikation genutzt wird und ob die Richtlinien restriktiv sind. Es wird verifiziert, dass ein Reporting-Endpunkt für CSP-Verstöße konfiguriert ist und die eingehenden Meldungen analysiert werden. Dies kann durch Überprüfung der Server-Header und der Konfigurationsrichtlinien sowie durch Einsicht in die Log-Analysen erfolgen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a1-m5",
                    "uuid": "a652b04a-9daa-4451-a05d-7357fbf9134a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle grundlegenden Sicherheitsmechanismen sind nicht nur implementiert, sondern auch maximal gehärtet. Die CSP ist streng und wird dynamisch verwaltet. Zusätzlich werden fortschrittliche Schutzmaßnahmen wie 'Trusted Types' zur Abwehr von DOM-XSS-Angriffen durchgesetzt. Die Integrität der Browserkonfiguration wird kontinuierlich und automatisiert überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein System zur automatisierten Verwaltung und Verteilung von CSPs ist im Einsatz. CSP-Verstöße lösen automatisierte Alarme aus. Die Sandboxing-Funktionen werden durch Betriebssystem-Level-Richtlinien (z.B. AppLocker, SELinux) weiter verstärkt. Die Konfigurationen werden durch ein Endpoint-Security-Tool permanent überwacht, und Abweichungen werden automatisch korrigiert oder gemeldet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die Wirksamkeit der automatisierten Überwachungs- und Korrekturmaßnahmen. Es wird geprüft, ob ein Manipulationsversuch an der Browserkonfiguration erkannt und verhindert bzw. gemeldet wird. Die Wirksamkeit der 'Trusted Types'-Implementierung wird durch gezielte Penetrationstests verifiziert. Automatisierte Konformitätsprüfungen können durch Ausführung eines Befehls wie `Get-ComputerPolicy -Path 'HKLM:\\SOFTWARE\\Policies\\Google\\Chrome'` und Vergleich mit einem Golden Image durchgeführt werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ef9714f5-3ecb-4e45-a5d6-f9555882c453",
                "control-id": "KONF.6.15",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Treatment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.1.2.a9-m1",
                    "uuid": "631cfa7b-16a8-4e44-a6dd-4565382ef9bd",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine isolierte Browser-Umgebung wird nur von einzelnen, besonders gefährdeten Personen (z.B. Administratoren) und auf freiwilliger Basis genutzt. Es gibt keine organisatorische Vorgabe."
                      },
                      {
                        "name": "guidance",
                        "value": "Einige technisch versierte Mitarbeiter richten sich möglicherweise selbst eine VM mit einem Browser ein, um riskante Webseiten zu besuchen. Dies geschieht jedoch ad-hoc und ohne standardisiertes Verfahren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor stellt durch Befragungen fest, dass keine einheitliche Strategie für Browser-Isolierung existiert und nur vereinzelte, individuelle Lösungen im Einsatz sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a9-m2",
                    "uuid": "fd6a7d11-ab99-4b82-841f-ca539869a07d",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine standardisierte, virtualisierte Browser-Instanz (z.B. in einer einfachen VM) wird für Hochrisikobenutzer auf Anfrage zur Verfügung gestellt. Das Setup ist grundlegend und wird nicht zentral verwaltet oder gehärtet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die IT-Abteilung stellt ein einfaches VM-Image mit einem vorinstallierten Browser bereit. Die Benutzer müssen die VM manuell starten und verwenden. Updates für die VM und den Browser darin müssen oft manuell durchgeführt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor prüft die Dokumentation für die Bereitstellung der VM. Es wird festgestellt, dass es keinen Prozess zur regelmäßigen Aktualisierung oder Härtung des VM-Images gibt und die Nutzung nicht erzwungen wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a9-m3",
                    "uuid": "da9b7726-7191-416f-9e9d-abcc4590b8be",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Basierend auf einer Risikoanalyse wird eine Richtlinie definiert, die vorschreibt, wann eine isolierte Browserumgebung verwendet werden muss (z.B. für den gesamten Zugriff auf das Internet). Eine standardisierte, gehärtete und zentral verwaltete virtualisierte Browser-Instanz wird für alle relevanten Benutzer bereitgestellt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein 'Golden Image' für eine virtuelle Maschine mit einem gehärteten Betriebssystem und einem vorkonfigurierten Browser wird erstellt und gepflegt. Dieses Image wird zentral an die Benutzer verteilt. Es gibt klare Anweisungen, für welche Tätigkeiten diese Umgebung zu nutzen ist."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die Richtlinie zur Browser-Isolierung und den Patch- und Management-Prozess für das VM-Image. Es wird stichprobenartig geprüft, ob die relevanten Benutzer die isolierte Umgebung wie vorgeschrieben nutzen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a9-m4",
                    "uuid": "8ed50972-3b0d-4519-b71d-944c8a052450",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE speziell abgesicherte, isolierte Browserumgebungen einsetzen. Es wird eine dedizierte Browser-Isolationslösung (z.B. Remote Browser Isolation - RBI, oder eine containerbasierte Lösung wie ReCoBS) implementiert. Diese stellt sicher, dass Webinhalte in einer entfernten, nicht-persistenten Umgebung ausgeführt und nur die gerenderten, sicheren Ergebnisse an den Client-Browser gestreamt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine kommerzielle oder Open-Source-RBI-Lösung wird eingeführt. Der gesamte Internetverkehr von den Clients wird transparent über diese Lösung geleitet. Die Richtlinien für die Isolation (z.B. welche Inhalte blockiert, welche umgewandelt werden) werden zentral verwaltet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die Konfiguration der RBI-Lösung und der zugehörigen Netzwerkrouten. Es wird auf einem Client-System verifiziert, dass bei einem Besuch einer Webseite kein aktiver Code (z.B. JavaScript) direkt auf dem Endgerät ausgeführt wird. Dies kann durch Analyse des DOM und der laufenden Prozesse im Client-Browser erfolgen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.1.2.a9-m5",
                    "uuid": "0fc88f42-9548-4777-adcc-0a70da44b51a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Browser-Isolationslösung ist vollständig in den Sicherheitsstack der Organisation integriert. Der Datenverkehr aus der Isolationsumgebung wird durch einen zentralen Web-Gateway zur Inhaltsprüfung (Malware-Scanning, DLP) geleitet, bevor er zum Benutzer gelangt. Die Isolationsinstanzen sind nicht-persistent und werden nach jeder Sitzung garantiert zerstört. Die Lösung selbst ist gehärtet und wird regelmäßig Penetrationstests unterzogen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die RBI-Lösung wird mit dem Secure Web Gateway und den DLP-Systemen der Organisation gekoppelt. Es werden Richtlinien für den Datentransfer (Upload/Download, Copy/Paste) zwischen der isolierten Umgebung und dem Client durchgesetzt. Die Plattform wird kontinuierlich auf Sicherheit und Performance überwacht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Auditor überprüft die gesamte Kette der Sicherheitskontrollen, von der Umleitung des Datenverkehrs in die RBI-Lösung bis zur Inhaltsprüfung im Web-Gateway. Es wird getestet, ob ein Versuch, sensible Daten aus der isolierten Sitzung zu exfiltrieren, von den DLP-Kontrollen erkannt und blockiert wird. Die Protokolle der Lösung werden auf die korrekte Zerstörung der Sitzungsinstanzen geprüft."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}