{
  "component-definition": {
    "uuid": "e460cab5-925c-4ab6-a432-a9fd990d5c4a",
    "metadata": {
      "title": "APP.1.1 Office-Anwendungen - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:07:58.290352+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "ea0d3093-5d78-4ebd-bf90-23b556645bef",
        "type": "software",
        "title": "APP.1.1 Office-Anwendungen",
        "description": "This component represents the implementation of all controls for Baustein APP.1.1.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Die Gruppe der Office-Produkte umfasst in erster Linie Anwendungen, die dazu dienen, Dokumente zu erstellen, zu bearbeiten oder zu betrachten. Dazu zählen unter anderem die freie Anwendung LibreOffice und die proprietäre Anwendung Microsoft Office, die in vielen Institutionen genutzt werden. Office-Produkte gehören für die meisten Institutionen zur notwendigen IT-Grundausstattung. Sie umfassen unter anderem Programme zur Textverarbeitung, Tabellenkalkulation und Erstellung von Präsentationen sowie Zeichenprogramme und einfache Datenbanksysteme."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel des vorliegenden Bausteins ist der Schutz der Informationen, die durch Office-Produkte verarbeitet und genutzt werden. Dazu werden spezielle Anforderungen an die Funktionsweise der Komponenten von Office-Produkten gestellt. Der Baustein zeigt Anforderungen auf, die zur Absicherung von Office-Produkten vor spezifischen Gefährdungen erfüllt werden sollten."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein APP.1.1 Office-Produkte ist auf jedes Office-Produkt anzuwenden, das lokal installiert ist und mit dem Dokumente betrachtet, bearbeitet oder erstellt werden, außer E-Mail-Anwendungen.\nDieser Baustein betrachtet den Einsatz von Office-Produkten aus Sicht des IT-Betriebs und gibt Hinweise für Benutzende, wie Office-Produkte eingesetzt werden sollten. Ergänzend zu den Anforderungen dieses Bausteins müssen die Anforderungen des übergeordneten Bausteins APP.6 Allgemeine Software umgesetzt werden. E-Mail-Anwendungen werden in diesem Baustein nicht berücksichtigt, die entsprechenden Anforderungen sind im Baustein APP.5.3 Allgemeiner E-Mail-Client und -Server zu finden. Bei der Verwendung von integrierten Datenbanksystemen wie Base in LibreOffice oder Access in Microsoft Office muss der Baustein APP.4.3 Relationale Datenbanken berücksichtigt werden. Ebenfalls im vorliegenden Baustein ausgenommen sind reine Cloud-Office-Anwendungen wie Google Workspace mit den Anwendungen Docs oder Sheets. Anforderungen an Cloud-Anwendungen sind in dem Baustein OPS.2.2 Cloud-Nutzung festgelegt."
          },
          {
            "name": "2.1. Fehlende Anpassung der Office-Produkte an den Bedarf der Institution",
            "value": "Werden Office-Produkte beschafft oder angepasst, ohne die Anforderungen an diese Software zu beachten, kann der Betrieb erheblich gestört werden. Es kann beispielsweise sein, dass vorhandene Vorlagen und Dokumente nicht kompatibel sind oder mit Anwendungen von Geschäftspartnern und -partnerinnen nicht interoperabel ist. Sollten Office-Produkte nicht an den Bedarf der Institution angepasst werden, kann dies zu Performance-Verlusten, Störungen oder Fehlern innerhalb der Geschäftsprozesse führen."
          },
          {
            "name": "2.2. Schädliche Inhalte in Office-Dokumenten",
            "value": "Office-Dokumente können in der Regel verschiedene sogenannte „Aktive Inhalte“ oder Makros enthalten, die mitunter für komplexe Automatisierungen genutzt werden. Aktive Inhalte können aber auch Schadcode enthalten, der ausgeführt wird, wenn das Dokument geöffnet wird. Solche Schadfunktionen in Office-Dokumenten können die betroffenen Dokumente selbst, aber auch andere Daten und Programme manipulieren. Darüber hinaus kann sich der Schadcode weiter ausbreiten. Alle betroffenen Geschäftsprozesse der Institution können in ihren Funktionen gestört oder blockiert werden. Im schlimmsten Fall bleibt die Manipulation unerkannt und führt zu Sicherheitslücken und zur Verarbeitung von verfälschten Informationen."
          },
          {
            "name": "2.3. Integritätsverlust von Office-Dokumenten",
            "value": "Die Integrität von Office-Dokumenten kann verfälscht werden, wenn unbeabsichtigt oder vorsätzlich die Inhalte geändert werden. Durch einen unbedachten Umgang mit Office-Produkten oder durch Unkenntnis der Benutzenden im Umgang mit Office-Dokumenten können Dokumente unerkannt geändert werden. Dies ist dann besonders problematisch, wenn es sich um produktiv eingesetzte Dokumente handelt. Wird mit Dokumenten weitergearbeitet, die unerkannt verfälscht wurden, werden möglicherweise falsche Entscheidungen getroffen oder es kann ein Image-Schaden für die Institution entstehen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "6de30171-3586-4595-89bf-1b8c6b8dbb80",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/office-anwendungen_profile.json",
            "description": "Implementation for all controls in Baustein APP.1.1",
            "implemented-requirements": [
              {
                "uuid": "35889a10-e504-4d8b-b01a-4fd7490cb685",
                "control-id": "KONF.10.4",
                "description": "Implementation for KONF.10.4 based on BSI APP.1.1.A12",
                "statements": [
                  {
                    "statement-id": "APP.1.1.A12-m2",
                    "uuid": "62faa5fc-8c63-4fba-9a70-c546d776a3bf",
                    "description": "Es existiert eine schriftliche Weisung in der IT-Benutzerordnung, die die Speicherung von dienstlichen Dokumenten in privaten oder nicht genehmigten öffentlichen Cloud-Speichern verbietet. Die integrierten Cloud-Funktionen in den Office-Anwendungen sind jedoch nicht technisch deaktiviert."
                  },
                  {
                    "statement-id": "APP.1.1.A12-m3",
                    "uuid": "377528ce-dea6-42a0-b977-b2c816ae632d",
                    "description": "Die in Office-Produkten integrierten Funktionen für Cloud-Speicher SOLLTEN grundsätzlich deaktiviert werden. Alle Cloud-Laufwerke SOLLTEN deaktiviert werden. Alle Dokumente SOLLTEN von den Benutzenden auf zentral verwalteten Fileservern gespeichert werden. Für die Freigabe von Dokumenten für Dritte SOLLTEN spezialisierte, genehmigte Anwendungen eingesetzt werden."
                  },
                  {
                    "statement-id": "APP.1.1.A12-m4",
                    "uuid": "05ee7543-a86d-4aa5-ae0c-7e0f6c869c93",
                    "description": "Zusätzlich zur Deaktivierung der Funktionen in Office wird der Netzwerkverkehr zu bekannten, nicht genehmigten Cloud-Speicherdiensten am zentralen Internet-Gateway (Firewall, Proxy) blockiert. Die Nutzung der genehmigten Filesharing-Lösung wird protokolliert und auf anomale Aktivitäten überwacht."
                  },
                  {
                    "statement-id": "APP.1.1.A12-m5",
                    "uuid": "aba5edb6-868d-4848-b84e-ff1ed5649414",
                    "description": "Eine umfassende Data Loss Prevention (DLP) Lösung ist im Einsatz. Sie inspiziert ausgehenden Datenverkehr und blockiert aktiv den Upload von Dokumenten mit sensiblen Inhalten (basierend auf Klassifizierung oder Inhaltsanalyse) zu allen nicht genehmigten Zielen, einschließlich privater Cloud-Speicher, Webmail und anderer Kanäle."
                  }
                ]
              },
              {
                "uuid": "d3ac5019-ab8c-41ff-be1f-cad28cd9e75b",
                "control-id": "KONF.11.8",
                "description": "Implementation for KONF.11.8 based on BSI APP.1.1.A11",
                "statements": [
                  {
                    "statement-id": "APP.1.1.A11-m2",
                    "uuid": "92cdd016-b996-48e8-a8ea-15e3b5ce44b2",
                    "description": "Die Installation von Erweiterungen (Add-ons, Extensions) für Office-Produkte ist nur für Benutzer mit administrativen Rechten möglich. Es gibt keine spezifischen Test- oder Freigabeprozesse für diese Erweiterungen."
                  },
                  {
                    "statement-id": "APP.1.1.A11-m3",
                    "uuid": "e3d7080c-e2ae-4713-8a58-a2afd25d162f",
                    "description": "Alle Erweiterungen von Office-Produkten, wie Add-ons und Extensions, SOLLTEN vor dem produktiven Einsatz genauso getestet werden wie neue Versionen. Die Tests SOLLTEN ausschließlich auf isolierten Testsystemen stattfinden und prüfen, ob die Erweiterungen negative Auswirkungen haben. Die Tests SOLLTEN einem definierten, nachvollziehbaren Testplan folgen."
                  },
                  {
                    "statement-id": "APP.1.1.A11-m4",
                    "uuid": "b5b2737f-bac7-4b79-8c04-9be99541019d",
                    "description": "Die Verwendung von Office-Erweiterungen wird technisch auf eine explizite Whitelist von genehmigten Add-ons beschränkt. Der Zugriff auf öffentliche Add-on-Stores wird blockiert und stattdessen wird ein interner, kuratierter Store mit den freigegebenen Erweiterungen bereitgestellt."
                  }
                ]
              },
              {
                "uuid": "a3792906-f867-4b4e-97d6-c770ef14f124",
                "control-id": "KONF.11.9",
                "description": "Implementation for KONF.11.9 based on BSI APP.1.1.A15",
                "statements": [
                  {
                    "statement-id": "APP.1.1.A15-m3",
                    "uuid": "5ff615b5-2d97-44ec-99d0-89d45583d572",
                    "description": "Für Daten mit erhöhtem Schutzbedarf wird die integrierte Dokumentenverschlüsselung von Office-Produkten mit einem Passwortschutz verwendet. Die Benutzer sind angewiesen, starke Passwörter zu verwenden und diese sicher zu verwalten."
                  },
                  {
                    "statement-id": "APP.1.1.A15-m4",
                    "uuid": "8ba0ec5f-235a-4f28-8973-7e3bb9ff761c",
                    "description": "Daten mit erhöhtem Schutzbedarf SOLLTEN nur verschlüsselt gespeichert bzw. übertragen werden. Bevor ein integriertes Verschlüsselungsverfahren genutzt wird, SOLLTE dessen Stärke geprüft werden. Zusätzlich SOLLTE ein Verfahren für digitale Signaturen für Makros und Dokumente eingesetzt werden."
                  },
                  {
                    "statement-id": "APP.1.1.A15-m5",
                    "uuid": "782868a9-d163-4754-9057-ed77a0e1f62a",
                    "description": "Die Verschlüsselung von Dokumenten mit erhöhtem Schutzbedarf erfolgt automatisch, basierend auf einer Inhaltsanalyse und/oder einer manuellen Klassifizierung durch den Benutzer. Die Schlüsselverwaltung ist zentralisiert und es existiert ein sicherer Prozess zur Wiederherstellung von Daten bei Schlüsselverlust."
                  }
                ]
              },
              {
                "uuid": "10d6db53-fc33-4d5d-9e17-a91d1176ff80",
                "control-id": "KONF.12.1.11",
                "description": "Implementation for KONF.12.1.11 based on BSI APP.1.1.A2",
                "statements": [
                  {
                    "statement-id": "APP.1.1.A2-m1",
                    "uuid": "0f941089-4ce9-4e21-8778-e4a9bc177b5c",
                    "description": "Es existiert eine Anweisung oder Empfehlung, dass Benutzer die automatische Ausführung von Aktiven Inhalten (Makros) in Office-Anwendungen deaktivieren sollen. Diese Einstellung wird jedoch nicht zentral verwaltet oder überprüft."
                  },
                  {
                    "statement-id": "APP.1.1.A2-m2",
                    "uuid": "ba8ce9bd-ebad-4dbd-8440-1ce41d1da2b8",
                    "description": "Die automatische Ausführung von Aktiven Inhalten ist standardmäßig auf allen Systemen in den Office-Anwendungen deaktiviert. Benutzer werden bei Dokumenten mit Makros benachrichtigt und müssen die Ausführung manuell pro Dokument bestätigen. Es gibt keine Unterscheidung nach Herkunft der Quellen."
                  },
                  {
                    "statement-id": "APP.1.1.A2-m3",
                    "uuid": "c27e03ff-2339-410c-bd7a-f18c201cd652",
                    "description": "Die Funktion, dass eingebettete Aktive Inhalte automatisch ausgeführt werden, MUSS zentral und für Benutzer nicht veränderbar deaktiviert werden. Falls es notwendig ist, Aktive Inhalte auszuführen, MUSS darauf geachtet werden, dass diese nur ausgeführt werden, wenn sie aus definierten vertrauenswürdigen Quellen stammen. Alle Benutzenden MÜSSEN hinsichtlich der Risiken und der sicheren Vorgehensweise eingewiesen werden."
                  },
                  {
                    "statement-id": "APP.1.1.A2-m4",
                    "uuid": "aa23dd23-10af-4328-82d9-f281273e601f",
                    "description": "Zusätzlich zur zentralen Deaktivierung werden alle Versuche, Aktive Inhalte aus nicht vertrauenswürdigen Quellen auszuführen, protokolliert und an ein zentrales Monitoring-System gemeldet. Die Liste der vertrauenswürdigen Quellen wird regelmäßig überprüft und auf das notwendige Minimum reduziert."
                  },
                  {
                    "statement-id": "APP.1.1.A2-m5",
                    "uuid": "17a75f52-acc1-4492-8f31-e9f5931f098b",
                    "description": "Die Ausführung von jeglichen Aktiven Inhalten ist grundsätzlich blockiert, es sei denn, sie sind explizit durch eine Kombination aus digitaler Signatur von einem internen, streng verwalteten Zertifikatsdienst UND der Herkunft aus einem vertrauenswürdigen Speicherort genehmigt. Alle anderen Dokumente, insbesondere von externen Quellen, werden automatisch in einer Sandbox-Umgebung (Content Disarm and Reconstruction, CDR) bereinigt, bevor sie dem Benutzer zugestellt werden."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}