{
  "component-definition": {
    "uuid": "2d13f53b-c9b1-4089-943f-e6f5b9014b2b",
    "metadata": {
      "title": "APP.3.2 Webserver - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:45:29.750377+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "7fac3f4c-04c4-4692-8d80-f6a058e1aa08",
        "type": "software",
        "title": "APP.3.2 Webserver",
        "description": "This component represents the implementation of all controls for Baustein APP.3.2.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Ein Webserver ist die Kernkomponente jedes Webangebotes, er nimmt Anfragen der Clients entgegen und liefert die entsprechenden Inhalte zurück. Die Daten werden in der Regel über das Hypertext Transfer Protocol (HTTP) oder dessen mit Transport Layer Security (TLS) verschlüsselte Variante HTTP Secure (HTTPS) transportiert. Da Webserver eine einfache Schnittstelle zwischen Serveranwendungen und Clients bieten, werden sie auch häufig für interne Informationen und Anwendungen in Institutionsnetzen, wie dem Intranet, eingesetzt.<BR>Webserver sind in der Regel direkt im Internet verfügbar und bieten somit eine exponierte Angriffsfläche. Deswegen müssen sie durch geeignete Schutzmaßnahmen abgesichert werden."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist der Schutz des Webservers und der Informationen, die durch den Webserver bereitgestellt oder damit verarbeitet werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein muss auf alle Webserver des Informationsverbunds angewendet werden.<BR>Die Bezeichnung Webserver wird sowohl für die Software verwendet, welche die HTTP-Anfragen beantwortet, als auch für die IT-Systeme, auf denen diese Software ausgeführt wird. In diesem Baustein wird vorrangig die Webserver-Software betrachtet. Sicherheitsaspekte des IT-Systems, auf dem die Webserver-Software installiert ist, werden im Baustein SYS.1.1 Allgemeiner Server sowie den jeweiligen betriebssystemspezifischen Bausteinen betrachtet.<BR>Empfehlungen, wie Webserver in die Netzarchitektur zu integrieren und mit Firewalls abzusichern sind, finden sich in den Bausteinen NET.1.1 Netzarchitektur und -design bzw. NET.3.2 Firewall.<BR>Der Baustein behandelt grundsätzliche Aspekte, die für die Bereitstellung von Webinhalten wichtig sind. Dynamische Inhalte, die durch Webanwendungen bereitgestellt werden, sind nicht Gegenstand des vorliegenden Bausteins. Diese werden im Baustein APP.3.1 Webanwendungen und Webservices behandelt. Ebenso werden hier keine Webservices betrachtet.<BR>Webbrowser werden in diesem Baustein nicht betrachtet. Anforderungen dazu sind im Baustein APP.1.2 Webbrowser zu finden."
          },
          {
            "name": "2.1. Reputationsverlust",
            "value": "Gelingt es bei einem Angriff mit administrativen Rechten auf einen Webserver zuzugreifen, kann darüber eine manipulierte Webseite ausgeliefert werden (Defacement). So kann die Reputation der Institution geschädigt werden. Ebenso kann die Veröffentlichung falscher Informationen, wie zum Beispiel fehlerhafter Produktbeschreibungen, dazu führen, dass die Reputation der Institution in der Öffentlichkeit leidet. Auch kann die Institution abgemahnt werden, wenn auf ihrer Webseite Inhalte veröffentlicht werden, die gegen gesetzliche Vorschriften verstoßen. Ein Schaden kann auch entstehen, wenn die Webseite nicht verfügbar ist und potenzielle Kunden und Kundinnen deshalb zu Mitbewerbern wechseln."
          },
          {
            "name": "2.2. Manipulation des Webservers",
            "value": "Bei einem Angriff könnten sich unberechtigte Personen Zugriff auf einen Webserver verschaffen und dessen Dateien manipulieren. Es könnte beispielsweise die Konfiguration der Webserver-Software geändert werden, Schadsoftware verbreitet oder Webinhalte modifiziert werden."
          },
          {
            "name": "2.3. Denial of Service (DoS)",
            "value": "Durch DoS-Angriffe lässt sich die Verfügbarkeit eines Webangebotes gezielt beeinträchtigen, indem beispielsweise einzelne Accounts durch fehlerhafte Anmeldungen gesperrt werden.<BR>Durch DDoS (Distributed Denial of Service)-Angriffe kann ein Webserver teilweise oder auch ganz ausfallen. Für Clients ist das Webangebot dann nur noch sehr langsam oder gar nicht mehr verfügbar. Für viele Institutionen kann ein solcher Ausfall schnell geschäftskritisch werden, z. B. für Online-Shops."
          },
          {
            "name": "2.4. Verlust vertraulicher Daten",
            "value": "Viele Webserver verwenden noch veraltete kryptografische Verfahren wie RC4 oder SSL. Eine unzureichende Authentisierung bzw. eine ungeeignete Verschlüsselung kann dazu führen, dass die Kommunikation zwischen den Clients und den Webservern mitgelesen oder manipuliert werden kann. Das gleiche gilt für die Kommunikation zwischen dem Webserver und anderen Servern, wie z. B. Load Balancern."
          },
          {
            "name": "2.5. Verstoß gegen Gesetze oder Regelungen",
            "value": "Für die Veröffentlichung von Webinhalten gibt es verschiedene regulatorische Anforderungen. Neben den Regelungen der Telemedien- und Datenschutzgesetze, sind auch die Regeln des Urheberrechts zu beachten. Verstöße gegen diese Gesetze können rechtliche Konsequenzen nach sich ziehen."
          },
          {
            "name": "2.6. Fehlende oder mangelhafte Fehlerbehebung",
            "value": "Treten während des Betriebs eines Webservers Fehler auf, kann sich das z. B. auf dessen Verfügbarkeit auswirken. Auch werden eventuell Inhalte unvollständig dargestellt oder Sicherheitsmechanismen fallen aus. Werden Fehler nicht korrekt behandelt, sind sowohl der Betrieb als auch der Schutz der Funktionen und Daten eines Webservers nicht mehr gewährleistet."
          }
        ],
        "control-implementations": [
          {
            "uuid": "fcc37c0c-b1c9-4422-a2f8-9d7e048794ee",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/webserver_profile.json",
            "description": "Implementation for all controls in Baustein APP.3.2",
            "implemented-requirements": [
              {
                "uuid": "c173158b-3e03-437d-b1f1-d02f9541498e",
                "control-id": "ARCH.8.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.2.a15-m1",
                    "uuid": "33d41519-a419-4cdb-a5d1-03dd95f3e985",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert ein einzelner Webserver ohne jegliche Redundanz. Es werden zwar Backups erstellt, die Wiederherstellung ist jedoch ein manueller und zeitaufwändiger Prozess."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein einzelner virtueller Server betreibt die Webseite. Nächtliche Backups werden auf einem separaten Speichersystem abgelegt. Ein Ausfall erfordert die manuelle Bereitstellung eines neuen Servers und die Wiederherstellung der Daten aus dem Backup."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Systemarchitektur. Analyse des Backup- und Wiederherstellungsprozesses und Schätzung der Wiederherstellungszeit (RTO)."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a15-m2",
                    "uuid": "985a25c4-5206-44b4-829d-f00f0fb5067d",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein Cold-Standby-Server ist vorhanden. Im Fehlerfall muss das DNS manuell umgeschaltet und die neuesten Daten aus dem Backup wiederhergestellt werden, was zu einer spürbaren Ausfallzeit führt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein zweiter, identisch konfigurierter Server ist vorhanden, aber normalerweise ausgeschaltet. Im Fehlerfall wird er hochgefahren, die Daten werden wiederhergestellt und der DNS-A-Record wird manuell auf die neue IP-Adresse geändert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Dokumentation und der Funktionsfähigkeit des Cold-Standby-Servers. Analyse des Failover-Prozesses auf manuelle Schritte und die damit verbundene Ausfallzeit."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a15-m3",
                    "uuid": "6e60e2bc-b3f5-4775-bb4d-1efe49c7806b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Webserver SOLLTEN redundant ausgelegt werden. Dies wird durch den Einsatz von mindestens zwei Servern in einem Load-Balancer-Cluster (aktiv-passiv oder aktiv-aktiv) realisiert, um eine grundlegende Hochverfügbarkeit zu gewährleisten. Die Redundanz weiterer Systeme wie der Internetanbindung ist noch nicht umgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Zwei Webserver werden hinter einem einzelnen Load Balancer betrieben. Der Load Balancer führt Health Checks durch und leitet den Traffic im Fehlerfall eines Servers automatisch nur noch an den verbleibenden Server weiter. Die Inhalte werden über ein geteiltes, hochverfügbares Dateisystem (z.B. NFS) synchron gehalten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Konfiguration des Load Balancers und der Health Checks. Simulation des Ausfalls eines Webserver-Knotens und Überprüfung, ob der Dienst ohne manuellen Eingriff weiterhin verfügbar ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a15-m4",
                    "uuid": "d0490e96-afdf-416a-8c23-4d3662392cac",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die gesamte Bereitstellungskette ist redundant ausgelegt, wie in der Anforderung gefordert. Dies umfasst redundante Webserver, redundante Load Balancer, redundante Internetanbindungen von verschiedenen Providern und ein redundantes Backend (z.B. geclusterte Anwendungsserver, replizierte Datenbanken). Das System kann den Ausfall jeder einzelnen Komponente ohne Serviceunterbrechung überstehen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Paar hochverfügbarer Load Balancer (z.B. mit VRRP) verteilt den Traffic auf die Webserver. Der Serverraum verfügt über zwei getrennte Internet-Uplinks, die über BGP geroutet werden. Die Webserver greifen auf einen Datenbankcluster (z.B. Galera Cluster für MySQL) zu."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung des Netzwerk- und Systemarchitekturdiagramms auf Single Points of Failure. Durchführung von Failover-Tests für die verschiedenen Komponenten (Load Balancer, Datenbankknoten, Internet-Uplink)."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a15-m5",
                    "uuid": "24f0d485-8c97-49e0-aa0a-51ff4a104fea",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anwendung wird über mehrere, geografisch getrennte Rechenzentren oder Cloud-Verfügbarkeitszonen hinweg in einer Aktiv-Aktiv-Konfiguration mit automatischem Failover betrieben. Ein Global Server Load Balancing (GSLB) wird verwendet, um den Verkehr zum nächstgelegenen oder leistungsfähigsten Rechenzentrum zu leiten und eine maximale Verfügbarkeit und Disaster-Recovery-Fähigkeit zu gewährleisten."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Webanwendung wird in zwei verschiedenen AWS-Regionen (z.B. Frankfurt und Irland) betrieben. AWS Route 53 wird mit einer Latenz-basierten oder Failover-Routing-Richtlinie konfiguriert, um den Traffic zu verteilen. Die Daten werden zwischen den Regionen über eine asynchrone Datenbankreplikation synchron gehalten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der GSLB-Konfiguration (z.B. in AWS Route 53). Durchführung eines regionalen Failover-Tests, bei dem eine komplette Region abgeschaltet wird, und Messung der Zeit, bis der gesamte Verkehr auf die verbleibende Region umgeleitet wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "acd917a2-cee0-455c-a2eb-e26ed6b8a3fd",
                "control-id": "DET.3.1.10",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.2.a4-m1",
                    "uuid": "38d6f614-1c37-4b9d-a310-543b4da0c025",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Standard-Protokollierung des Webservers ist aktiviert, zeichnet aber nur erfolgreiche Zugriffe (Access Log) auf. Fehlerprotokolle werden nicht oder nur auf einem sehr niedrigen Level geschrieben. Die Logs werden lokal gespeichert und selten ausgewertet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die `access_log` Direktive in Nginx ist aktiviert. Die `error_log` Direktive ist auf der Standardeinstellung 'error' belassen, wodurch weniger detaillierte Fehlermeldungen nicht protokolliert werden. Logrotate ist konfiguriert, aber die archivierten Logs werden nicht weiter analysiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Webserver-Konfigurationsdateien bezüglich der Log-Level. Einsehen der existierenden Log-Dateien auf dem Server."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a4-m2",
                    "uuid": "3ec0e371-b6b5-47f8-b469-92dc22d7d4f4",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webserver ist so konfiguriert, dass er alle geforderten Ereignisse protokolliert: erfolgreiche Zugriffe, fehlgeschlagene Zugriffe aufgrund von Berechtigungsfehlern oder nicht vorhandenen Ressourcen sowie Server-Fehler. Die Log-Dateien werden lokal gespeichert und rotiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Log-Level wird so angepasst, dass auch 4xx- und 5xx-Fehler detailliert im Error-Log erscheinen. Das Log-Format wird eventuell angepasst, um zusätzliche Informationen wie den 'User-Agent' zu enthalten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Log-Konfiguration auf Vollständigkeit. Auslösen eines 404- (nicht gefunden) und eines 403- (verboten) Fehlers und Überprüfung, ob diese korrekt in den Logs erscheinen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a4-m3",
                    "uuid": "868bc97e-d5b1-47a4-a0af-6aa2bdac38c8",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webserver MUSS mindestens erfolgreiche Zugriffe, fehlgeschlagene Zugriffe (aufgrund mangelnder Berechtigung, nicht vorhandener Ressourcen und Server-Fehlern) sowie allgemeine Fehlermeldungen protokollieren. Die Protokollierungsdaten SOLLTEN regelmäßig ausgewertet werden. Um die Logs vor Manipulation zu schützen, werden sie an einen zentralen Log-Server gesendet."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Log-Shipper wie Filebeat oder rsyslog wird auf dem Webserver installiert, um alle relevanten Log-Dateien an einen zentralen ELK-Stack oder Graylog-Server zu senden. Es gibt einen dokumentierten Prozess, bei dem ein Administrator wöchentlich die Dashboards im Log-Management-System auf Anomalien prüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Konfiguration des Log-Shippers. Verifizieren auf dem zentralen Log-Server, dass die Logs des Webservers ankommen. Einfordern der Protokolle der wöchentlichen Log-Reviews."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a4-m4",
                    "uuid": "0287e88a-5d07-4151-8d9a-4ac4cb2493aa",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die zentral gesammelten Protokolldaten werden durch automatisierte Regeln und Dashboards überwacht. Bei kritischen Ereignissen, wie einer Häufung von 403-Fehlern oder serverseitigen 5xx-Fehlern, werden automatisch Alerts an das zuständige Team gesendet. Die Auswertung der Logs wird dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Im zentralen Log-Management-System (z.B. Splunk, Graylog) werden Alerts konfiguriert, die bei mehr als X Fehlern pro Minute eine E-Mail oder eine Slack-Nachricht senden. Es werden Dashboards erstellt, die die wichtigsten Metriken (Top-Fehler, Traffic-Quellen etc.) visualisieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der konfigurierten Alerting-Regeln im Log-Management-System. Auslösen einer Serie von Fehlern und Überprüfung, ob ein Alert generiert wird. Einsicht in die Log-Review-Protokolle."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a4-m5",
                    "uuid": "793a076e-4c94-4dda-84ec-5917f50eb8df",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Webserver-Logs werden in Echtzeit in ein Security Information and Event Management (SIEM) System eingespeist. Das SIEM verwendet fortgeschrittene Korrelationsregeln und Machine-Learning-Modelle, um komplexe Angriffsmuster (z.B. Slow-Brute-Force-Angriffe, Web-Scanning-Aktivitäten) zu erkennen und hochzuverlässige Alarme für das Security Operations Center (SOC) zu generieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Logs werden mit einem Web Application Firewall (WAF) Log und anderen Datenquellen im SIEM korreliert. Eine User and Entity Behavior Analytics (UEBA) Komponente lernt das normale Verhalten und erkennt Abweichungen, z.B. wenn ein Benutzer plötzlich eine hohe Anzahl von Fehlern generiert. Alarme werden automatisch in ein SOAR-System zur weiteren Bearbeitung eingespeist."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Korrelationsregeln und ML-Modelle im SIEM. Durchführen einer simulierten Angriffssequenz (z.B. mit einem Web-Scanner) und Überprüfung, ob ein entsprechender, korrelierter Alarm im SIEM generiert wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ce7ac9f0-30c2-4a75-a7c4-346a1397d8b1",
                "control-id": "DET.4.13",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.2.a18-m1",
                    "uuid": "46b4f3b0-7bae-4830-a971-5412d5cd97e3",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Grundlegende Serverleistungsmetriken wie CPU- und Speicherauslastung werden überwacht. Es sind keine spezifischen Schutzmaßnahmen gegen DoS-Angriffe vorhanden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Monitoring-Tool wie Nagios oder Zabbix überwacht die CPU-Last des Webservers und sendet einen Alarm, wenn diese 90% überschreitet. Die Reaktion auf einen DoS-Angriff wäre rein reaktiv."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Konfiguration des Monitoring-Systems. Nachfrage nach Plänen und Maßnahmen zum Schutz vor DoS-Angriffen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a18-m2",
                    "uuid": "f1112ac3-624f-4619-9b19-b2931ac6ee6d",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webserver und die Firewall sind mit grundlegendem Rate-Limiting konfiguriert, um einfache DoS-Angriffe abzuschwächen. Die Gesundheit und Verfügbarkeit des Servers werden überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Das `limit_req_module` von Nginx wird verwendet, um die Anzahl der Anfragen pro IP-Adresse zu begrenzen. Die Firewall hat Regeln, um die Rate von neuen Verbindungen zu drosseln. Ein Ping-Check überwacht die Erreichbarkeit des Servers."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Rate-Limiting-Konfiguration auf Webserver und Firewall. Analyse der Wirksamkeit gegen einfache DoS-Tools in einer Testumgebung."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a18-m3",
                    "uuid": "72445867-b8d7-44f4-a726-ae10a8a2f317",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webserver SOLLTE ständig auf Leistung und Verfügbarkeit überwacht werden. Es SOLLTEN Maßnahmen definiert und umgesetzt werden, die DDoS-Angriffe verhindern oder zumindest abschwächen. Dies wird durch eine Kombination aus lokaler Härtung und einem reaktiven (on-demand) DDoS-Schutzdienst realisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Umfassendes Performance-Monitoring ist etabliert. Es existiert ein formaler Plan zur Abwehr von DDoS-Angriffen. Dieser Plan beinhaltet einen Vertrag mit einem DDoS-Mitigation-Anbieter, der im Angriffsfall den Traffic über sein Scrubbing-Center umleitet. Dieser Prozess wird manuell initiiert, wenn der Angriff erkannt wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung des DDoS-Abwehrplans und des Vertrags mit dem Mitigation-Anbieter. Analyse der definierten Schwellenwerte und Prozesse zur Aktivierung des Schutzes. Befragung des Teams zum Ablauf im Ernstfall."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a18-m4",
                    "uuid": "6b6a88b0-aaa5-4669-bd6d-dd82565e3dc6",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein 'Always-on'-DDoS-Schutzdienst wird eingesetzt, der volumetrische und protokollbasierte Angriffe automatisch am Netzwerkrand erkennt und abwehrt, bevor sie die Infrastruktur der Organisation erreichen. Eine Web Application Firewall (WAF) wird zum Schutz vor Application-Layer-DoS-Angriffen (Layer 7) eingesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der gesamte Traffic wird permanent durch einen Dienst wie Cloudflare Spectrum oder AWS Shield Advanced geleitet. Eine WAF ist mit Regeln gegen Application-Layer-Angriffe wie Slowloris, HTTP-Floods oder ressourcenintensive API-Aufrufe (z.B. komplexe Suchen) konfiguriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Konfiguration des DDoS-Schutzdienstes und der WAF. Analyse der Berichte über abgewehrte Angriffe. Durchführung von simulierten Layer-7-DoS-Angriffen gegen eine Test-Schnittstelle."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a18-m5",
                    "uuid": "06a0e030-e228-4528-a02c-30bfa886bb0a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein hybrides DDoS-Schutzmodell wird verwendet, das On-Premise-Appliances zur sofortigen Abwehr von kleineren Angriffen mit einem Cloud-basierten Scrubbing-Dienst für großvolumige Angriffe kombiniert. Das System nutzt Machine Learning, um eine Baseline des normalen Traffics zu erstellen und kann so Zero-Day-Application-Layer-DoS-Angriffe automatisch erkennen und abwehren. Die Wirksamkeit der Abwehrmaßnahmen wird regelmäßig durch DDoS-Angriffssimulationen getestet."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine On-Premise-DDoS-Appliance (z.B. von Radware oder Arbor Networks) schützt vor kleineren Angriffen. Bei größeren Angriffen wird der Traffic automatisch per BGP an einen Cloud-Scrubbing-Anbieter umgeleitet. Die WAF nutzt Verhaltensanalyse, um anomale Anfragemuster zu erkennen. Es werden jährlich geplante DDoS-Tests mit einem spezialisierten Anbieter durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Architektur des hybriden Schutzmodells. Analyse der Konfiguration der Verhaltensanalyse-Engine. Anforderung und Auswertung der Berichte der durchgeführten DDoS-Tests und der daraus resultierenden Verbesserungsmaßnahmen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e2e76f98-c49e-4b5f-b651-fcc9d5bb6e4e",
                "control-id": "DEV.3.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.2.a12-m1",
                    "uuid": "2619b424-91c0-4e62-ba8c-6b7c4ab3838c",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden die Standard-Fehlerseiten des Webservers oder des Anwendungsframeworks verwendet. Diese geben oft detaillierte Fehlermeldungen, Stack-Traces und Versionsinformationen an den Benutzer aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Debug-Modus einer Anwendung (z.B. Django, ASP.NET) werden detaillierte Fehlerseiten angezeigt, und dieser Modus wird versehentlich auf dem Produktionsserver belassen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Auslösen eines Fehlers auf der Webseite (z.B. durch Aufruf einer nicht existierenden Seite oder Eingabe ungültiger Daten) und Analyse der angezeigten Fehlerseite auf verräterische Informationen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a12-m2",
                    "uuid": "061b875f-8d7f-40bd-b8d6-118391f99f6c",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Benutzerdefinierte Fehlerseiten sind konfiguriert, um die Anzeige von Stack-Traces zu verhindern. Die Server-Versions-Banner im HTTP-Header werden jedoch noch gesendet."
                      },
                      {
                        "name": "guidance",
                        "value": "Im Webserver sind benutzerdefinierte Seiten für die Fehlercodes 404 und 500 konfiguriert (`ErrorDocument` in Apache). Die Direktive `ServerTokens` ist aber noch auf 'Prod' oder 'OS' gesetzt, wodurch die Server-Version sichtbar bleibt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der HTTP-Header der Server-Antwort (z.B. mit `curl -I http://example.com`) auf das Vorhandensein von `Server` oder `X-Powered-By` Headern."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a12-m3",
                    "uuid": "e1a768c0-6e0f-44d9-a9c1-74f684f095ca",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Aus den HTTP-Informationen und den angezeigten Fehlermeldungen SOLLTEN weder der Produktname noch die verwendete Version des Webservers ersichtlich sein. Es SOLLTEN nur allgemeine Fehlermeldungen ausgegeben werden, die keine Details zu Systeminformationen enthalten. Die Fehlermeldung SOLLTE ein eindeutiges Merkmal (z.B. eine Korrelations-ID) enthalten, das dem IT-Betrieb die Nachvollziehbarkeit des Fehlers ermöglicht. Es SOLLTE sichergestellt sein, dass der Server nach einem unerwarteten Fehler nicht in einem anfälligen Zustand verbleibt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Webserver-Konfiguration wird gehärtet, um alle Versionsinformationen zu unterdrücken (z.B. `ServerTokens Prod` und `Header unset X-Powered-By` in Apache). Die Anwendung generiert bei einem Fehler eine eindeutige ID, zeigt diese dem Benutzer auf einer generischen Fehlerseite an ('Es ist ein Fehler aufgetreten. Bitte kontaktieren Sie den Support mit der ID: XYZ-123') und schreibt dieselbe ID zusammen mit dem detaillierten Stack-Trace in das serverseitige Log."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der HTTP-Header und Fehlerseiten auf Informationslecks. Auslösen eines Fehlers und Überprüfung, ob eine Korrelations-ID angezeigt wird. Anschließend Überprüfung der serverseitigen Logs, um zu verifizieren, dass der Fehler mit derselben ID und allen Details protokolliert wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a12-m4",
                    "uuid": "2b48250c-1203-4522-8d84-f133d7e2eb39",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein zentrales Fehlerbehandlungs-Framework in der Anwendung stellt sicher, dass alle Ausnahmen (Exceptions) korrekt abgefangen werden und der Anwendungsprozess nach einem Absturz ordnungsgemäß beendet und neu gestartet wird. Eine Web Application Firewall (WAF) wird zusätzlich eingesetzt, um ausgehende Antworten zu filtern und eventuell doch durchgerutschte sensible Informationen zu entfernen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein globales Exception-Handling-Modul wird in der Anwendung implementiert. Ein Prozess-Manager wie `systemd` oder `pm2` sorgt dafür, dass abgestürzte Anwendungsprozesse automatisch neu gestartet werden. Eine WAF (z.B. ModSecurity) wird mit Regeln konfiguriert, die das Austreten von Fehler-Signaturen (z.B. 'SQL syntax error') im Response-Body verhindern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Code-Review des Fehlerbehandlungs-Frameworks. Überprüfung der WAF-Regeln zum Schutz vor Informationslecks. Simulation eines Anwendungsabsturzes und Überprüfung, ob der Prozess automatisch neu gestartet wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a12-m5",
                    "uuid": "543e9e9b-ee05-4236-98ff-f41cfaa66e82",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein umfassendes Exception-Handling-Framework ist im gesamten Anwendungsstack etabliert. Das Verhalten des Systems unter verschiedenen Fehlerbedingungen (z.B. Datenbank nicht erreichbar, Dateisystem voll) wird aktiv mittels Chaos-Engineering-Prinzipien getestet, um die Widerstandsfähigkeit und Sicherheit zu gewährleisten und Informationslecks unter allen Umständen zu verhindern."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle Fehler werden strukturiert (z.B. als JSON) und mit Korrelations-IDs an ein zentrales Log-Management-System gesendet. Tools wie der Chaos Monkey oder Gremlin werden in einer Staging-Umgebung eingesetzt, um gezielt Systemkomponenten ausfallen zu lassen und zu testen, wie die Anwendung darauf reagiert und welche Fehler sie dem Benutzer anzeigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der strukturierten Log-Ausgaben. Anforderung und Auswertung der Protokolle und Ergebnisse der Chaos-Engineering-Tests."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "94ca975d-b072-4aa7-8550-767a8e6fd095",
                "control-id": "DEV.3.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.2.a5-m1",
                    "uuid": "4e119277-e315-4768-9304-e4261f9e56f9",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Passwörter werden auf dem Webserver gespeichert, aber sie werden nur mit einem veralteten oder unsicheren Hashing-Algorithmus wie MD5 oder SHA1 ohne Salt gespeichert."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Altanwendung nutzt eine `.htpasswd`-Datei, die mit dem `htpasswd -d` (CRYPT) oder `-m` (MD5) Algorithmus erstellt wurde. Im Code wird eine Funktion wie `md5($password)` verwendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Passwort-Speicherungsmechanismen, z.B. durch Einsicht in den relevanten Quellcode oder die Konfiguration von Authentisierungsmodulen. Überprüfung der Passwort-Hashes in der Datenbank oder `.htpasswd`-Datei auf ihr Format."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a5-m2",
                    "uuid": "86b4c8e4-f415-4a5d-a2b7-0aaaedbf3dbd",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Passwörter werden unter Verwendung eines Standard-Hashing-Algorithmus wie SHA-256 mit einem benutzerspezifischen Salt gespeichert. Die Passwortdatei ist vor unbefugtem Lesen geschützt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Anwendung generiert für jeden Benutzer einen zufälligen Salt und speichert `hash('sha256', $password . $salt)`. Die Datei, in der die Hashes gespeichert sind, ist nur für den Webserver-Prozess lesbar."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung des Quellcodes, um sicherzustellen, dass für jeden Benutzer ein einzigartiger Salt verwendet und mit einem starken Hash-Algorithmus kombiniert wird. Prüfung der Dateiberechtigungen der Passwortdatei."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a5-m3",
                    "uuid": "7092687d-0fd3-424e-b8af-014ecf20d1d0",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wenn sich Clients mit Hilfe von Passwörtern am Webserver authentisieren, MÜSSEN diese kryptografisch gesichert gespeichert werden. Hierfür MUSS eine moderne, adaptive Passwort-Hashing-Funktion wie Argon2, scrypt oder bcrypt verwendet werden. Die Passwort-Hashes MÜSSEN vor unbefugtem Zugriff geschützt gespeichert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Anwendung verwendet eine Standard-Bibliothek (z.B. `password_hash()` in PHP mit `PASSWORD_ARGON2ID` oder `PASSWORD_BCRYPT`), die die Erzeugung von Salt und das Hashing sicher handhabt. Die Konfigurationsparameter (z.B. cost-Faktor) sind auf einen aktuellen, sicheren Wert eingestellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung des Quellcodes auf die Verwendung einer empfohlenen, adaptiven Hashing-Funktion. Verifizieren der verwendeten Parameter (z.B. Cost-Faktor für bcrypt, Memory/Time-Kosten für Argon2) auf Angemessenheit. Automatisiert kann ein Quellcode-Scanner nach veralteten Hash-Funktionen suchen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a5-m4",
                    "uuid": "e6e22a3b-4ef6-426b-a57c-b400fa1220d4",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zur sicheren Speicherung der Passwörter werden serverseitige Mechanismen zum Schutz vor Brute-Force-Angriffen implementiert. Dazu gehören eine fehlgeschlagene Anmeldeversuchserkennung mit anschließender Account-Sperrung oder Verzögerung."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Tool wie `fail2ban` wird eingesetzt, um die Log-Dateien auf fehlgeschlagene Logins zu überwachen und die IP-Adressen von Angreifern temporär auf der Firewall zu sperren. Alternativ implementiert die Anwendung selbst eine Logik, die nach mehreren Fehlversuchen das Konto sperrt oder ein CAPTCHA anzeigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Konfiguration von `fail2ban` oder der anwendungsspezifischen Schutzmechanismen. Durchführen eines Test-Brute-Force-Angriffs mit mehreren falschen Passwörtern und Überprüfung, ob die IP-Adresse gesperrt oder der Account blockiert wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a5-m5",
                    "uuid": "c30f5f3d-2ca3-4761-adb4-a9c809975dbe",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Authentisierung wird vollständig an eine zentrale, gehärtete Identity and Access Management (IAM) Lösung ausgelagert, die standardmäßig Multi-Faktor-Authentisierung (MFA) erzwingt. Passwörter werden auf dem Webserver selbst nicht mehr verarbeitet oder gespeichert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Webanwendung wird als Client (Service Provider) für ein zentrales IAM-System konfiguriert, das Protokolle wie OpenID Connect (OIDC) oder SAML 2.0 unterstützt (z.B. Keycloak, Microsoft Entra ID). Alle Benutzer müssen sich über dieses zentrale System authentifizieren, das MFA durchsetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Konfiguration der OIDC/SAML-Integration. Verifizieren, dass ein Login ohne MFA nicht möglich ist. Sicherstellen, dass keine lokalen Passwort-Datenbanken mehr auf dem Webserver existieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e5dc08e4-4431-460c-af9d-2f738be0dd3d",
                "control-id": "KONF.10.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.2.a1-m1",
                    "uuid": "5bb0d260-ecd1-49d1-b4c3-dbb118eff060",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webserver ist installiert, aber es werden nur vereinzelte Sicherheitseinstellungen vorgenommen, wie z.B. die Deaktivierung offensichtlich unnötiger Module. Die Konfiguration ist weitgehend im Standardzustand und die Prozessrechte sind nicht minimal."
                      },
                      {
                        "name": "guidance",
                        "value": "Auf einem neu installierten Apache- oder Nginx-Server werden nur einige wenige Module aus der Standardinstallation deaktiviert. Es wird kein dedizierter, unprivilegierter Benutzer für den Webserver-Prozess erstellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen, ob die Konfiguration des Webservers im Wesentlichen der Standardinstallation entspricht. Verifizieren, ob der Webserver-Prozess mit erhöhten Rechten (z. B. als 'nobody' oder 'www-data' ohne weitere Einschränkungen) läuft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a1-m2",
                    "uuid": "73173cf6-69e2-400c-8d52-8e071e7ee092",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webserver-Prozess wird grundsätzlich unter einem Konto mit minimalen Rechten ausgeführt. Alle offensichtlich nicht benötigten Module und Funktionen werden manuell deaktiviert. Die Schreibberechtigungen im Web-Verzeichnis sind auf das Notwendigste reduziert."
                      },
                      {
                        "name": "guidance",
                        "value": "Für den Webserver wird ein dedizierter Systembenutzer mit eingeschränkten Rechten angelegt. Eine Liste nicht benötigter Module wird manuell abgearbeitet und diese werden in der Konfiguration deaktiviert. Die Berechtigungen im Document-Root werden manuell auf read-only für den Webserver-Benutzer gesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Verifizieren, dass der Webserver-Prozess unter einem dedizierten, unprivilegierten Benutzerkonto läuft. Überprüfen der Liste der geladenen Module und Vergleich mit der Liste der benötigten Module. Prüfen der Dateisystemberechtigungen für den Web-Content."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a1-m3",
                    "uuid": "294b5c8b-82b2-407f-b92d-b91dae76d08d",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS eine dokumentierte, sichere Grundkonfiguration für den Webserver geben, die systematisch angewendet wird. Der Webserver-Prozess MUSS einem Konto mit minimalen Rechten zugewiesen werden. Alle nicht benötigten Module, Funktionen und Schreibberechtigungen MÜSSEN deaktiviert bzw. entzogen werden. Der Webserver SOLLTE in einer gekapselten Umgebung oder auf einem dedizierten System ausgeführt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Härtungsskript oder ein Konfigurationsmanagement-Playbook (z. B. Ansible) wird verwendet, um eine standardisierte, sichere Konfiguration auszurollen. Dies beinhaltet das Anlegen eines 'nologin'-Benutzers, die Deaktivierung einer Whitelist von Modulen und das Setzen von strikten Dateiberechtigungen. Die Konfiguration, den Webserver in einem Docker-Container (gekapselte Umgebung) zu betreiben, wird als Standardverfahren festgelegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen der Existenz und des Inhalts des Dokuments zur sicheren Grundkonfiguration. Audit der ausgerollten Konfiguration gegen dieses Dokument. Verifizieren, dass der Webserver in einer gekapselten Umgebung (z.B. per `docker ps` oder `systemd-nspawn --list`) oder auf einem dedizierten (virtuellen) Server läuft. Automatisiert kann dies durch einen Konfigurations-Scan gegen ein vordefiniertes Profil (z.B. mit OpenSCAP) geprüft werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a1-m4",
                    "uuid": "446b4d83-d8d0-4458-9480-a4cac8d60b1d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die sichere Konfiguration wird durch ein Konfigurationsmanagementsystem erzwungen und überwacht. Der Webserver wird standardmäßig in einer gekapselten Umgebung (z.B. Container oder chroot-Jail) ausgeführt. Die Konformität der Konfiguration wird regelmäßig automatisiert überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Puppet, Chef oder Ansible werden im Enforcing-Modus betrieben, um Konfigurationsabweichungen automatisch zu korrigieren. Die Container-Images für den Webserver basieren auf gehärteten Minimal-Images (z.B. distroless oder Alpine Linux). Regelmäßige Scans mit Tools wie OpenSCAP oder lynis prüfen die Konfiguration und melden Abweichungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Review der Konfigurationsmanagement-Regeln. Überprüfung der Berichte der automatisierten Konformitäts-Scans. Verifizieren, dass die genutzten Container-Images einer definierten Härtungsrichtlinie entsprechen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a1-m5",
                    "uuid": "986e05fc-0797-4f63-aea2-e3d3ecaa9fe7",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die sichere Konfiguration wird durch ein vollautomatisches Konfigurationsmanagementsystem durchgesetzt. Die Webserver werden in minimalen, schreibgeschützten Containern ausgeführt, die durch strikte Mandatory Access Control (MAC) Profile wie SELinux oder AppArmor zusätzlich abgesichert sind. Jegliche Konfigurationsabweichung führt zu einem automatisierten Alert und ggf. zur Neuinstanziierung des Dienstes aus einem sauberen Image."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Kubernetes-Cluster mit Pod Security Policies oder Gatekeeper wird verwendet, um die Ausführung von Containern auf Basis von gehärteten Richtlinien zu erzwingen. Die Container-Dateisysteme werden als read-only gemountet. Maßgeschneiderte SELinux-Profile werden für die Webserver-Container erstellt und durchgesetzt. Ein SIEM korreliert Konfigurations-Scan-Ergebnisse mit Laufzeit-Events."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Audit der Kubernetes-Sicherheitsrichtlinien (z.B. Gatekeeper-Policies). Überprüfung der SELinux/AppArmor-Profile auf ihre Wirksamkeit. Verifizieren des automatisierten Response-Prozesses durch gezielte, absichtliche Fehlkonfiguration in einer Testumgebung."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "9b684e25-108a-47fb-a870-a04af652b1d3",
                "control-id": "KONF.10.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.2.a14-m1",
                    "uuid": "b492cc87-425b-4bea-b895-5eac30415232",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Integrität von Web-Dateien wird nur manuell und bei Verdacht auf eine Kompromittierung geprüft. Ein Virenscan auf dem Server wird unregelmäßig durchgeführt."
                      },
                      {
                        "name": "guidance",
                        "value": "Wenn eine Webseite verunstaltet aussieht, vergleicht ein Administrator die Dateien manuell mit einem Backup. Ein Antiviren-Scan wird nur nach einem Sicherheitsvorfall gestartet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Befragung der Administratoren nach ihren Prozessen zur Integritätsprüfung und zum Scannen nach Schadsoftware."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a14-m2",
                    "uuid": "ff655db5-c1aa-4fd5-832a-da4b7e551974",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein geplanter Task führt wöchentlich einen Virenscanner über das Web-Verzeichnis aus. Konfigurationsdateien werden sporadisch manuell auf Änderungen überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Cron-Job startet wöchentlich einen `clamscan` über das Verzeichnis `/var/www`. Ein Administrator schaut gelegentlich in die Nginx-Konfigurationsdateien, um zu sehen, ob etwas geändert wurde."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Konfiguration des geplanten Virenscan-Tasks und Einsicht in die letzten Scan-Berichte."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a14-m3",
                    "uuid": "340f9d54-afcc-4c00-bdf6-c6d487a80e23",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der IT-Betrieb SOLLTE regelmäßig prüfen, ob die Konfigurationen des Webservers und die von ihm bereitgestellten Dateien noch integer sind und nicht durch Angriffe verändert wurden. Die zur Veröffentlichung vorgesehenen Dateien SOLLTEN regelmäßig auf Schadsoftware geprüft werden. Dies wird durch den Einsatz eines File Integrity Monitoring (FIM) Werkzeugs und regelmäßige, geplante Virenscans umgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein FIM-Tool wie AIDE oder Wazuh wird eingesetzt. Es wird eine Baseline der kritischen Konfigurations- und Inhaltsdateien erstellt und täglich ein Scan durchgeführt, der einen Bericht über alle Änderungen generiert. Zusätzlich läuft ein täglicher, geplanter Virenscan über das gesamte Web-Verzeichnis."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der FIM-Konfiguration und der generierten Berichte. Überprüfung der Konfiguration und der Protokolle der regelmäßigen Virenscans. Testweise Änderung einer überwachten Datei und Überprüfung, ob die Änderung im nächsten FIM-Bericht erscheint."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a14-m4",
                    "uuid": "c413cd34-8f35-4214-b2b2-a67d25ae60af",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das FIM-Tool ist so konfiguriert, dass es bei Erkennung einer unautorisierten Änderung an kritischen Dateien eine Echtzeit-Alarmierung an das Sicherheitsteam sendet. Der Virenscan wird in die CI/CD-Pipeline integriert, sodass Inhalte automatisch vor dem Deployment in die Produktionsumgebung gescannt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Wazuh ist so konfiguriert, dass FIM-Alarme direkt als E-Mail oder Slack-Nachricht an das zuständige Team gesendet werden. Im Jenkins- oder GitLab-CI-Pipeline-Skript wird ein Schritt hinzugefügt, der den Build-Artefakt vor dem Deployment mit `clamscan` scannt. Ein fehlgeschlagener Scan bricht das Deployment ab."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Echtzeit-Alarmierungskonfiguration des FIM-Systems. Einsicht in die CI/CD-Pipeline-Konfiguration, um den Scan-Schritt zu verifizieren. Testen des Deployments eines infizierten Artefakts (mit EICAR) und Überprüfung, ob es blockiert wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a14-m5",
                    "uuid": "a6dda9ba-0670-421c-9b3e-3ae7ca98d0fe",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das FIM-System ist vollständig in ein SIEM und ein SOAR-System integriert. Kritische Dateiänderungen lösen eine automatisierte Reaktion aus, wie z.B. das Zurücksetzen der Datei aus der Versionskontrolle oder das automatische Isolieren des Servers. Zusätzlich zu statischen Scans überwacht eine Endpoint Detection and Response (EDR) Lösung den Server auf bösartige Prozesse und Verhaltensweisen in Echtzeit."
                      },
                      {
                        "name": "guidance",
                        "value": "FIM-Alarme im SIEM lösen ein SOAR-Playbook aus, das versucht, die geänderte Datei automatisch aus dem Git-Repository wiederherzustellen. Schlägt dies fehl, wird der Server aus dem Load Balancer genommen. Ein EDR-Agent (z.B. CrowdStrike Falcon, SentinelOne) ist auf dem Server installiert und überwacht die Prozessausführungen und Netzwerkverbindungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der SIEM/SOAR-Integrations- und Automatisierungs-Playbooks. Überprüfung der EDR-Konfiguration und der Erkennungs-Logs. Durchführung eines Tests, bei dem eine verdächtige Aktivität (z.B. Ausführen eines Mimikatz-ähnlichen Tools) simuliert und die Reaktion des EDR- und SOAR-Systems beobachtet wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "182ed9a9-0094-4755-97cc-7857406ee596",
                "control-id": "KONF.14.1.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.2.a11-m1",
                    "uuid": "a48d5072-65e7-4c85-b2d1-e76134e6b116",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "HTTPS ist auf dem Webserver aktiviert, aber die Konfiguration ist schwach. Es werden veraltete Protokolle wie SSLv3 oder TLS 1.0/1.1 sowie unsichere Cipher Suites (z.B. solche mit RC4) noch unterstützt. Auf einigen Seiten tritt Mixed Content auf."
                      },
                      {
                        "name": "guidance",
                        "value": "Die TLS-Konfiguration des Webservers ist im Auslieferungszustand des Betriebssystems belassen worden, was oft eine breite Kompatibilität auf Kosten der Sicherheit bedeutet. Inhalte werden teilweise über `http://` statt `https://` eingebunden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Verwendung eines Online-Tools wie der SSL Labs Server Test, um die TLS-Konfiguration zu prüfen. Ein Ergebnis schlechter als 'A' deutet auf Schwachstellen hin. Manuelles Prüfen der Webseite auf Mixed-Content-Warnungen in der Browser-Konsole."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a11-m2",
                    "uuid": "bee745c9-ae3f-4580-9f4c-a44d0041c7ef",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webserver ist so konfiguriert, dass er HTTPS mit mindestens TLS 1.2 und einer Reihe sicherer Cipher Suites anbietet. Veraltete Protokolle sind deaktiviert. Ein manueller Prozess stellt sicher, dass auf neuen Seiten kein Mixed Content entsteht."
                      },
                      {
                        "name": "guidance",
                        "value": "In der Webserver-Konfiguration werden die Protokolle explizit auf `TLSv1.2 TLSv1.3` gesetzt und eine empfohlene Cipher-Liste (z.B. von Mozilla) wird übernommen. Redakteure werden angewiesen, bei der Einbindung von Inhalten immer HTTPS-URLs zu verwenden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Erneute Prüfung mit dem SSL Labs Server Test, um die Deaktivierung alter Protokolle zu verifizieren. Stichprobenartige Prüfung neuer Seiten auf Mixed Content."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a11-m3",
                    "uuid": "e5fa5ea7-c4b2-4e3e-81f5-288cb8b1cf44",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Webserver MUSS für alle Verbindungen durch nicht vertrauenswürdige Netze eine sichere Verschlüsselung über TLS anbieten (HTTPS) und nur starke Protokolle (TLS 1.2, TLS 1.3) und Cipher Suites gemäß aktuellen Empfehlungen (z.B. BSI TR-02102-2) unterstützen. Wenn eine HTTPS-Verbindung genutzt wird, MÜSSEN alle Inhalte über HTTPS ausgeliefert werden; sogenannter Mixed Content DARF NICHT verwendet werden. HTTP-Anfragen werden automatisch auf HTTPS umgeleitet."
                      },
                      {
                        "name": "guidance",
                        "value": "Die TLS-Konfiguration wird explizit gehärtet und orientiert sich an den Vorgaben des BSI oder anderer anerkannter Quellen. Eine Content Security Policy (CSP) mit der Direktive `block-all-mixed-content` wird per HTTP-Header ausgeliefert, um das Laden von Mixed Content im Browser zu unterbinden. Eine permanente (301) Umleitung von HTTP auf HTTPS ist konfiguriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Webserver-Konfiguration auf die eingestellten Protokolle und Cipher Suites. Überprüfung der gesendeten HTTP-Header auf eine korrekte CSP. Testen, ob eine Anfrage an `http://` korrekt mit einem 301-Statuscode auf `https://` umgeleitet wird. Ein SSL Labs Test sollte mindestens die Note 'A' erreichen."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a11-m4",
                    "uuid": "9ad8de93-5b7b-47c2-b90b-e5aebe36a63e",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zur starken TLS-Konfiguration wird der HTTP Strict Transport Security (HSTS) Header mit einer langen `max-age` und der `includeSubDomains` Direktive verwendet, um den Browser anzuweisen, ausschließlich über HTTPS zu kommunizieren. OCSP Stapling ist aktiviert, um die Performance und den Datenschutz beim Abruf des Zertifikatstatus zu verbessern."
                      },
                      {
                        "name": "guidance",
                        "value": "Der HSTS-Header `Strict-Transport-Security: max-age=31536000; includeSubDomains` wird gesetzt. Die Konfiguration für OCSP Stapling wird im Webserver aktiviert und ein gültiger OCSP-Response wird regelmäßig abgerufen und mitgeliefert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der HTTP-Header auf das Vorhandensein und die korrekte Syntax des HSTS-Headers. Der SSL Labs Server Test wird verwendet, um die korrekte Implementierung von HSTS und OCSP Stapling zu verifizieren. Ein 'A+' Rating ist das Ziel."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a11-m5",
                    "uuid": "f5da95c0-f0dd-41bb-b06c-beb8d5b85d0d",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die HSTS-Richtlinie wird in die Preload-Listen der gängigen Browser eingetragen, um maximalen Schutz zu gewährleisten. Zusätzlich werden DNS Certification Authority Authorization (CAA) Records genutzt, um festzulegen, welche Zertifizierungsstellen Zertifikate für die Domain ausstellen dürfen. Die Einhaltung von Certificate Transparency (CT) wird aktiv überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Domain wird über hstspreload.org zur Preloading-Liste angemeldet. Im DNS werden CAA-Records für die autorisierten CAs eingetragen. Ein Dienst wie `crt.sh` oder kommerzielle CT-Monitoring-Dienste werden genutzt, um bei der Ausstellung neuer Zertifikate für die eigene Domain benachrichtigt zu werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung des HSTS-Preload-Status der Domain. Abfrage der DNS CAA-Records (z.B. mit `dig caa example.com`). Überprüfung der Konfiguration des CT-Monitoring-Dienstes."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "bc23509a-5c3c-448a-8746-6cbe7c2e2661",
                "control-id": "KONF.6.11",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.2.a3-m1",
                    "uuid": "f7ae7d33-13b1-463a-8d8e-395d11fd98ed",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine maximale Dateigröße für Uploads ist in der Webserver-Konfiguration festgelegt. Ein Virenscan von zum Download angebotenen Dateien wird nur sporadisch oder bei Verdacht durchgeführt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Parameter `upload_max_filesize` in der `php.ini` ist gesetzt. Es gibt keine formalisierte Prozedur für Virenscans von Dateien, die auf der Webseite zum Download angeboten werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung des Konfigurationsparameters für die maximale Upload-Größe. Nachfragen, ob und wie Dateien vor der Veröffentlichung auf Viren geprüft werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a3-m2",
                    "uuid": "06500a9d-4399-476d-8255-b80868510a9d",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Dateien, die zum Download bereitgestellt werden, werden vor der Veröffentlichung manuell mit einer Antiviren-Software gescannt. Für Uploads ist eine Maximalgröße und ein ausreichendes Speicherkontingent konfiguriert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Redakteur ist angewiesen, jede Datei vor dem Hochladen auf den Server mit dem lokalen Virenscanner zu prüfen. In der Webserverkonfiguration sind Limits für die Dateigröße und die Gesamtgröße des Upload-Verzeichnisses gesetzt, um eine DoS durch Speichererschöpfung zu verhindern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Arbeitsanweisung für Redakteure. Verifizieren der Konfiguration der Speicher- und Größenlimits für Uploads."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a3-m3",
                    "uuid": "df8f947b-f7fd-451f-9669-abcc5ca360f3",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS ein definierter Prozess existieren, bei dem alle hochgeladenen Dateien serverseitig auf Schadsoftware geprüft werden. Für alle zum Download bereitgestellten Dateien MUSS vor der Veröffentlichung ebenfalls ein Virenscan durchgeführt werden. Eine Maximalgröße für Datei-Uploads MUSS spezifiziert sein und es MUSS genügend Speicherplatz reserviert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Hochgeladene Dateien werden nach dem Upload-Vorgang automatisch durch eine serverseitige Antiviren-Engine wie ClamAV gescannt. Der Upload-Vorgang wird erst abgeschlossen, wenn der Scan erfolgreich war. Uploaded files are stored in a non-executable directory outside the web root. Speicherplatz wird durch Quotas auf dem Dateisystem limitiert und überwacht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung des Workflows für Datei-Uploads, inklusive der Anbindung an die Scan-Engine. Testen des Uploads mit einer EICAR-Testdatei und Überprüfung, ob dieser abgewiesen wird. Verifizieren der konfigurierten Quotas."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a3-m4",
                    "uuid": "7ae5655e-cde5-4f99-bfd4-6d1bb4691ddd",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zum Virenscan werden hochgeladene Dateien auf ihren Dateityp überprüft (Whitelist-Ansatz, Prüfung von Magic Bytes, nicht nur der Endung) und in einer isolierten Sandbox-Umgebung auf verdächtiges Verhalten analysiert, bevor sie freigegeben werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Anwendung prüft die ersten Bytes einer Datei, um den echten MIME-Typ zu bestimmen und gleicht ihn gegen eine Liste erlaubter Typen ab. Für risikoreiche Dateitypen (z.B. PDFs, Office-Dokumente) wird der Scan in einer Cuckoo Sandbox oder einem ähnlichen System durchgeführt, um dynamisches Verhalten zu analysieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung des Quellcodes oder der Konfiguration der Dateityp-Validierung. Versuch, eine Datei mit einer falschen Endung hochzuladen. Anfordern von Analyseberichten aus der Sandbox-Umgebung."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a3-m5",
                    "uuid": "58a02dcb-e974-4b72-87d8-253089c7fccd",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird eine Multi-Engine-Scanning-Lösung verwendet, um die Erkennungsrate zu maximieren. Zusätzlich wird für unterstützte Dateitypen eine Content Disarm and Reconstruction (CDR) Technologie eingesetzt. Diese entfernt proaktiv alle aktiven Inhalte (z.B. Makros, Skripte) aus den Dateien und stellt eine bereinigte, sichere Version der Datei zur Verfügung."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Dienst wie OPSWAT MetaDefender wird integriert, der Dateien mit über 30 Antiviren-Engines scannt und CDR durchführt. Die ursprüngliche Datei wird verworfen und nur die bereinigte Version wird im System weiterverarbeitet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Integration und Konfiguration der CDR-Lösung. Hochladen einer Testdatei, die harmlose Makros enthält, und Überprüfung, ob die resultierende Datei diese Makros nicht mehr enthält, der Inhalt aber erhalten geblieben ist."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "12235151-def1-43c9-9c70-6636b95f1f85",
                "control-id": "KONF.6.8",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.3.2.a2-m1",
                    "uuid": "3fd7d9a2-4e6a-4796-aa2b-b566b81598bc",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Berechtigungen für die Haupt-Web-Inhalte sind gesetzt, aber Konfigurationsdateien, Skripte oder Log-Dateien sind teilweise für unbefugte Benutzer lesbar. Das Auflisten von Verzeichnissen ist eventuell noch aktiviert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Web-Dateien werden mit `chmod -R 755` behandelt, was auch Schreibzugriff für den Besitzer auf Verzeichnisse erlaubt, wo es nicht nötig wäre. Die Konfigurationsoption `Options +Indexes` ist in der Apache-Konfiguration noch aktiv."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen, ob das Auflisten von Verzeichnissen durch Eingabe einer Verzeichnis-URL im Browser möglich ist. Manuelles Überprüfen der Berechtigungen von kritischen Konfigurationsdateien (z. B. `ls -l /etc/nginx/nginx.conf`)."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a2-m2",
                    "uuid": "2f859f86-7764-4aad-b652-bdb1260ddec1",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Dateiberechtigungen für alle Web-Inhalte, Skripte und Konfigurationsdateien sind manuell korrekt gesetzt, um unbefugtes Lesen und Schreiben zu verhindern. Das Auflisten von Verzeichnissen ist global deaktiviert. Es gibt einen manuellen Prozess, um regelmäßig zu prüfen, ob versehentlich vertrauliche Dateien im Web-Root liegen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Skript wird periodisch ausgeführt, um Dateiberechtigungen gemäß einer einfachen Richtlinie zu korrigieren. Die Direktive `Options -Indexes` wird global in der Apache-Konfiguration gesetzt. Ein Administrator durchsucht monatlich manuell die Web-Verzeichnisse nach Dateien mit verdächtigen Namen wie 'backup', '.zip' oder 'conf'."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen der globalen Konfiguration zur Deaktivierung der Verzeichnisauflistung. Stichprobenartige Prüfung der Dateiberechtigungen. Einholen von Nachweisen über die regelmäßigen manuellen Überprüfungen auf vertrauliche Dateien."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a2-m3",
                    "uuid": "0dab7b99-79b9-4658-b2df-0dd8603bb8f4",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS sichergestellt sein, dass alle Dateien auf dem Webserver vor unbefugtem Zugriff geschützt sind. Der Webserver MUSS so konfiguriert sein, dass Webanwendungen nur auf das definierte WWW-Wurzelverzeichnis zugreifen und keine Dateien außerhalb davon ausliefern können. Funktionen zum Auflisten von Verzeichnissen MÜSSEN deaktiviert sein. Es MUSS ein regelmäßiger Prozess zur Überprüfung auf fälschlicherweise veröffentlichte vertrauliche Dateien etabliert sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Webserver-Konfiguration nutzt eine `chroot`-ähnliche Funktionalität (z. B. `document_root` in PHP-FPM Pools) oder wird in einem Container betrieben, um den Zugriff auf das WWW-Wurzelverzeichnis zu beschränken. Dateiberechtigungen werden über ein Konfigurationsmanagement-Tool erzwungen. Ein dokumentierter, vierteljährlicher Prozess sieht vor, dass ein Verantwortlicher die Web-Verzeichnisse auf vertrauliche Daten prüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Webserver-Konfiguration auf `chroot`- oder andere Kapselungsmechanismen. Testen, ob ein Directory-Traversal-Angriff möglich ist (z. B. `http://example.com/../../etc/passwd`). Einfordern der Dokumentation und der Protokolle der regelmäßigen Überprüfungen. Automatisiert kann die Konfiguration durch einen Security-Scanner wie Nikto auf Directory-Listing und Traversal-Schwachstellen geprüft werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a2-m4",
                    "uuid": "8123ddfc-2822-4178-9302-55dd2d763dc9",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein File Integrity Monitoring (FIM) System wird eingesetzt, um unautorisierte Änderungen an Konfigurations- und Inhaltsdateien zeitnah zu erkennen und zu melden. Die Suche nach fälschlicherweise veröffentlichten vertraulichen Dateien wird durch automatisierte Skripts unterstützt, die nach bestimmten Mustern (z.B. 'private_key', 'password') suchen."
                      },
                      {
                        "name": "guidance",
                        "value": "Tools wie Wazuh, Samhain oder AIDE werden eingesetzt, um eine Baseline der Dateisystem-Hashes zu erstellen und täglich auf Änderungen zu prüfen. Ein Cron-Job führt regelmäßig ein Skript aus, das `grep` oder ähnliche Werkzeuge verwendet, um nach verdächtigen Mustern in den Web-Verzeichnissen zu suchen und einen Bericht zu erstellen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der Konfiguration und der Alarmierungsregeln des FIM-Systems. Anfordern und Auswerten der Berichte der automatisierten Dateiscans. Testweise eine Datei ändern und prüfen, ob ein FIM-Alarm generiert wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.3.2.a2-m5",
                    "uuid": "30c6d466-7863-4356-9f96-b3ce378a0036",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das FIM-System ist in ein zentrales SIEM integriert und löst automatisierte Reaktionen aus (z.B. Alarmierung des SOC, Quarantäne der Datei). Zusätzlich werden automatisierte Data Loss Prevention (DLP) Werkzeuge eingesetzt, die kontinuierlich den öffentlichen Web-Content auf sensible Informationsmuster (z.B. Kreditkartennummern, Personendaten) scannen und bei Fund sofort alarmieren."
                      },
                      {
                        "name": "guidance",
                        "value": "FIM-Agenten senden ihre Logs in Echtzeit an ein SIEM wie Splunk oder ELK Stack. Im SIEM sind Korrelationsregeln definiert, die bei kritischen Dateiänderungen sofort ein Ticket in einem SOAR-System erstellen. Ein DLP-Tool, entweder als eigenständige Lösung oder als Cloud-Dienst, scannt kontinuierlich die öffentliche Website."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfung der SIEM-Korrelationsregeln und SOAR-Playbooks für FIM-Events. Anfordern und Auswerten der DLP-Scan-Berichte. Durchführen eines kontrollierten Tests, bei dem eine Datei mit einem Test-Datenmuster (z.B. eine EICAR-ähnliche Testkreditkartennummer) auf den Webserver geladen wird, um die DLP-Reaktion zu verifizieren."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}