{
  "component-definition": {
    "uuid": "3069d189-da87-4e9f-b126-5a90dd6f5993",
    "metadata": {
      "title": "APP.3.1 Webanwendungen - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:07:58.564519+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "6614d080-0f12-461b-a27c-8ca72264b5f4",
        "type": "software",
        "title": "APP.3.1 Webanwendungen",
        "description": "This component represents the implementation of all controls for Baustein APP.3.1.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Webanwendungen bieten bestimmte Funktionen und dynamische (sich verändernde) Inhalte. Dazu nutzen Webanwendungen die Internetprotokolle HTTP (Hypertext Transfer Protocol) oder HTTPS. Bei HTTPS wird die Verbindung durch das Protokoll TLS (Transport Layer Security) kryptografisch abgesichert. Webanwendungen stellen auf einem Server Dokumente und Bedienoberflächen, z. B. in Form von Eingabemasken, bereit und liefern diese auf Anfrage an entsprechende Programme auf den Clients aus, wie z. B. an Webbrowser.\nWebservices sind Anwendungen, die das HTTP(S)-Protokoll verwenden, um Daten für andere Anwendungen bereitzustellen. In der Regel werden sie nicht unmittelbar durch Benutzende angesteuert.\nUm eine Webanwendung oder einen Webservice zu betreiben, sind in der Regel mehrere Komponenten notwendig. Üblich sind Webserver, um Daten auszuliefern und Applikationsserver, um die eigentliche Anwendung oder den Webservice zu betreiben. Außerdem werden zusätzliche Hintergrundsysteme benötigt, die oft als Datenquellen über unterschiedliche Schnittstellen angebunden sind, z. B. Datenbanken oder Verzeichnisdienste.\nWebanwendungen und Webservices werden sowohl in öffentlichen Datennetzen als auch in lokalen Netzen einer Institution (Intranet) eingesetzt, um Daten und Anwendungen bereitzustellen. In der Regel müssen sich Clients authentisieren, um auf eine Webanwendung oder einen Webservice zugreifen zu können."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es, Webanwendungen und Webservices sicher einzusetzen sowie Informationen zu schützen, die durch sie verarbeitet werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein ist auf jede Webanwendung und jeden Webservice anzuwenden, die im Informationsverbund eingesetzt werden."
          },
          {
            "name": "2.1. Unzureichende Protokollierung von sicherheitsrelevanten Ereignissen",
            "value": "Wenn sicherheitsrelevante Ereignisse von der Webanwendung oder dem Webservice unzureichend protokolliert werden, können diese unter Umständen zu einem späteren Zeitpunkt nur schwer nachvollzogen werden. Die Ursachen für ein Ereignis sind dann möglicherweise nicht mehr ermittelbar. So können z. B. kritische Fehler oder unerlaubte Änderungen in der Konfiguration der Webanwendung übersehen werden."
          },
          {
            "name": "2.2. Offenlegung sicherheitsrelevanter Informationen bei Webanwendungen und Webservices",
            "value": "Webseiten und Daten, die von einer Webanwendung oder einem Webservice generiert und ausgeliefert werden, können Informationen zu den Hintergrundsystemen enthalten, z. B. Angaben zu Datenbanken oder Versionsständen von Frameworks. Diese Informationen können es bei Angriffen erleichtern, gezielt Webanwendungen oder Webservices anzugreifen."
          },
          {
            "name": "2.3. Missbrauch einer Webanwendung durch automatisierte Nutzung",
            "value": "Wenn Funktionen einer Webanwendung oder eines Webservices automatisiert genutzt werden, können so zahlreiche Vorgänge in kurzer Zeit ausgeführt werden. Mithilfe eines wiederholt durchgeführten Login-Prozesses kann so z. B. versucht werden, gültige Kombinationen von Konten und Passwörtern zu erraten (Brute-Force). Außerdem kann eine Liste mit gültigen Konten erzeugt werden (Enumeration), falls die Webanwendung oder der Webservice Informationen über vorhandene Konten zurück gibt. Darüber hinaus können wiederholte Aufrufe von ressourcenintensiven Funktionen wie z. B. komplexen Datenbankabfragen für Denial-of-Service-Angriffe auf Anwendungsebene missbraucht werden."
          },
          {
            "name": "2.4. Unzureichende Authentisierung",
            "value": "Oft sollen spezielle Funktionen einer Webanwendung oder eines Webservices nur bestimmten Gruppen vorbehalten bleiben. Die entsprechenden Personen erhalten dann z. B. Konten, die exklusiv mit den notwendigen Zugriffsrechten ausgestattet sind. Unter diesen Konten authentisieren sich die Benutzenden zu Beginn jeder Sitzung in der Webanwendung oder dem Webservice, z. B. mit Kontoname und Passwort. Wird diese Authentisierung nicht korrekt konfiguriert, kann sie möglicherweise umgangen werden. Außerdem kann eine Webanwendung oder ein Webservice so konfiguriert werden, dass Zugangsdaten auf dem Webserver unsicher gespeichert werden. Im Falle eines erfolgreichen Angriffs verfügen Angreifende dann über große Mengen von Zugangsdaten, die sie auch an anderen Stellen einsetzen könnten."
          }
        ],
        "control-implementations": [
          {
            "uuid": "6325a1cf-c200-43d3-9a48-e93ea645954e",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/webanwendungen_profile.json",
            "description": "Implementation for all controls in Baustein APP.3.1",
            "implemented-requirements": [
              {
                "uuid": "2153fe57-dd6e-4ffb-8980-a60269d1efbd",
                "control-id": "BER.3.9",
                "description": "Implementation for BER.3.9 based on BSI APP.3.1.A7",
                "statements": [
                  {
                    "statement-id": "app.3.1-a7-m1",
                    "uuid": "9b0383da-dbb4-45d6-b6c7-dbca9adf0d05",
                    "description": "Es sind keine spezifischen Schutzmechanismen gegen die automatisierte Nutzung implementiert. Die Anwendung ist anfällig für einfache Brute-Force-Angriffe auf Login-Formulare oder Ressourcen-intensive Abfragen."
                  },
                  {
                    "statement-id": "app.3.1-a7-m2",
                    "uuid": "218725d5-2538-46fa-8b3d-f7312c292b34",
                    "description": "Ein einfacher Schutzmechanismus wie ein traditionelles CAPTCHA (z.B. mit verzerrtem Text) ist auf der Login-Seite implementiert. Es gibt eine einfache, serverweite Ratenbegrenzung."
                  },
                  {
                    "statement-id": "app.3.1-a7-m3",
                    "uuid": "58f6efae-1f86-47a3-b871-e1ac1b2d63fa",
                    "description": "Der IT-Betrieb MUSS sicherstellen, dass Webanwendungen und Webservices vor unberechtigter automatisierter Nutzung geschützt werden. Dabei MUSS jedoch berücksichtigt werden, wie sich die Schutzmechanismen auf die Nutzungsmöglichkeiten berechtigter Clients auswirken. Wenn die Webanwendung RSS-Feeds oder andere Funktionen enthält, die explizit für die automatisierte Nutzung vorgesehen sind, MUSS dies ebenfalls bei der Konfiguration der Schutzmechanismen berücksichtigt werden."
                  },
                  {
                    "statement-id": "app.3.1-a7-m4",
                    "uuid": "e263799a-8acf-4bc0-9c44-bfbe64448022",
                    "description": "Ein modernes, benutzerfreundliches Challenge-Response-System (z.B. unsichtbares reCAPTCHA) ist auf allen sensiblen, unauthentifizierten Endpunkten standardmäßig aktiv. Temporäre Sperren werden nicht nur pro IP-Adresse, sondern auch pro Benutzerkonto verhängt. Verdächtige automatisierte Zugriffsversuche werden protokolliert und lösen Alarme aus."
                  },
                  {
                    "statement-id": "app.3.1-a7-m5",
                    "uuid": "5f77daee-dd38-4795-bdc5-f48fc044eb35",
                    "description": "Eine dedizierte Bot-Management-Lösung wird eingesetzt, die mittels Geräte-Fingerprinting, Verhaltensanalyse und Reputationsdatenbanken zwischen menschlichen Nutzern, legitimen Bots (z.B. Suchmaschinen) und bösartigen Bots unterscheidet. Auf Basis dieser Klassifizierung werden granulare Zugriffsregeln und Gegenmaßnahmen automatisiert durchgesetzt."
                  }
                ]
              },
              {
                "uuid": "a6c2e223-60bd-4dfc-97a9-ef215efe46db",
                "control-id": "BES.2.1.3",
                "description": "Implementation for BES.2.1.3 based on BSI APP.3.1.A9",
                "statements": [
                  {
                    "statement-id": "app.3.1-a9-m3",
                    "uuid": "4bd56375-26cd-4df7-940b-05983e1d4872",
                    "description": "Zusätzlich zu den allgemeinen Aspekten der Beschaffung von Software SOLLTE die Institution mindestens folgendes bei der Beschaffung von Webanwendungen und Webservices berücksichtigen: sichere Eingabevalidierung und Ausgabekodierung, sicheres Session-Management, sichere kryptografische Verfahren, sichere Authentisierungsverfahren, sichere Verfahren zum serverseitigen Speichern von Zugangsdaten, geeignetes Berechtigungsmanagement, ausreichende Protokollierungsmöglichkeiten, regelmäßige Sicherheitsupdates durch den Entwickelnden der Software, Schutzmechanismen vor verbreiteten Angriffen auf Webanwendungen und Webservices sowie Zugriff auf den Quelltext der Webanwendung oder des Webservices."
                  },
                  {
                    "statement-id": "app.3.1-a9-m4",
                    "uuid": "a9af710d-db0f-467e-9a41-2361ff23793f",
                    "description": "Anbieter müssen im Rahmen des Beschaffungsprozesses Nachweise über ihren Secure Software Development Lifecycle (SSDLC) erbringen. Die zu beschaffende Software wird vor dem Kauf einer unabhängigen Sicherheitsüberprüfung oder einem Penetrationstest unterzogen. Vertraglich werden feste Fristen für die Bereitstellung von Sicherheitspatches vereinbart."
                  },
                  {
                    "statement-id": "app.3.1-a9-m5",
                    "uuid": "3774b16e-c7f6-4823-ad76-3ed06056e4e5",
                    "description": "Anbieter müssen eine vollständige Software Bill of Materials (SBOM) für das Produkt bereitstellen. Die Software durchläuft vor der finalen Abnahme intensive interne und externe Penetrationstests. Der Vertrag mit dem Anbieter enthält strenge SLAs für die Behebung von Schwachstellen sowie ein Auditrecht, das es der Institution erlaubt, die Entwicklungsprozesse des Anbieters zu überprüfen."
                  }
                ]
              },
              {
                "uuid": "c2a3c2e7-b256-4d3c-be79-ff0a38101a56",
                "control-id": "DEV.2.2",
                "description": "Implementation for DEV.2.2 based on BSI APP.3.1.A8",
                "statements": [
                  {
                    "statement-id": "app.3.1-a8-m1",
                    "uuid": "ce2c7eb9-b10d-4183-9048-c273c694a0bf",
                    "description": "Die Entwicklung der Anwendung erfolgt ad-hoc mit Fokus auf die schnellstmögliche Bereitstellung von Funktionen. Eine dokumentierte Architektur existiert nicht, und Sicherheitsaspekte werden nicht systematisch berücksichtigt."
                  },
                  {
                    "statement-id": "app.3.1-a8-m2",
                    "uuid": "a39ac528-3f68-4b6f-98aa-6825422703d3",
                    "description": "Es existiert eine grundlegende Architekturdokumentation, die die Hauptkomponenten der Anwendung und deren Zusammenspiel beschreibt. Allgemeine Sicherheitsaspekte werden erwähnt, sind aber nicht in die Architektur integriert."
                  },
                  {
                    "statement-id": "app.3.1-a8-m3",
                    "uuid": "e51aaa3e-e31a-44e9-87ea-68114596a179",
                    "description": "Sicherheitsaspekte SOLLTEN bereits während der Planung von Webanwendungen und Webservices betrachtet werden. Auch SOLLTE darauf geachtet werden, dass die Architektur der Webanwendung oder des Webservice die Geschäftslogik der Institution exakt erfasst und korrekt umsetzt."
                  },
                  {
                    "statement-id": "app.3.1-a8-m4",
                    "uuid": "bab858a0-dc08-4567-aa2f-5cfd295ffed5",
                    "description": "Für die geplante Architektur wird ein systematisches Threat Modeling (z.B. nach STRIDE) durchgeführt, um potenzielle Bedrohungen zu identifizieren. Die Architektur wird nach den Prinzipien 'Secure by Design' und 'Defense in Depth' entworfen und beinhaltet explizit Sicherheitskomponenten (z.B. API-Gateway, WAF)."
                  },
                  {
                    "statement-id": "app.3.1-a8-m5",
                    "uuid": "d4ed7a6c-42a7-4515-a3f7-95a599f5a43a",
                    "description": "Die Systemarchitektur basiert auf einem Zero-Trust-Modell, bei dem keine impliziten Vertrauensstellungen existieren. Jede Interaktion zwischen Komponenten wird explizit authentifiziert und autorisiert. Die Architektur wird von einem formalen Security Architecture Board geprüft und freigegeben und wird kontinuierlich basierend auf neuer Threat Intelligence weiterentwickelt."
                  }
                ]
              },
              {
                "uuid": "a62c61e1-3400-4b48-a66d-72a57ae84df5",
                "control-id": "DEV.3.4",
                "description": "Implementation for DEV.3.4 based on BSI APP.3.1.A14",
                "statements": [
                  {
                    "statement-id": "app.3.1-a14-m1",
                    "uuid": "d334746d-7172-45a7-bc94-bb1bf684e318",
                    "description": "Zugangsdaten werden nur gehasht, aber nicht gesalzen gespeichert. Teile des Quelltextes, wie z.B. Include-Dateien oder Konfigurationsdateien, sind möglicherweise über den Webserver direkt abrufbar."
                  },
                  {
                    "statement-id": "app.3.1-a14-m2",
                    "uuid": "8f417235-641c-4a93-9917-fad46f15c9b9",
                    "description": "Zugangsdaten werden mit einem Salt und einem Hash-Verfahren gespeichert, jedoch wird ein veralteter oder schwacher Algorithmus (z.B. MD5 oder SHA1) verwendet. Der Quelltext der Anwendung ist grundsätzlich vor direktem Abruf geschützt."
                  },
                  {
                    "statement-id": "app.3.1-a14-m3",
                    "uuid": "3b27f6a8-7ae6-4694-a3a2-92170879efe7",
                    "description": "Der IT-Betrieb MUSS sicherstellen, dass Zugangsdaten zur Webanwendung oder zum Webservice serverseitig mithilfe von sicheren kryptografischen Algorithmen vor unbefugtem Zugriff geschützt werden. Dazu MÜSSEN Salted Hash-Verfahren verwendet werden. Die Dateien mit den Quelltexten der Webanwendung oder des Webservices MÜSSEN vor unerlaubten Abrufen geschützt werden."
                  },
                  {
                    "statement-id": "app.3.1-a14-m4",
                    "uuid": "55ff5785-1a05-4c8b-abd4-cc6487018a4d",
                    "description": "Für die Speicherung von Zugangsdaten wird ein modernes, rechenintensives Hashing-Verfahren wie Argon2 oder scrypt mit von Sicherheitsexperten empfohlenen Parametern eingesetzt. Der Quelltext wird in einem sicheren Versionskontrollsystem verwaltet und der Zugriff darauf ist stark reglementiert."
                  },
                  {
                    "statement-id": "app.3.1-a14-m5",
                    "uuid": "75e193ed-01ff-4376-99cb-aa1519668c6e",
                    "description": "Gehashte Zugangsdaten werden zusätzlich mit einem anwendungsspezifischen Schlüssel verschlüsselt, der in einem Hardware Security Module (HSM) oder einem dedizierten Key Management Service (KMS) sicher verwahrt wird. Der Quelltext wird mittels einer sicheren CI/CD-Pipeline, die automatisierte Sicherheitstests (SAST) durchführt, auf die Produktivsysteme ausgerollt."
                  }
                ]
              },
              {
                "uuid": "3778dc0f-6531-40fa-8c66-3c48b04be6f5",
                "control-id": "KONF.10.1",
                "description": "Implementation for KONF.10.1 based on BSI APP.3.1.A12",
                "statements": [
                  {
                    "statement-id": "app.3.1-a12-m3",
                    "uuid": "2e8dd132-9fb5-4d10-9f3e-552924f29647",
                    "description": "Webanwendungen und Webservices SOLLTEN so konfiguriert sein, dass auf ihre Ressourcen und Funktionen ausschließlich über die vorgesehenen, abgesicherten Kommunikationspfade zugegriffen werden kann. Der Zugriff auf nicht benötigte Ressourcen und Funktionen SOLLTE deaktiviert werden. Falls dies nicht möglich ist, SOLLTE der Zugriff soweit wie möglich eingeschränkt werden. Folgendes SOLLTE bei der Konfiguration von Webanwendungen und Webservices umgesetzt werden: Deaktivieren nicht benötigter HTTP-Methoden, Konfigurieren der Zeichenkodierung, Vermeiden von sicherheitsrelevanten Informationen in Fehlermeldungen und Antworten, Speichern von Konfigurationsdateien außerhalb des Web-Root-Verzeichnisses sowie Festlegen von Grenzwerten für Zugriffsversuche."
                  },
                  {
                    "statement-id": "app.3.1-a12-m4",
                    "uuid": "c3a54342-e95a-41a9-832c-72b680e1e494",
                    "description": "Die sichere Konfiguration der Anwendung und des Webservers wird als Code (Infrastructure as Code) in einem Versionskontrollsystem verwaltet. Dies stellt eine konsistente, nachvollziehbare und wiederholbare Konfiguration über alle Umgebungen (Entwicklung, Test, Produktion) hinweg sicher."
                  },
                  {
                    "statement-id": "app.3.1-a12-m5",
                    "uuid": "3699f084-f6c0-41f1-8dd1-938e90a50a3d",
                    "description": "Die Konfiguration wird kontinuierlich auf Konformität mit einer definierten, gehärteten Baseline überwacht. Jede Abweichung von dieser Baseline (Konfigurationsdrift) löst einen automatisierten Alarm und/oder eine automatische Korrekturmaßnahme aus. Die Konfiguration wird regelmäßig formalen Reviews und Audits unterzogen."
                  }
                ]
              },
              {
                "uuid": "a3b0c92b-26d8-483a-9fff-8769fd31f937",
                "control-id": "KONF.10.5",
                "description": "Implementation for KONF.10.5 based on BSI APP.3.1.A22",
                "statements": [
                  {
                    "statement-id": "app.3.1-a22-m3",
                    "uuid": "c7bcf9a2-1114-402a-84d1-d0e013146e9d",
                    "description": "Webanwendungen und Webservices SOLLTEN regelmäßig auf Sicherheitsprobleme hin überprüft werden. Insbesondere SOLLTEN regelmäßig Revisionen durchgeführt werden. Die Ergebnisse SOLLTEN nachvollziehbar dokumentiert, ausreichend geschützt und vertraulich behandelt werden. Abweichungen SOLLTE nachgegangen werden. Die Ergebnisse SOLLTEN dem ISB vorgelegt werden."
                  },
                  {
                    "statement-id": "app.3.1-a22-m4",
                    "uuid": "c3b65d7f-e7a2-4428-bb0c-3c83561e42b4",
                    "description": "Die Penetrationstests werden nach einem etablierten Standard (z.B. OWASP ASVS) durchgeführt. Der Scope der Tests umfasst die gesamte Anwendungsarchitektur, einschließlich der angebundenen Hintergrundsysteme und APIs. Die Ergebnisse fließen in einen formalen Schwachstellenmanagementprozess ein, der klare Fristen für die Behebung von Schwachstellen basierend auf ihrer Kritikalität vorgibt."
                  },
                  {
                    "statement-id": "app.3.1-a22-m5",
                    "uuid": "9607673e-1598-4b71-be45-17f66f508fc4",
                    "description": "Es ist ein kontinuierliches Sicherheitstestprogramm etabliert, das automatisierte dynamische Anwendungssicherheitstests (DAST) in der CI/CD-Pipeline, regelmäßige Penetrationstests durch wechselnde Drittanbieter (um Betriebsblindheit zu vermeiden) und ein öffentliches oder privates Bug-Bounty-Programm zur Einbindung der breiteren Sicherheits-Community umfasst."
                  }
                ]
              },
              {
                "uuid": "656073c6-b005-4cb4-b43e-3748d50793c7",
                "control-id": "KONF.11.1",
                "description": "Implementation for KONF.11.1 based on BSI APP.3.1.A1",
                "statements": [
                  {
                    "statement-id": "app.3.1-a1-m1",
                    "uuid": "696b0a34-c594-40d5-a1a9-893104ed74ec",
                    "description": "Eine Authentisierung ist nur für einige, aber nicht für alle schutzbedürftigen Bereiche der Webanwendung oder des Webservices implementiert. Es existieren keine oder nur sehr schwach definierte Grenzwerte für fehlgeschlagene Anmeldeversuche."
                  },
                  {
                    "statement-id": "app.3.1-a1-m2",
                    "uuid": "8fb8fa98-7ec6-48c1-8e85-95a55f1baa71",
                    "description": "Alle schutzbedürftigen Ressourcen der Webanwendung oder des Webservices erfordern eine Authentisierung der Clients. Es werden einfache Authentisierungsmethoden wie Benutzername und Passwort verwendet. Es sind grundlegende Grenzwerte für fehlgeschlagene Anmeldeversuche festgelegt."
                  },
                  {
                    "statement-id": "app.3.1-a1-m3",
                    "uuid": "67bf4e35-e4ba-4793-ab34-dcdf6f518c99",
                    "description": "Der IT-Betrieb MUSS Webanwendungen und Webservices so konfigurieren, dass sich Clients gegenüber der Webanwendung oder dem Webservice authentisieren müssen, wenn diese auf geschützte Ressourcen zugreifen wollen. Dafür MUSS eine angemessene Authentisierungsmethode ausgewählt werden. Der IT-Betrieb MUSS geeignete Grenzwerte für fehlgeschlagene Anmeldeversuche festlegen."
                  },
                  {
                    "statement-id": "app.3.1-a1-m4",
                    "uuid": "a8701e66-e444-41b9-b048-685b11ba7a89",
                    "description": "Die Authentisierung wird durch den Einsatz von Multi-Faktor-Authentisierung (MFA) für alle Benutzerkonten verstärkt. Der Auswahlprozess für die Authentisierungsmethode SOLLTE dokumentiert werden. Die festgelegten Grenzwerte für fehlgeschlagene Anmeldeversuche werden aktiv überwacht und Administratoren werden über auffällige Aktivitäten informiert."
                  },
                  {
                    "statement-id": "app.3.1-a1-m5",
                    "uuid": "2a3fed67-b74f-45b3-8964-ce4f4d0e18b0",
                    "description": "Die Authentisierung ist für alle Zugriffe obligatorisch und verwendet standardmäßig Phishing-resistente Methoden (z.B. FIDO2/WebAuthn). Anmeldeversuche und Sitzungsaktivitäten werden in Echtzeit durch ein SIEM-System analysiert, das bei Anomalien automatisch Konten sperrt, Sitzungen beendet und Sicherheitsvorfälle generiert."
                  }
                ]
              },
              {
                "uuid": "06441b3a-b61c-4c05-ba1e-e13fca3d67e3",
                "control-id": "KONF.11.8",
                "description": "Implementation for KONF.11.8 based on BSI APP.3.1.A11",
                "statements": [
                  {
                    "statement-id": "app.3.1-a11-m3",
                    "uuid": "40681605-afde-4346-9bfa-739b407769e1",
                    "description": "Der Zugriff auf Hintergrundsysteme, auf denen Funktionen und Daten ausgelagert werden, SOLLTE ausschließlich über definierte Schnittstellen und von definierten IT-Systemen aus möglich sein. Bei der Kommunikation über Netz- und Standortgrenzen hinweg SOLLTE der Datenverkehr authentisiert und verschlüsselt werden."
                  },
                  {
                    "statement-id": "app.3.1-a11-m4",
                    "uuid": "97e14556-b82b-44cb-a921-b65c9cbade2c",
                    "description": "Ein API-Gateway wird eingesetzt, um als einziger Zugriffspunkt für alle Hintergrundsysteme zu dienen. Das Gateway erzwingt für alle Anfragen eine starke Authentisierung (z.B. OAuth 2.0), Autorisierung, Ratenbegrenzung und Protokollierung."
                  },
                  {
                    "statement-id": "app.3.1-a11-m5",
                    "uuid": "a69be0e5-073c-4b9d-8b83-8b8f97faa695",
                    "description": "Es wird ein Zero-Trust-Modell angewendet, bei dem jede Anfrage zwischen der Webanwendung und den Hintergrundsystemen unabhängig von ihrem Netzwerkstandort authentifiziert und autorisiert wird. Die gesamte Kommunikation wird durch gegenseitige TLS-Authentifizierung (mTLS) abgesichert, bei der sich sowohl der Client als auch der Server mit Zertifikaten ausweisen."
                  }
                ]
              },
              {
                "uuid": "0ab45fc9-f553-4cd6-abd8-d5aca143c518",
                "control-id": "KONF.12.1.10",
                "description": "Implementation for KONF.12.1.10 based on BSI APP.3.1.A21",
                "statements": [
                  {
                    "statement-id": "app.3.1-a21-m3",
                    "uuid": "8c20f43b-d19f-46cc-bc84-0c3a7c0d7a4e",
                    "description": "Zum Schutz vor Clickjacking, Cross-Site-Scripting und anderen Angriffen SOLLTE der IT-Betrieb geeignete HTTP-Response-Header setzen. Dazu SOLLTEN mindestens die folgenden HTTP-Header verwendet werden: Content-Security-Policy, Strict-Transport-Security, Content-Type, X-Content-Type-Options sowie Cache-Control. Cookies SOLLTEN grundsätzlich mit den Attributen secure, SameSite und httponly gesetzt werden."
                  },
                  {
                    "statement-id": "app.3.1-a21-m4",
                    "uuid": "04ca1b7d-53c5-4553-a223-df9e22c92f03",
                    "description": "Die Konfiguration der HTTP-Header ist restriktiv und folgt dem Prinzip der geringsten Rechte. Die Content-Security-Policy ist so streng wie möglich konfiguriert und vermeidet unsichere Direktiven wie 'unsafe-inline'. Die `max-age` Direktive des HSTS-Headers ist auf einen langen Zeitraum (z.B. ein Jahr) gesetzt und die `preload` Direktive ist enthalten. Das `SameSite` Attribut von Cookies ist wo immer möglich auf `Strict` gesetzt."
                  },
                  {
                    "statement-id": "app.3.1-a21-m5",
                    "uuid": "4aea6a6c-e668-4cca-9931-fdcb4dddc0c0",
                    "description": "Die Content-Security-Policy wird im 'Enforce'-Modus betrieben und enthält eine `report-uri` oder `report-to` Direktive. Die gemeldeten CSP-Verstöße werden zentral gesammelt, analysiert und zur kontinuierlichen Verbesserung der Policy genutzt. Zusätzliche moderne Sicherheitsheader wie `Permissions-Policy`, `Cross-Origin-Opener-Policy` (COOP) und `Cross-Origin-Embedder-Policy` (COEP) sind implementiert, um die Anwendung weiter zu isolieren und vor Cross-Site-Leaks zu schützen."
                  }
                ]
              },
              {
                "uuid": "981fa1e8-29e1-4e53-b069-388f8a76c10f",
                "control-id": "KONF.12.1.7",
                "description": "Implementation for KONF.12.1.7 based on BSI APP.3.1.A20",
                "statements": [
                  {
                    "statement-id": "app.3.1-a20-m3",
                    "uuid": "1cf9d990-da1f-4545-b870-fca71d1434d6",
                    "description": "Institutionen SOLLTEN Web Application Firewalls (WAF) einsetzen. Die Konfiguration der eingesetzten WAF SOLLTE auf die zu schützende Webanwendung oder den Webservice angepasst werden. Nach jedem Update der Webanwendung oder des Webservices SOLLTE die Konfiguration der WAF geprüft werden."
                  },
                  {
                    "statement-id": "app.3.1-a20-m4",
                    "uuid": "b5b12efd-79a2-46f4-99c1-690a6727c83c",
                    "description": "Das WAF-Regelwerk wird sorgfältig auf die spezifische Anwendung zugeschnitten, um False Positives und False Negatives zu minimieren. Die WAF wird für virtuelles Patchen verwendet, um bekannte Schwachstellen in der Anwendung temporär zu mitigieren, bis ein offizieller Patch verfügbar ist. Die WAF-Logs werden in ein zentrales SIEM integriert und aktiv auf Angriffsindikatoren überwacht."
                  },
                  {
                    "statement-id": "app.3.1-a20-m5",
                    "uuid": "fbcc0ca9-395e-4bf9-a634-482e7ca8a760",
                    "description": "Die WAF ist Teil einer integrierten Web Application and API Protection (WAAP) Plattform, die auch Bot-Schutz, API-Sicherheit und DDoS-Abwehr umfasst. Die Plattform nutzt maschinelles Lernen, um das Normalverhalten der Anwendung zu erlernen (positive security model) und sich automatisch an neue Angriffsmuster anzupassen."
                  }
                ]
              },
              {
                "uuid": "0db33ef4-f6ae-4bea-bc64-ee8364b0ac68",
                "control-id": "KONF.6.11",
                "description": "Implementation for KONF.6.11 based on BSI APP.3.1.A4",
                "statements": [
                  {
                    "statement-id": "app.3.1-a4-m1",
                    "uuid": "42c13538-ed31-48eb-bfb4-ac8043ab8c9c",
                    "description": "Die Upload-Funktion existiert, prüft jedoch nur oberflächlich den Dateityp (z.B. anhand der Dateiendung) oder erzwingt keine Größenbeschränkungen. Die hochgeladenen Dateien werden an einem unsicheren Ort gespeichert."
                  },
                  {
                    "statement-id": "app.3.1-a4-m2",
                    "uuid": "9dec727f-83d4-47b0-b1b8-e7f3d3c0dc8f",
                    "description": "Die Upload-Funktion prüft den MIME-Type der Datei und erzwingt eine maximale Dateigröße. Hochgeladene Dateien werden in einem separaten, dedizierten Verzeichnis gespeichert, die Dateiberechtigungen sind jedoch möglicherweise zu freizügig."
                  },
                  {
                    "statement-id": "app.3.1-a4-m3",
                    "uuid": "675a8bbc-ad67-4a62-8d2e-9666e341d004",
                    "description": "Falls eine Webanwendung oder ein Webservice eine Upload-Funktion für Dateien anbietet, MUSS diese Funktion durch den IT-Betrieb so weit wie möglich eingeschränkt werden. Insbesondere MÜSSEN die erlaubte Dateigröße, erlaubte Dateitypen und erlaubte Speicherorte festgelegt werden. Es MUSS festgelegt werden, welche Clients die Funktion verwenden dürfen. Auch MÜSSEN Zugriffs- und Ausführungsrechte restriktiv gesetzt werden. Zudem MUSS sichergestellt werden, dass Clients Dateien nur im vorgegebenen erlaubten Speicherort speichern können."
                  },
                  {
                    "statement-id": "app.3.1-a4-m4",
                    "uuid": "4978b867-43d2-44d1-b80c-7c3843e65418",
                    "description": "Alle hochgeladenen Dateien werden nach dem Upload serverseitig mit einem aktuellen Virenscanner auf Malware überprüft, bevor sie für andere Benutzer verfügbar gemacht werden. Alle Upload-Vorgänge werden protokolliert."
                  },
                  {
                    "statement-id": "app.3.1-a4-m5",
                    "uuid": "687372de-3c42-4c62-9145-223caa106474",
                    "description": "Die Verarbeitung hochgeladener Dateien (einschließlich Malware-Scan und Inhaltsanalyse) findet in einer isolierten Sandbox-Umgebung statt. Der Dateispeicher ist ein dedizierter, gehärteter Objektspeicher-Dienst, der physisch vom Applikationsserver getrennt ist. Die Dateinamen werden serverseitig neu generiert, um Pfad-Traversal-Angriffe zu verhindern."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}