{
  "component-definition": {
    "uuid": "cc50b1f5-98f6-43c8-9802-c7febeef5488",
    "metadata": {
      "title": "APP.4.9 Cloud-Dienste - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:07:58.865289+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "d5d467f1-5ac9-4814-8f54-a28e842cc723",
        "type": "software",
        "title": "APP.4.9 Cloud-Dienste",
        "description": "This component represents the implementation of all controls for Baustein APP.4.9.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Objektbasierte Speicherlösungen (Object Storage) sind ein zentraler Baustein moderner IT-Architekturen, insbesondere in Cloud-Umgebungen (z. B. S3-kompatible Dienste) und in großen On-Premises-Infrastrukturen (z. B. mit Ceph oder OpenStack Swift). Im Gegensatz zu traditionellen Datei- oder Blockspeichern organisieren sie Daten als einzelne Objekte in flachen Hierarchien, sogenannten Buckets. Jedes Objekt besteht aus den eigentlichen Daten, einer eindeutigen ID und Metadaten.\nDer Zugriff auf Objektspeicher erfolgt ausschließlich über programmatische Schnittstellen (APIs), typischerweise über HTTP. Diese API-zentrierte Natur und ein sehr flexibles Berechtigungsmodell sind Stärken, aber auch die Quelle spezifischer Risiken. Eine einzige Fehlkonfiguration in einer Bucket-Richtlinie kann dazu führen, dass Terabytes an sensiblen Daten ungeschützt im Internet stehen. Die Sicherheit von Objektspeichern hängt daher entscheidend von der korrekten Konfiguration der Zugriffsrichtlinien und der Absicherung der API-Endpunkte ab."
          },
          {
            "name": "Zielsetzung",
            "value": "Dieser Baustein zeigt einen systematischen Weg auf, um objektbasierte Speicherlösungen sicher zu konfigurieren und zu betreiben. Ziel ist es, die Vertraulichkeit, Integrität und Verfügbarkeit der gespeicherten Objekte zu gewährleisten. Schwerpunkte sind die rigorose Kontrolle von Zugriffsberechtigungen auf Bucket- und Objektebene, die durchgängige Verschlüsselung der Daten, die Absicherung der API-Kommunikation und das lückenlose Logging aller Zugriffe."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein APP.4.9 ist auf alle eingesetzten objektbasierten Speicherlösungen anzuwenden.\nDieser Baustein konkretisiert die allgemeinen Anforderungen aus APP.4.4 Speicherlösungen für den spezifischen Fall des Objektspeichers. Er behandelt nicht die Absicherung der zugrundeliegenden Server-Infrastruktur bei On-Premises-Lösungen (siehe OPS.1.1-Bausteine). Bei der Nutzung von Cloud-Diensten sind zusätzlich die Anforderungen aus OPS.2.3 Nutzung von Cloud-Diensten zu beachten."
          },
          {
            "name": "Unbeabsichtigte Veröffentlichung von Daten durch öffentliche Buckets",
            "value": "Dies ist eine der häufigsten und schwerwiegendsten Schwachstellen bei Objektspeichern. Durch eine fehlerhafte Konfiguration der Zugriffsrichtlinien (ACLs oder Bucket Policies) wird ein Bucket für die gesamte Welt lesbar oder sogar beschreibbar. Dies führt zur vollständigen Offenlegung aller darin enthaltenen Daten."
          },
          {
            "name": "Kompromittierung von API-Zugangsdaten",
            "value": "Der Zugriff auf Objektspeicher erfolgt über API-Schlüssel (Access Keys). Werden diese Schlüssel kompromittiert, beispielsweise weil sie in öffentlich zugänglichem Quellcode hinterlegt wurden, erlangt ein Angreifer die gleichen Rechte wie der legitime Besitzer der Schlüssel und kann Daten unbemerkt auslesen, manipulieren oder löschen."
          },
          {
            "name": "Unzureichende Zugriffskontrolle auf Objektebene",
            "value": "Selbst wenn ein Bucket nicht vollständig öffentlich ist, können zu weitreichende interne Berechtigungen zu Datenlecks führen. Erlaubt eine Richtlinie beispielsweise allen authentifizierten Benutzern einer Organisation den Lesezugriff auf alle Objekte, können Daten über die Abteilungsgrenzen hinweg unautorisiert eingesehen werden."
          },
          {
            "name": "Verlust oder Manipulation von Daten ohne Versionierung",
            "value": "Ist die Objekt-Versionierung nicht aktiviert, wird bei einer Überschreibung eines Objekts die alte Version unwiederbringlich gelöscht. Dies kann durch Angreifer, aber auch durch fehlerhafte Skripte oder menschliches Versagen zum permanenten Datenverlust oder zur unbemerkten Manipulation von Daten führen."
          },
          {
            "name": "Ausspähen von Daten während der Übertragung",
            "value": "Erfolgt die Kommunikation mit den API-Endpunkten des Objektspeichers unverschlüsselt über HTTP, können sowohl die übertragenen Daten als auch die zur Authentifizierung genutzten API-Schlüssel im Netzwerk mitgelesen werden."
          }
        ],
        "control-implementations": [
          {
            "uuid": "2287ba5a-9e95-4989-a0c2-2c05dcf7f5c9",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/cloud-dienste_profile.json",
            "description": "Implementation for all controls in Baustein APP.4.9",
            "implemented-requirements": []
          }
        ]
      }
    ]
  }
}