{
  "component-definition": {
    "uuid": "066f0ec6-1214-4d26-a463-428a0e007442",
    "metadata": {
      "title": "APP.7 Anwendungen - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:07:59.148488+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "0c08e6d8-f03f-48bb-ac3c-42a58f5aa689",
        "type": "software",
        "title": "APP.7 Anwendungen",
        "description": "This component represents the implementation of all controls for Baustein APP.7.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Viele Institutionen stehen vor Herausforderungen, die sie nicht mehr hinreichend mit unangepasster Software lösen können. Die mit diesen Herausforderungen verbundenen Aufgabenstellungen bedürfen häufig Softwarelösungen, die auf die individuellen Bedürfnisse der Institutionen zugeschnitten sind. Im Folgenden werden diese Softwarelösungen als Individualsoftware bezeichnet. Hierzu können einerseits Basislösungen, die aus einer Grundmenge an typischen Funktionen bestehen, eingesetzt und individualisiert werden. Die Grundfunktionen werden hierbei für den individuellen Einsatzzweck der Institution angepasst und um individuell benötigte Funktionen erweitert. Gängige Beispiele hierfür sind IT-Anwendungen wie ERP- (Enterprise Resource Planning), CMS- (Content Management Systeme) oder IDM-Systeme (Identity Management). Individualsoftware kann auch vollständig neu von der Institution selbst oder von Dritten entwickelt werden. Hierzu gehören Anwendungen zur Geschäftsprozesssteuerung oder individuell angepasste Fachanwendungen, wie Personalverwaltungssoftware, Verfahren zur Verwaltung von Sozialdaten oder Meldedaten.\n\nVon essentieller Bedeutung ist es hierbei, dass bereits bei der Planung und Konzeptionierung der Individualsoftware auch die benötigten Sicherheitsfunktionen bedacht werden und die Informationssicherheit in dem gesamten Lebenszyklus der Individualsoftware berücksichtigt wird. Fehler in der Planung oder fehlende Sicherheitsfunktionen können im laufenden Betrieb nicht oder nur mit hohem zusätzlichem Aufwand ausgeglichen werden.\n\nIndividualsoftware wird dabei in der Regel im Rahmen eines Projektes entwickelt. Hierzu haben sich die unterschiedlichsten Vorgehens- bzw. Projektmanagementmodelle etabliert. Während klassische, lineare Vorgehensmodelle, wie der Wasserfallprozess, sehr gut zu Projekten mit zu Beginn feststehenden Anforderungen passen, ermöglichen agile Vorgehensmodelle, wie Scrum, Individualsoftware iterativ und inkrementell zu entwickeln. Agile Vorgehensmodell können sich somit besser an verändernde Gegebenheiten anpassen, insbesondere wenn zu Beginn noch nicht alle Anforderungen feststehen. Allerdings bieten sie nicht dieselbe Kalkulationssicherheit wie lineare Vorgehensmodelle und passen auch in einigen Fällen nicht zu den klassischen Strukturen der Beschaffungsprozesse, die auf ein lineares Vorgehen ausgerichtet sind."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es aufzuzeigen, welche grundlegenden Sicherheitsanforderungen bei der Planung und Entwicklung von Individualsoftware zu berücksichtigen sind."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein APP.7 Entwicklung von Individualsoftware ist für jede Entwicklung einer Individualsoftware einmal anzuwenden.\n\nAspekte zur Planung, Konzeption und Einsatz von Individualsoftware, wie benötigte Sicherheitsfunktionen festzulegen oder Individualsoftware außer Betrieb zu nehmen, werden im Baustein APP.6 Allgemeine Software behandelt. Er ist daher immer zusammen mit diesem Baustein anzuwenden.\n\nWenn Software entwickelt wird, liegt sehr häufig ein auftragnehmendes und auftraggebendes Verhältnis vor. Im IT-Grundschutz spiegelt sich dieser Sachverhalt wider, indem der Baustein APP.7 Entwicklung von Individualsoftware die auftragsgebende Seite und der Baustein CON.8 Software-Entwicklung die auftragnehmende Seite behandeln.\n\nDie Freigabe und Tests von Individualsoftware wird im Baustein OPS.1.1.6 Software-Tests und -Freigaben behandelt."
          },
          {
            "name": "2.1. Unzulängliche vertragliche Regelungen mit externen Dienstleistenden",
            "value": "Aufgrund von unzulänglichen vertraglichen Regelungen mit externen Dienstleistenden können vielfältige und schwerwiegende Sicherheitsprobleme auftreten. Dies gilt insbesondere, wenn Anwendungen erstellt, eingeführt oder gewartet werden. Sind Aufgaben, Leistungsparameter oder der Aufwand ungenügend oder missverständlich beschrieben, können Sicherheitsmaßnahmen möglicherweise aus Unkenntnis oder aufgrund mangelnder Qualifizierung oder fehlender Ressourcen nicht umgesetzt werden. Dies kann viele negative Auswirkungen nach sich ziehen, etwa wenn regulatorische Anforderungen und Pflichten nicht erfüllt werden, Auskunftspflichten und Gesetze nicht eingehalten werden oder keine Verantwortung übernommen wird, weil Kontroll- und Steuerungsmöglichkeiten fehlen."
          },
          {
            "name": "2.2. Software-Konzeptionsfehler",
            "value": "Werden Anwendungen, Programme und Protokolle konzeptioniert, können sicherheitsrelevante Konzeptionsfehler entstehen. Diese ergeben sich häufig daraus, dass Anwendungsmodule und Protokolle, die für einen bestimmten Zweck vorgesehen sind, in anderen Einsatzszenarien wiederverwendet werden. Sind dann andere Sicherheitsvorgaben relevant, kann dies zu massiven Sicherheitsproblemen führen, zum Beispiel wenn Anwendungsmodule und Protokolle, die eigentlich für abgeschottete betriebliche Umgebungen vorgesehen sind, an das Internet angebunden werden."
          },
          {
            "name": "2.3. Undokumentierte Funktionen",
            "value": "Viele Anwendungen enthalten vom herstellenden Unternehmen eingebaute, undokumentierte Funktionen, häufig für die Entwicklung oder zum Support der Anwendung. Diese sind den Benutzenden meistens nicht bekannt. Undokumentierte Funktionen sind dann problematisch, wenn sie es erlauben, dass wesentliche Sicherheitsmechanismen umgangen werden, z. B. zum Zugriffsschutz. Dies kann die Vertraulichkeit, Integrität und Verfügbarkeit der verarbeiteten Daten erheblich beeinträchtigen."
          },
          {
            "name": "2.4. Fehlende oder unzureichende Sicherheitsmaßnahmen in Anwendungen",
            "value": "Sicherheitsmechanismen oder Sicherheitsfunktionen sollen in der Anwendung sicherstellen, dass bei der Verarbeitung von Informationen die Vertraulichkeit, Integrität und Verfügbarkeit im benötigten Maße gewährleistet werden können. Häufig steht bei der Entwicklung einer Anwendung aber die fachliche Funktionalität oder der Zeit- und Kostenrahmen im Vordergrund. So können wichtige Sicherheitsmechanismen zu schwach ausgeprägt sein, sodass sie einfach umgangen werden können oder sogar ganz fehlen."
          },
          {
            "name": "2.5. Mangelhafte Steuerung der Software-Entwicklung",
            "value": "Wird die Software-Entwicklung vom Auftraggebenden nicht hinreichend gesteuert, bestehen eine Reihe von Gefahren, wie z. B.:\n\n• Es können geforderte Sicherheitsfunktionen fehlen oder nur unzureichend implementiert werden. Hieraus können sich vielfältige Risiken ergeben, die die Verfügbarkeit, Vertraulichkeit und Integrität der mit der Individualsoftware verarbeiteten Daten gefährden.\n• Das Entwicklungsprojekt kann sich zeitlich verzögern, sodass die Individualsoftware nicht rechtzeitig verfügbar ist.\n• Prioritäten können falsch gesetzt werden, indem z. B. nachrangig benötigte Funktionen umfangreich entwickelt werden und dringend benötigte Sicherheitsfunktionen nur rudimentär implementiert werden. Auch hieraus können Projektverzögerungen und vielseitige Sicherheitsrisiken entstehen."
          },
          {
            "name": "2.6. Beauftragung ungeeigneter Software-Entwickelnder",
            "value": "Werden ungeeignete Software-Entwickelnde beauftragt, können daraus unterschiedliche Gefährdungen entstehen:\n\n• Aufgrund fehlender fachlicher Expertise, z. B. in der verwendeten Programmiersprache, in den eingesetzten Frameworks oder der geplanten technischen Einsatzumgebung, kann die Software viele vermeidbare Sicherheitslücken umfassen.\n• Fehlende Kenntnisse im Bereich des Projektmanagements und Requirements Engineering können zu Reibungsverlusten in Abstimmungsprozessen und somit zu erheblichen Verzögerungen führen. Auch können deswegen Schwerpunkte falsch gesetzt werden und so wesentliche Sicherheitsfunktionen nicht mit der erforderlichen Priorität implementiert werden. Ungeeignete Software-Entwickelnde können beispielsweise aufgrund zu knapper, unrealistischer Kostenkalkulationen beauftragt werden. Auch Fehler, missverständliche Anforderungen und falsche Zielvorstellungen in Ausschreibungen können dazu führen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "ea2e419a-5f44-4096-99a9-7e3dd66b923e",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/anwendungen_profile.json",
            "description": "Implementation for all controls in Baustein APP.7",
            "implemented-requirements": [
              {
                "uuid": "b8132985-5880-4710-b4d9-9192feb82135",
                "control-id": "BES.2.1.3",
                "description": "Implementation for BES.2.1.3 based on BSI APP.7.A7",
                "statements": [
                  {
                    "statement-id": "APP.7.A7-m1",
                    "uuid": "9aecc4aa-3b63-49aa-b194-0a07c2b17276",
                    "description": "Der Auftragnehmer für die Software-Entwicklung wird primär auf Basis der niedrigsten Kosten ausgewählt. Eine Bewertung der Sicherheitskompetenz des Auftragnehmers findet nicht statt."
                  },
                  {
                    "statement-id": "APP.7.A7-m2",
                    "uuid": "95641339-1dad-4fc8-9c53-de0696ef1f92",
                    "description": "Der Beschaffungsprozess bewertet die allgemeinen Fähigkeiten des Auftragnehmers. Dessen Sicherheitsexpertise ist jedoch kein primäres oder entscheidendes Auswahlkriterium. Öffentliche Ausschreibungen können hochrangige Architekturentscheidungen offenlegen."
                  },
                  {
                    "statement-id": "APP.7.A7-m3",
                    "uuid": "e2e00198-be90-4159-8d8a-5a183735919d",
                    "description": "Das Entwicklungsprojekt SOLLTE im Rahmen des hierfür bestens geeigneten Projektmanagementmodells beauftragt werden. Sicherheitsaspekte SOLLTEN dabei bereits bei der Ausschreibung und Vergabe berücksichtigt werden, sodass einerseits nur geeignete Auftragnehmende beauftragt werden, andererseits aber keine weitreichenden Rückschlüsse auf die Sicherheitsarchitektur durch die öffentlich verfügbaren Informationen möglich sind. In der Institution SOLLTEN definierte Prozesse und festgelegte Kontaktpersonen existieren, die sicherstellen, dass die jeweiligen Rahmenbedingungen berücksichtigt werden."
                  },
                  {
                    "statement-id": "APP.7.A7-m4",
                    "uuid": "117fdefc-6712-4263-bf2b-54c8a62131ec",
                    "description": "Der Beschaffungsprozess verlangt von potenziellen Auftragnehmern explizite Nachweise ihrer Sicherheitsexpertise. Dies können Zertifizierungen (z.B. ISO 27001) oder detaillierte Referenzen für vergleichbare Projekte zur sicheren Softwareentwicklung sein."
                  },
                  {
                    "statement-id": "APP.7.A7-m5",
                    "uuid": "df519d93-3dee-41f2-886f-60be54fe519a",
                    "description": "Es wird ein mehrstufiges Beschaffungsverfahren (z.B. Teilnahmewettbewerb) verwendet. Detaillierte Informationen zur Sicherheitsarchitektur werden erst nach einer Eignungsprüfung und Unterzeichnung einer Geheimhaltungsvereinbarung (NDA) an eine engere Auswahl von Bietern weitergegeben. Der endgültige Vertrag enthält spezifische Service Level Agreements (SLAs) zur Informationssicherheit."
                  }
                ]
              },
              {
                "uuid": "0fffda1d-d42f-45ad-b536-2c192a76b891",
                "control-id": "DEV.2.2",
                "description": "Implementation for DEV.2.2 based on BSI APP.7.A6",
                "statements": [
                  {
                    "statement-id": "APP.7.A6-m1",
                    "uuid": "2f62b9fb-f449-41dc-a187-1d3e4a2baad8",
                    "description": "Anforderungen existieren nur in unstrukturierter Form, beispielsweise als Sammlung von E-Mails, Tickets oder User Stories in einem Backlog. Es gibt kein konsolidiertes, versioniertes Anforderungsdokument."
                  },
                  {
                    "statement-id": "APP.7.A6-m2",
                    "uuid": "5bb2ae7a-eec9-4a86-8a63-4d7da2b4019e",
                    "description": "Die Anforderungen sind in einem Dokument zusammengefasst und werden den Entwicklern zur Verfügung gestellt. Die Aktualisierung dieses Dokuments bei Änderungen erfolgt jedoch informell und nicht über einen gesteuerten Prozess."
                  },
                  {
                    "statement-id": "APP.7.A6-m3",
                    "uuid": "be0cfbc3-1b62-4b50-a814-8d2fa7ae5173",
                    "description": "Die Anforderungen aus dem Anforderungskatalog, die Sicherheitsanforderungen an den Prozess der Software-Entwicklung, sowie die Sicherheitsfunktionen zur Systemintegration SOLLTEN umfassend dokumentiert werden. Die Dokumentation mitsamt Sicherheitsprofil SOLLTE den Entwickelnden zur Software-Entwicklung zur Verfügung gestellt werden. Die Dokumentation SOLLTE bei Änderungen an der Individualsoftware sowie bei funktionalen Updates aktualisiert werden."
                  },
                  {
                    "statement-id": "APP.7.A6-m4",
                    "uuid": "f8dffe8e-e1de-4cfc-910c-d70a8305245b",
                    "description": "Insbesondere SOLLTE ein Sicherheitsprofil für die Anwendung erstellt werden. Dieses SOLLTE den Schutzbedarf der zu verarbeitenden Daten und Funktionen dokumentieren. Das Sicherheitsprofil wird versioniert und unterliegt einem formalen Freigabeprozess."
                  },
                  {
                    "statement-id": "APP.7.A6-m5",
                    "uuid": "f7689391-16e6-48c3-aedb-c540d83f23e2",
                    "description": "Die gesamte Anforderungsdokumentation wird in einem zentralen Repository als „Documentation as Code“ verwaltet und ist direkt mit dem Quellcode, den Tests und den Bereitstellungskonfigurationen verknüpft. Änderungen an Anforderungen lösen automatisierte Workflows für Review, Test und Bereitstellung aus."
                  }
                ]
              },
              {
                "uuid": "6f62670b-6876-4201-a4ef-de3d8c5523a7",
                "control-id": "DEV.2.6",
                "description": "Implementation for DEV.2.6 based on BSI APP.7.A2",
                "statements": [
                  {
                    "statement-id": "APP.7.A2-m1",
                    "uuid": "d450e77e-541c-4d23-8bac-bfdaab67cda7",
                    "description": "Es wird lediglich die allgemeine Erwartung geäußert, dass die Software „sicher“ entwickelt werden soll. Es werden keine spezifischen Anforderungen an den Entwicklungsprozess oder die Entwicklungsumgebung formuliert."
                  },
                  {
                    "statement-id": "APP.7.A2-m2",
                    "uuid": "61d1de62-0685-4305-8525-73c7c84747e5",
                    "description": "Es werden allgemeine Sicherheitsrichtlinien der Institution an den Software-Entwickler übergeben. Es gibt jedoch keine spezifischen Vorgaben, wie diese im Entwicklungsprozess umzusetzen sind oder welche technischen Maßnahmen in der Entwicklungsumgebung erforderlich sind."
                  },
                  {
                    "statement-id": "APP.7.A2-m3",
                    "uuid": "d2e8e0d7-1e9e-4a78-a9fc-538d23e3b6ce",
                    "description": "Die Institution MUSS klare Anforderungen an den Prozess der Software-Entwicklung definieren. Aus den Anforderungen MUSS hervorgehen, in was für einer Umgebung die Software entwickelt werden darf und welche technischen und organisatorischen Maßnahmen von Seiten der beauftragten Software-Entwickelnden umzusetzen sind."
                  },
                  {
                    "statement-id": "APP.7.A2-m4",
                    "uuid": "f907f27b-b9c0-4c44-beb7-2bdf1fe2dbe2",
                    "description": "Die Anforderungen an den Entwicklungsprozess umfassen messbare Sicherheitsmetriken. Dies beinhaltet Vorgaben zur minimalen Testabdeckung durch Sicherheitstests, die verpflichtende Nutzung von Werkzeugen zur statischen Code-Analyse (SAST) und eine Obergrenze für die Anzahl erlaubter kritischer Schwachstellen bei der Auslieferung."
                  },
                  {
                    "statement-id": "APP.7.A2-m5",
                    "uuid": "009d5329-5a0e-4684-9aaf-641e8611ef49",
                    "description": "Die Einhaltung der Sicherheitsanforderungen an den Entwicklungsprozess wird durch eine sichere CI/CD-Pipeline (DevSecOps) automatisch erzwungen. Die Pipeline integriert SAST-, DAST- und SCA-Werkzeuge (Software Composition Analysis) und verhindert ein Deployment, wenn vordefinierte Sicherheits-Gates nicht erfüllt werden."
                  }
                ]
              },
              {
                "uuid": "44689154-33ee-4805-be85-6e21a718fb35",
                "control-id": "DEV.4.10",
                "description": "Implementation for DEV.4.10 based on BSI APP.7.A5",
                "statements": [
                  {
                    "statement-id": "APP.7.A5-m1",
                    "uuid": "c6944d24-26a5-422d-8e63-99a3960f3f49",
                    "description": "Die Entwicklung wird ad-hoc durch informelle Status-Updates gesteuert. Es fehlt ein strukturiertes Vorgehens- oder Projektmanagementmodell."
                  },
                  {
                    "statement-id": "APP.7.A5-m2",
                    "uuid": "f69712cf-318d-458a-8433-ecf8ae1f56fc",
                    "description": "Es wird ein Projektmanagementmodell wie Scrum oder Kanban verwendet, dieses fokussiert sich jedoch rein auf die Umsetzung funktionaler Anforderungen. Aspekte wie Risikomanagement oder formale Qualitätsziele sind nicht explizit integriert."
                  },
                  {
                    "statement-id": "APP.7.A5-m3",
                    "uuid": "8f866884-34ee-49fb-add6-d6d8978f744d",
                    "description": "Bei der Entwicklung von Individualsoftware SOLLTE ein geeignetes Steuerungs- und Projektmanagementmodell verwendet werden. Hierbei SOLLTE das ausgewählte Modell mit dem Auftragnehmenden abgestimmt werden. Bei der Steuerung SOLLTE berücksichtigt werden, dass das benötigte Personal ausreichend qualifiziert ist. Alle relevanten Phasen SOLLTEN während des Lebenszyklus der Software abgedeckt werden. Außerdem SOLLTE es ein geeignetes Entwicklungsmodell, ein Risikomanagement sowie Qualitätsziele enthalten."
                  },
                  {
                    "statement-id": "APP.7.A5-m4",
                    "uuid": "9a2463a0-66c6-4ab9-95e5-1780b7ad20c9",
                    "description": "Der Steuerungsprozess beinhaltet regelmäßige, formale Reviews von Sicherheitsmeilensteinen und Risikobewertungen. Die Ergebnisse dieser Reviews werden dokumentiert und fließen nachweislich in den weiteren Entwicklungsprozess ein."
                  },
                  {
                    "statement-id": "APP.7.A5-m5",
                    "uuid": "d7c088e9-ba99-43b9-bac5-78dc45cca1a8",
                    "description": "Die Steuerung wird durch ein Projektmanagement-Tool unterstützt, das sicherheitsrelevante Aufgaben, Risiken und Qualitätsmetriken automatisiert nachverfolgt. Es stellt den Stakeholdern Echtzeit-Dashboards zum Sicherheitsstatus des Projekts zur Verfügung."
                  }
                ]
              },
              {
                "uuid": "5376198f-fa7b-4a0b-a663-22ef48ba8f37",
                "control-id": "DEV.4.11",
                "description": "Implementation for DEV.4.11 based on BSI APP.7.A8",
                "statements": [
                  {
                    "statement-id": "APP.7.A8-m1",
                    "uuid": "be25e913-ba2e-4d97-b513-0010ec4ce8ad",
                    "description": "Die Fachverantwortlichen werden erst unmittelbar vor der Inbetriebnahme durch eine Demonstration des fertigen Produkts einbezogen. Es finden keine Tests durch die Fachverantwortlichen statt."
                  },
                  {
                    "statement-id": "APP.7.A8-m2",
                    "uuid": "734bc3bd-7853-4abc-9a76-4be1deae9f41",
                    "description": "Die Fachverantwortlichen werden am Ende des Entwicklungszyklus in formale Abnahmetests (User Acceptance Tests, UAT) einbezogen. Eine Beteiligung während der Entwicklung findet nicht statt."
                  },
                  {
                    "statement-id": "APP.7.A8-m3",
                    "uuid": "27c068f9-6269-448c-a258-a4715ef0867d",
                    "description": "Fachverantwortliche SOLLTEN schon vor der endgültigen Abnahme frühzeitig an entwicklungsbegleitenden Tests der Software-Entwickelnden beteiligt werden. Dies SOLLTE in Abstimmung mit dem Auftragnehmenden bereits initial im Projektablaufplan berücksichtigt werden."
                  },
                  {
                    "statement-id": "APP.7.A8-m4",
                    "uuid": "acb99831-2c57-4436-a0b7-5d53a4cfb0fd",
                    "description": "Die Fachverantwortlichen werden kontinuierlich in den agilen Entwicklungsprozess einbezogen, beispielsweise durch Teilnahme an Sprint-Reviews. Sie haben permanenten Zugang zu einer Staging-Umgebung, um neue Funktionen zu testen, sobald diese entwickelt sind. Ihr Feedback wird formal erfasst und in nachfolgenden Sprints eingeplant."
                  },
                  {
                    "statement-id": "APP.7.A8-m5",
                    "uuid": "0ad93504-be48-47d2-b4cc-084f4ad20ce0",
                    "description": "Automatisierte Akzeptanztests werden in Zusammenarbeit mit den Fachverantwortlichen unter Verwendung eines Frameworks wie Behavior-Driven Development (BDD) entwickelt. Diese Tests laufen automatisch in der CI/CD-Pipeline und geben sofortiges Feedback, ob neuer Code die fachlichen Anforderungen erfüllt."
                  }
                ]
              },
              {
                "uuid": "f0907f7d-0d94-454e-b4c0-172b6740f081",
                "control-id": "DEV.5.1",
                "description": "Implementation for DEV.5.1 based on BSI APP.7.A4",
                "statements": [
                  {
                    "statement-id": "APP.7.A4-m1",
                    "uuid": "83aff5d0-386a-40f1-9df4-404fdb06420b",
                    "description": "Die Beauftragung der Entwicklung erfolgt auf Basis einer informellen Anfrage oder einer kurzen Beschreibung des gewünschten Ergebnisses. Formale Anforderungsdokumente werden nicht verwendet."
                  },
                  {
                    "statement-id": "APP.7.A4-m2",
                    "uuid": "c8757d8a-a987-44a2-8e36-dd9bb5d5f34c",
                    "description": "Die Beauftragung basiert auf einem funktionalen Anforderungskatalog. Sicherheitsanforderungen an den Prozess oder die Systemintegration sind jedoch nicht Teil der Beauftragungsgrundlage."
                  },
                  {
                    "statement-id": "APP.7.A4-m3",
                    "uuid": "e5ffc384-4ed7-44ae-bee9-eebd345dad10",
                    "description": "Wird Individualsoftware durch die eigene Institution entwickelt oder extern beauftragt, dann MÜSSEN neben den bestehenden rechtlichen und organisatorischen Vorgaben insbesondere der Anforderungskatalog, die Sicherheitsanforderungen an den Prozess der Software-Entwicklung, sowie die Sicherheitsfunktionen zur Systemintegration als Grundlage zur Software-Entwicklung verwendet werden."
                  },
                  {
                    "statement-id": "APP.7.A4-m4",
                    "uuid": "351e99ea-cf0b-46d2-8ea5-c719a73b0c03",
                    "description": "Der Beschaffungsprozess beinhaltet einen formalen Verifikationsschritt, bei dem die Angebote der potenziellen Auftragnehmer daraufhin überprüft werden, ob alle spezifizierten Sicherheitsanforderungen adäquat adressiert und verstanden wurden."
                  },
                  {
                    "statement-id": "APP.7.A4-m5",
                    "uuid": "ded3db58-cf01-4d3f-8026-9912f13c35bf",
                    "description": "Der Vertrag mit dem Auftragnehmer enthält Konventionalstrafen für die Nichteinhaltung wesentlicher Sicherheitsanforderungen. Der Auftragnehmer wird vertraglich verpflichtet, die Einhaltung durch nachprüfbare Belege (z.B. Audit-Berichte Dritter, Ergebnisse von Penetrationstests, SAST/DAST-Protokolle) nachzuweisen."
                  }
                ]
              },
              {
                "uuid": "87bdb4d0-f4ec-4571-ad68-42993efdd25b",
                "control-id": "KONF.10.1",
                "description": "Implementation for KONF.10.1 based on BSI APP.7.A1",
                "statements": [
                  {
                    "statement-id": "APP.7.A1-m1",
                    "uuid": "4bc756ee-e8d6-4aa5-8180-c9ae8b699a3e",
                    "description": "Für die Entwicklung von Individualsoftware ist lediglich ein technischer Ansprechpartner benannt. Es existieren keine formalisierten Verantwortlichkeiten oder ein definiertes Vorgehensmodell."
                  },
                  {
                    "statement-id": "APP.7.A1-m2",
                    "uuid": "9e0f4b85-5094-422d-987a-da245af7ec35",
                    "description": "Es ist eine verantwortliche Stelle für die Steuerung und Koordination der Software-Entwicklung benannt. Ein grundlegendes, aber informelles Projektmanagementmodell (z. B. eine einfache Liste von Aufgaben und Meilensteinen) wird verwendet."
                  },
                  {
                    "statement-id": "APP.7.A1-m3",
                    "uuid": "1ce67c41-e6da-44eb-b425-1e40ef63ab3d",
                    "description": "Die Planung des Software-Einsatzes MUSS um Aspekte von Individualsoftware ergänzt werden, indem definiert wird, wer dafür zuständig ist, die Software-Entwicklung bzw. den Auftragnehmenden zu steuern und zu koordinieren, sowie in was für einen organisatorischen Rahmen die Software zu entwickeln ist (Projektmanagementmodell)."
                  },
                  {
                    "statement-id": "APP.7.A1-m4",
                    "uuid": "4ed95d18-f69d-4034-a5a4-a9e97b657f68",
                    "description": "Individualsoftware SOLLTE im Rahmen eines Entwicklungsprojektes entwickelt werden. Das Entwicklungsprojekt sollte anhand eines Ablaufplans zeitlich grob geplant werden. Das gewählte Projektmanagementmodell ist mit den übergeordneten Sicherheitsrichtlinien der Institution verknüpft."
                  },
                  {
                    "statement-id": "APP.7.A1-m5",
                    "uuid": "dec421ae-30d3-4e8d-bdf9-0e8c5e0525f4",
                    "description": "Das Projektmanagementmodell ist vollständig in die Risikomanagement- und Sicherheits-Governance-Prozesse der Institution integriert. Die definierten Rollen umfassen spezifische Sicherheitsverantwortlichkeiten. Die Planung wird durch dedizierte Tools unterstützt, die eine kontinuierliche Überwachung des Projektfortschritts und der Einhaltung von Sicherheitsmeilensteinen ermöglichen."
                  }
                ]
              },
              {
                "uuid": "26ad0f42-cb97-4f59-84a7-ad8a4400db7d",
                "control-id": "KONF.11.8",
                "description": "Implementation for KONF.11.8 based on BSI APP.7.A3",
                "statements": [
                  {
                    "statement-id": "APP.7.A3-m1",
                    "uuid": "f769d41a-d6bf-4589-a00e-794bee44f88d",
                    "description": "Es wird nur der allgemeine Zweck der Software beschrieben, ohne spezifische Anforderungen an die technische Plattform, Ressourcen oder Schnittstellen."
                  },
                  {
                    "statement-id": "APP.7.A3-m2",
                    "uuid": "88caa437-106b-42ab-9a04-a6f3103d5c14",
                    "description": "Die Zielplattform (z.B. „Windows Server mit IIS“) ist grob spezifiziert. Ressourcenbeschränkungen und detaillierte Schnittstellenanforderungen sind jedoch nur allgemein und nicht formal beschrieben."
                  },
                  {
                    "statement-id": "APP.7.A3-m3",
                    "uuid": "7b59f6a4-a72a-438e-aa79-34439d9e205c",
                    "description": "Der IT-Betrieb und die zuständigen Fachverantwortlichen MÜSSEN Anforderungen an die technische Einsatzumgebung der geplanten Individualsoftware erstellen und mit der Software-Entwicklung abstimmen. Aus den Anforderungen MUSS klar hervorgehen: auf was für einer Hardware-Plattform, auf was für einer Software-Plattform (inklusive gesamten Software-Stack), mit welchen zur Verfügung stehenden Ressourcen (z. B. CPU-Cluster oder Arbeitsspeicher), und mit welchen Schnittstellen mit anderen IT-Systemen oder Anwendungen die Anwendung eingesetzt werden soll sowie welche Sicherheitsfunktionen sich hieraus ergeben."
                  },
                  {
                    "statement-id": "APP.7.A3-m4",
                    "uuid": "172c2a15-ba79-4fe8-aa5a-8741f70e8439",
                    "description": "Schnittstellen mit anderen IT-Systemen SOLLTEN in standardisierten technischen Formaten modelliert und definiert werden. Dies umfasst die Definition von Datenmodellen und Endpunkten."
                  },
                  {
                    "statement-id": "APP.7.A3-m5",
                    "uuid": "2d53a3d4-ddad-43e1-a5ad-5b7f5d701cfb",
                    "description": "Alle Plattform- und Schnittstellenanforderungen sind als „Infrastructure as Code“ (z.B. mit Terraform, Ansible) und „Policy as Code“ (z.B. mit Open Policy Agent) definiert. Dies stellt eine automatisierte Validierung und die konsistente Bereitstellung der Einsatzumgebung sicher."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}