{
  "component-definition": {
    "uuid": "ea36f3b5-55c7-44b0-a625-6dd6fc31460c",
    "metadata": {
      "title": "SYS.4.5 Daten - Benutzerdefiniert",
      "last-modified": "2025-11-13T21:19:02.950788+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "cadcc0ad-4cf6-4a20-9663-ace54011e77b",
        "type": "hardware",
        "title": "SYS.4.5 Daten",
        "description": "This component represents the implementation of all controls for Baustein SYS.4.5.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Wechseldatenträger werden oft eingesetzt, um Daten zu transportieren, zu speichern oder um mobil auf sie zugreifen zu können. Zu Wechseldatenträgern gehören externe Festplatten, CD-ROMs, DVDs, Speicherkarten, Magnetbänder und USB-Sticks.<BR>Wechseldatenträger sind danach klassifizierbar, ob sie nur lesbar, einmalig beschreibbar oder wiederbeschreibbar sind. Unterschiede gibt es auch bei der Art der Datenspeicherung (analog oder digital) oder ihrer Bauform. So gibt es auswechselbare Datenträger (z. B. verbaute Festplatten) oder externe Datenspeicher (z. B. USB-Sticks)."
          },
          {
            "name": "Zielsetzung",
            "value": "In diesem Baustein wird aufgezeigt, wie Wechseldatenträger sicher genutzt werden können. Außerdem wird beschrieben, wie verhindert werden kann, dass über Wechseldatenträger unbeabsichtigt Informationen weitergegeben werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein SYS.4.5 Wechseldatenträger ist auf jeden Wechseldatenträger im Informationsverbund anzuwenden.<BR>Dieser Baustein beschäftigt sich mit den Sicherheitseigenschaften von Wechseldatenträgern. Der Schutz der IT-Systeme, an denen die Wechseldatenträger angeschlossen werden können, wird in dem vorliegenden Baustein nicht berücksichtigt. Empfehlungen hierzu sind in den Bausteinen SYS.1.1 Allgemeiner Server und SYS.2.1 Allgemeiner Client sowie den betriebssystemspezifischen Bausteinen zu finden.<BR>Wechseldatenträger speichern Daten elektronisch, magnetisch oder auf andere, nicht direkt wahrnehmbare Weise. Sie verarbeiten dabei selbst keine Daten. Die Anforderungen an solche Geräte, wie z. B. Smartphones und Tablets, werden im Baustein SYS.3.2.1 Allgemeine Smartphones und Tablets aufgeführt. Nicht zu den Wechseldatenträgern zählen auch Cloud-Speicher. Anforderungen an Cloud-Umgebungen sind im Baustein OPS.2.2 Cloud-Nutzung zu finden.<BR>Wechseldatenträger können bei persönlichen Treffen oder auch per Versand ausgetauscht werden. Der sichere Austausch der eigentlichen Informationen wird in diesem Baustein nicht betrachtet. Dazu sind die Anforderungen des Bausteins CON.9 Informationsaustausch zu erfüllen."
          },
          {
            "name": "Sorglosigkeit im Umgang mit Informationen",
            "value": "Häufig gibt es in Institutionen zwar organisatorische Regelungen und technische Sicherheitsverfahren für Wechseldatenträger, diese werden jedoch oft durch einen sorglosen Umgang mit den Wechseldatenträgern umgangen. So kommt es etwa vor, dass Wechseldatenträger während einer Pause unbeaufsichtigt im Besprechungsraum zurück- oder auch im Zugabteil liegen gelassen werden."
          },
          {
            "name": "Unzureichende Kenntnis über Regelungen",
            "value": "Wenn die Regelungen für den korrekten Umgang mit Wechseldatenträgern nicht hinreichend bekannt sind, können sie sich auch nicht eingehalten werden. So können zahlreiche Gefährdungen hinsichtlich der Informationssicherheit eintreten, zum Beispiel, wenn nicht geprüfte USB-Sticks an die IT-Systeme der Institution angeschlossen werden."
          },
          {
            "name": "Diebstahl oder Verlust von Wechseldatenträgern",
            "value": "Bei Wechseldatenträgern ist das Risiko von Datenverlusten höher als bei stationären IT-Systemen. Ursachen für Datenverluste sind etwa Diebstahl oder verlorengegangene Geräte. Die auf den Wechseldatenträgern abgelegten Informationen sind in diesen Fällen oft unwiederbringlich verloren. Außerdem können die Informationen Externen in die Hände fallen."
          },
          {
            "name": "Defekte Datenträger",
            "value": "Wechseldatenträger sind aufgrund ihrer Größe und Anwendungsbereiche anfällig für Beschädigungen, Fehler oder Ausfälle. Ursache sind beispielsweise ständig wechselnde Einsatzumgebungen oder mechanische Einwirkungen."
          },
          {
            "name": "Beeinträchtigung durch wechselnde Einsatzumgebung",
            "value": "Wechseldatenträger werden in sehr unterschiedlichen Umgebungen eingesetzt und sind dadurch vielen Gefährdungen ausgesetzt. Dazu gehören beispielsweise schädigende Umwelteinflüsse wie zu hohe oder zu niedrige Temperaturen und Staub oder Feuchtigkeit. Hinzu kommen beispielsweise Transportschäden. Ein weiterer wichtiger Aspekt ist, dass Wechseldatenträger oft in Bereichen mit unterschiedlichem Sicherheitsniveau benutzt werden."
          },
          {
            "name": "Verbreitung von Schadsoftware",
            "value": "Wechseldatenträger werden oft benutzt, um Daten zwischen verschiedenen Geräten und dem Arbeitsplatzrechner auszutauschen. Schadsoftware könnte Daten auf den Wechseldatenträgern kompromittieren und sich so auf die Arbeitsplatzrechner übertragen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "029c008d-8621-40a5-b251-7cc7ae28ef0f",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/daten_profile.json",
            "description": "Implementation for all controls in Baustein SYS.4.5",
            "implemented-requirements": []
          }
        ]
      }
    ]
  }
}