{
  "component-definition": {
    "uuid": "1538f43b-4f9b-41f8-9a80-d9219a5965a6",
    "metadata": {
      "title": "INF.11 Fahrzeuge - Benutzerdefiniert",
      "last-modified": "2025-11-13T21:19:03.814769+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "ea279042-9bb7-486e-9046-ef8cb117131e",
        "type": "physical",
        "title": "INF.11 Fahrzeuge",
        "description": "This component represents the implementation of all controls for Baustein INF.11.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Institutionen nutzen in vielen Situationen die unterschiedlichsten Fahrzeuge im Nah- und Fernbereich. Als Fahrzeug werden im Kontext dieses Bausteins motorisierte Fortbewegungsmittel bezeichnet, die sich in der Regel auf Land- und Luftstraßen, Seewegen sowie Wasserstraßen bewegen und über eine Fahrzeugkabine oder Vergleichbares verfügen. Beispiele hierfür sind PKW, LKW, Flugzeuge oder Schiffe. Im folgenden Text wird nur noch der Oberbegriff Fahrzeug verwendet, außer es ist eine bestimmte Art von Fahrzeug gemeint.<BR>Nahezu alle modernen Fahrzeuge verfügen über integrierte IT-Komponenten, wie zum Beispiel Infotainmentsysteme oder interne Analysesysteme, die im Rahmen der Informationssicherheit ganzheitlich betrachtet werden müssen. Darüber hinaus werden dienstliche Aufgaben häufig nicht nur in den Räumen und Gebäuden einer Institution erledigt, sondern auch innerhalb von Fahrzeugen, die sich an wechselnden Standorten und in verschiedenen Umgebungen befinden können. Ein Fahrzeug ist somit auch eine eigenständige mobile Arbeitsumgebung, die durch die Institution angemessen abgesichert werden muss."
          },
          {
            "name": "Zielsetzung",
            "value": "Der Baustein beschreibt spezifische Gefährdungen, die zu beachten sind, wenn Institutionen Fahrzeuge mit IT-Komponenten einsetzen oder Fahrzeuge im Allgemeinen als IT-Arbeitsplätze verwenden. Darauf aufbauend legt der Baustein fest, welche Anforderungen von Fahrzeugnutzenden und -haltenden zu erfüllen sind, um den optimalen Betrieb eines Fahrzeugs aus Sicht der Informationssicherheit zu gewährleisten."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein INF.11 Allgemeines Fahrzeug ist grundsätzlich auf jedes von der Institution eingesetztes Land-, Luft- und Wasserfahrzeug einmal anzuwenden.<BR>Adressaten des Bausteins sind Benutzende und Betreibende von Fahrzeugen. Autonom fahrende oder ferngesteuerte Fahrzeuge, Schienenfahrzeuge und Raumfahrzeuge sind von diesem Baustein ausgenommen.<BR>Die Art, die Ausstattung, der Einsatzort und das Aufgabenfeld von Fahrzeugen können sich je nach Institution voneinander unterscheiden. In dem Baustein INF.11 Allgemeines Fahrzeug werden nur die typischen Einsatzszenarien von Fahrzeugen berücksichtigt, sodass spezielle Einsatzzwecke, wie etwa Rettungseinsätze von Rettungshubschraubern oder Kampfeinsätze von Militärfahrzeugen, ergänzend individuell betrachtet werden müssen.<BR>Daher wird nicht abschließend auf nachträglich eingebaute, einsatzspezifische IT-Systeme oder fahrzeugspezifische Fachanwendungen eingegangen, wie sie zum Beispiel bei Einsatzfahrzeugen oder Führungsfahrzeugen üblich sind. Die Ausstattung und die damit verbundenen Fachanwendungen dieser Fahrzeuge sind individuell ergänzend zu behandeln.<BR>Außerdem werden die fahrzeugeigenen Netze über Kommunikationsbusse wie CAN, LIN oder Flexray, auch IVN (In-Vehicle-Network) genannt, nicht betrachtet, da diese in der Regel nicht durch die Anwendenden verändert werden.<BR>Um die mitgeführten und nachträglich eingebauten IT-Komponenten abzusichern, müssen alle relevanten Bausteine, wie SYS.3.1 Laptops, SYS.3.2 Allgemeine Smartphones und Tablets, NET.3.3 VPN und die Bausteinschichten NET.4 Telekommunikation sowie NET.2 Funknetze gesondert berücksichtigt werden.<BR>Darüber hinaus muss, bevor das Fahrzeug entsorgt, bzw. ausgesondert wird, der Baustein CON.6 Löschen und Vernichten angewendet werden, damit keine schützenswerten Informationen im Fahrzeug verbleiben.<BR>Dieser Baustein behandelt alle infrastrukturellen Aspekte, sodass INF.9 Mobiler Arbeitsplatz nicht zusätzlich zu modellieren ist."
          },
          {
            "name": "2.1. Fehlende oder unzureichende Regelungen für Fahrzeuge",
            "value": "Wird nicht oder nur unzureichend geregelt, welche Informationen über die von Fahrzeugen für Benutzende zur Verfügung gestellten Netze wie WLAN oder Bluetooth übertragen und verarbeitet werden dürfen und welche Schutzvorkehrungen dabei zu treffen sind, können vertrauliche Informationen offengelegt werden. Wird nicht hinreichend geregelt, wie diese abzusichern und zu benutzen sind, könnten schützenswerte Informationen wie personenbezogene Daten offengelegt werden.<BR>Wenn Fahrzeuge gestohlen werden oder integrierte IT-Komponenten ausfallen und es hierfür keine Regelungen und festgelegte Abläufe gibt, kann dies gravierende Folgen haben. Es besteht die Gefahr, dass schützenswerte Informationen im Fahrzeug verbleiben und unbefugte Dritte Zugang zu diesen erhalten.<BR>Wenn Fahrzeuge oder die darin verbauten IT-Komponenten unsachgemäß in Betrieb genommen werden, kann dies zu umfangreichen Gefährdungen der Informationssicherheit führen. Es könnten relevante Einstellungen, wie die automatische Synchronisation von Telefonbüchern, falsch konfiguriert sein oder es könnten Funktionstest bei Flugzeugen übersprungen oder unsachgemäß durchgeführt werden. Dies wiederum kann dazu führen, dass die Systeme des Flugzeuges während des Einsatzes nicht wie vorgesehen funktionieren und schlimmstenfalls zu einem Totalverlust des Flugzeugs führen.<BR>Genauso kann aber auch die Funktion der integrierten IT-Komponenten und des gesamten Fahrzeuges gefährdet werden, wenn das Fahrzeug unsachgemäß ausgeschaltet oder temporär außer Betrieb genommen wird. Ein Beispiel hierfür sind Einsatzfahrzeuge. Werden diese für einen längeren Zeitraum ausgeschaltet, so droht aufgrund der umfangreichen Ausstattung, dass sich die Fahrzeugbatterie vollständig entlädt. Infolgedessen kann das Fahrzeug nicht mehr starten und in den integrierten IT-Komponenten könnten Daten verloren gehen."
          },
          {
            "name": "2.2. Fehlendes Sicherheitsbewusstsein und Sorglosigkeit beim Umgang mit dem Fahrzeug",
            "value": "Fehlendes Sicherheitsbewusstsein und Sorglosigkeit beim Umgang mit den Fahrzeugen und deren Komponenten stellen eine ernstzunehmende Gefahr dar. Sind Mitarbeitende beispielsweise nicht ausreichend geschult, wie sie mit den Fahrzeugen und den IT-Komponenten umgehen sollen und sind sich der möglichen Risiken nicht bewusst, könnten Fahrzeuge und die darin verbauten IT-Komponenten falsch oder unsorgfältig benutzt werden. So werden zum Beispiel IT-Systeme auf Brücken von Schiffen von unterschiedlichen Personen benutzt. Werden nun wesentliche Einstellungen von einem Benutzenden verändert, ohne die weiteren Benutzenden darüber zu informieren, dann könnten Fehlfunktionen auftreten, die die weiteren Benutzenden nicht nachvollziehen können.<BR>Eine weitere Gefahr kann darin bestehen, dass Fahrzeuge unzuverlässig abgeschlossen werden. Hierdurch könnten unbefugte Dritte einfach die Fahrzeugkabine betreten und alle dort vorhandenen IT-Komponenten und abgelegten Informationen einsehen oder entwenden.<BR>Weiterhin könnten schlecht geschulte Mitarbeitende unangemessen auf Störungen reagieren und durch eine falsche Reaktion die Situation verschlimmern. Wird z. B. bei einer Störung der integrierten IT-Systeme des Fahrzeugs nicht die hierfür zuständige Stelle der Institution kontaktiert, sondern vom Benutzenden versucht, die Störung selbst zu beheben, können hieraus unabsehbare Folgen resultieren. Es könnten beispielsweise relevante Einstellungen für die Sicherheit oder den Datenschutz verändert werden."
          },
          {
            "name": "2.3. Ungeregelte Datenübertragung an Dritte und unsichere Kommunikationsschnittstellen",
            "value": "Viele moderne Fahrzeuge verfügen nicht nur über die für die Benutzenden relevanten bzw. direkt ersichtlichen drahtlosen Kommunikationsschnittstellen, wie z. B. Bluetooth oder WLAN. Viele interne Systeme des Fahrzeugs kommunizieren direkt über integrierte Mobilfunkschnittstellen mit IT-Systemen der herstellenden Unternehmen, wobei dieser Informationsaustausch von den Anwendenden in der Regel nicht beeinflusst werden kann. Hiermit sind nicht nur gesetzlich vorgeschriebene und für den Anwendenden transparente Systeme wie der eCall gemeint, sondern insbesondere auch solche, die nicht für den Benutzenden direkt ersichtlich sind. Beispielsweise übertragen viele fahrzeugherstellende Unternehmen Daten, um detaillierte Informationen über den Standort und die Kilometerzahl des Fahrzeugs oder über das Verhalten der Fahrzeugführenden zu sammeln. Dadurch könnten umfangreich personenbezogene Daten über die Fahrzeugnutzenden erhoben werden, ohne dass diese darüber Kenntnis haben oder dieser Datenerhebung und -verarbeitung explizit zugestimmt haben.<BR>Eine weitere Gefahr sind unsichere Kommunikationsschnittstellen der Fahrzeuge. Durch mangelnde Schutzmechanismen können so sensible Daten ausgelesen werden. Lässt beispielsweise das Infotainmentsystem eine Bluetooth-Koppelung ohne Sicherheitsmechanismen zu, könnten unbefugte Dritte ihr Smartphone unbemerkt damit koppeln und Adressbücher synchronisieren."
          },
          {
            "name": "2.4. Unsachgemäße Veränderungen am Fahrzeug",
            "value": "Während herkömmliche PKW sehr selten durch den Fahrzeugbetreibenden verändert werden, müssen Fahrzeuge für spezialisierte Einsatzzwecke sehr häufig noch durch die Betreibenden oder spezialisierten Unternehmen nachträglich angepasst werden. Ein Beispiel hierfür sind Einsatzfahrzeuge oder nachträglich modernisierte oder umfunktionierte Schiffe. Wird in diesen Fällen ein Fahrzeug unsachgemäß verändert, indem z. B. zusätzliche Kabel ungeeignet verlegt werden, kann dies zu erheblichen Schäden bis hin zum Totalverlust des Fahrzeugs führen.<BR>Auch anderweitige Veränderungen können die Einsatzfähigkeit der Fahrzeuge beeinträchtigen. Wird z. B das Infotainmentsystem manipuliert, um neue bzw. gesperrte Funktionen freizuschalten, könnten die Updates des herstellenden Unternehmens nicht mehr eingespielt und damit verbunden potentielle Sicherheitslücken nicht mehr geschlossen werden."
          },
          {
            "name": "2.5. Manipulation, unbefugter Zutritt und Diebstahl bei Fahrzeugen",
            "value": "Offen in Fahrzeugen liegende Informationen können häufig von außerhalb der Fahrzeuge eingesehen werden, wenn kein oder nur ein unzureichender Sichtschutz vorhanden ist. Dies kann Begehrlichkeiten wecken, die zu Angriffen führen.<BR>Fahrzeuge werden häufig auf öffentlich zugänglichen Parkplätzen abgestellt oder an Bootsanlegern vertäut, die nicht durch zentrale Schutzmaßnahmen der Institution, wie Sicherheitsdienste oder verschlossene Garagen, geschützt werden. Sie sind somit prinzipiell einem erhöhten Risiko ausgesetzt, von Unbefugten betreten zu werden. Unsichere Schließsysteme können hierbei eine Schwachstelle sein. Zum Beispiel können sogenannte schlüssellose Schließsysteme an Fahrzeugen unter Umständen leicht durch Relay-Angriffe umgangen werden.<BR>Somit können IT-Systeme, Zubehör, Informationen und Software häufig einfacher manipuliert, zerstört oder gestohlen werden, wenn sie in Fahrzeugen statt in Räumlichkeiten der Institution unbeaufsichtigt aufbewahrt werden. Werden IT-Systeme, Zubehör, Informationen oder Software manipuliert oder zerstört, sind die Mitarbeitenden in Fahrzeugen oft nur noch eingeschränkt arbeitsfähig. Die betroffenen IT-Systeme könnten sogar in der Art manipuliert werden, dass z. B. die darauf verarbeiteten Daten durch Schadsoftware an unbefugte Dritte weitergeleitet werden. Des Weiteren müssen womöglich zerstörte IT-Komponenten ersetzt werden, was sowohl finanzielle als auch personelle Ressourcen erfordert."
          },
          {
            "name": "2.6. Gefahren im Zusammenhang mit Wartung, Reparatur und Updates",
            "value": "Werden Fahrzeuge und die verwendeten IT-Komponenten nicht oder nur unzureichend gewartet und gepflegt oder ihre Funktionsfähigkeit nicht regelmäßig überprüft, kann das dazu führen, dass sie im Bedarfsfall nicht oder nur eingeschränkt einsatzfähig sind.<BR>Eine große Herausforderung hierbei ist, dass Updates für die in den Fahrzeugen integrierten IT-Systeme nicht unbedingt zu den regelmäßigen Wartungszyklen der Fahrzeuge bereitstehen. Dadurch könnten Updates beispielsweise nur unregelmäßig und verzögert eingespielt werden.<BR>In institutionseigenen Werkstätten können die Fahrzeuge und die verbauten IT-Komponenten in der Regel nicht vollständig gewartet oder repariert werden, weshalb Fahrzeuge häufig an Fremdfirmen übergeben werden. In den Räumlichkeiten der Fremdfirmen sind die Fahrzeuge meist unbeobachtet und Dritte können umfassend auf das Fahrzeug und die verwendeten IT-Komponenten zugreifen. Dadurch besteht ein erhöhtes Risiko, dass die IT-Komponenten missbraucht oder schützenswerte Informationen entwendet werden."
          },
          {
            "name": "2.7. Gefahren bei der Aussonderung",
            "value": "Werden Fahrzeuge ausgesondert, können diese mit allen verbauten IT-Komponenten oder mit einem Teil davon veräußert werden. Hierdurch können Fremdpersonen auf die IT-Komponenten zugreifen und so auf interne Informationen oder personenbezogene Daten rückschließen, wie zum Beispiel gespeicherte Telefonnummern. Außerdem können institutionseigene Komponenten wie SIM-Karten oder Kryptomodule in den Fahrzeugen verbleiben. Somit würden die nachfolgenden Besitzenden ungewollt Zugang zu diesen erhalten und könnten beispielsweise Informationen aus diesen Komponenten auslesen (wie z. B. Telefonnummern von der SIM-Karte) und widerrechtlich verwenden."
          },
          {
            "name": "2.8. Unzulässige Temperatur und Luftfeuchte in Fahrzeugen",
            "value": "Jedes Gerät hat einen Temperaturbereich, innerhalb dessen es ordnungsgemäß funktioniert. Über- oder unterschreitet die Raumtemperatur die Grenzen dieses Bereiches, können Geräte sowie IT-Komponenten ausfallen und der Betrieb kann gestört werden. Ähnliches gilt für die Luftfeuchtigkeit. In Fahrzeugen liegen unterschiedliche Voraussetzungen vor, die genau zu solchen Situationen führen können. So kann der Innenraum von in der Sonne abgestellten Fahrzeugen bis zu 70 Grad erreichen und somit den üblichen Temperaturbereich von z. B. Lithium-Ionen-Akkus überschreiten."
          }
        ],
        "control-implementations": [
          {
            "uuid": "95dc4783-811e-46f3-bf67-de21d42f86ef",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/fahrzeuge_profile.json",
            "description": "Implementation for all controls in Baustein INF.11",
            "implemented-requirements": [
              {
                "uuid": "0c657b01-c9f8-42a4-83f2-8348fba80539",
                "control-id": "ARCH.2.2.11",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.11.A17-m3",
                    "uuid": "35bbbc72-0f63-4c4c-a3a7-bdb8c16fbb2e",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Generell SOLLTE die Institution sicherstellen, dass keine Informationen unerlaubt und undefiniert zwischen dem In-Vehicle-Network (IVN), das an die Netze der Fahrzeughersteller angebunden ist, und den einsatzspezifischen IT-Komponenten ausgetauscht werden. Hierzu SOLLTEN Gateways mit standardisierten Protokollen eingesetzt werden. Die Gateways SOLLTEN dabei vom fahrzeugherstellenden Unternehmen freigegeben sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Für die Anbindung von Sonder-IT (z.B. ein Diagnoselaptop) an den Fahrzeugbus wird ein vom Hersteller empfohlenes Gateway verwendet. Die Konfiguration des Gateways lässt nur die für den Anwendungsfall unbedingt notwendige Kommunikation zu. Direkte, unkontrollierte Verbindungen werden vermieden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert den Netzwerkplan des Fahrzeugs und die Spezifikationen des verwendeten Gateways. Es wird geprüft, ob eine Freigabe des Herstellers für das Gateway vorliegt. Die Konfiguration des Gateways wird auf Plausibilität geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A17-m4",
                    "uuid": "99fa3a99-c25a-4c77-98da-6eb48610c94c",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein zertifiziertes, vom Hersteller zugelassenes Gateway wird verwendet. Es ist mit einem strengen Default-Deny-Regelsatz konfiguriert, der nur explizit definierte Nachrichten zwischen dem IVN und dem Sondernetz zulässt. Die Konfiguration des Gateways wird zentral verwaltet und auditiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Gateway wird so konfiguriert, dass es als reine Firewall fungiert. Nur spezifische CAN-IDs oder Ethernet-Frames, die für die Funktion der Sonder-IT notwendig sind, werden durchgelassen. Jede Änderung an der Gateway-Konfiguration erfordert einen genehmigten Change-Request und wird protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Firewall-Regeln des Gateways im Detail. Es wird geprüft, ob der Grundsatz 'Default-Deny' umgesetzt ist. Die Change-Management-Protokolle für Konfigurationsänderungen am Gateway werden auditiert. Netzwerk-Traffic kann mitgeschnitten und gegen die Regelliste verifiziert werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A17-m5",
                    "uuid": "56fc605d-0d8f-490d-9cf2-ad40348730e5",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein High-Assurance-Gateway mit Intrusion-Detection-Fähigkeiten wird eingesetzt. Es filtert nicht nur den Verkehr, sondern überwacht ihn auch auf Anomalien und Angriffe auf den Fahrzeugbus. Der gesamte Datenverkehr zwischen den Segmenten wird protokolliert und analysiert. Das Gateway selbst ist ein gehärtetes Gerät mit Secure Boot und Funktionen zur Fernattestierung."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Gateway nutzt Deep Packet Inspection für den Fahrzeugbus-Verkehr und vergleicht ihn mit einem erlernten Normalprofil. Bei Abweichungen (z.B. unbekannte CAN-IDs, ungewöhnliche Frequenzen) wird ein Alarm an das SIEM gesendet und der verdächtige Verkehr kann blockiert werden. Das Gateway wird regelmäßig auf Integrität geprüft (Remote Attestation)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des Intrusion Detection Systems auf dem Gateway. Die SIEM-Logs werden auf Alarme vom Gateway hin untersucht, um dessen Wirksamkeit zu beurteilen. Die Protokolle der Remote-Attestation-Prüfungen werden kontrolliert, um die Integrität des Gateways selbst sicherzustellen. Ein Penetrationstest kann versuchen, die Netzwerkgrenze zu überwinden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "8b8ff854-3bea-48d5-bc37-fb80c23c5f6f",
                "control-id": "ASST.5.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "REAL",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.11.A2-m1",
                    "uuid": "cb4dafa2-a482-4848-8c19-39a25538fb2d",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wartung wird rein reaktiv durchgeführt, wenn ein Defekt auftritt. Updates für IT-Komponenten werden sporadisch oder gar nicht installiert. Es gibt keine klaren Regeln, wer Wartungen durchführt oder Updates einspielt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt keinen Wartungsplan. Fahrer sind angewiesen, bei Problemen eine beliebige Werkstatt aufzusuchen. OTA-Update-Anfragen auf dem Display werden entweder ignoriert oder von den Fahrern nach eigenem Ermessen bestätigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Fahrzeughistorie auf geplante vs. ungeplante Werkstattaufenthalte. Fehlende Wartungspläne und -protokolle sind ein Indiz für diesen Reifegrad. Softwareversionen der IT-Komponenten werden stichprobenartig geprüft und mit den aktuell verfügbaren Versionen verglichen; große Abweichungen bestätigen die unzureichende Update-Versorgung."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A2-m2",
                    "uuid": "a6e44e93-caa5-45a2-9818-e0e2c88d3fa0",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Wartung der Fahrzeuge folgt den grundlegenden Herstellervorgaben. Updates werden installiert, wenn das System dazu auffordert, jedoch ohne einen definierten Prozess oder Kontrollen der Umgebung. Nach einer Wartung werden grundlegende Funktionstests durchgeführt, aber nicht systematisch anhand einer Checkliste."
                      },
                      {
                        "name": "guidance",
                        "value": "Fahrzeuge werden zu den vom Hersteller vorgesehenen Intervallen in die Werkstatt gebracht. OTA-Updates werden in der Regel vom Fahrer initiiert. Nach der Wartung prüft der Fahrer, ob das Fahrzeug fährt und die wesentlichen Systeme funktionieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Wartungsnachweise und vergleicht sie mit den Herstellervorgaben. Es wird geprüft, ob ein Prozess für die Freigabe und Installation von Updates existiert. Das Fehlen von standardisierten Checklisten für die Abnahme nach der Wartung deutet auf diesen Reifegrad hin."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A2-m3",
                    "uuid": "59353f90-ae4f-4033-97fd-4c0abe8cf5ed",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Fahrzeuge und die zugehörigen IT-Komponenten MÜSSEN nach den Vorgaben des Herstellers gewartet werden. Es MUSS klar geregelt werden, wer in welcher Umgebung Updates installieren darf. Auch „Over-the-Air“ (OTA) Updates MÜSSEN geregelt eingespielt werden. Wartungs- und Reparaturarbeiten MÜSSEN von befugtem Personal in einer sicheren Umgebung durchgeführt werden. SOLLTE vor der Wartung geklärt werden, wie mit Fremdfirmen umgegangen wird. Nach der Rückkehr in den Betrieb MUSS mittels Checkliste geprüft werden, ob alle Mängel behoben und die IT-Komponenten einsatzfähig sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Es existiert ein Wartungs- und Updateplan. Es ist definiert, dass Updates nur von autorisiertem Personal (z.B. IT-Betrieb) und in einer vertrauenswürdigen Umgebung (z.B. im Unternehmensnetzwerk) installiert werden dürfen. Für die Abnahme nach der Wartung wird eine standardisierte Checkliste verwendet, die auch die Prüfung von IT-Sicherheitsfunktionen umfasst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz und Einhaltung von Wartungs- und Updateplänen. Es wird geprüft, ob Regelungen für die Update-Installation und den Umgang mit Fremdfirmen existieren. Die ausgefüllten Abnahme-Checklisten werden stichprobenartig kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A2-m4",
                    "uuid": "f6cb51ac-f47c-4f1a-b232-cde9544a91ba",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Umgang mit Fremdfirmen bei Wartungsarbeiten ist durch verbindliche vertragliche Vereinbarungen (z.B. Vertraulichkeitserklärungen, Sicherheitsanforderungen an die Werkstatt) geregelt. OTA-Updates werden über eine zentrale Richtlinie verwaltet und idealerweise zentral freigegeben, bevor die Fahrer sie installieren können. Die nach der Wartung verwendete Checkliste ist detailliert, wird revisionssicher archiviert und enthält spezifische IT-Sicherheitsprüfpunkte."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor der Vergabe von Wartungsarbeiten an eine Werkstatt wird ein Vertrag zur Auftragsverarbeitung oder eine vergleichbare Sicherheitsvereinbarung geschlossen. Ein Flottenmanagement-Tool wird genutzt, um den Update-Status der Fahrzeuge zu überwachen und OTA-Updates zentral zu steuern. Die Checkliste wird als Teil des Wartungsprotokolls digital abgelegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Verträge mit externen Werkstätten auf Sicherheitsklauseln. Es wird das Verfahren zur Verwaltung von OTA-Updates geprüft, idealerweise durch Einsicht in die Konfiguration des Flottenmanagement-Tools. Die Vollständigkeit und Qualität der digital archivierten Abnahmeprotokolle werden auditiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A2-m5",
                    "uuid": "d0fa3d88-35b4-4313-a5f3-2e4479156f9d",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein zentrales, automatisiertes System verwaltet die Wartungspläne und die Verteilung von Updates. Jeglicher Fremdzugriff auf die Fahrzeug-IT während der Wartung wird streng kontrolliert und protokolliert. Die Überprüfung nach der Wartung ist, wo möglich, automatisiert (z.B. durch Skripte, die die Konfiguration und Funktionsfähigkeit von IT-Systemen prüfen) und generiert Compliance-Berichte."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein fortschrittliches Flottenmanagement-System wird eingesetzt, das proaktiv Wartungsbedarf meldet (Predictive Maintenance) und ein vollautomatisches Patch-Management für die Fahrzeug-IT ermöglicht. Bei Wartungen durch Dritte wird ein spezieller, schreibgeschützter „Werkstattmodus“ aktiviert, der den Zugriff auf sensible Daten und Funktionen unterbindet. Automatisierte Health-Checks nach jedem Werkstattbesuch prüfen die Integrität der Systeme."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration und die Protokolle des zentralen Management-Systems. Es wird geprüft, ob technische Schutzmaßnahmen wie ein „Werkstattmodus“ implementiert und genutzt werden. Die Berichte der automatisierten Verifikationsläufe nach Wartungen werden ausgewertet, um die Effektivität des Prozesses zu beurteilen. Ein automatisierter Scan der Fahrzeugkonfiguration kann zur Überprüfung der Korrektheit herangezogen werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "c55806a5-735f-45a1-8e76-2a5ae27b1216",
                "control-id": "ASST.6.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Improvement",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ASST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.11.A10-m3",
                    "uuid": "d938f4e3-fb43-4ad0-bdd7-d7df9440c7ca",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Werden Fahrzeuge ausgesondert, SOLLTEN keine schützenswerten Informationen in den Fahrzeugen verbleiben. Bevor Fahrzeuge endgültig ausgesondert werden, SOLLTE anhand der Inventarliste geprüft werden, ob keine inventarisierten Gegenstände und darüber hinaus relevanten Gegenstände zurückgelassen worden sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine Checkliste für die Fahrzeugaussonderung. Diese schreibt vor, alle persönlichen Gegenstände zu entfernen, die IT-Systeme (Navigationsgerät, Infotainment) auf Werkseinstellungen zurückzusetzen und anhand der Inventarliste zu prüfen, ob alle institutionseigenen Geräte (z.B. Handfunkgeräte, SIM-Karten) entfernt wurden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Aussonderungs-Checkliste an und prüft deren Vollständigkeit. Bei einer anstehenden Aussonderung wird der Prozess begleitet und die Abarbeitung der Checkliste verifiziert. Bei bereits ausgesonderten Fahrzeugen werden die Protokolle geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A10-m4",
                    "uuid": "28137d7c-e88e-4c83-8a94-ab539106411e",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein formaler, dokumentierter Aussonderungsprozess ist etabliert. Dieser umfasst das sichere Löschen von Daten auf allen IT-Systemen gemäß anerkannter Standards. Die Durchführung der Maßnahmen wird in einem Aussonderungsprotokoll, das dem Fahrzeugakt beigefügt wird, bestätigt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Prozess wird von geschultem Personal (IT-Betrieb) durchgeführt. Neben dem Zurücksetzen auf Werkseinstellungen werden, falls technisch möglich, sichere Löschverfahren (z.B. mehrfaches Überschreiben) angewendet. Das Aussonderungsprotokoll wird vom IT-Verantwortlichen und vom Flottenmanager unterschrieben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die formalen Aussonderungsprozess-Dokumentationen und die unterzeichneten Protokolle. Es wird geprüft, ob die angewendeten Löschverfahren dem Stand der Technik entsprechen. Die Schulungsnachweise des Personals werden kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A10-m5",
                    "uuid": "e6936761-6a74-47be-b814-bcb4878aeb20",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Aussonderung wird ausschließlich von speziell geschultem Personal durchgeführt. Wo immer verfügbar, wird die Funktion 'Cryptographic Erase' genutzt, um Daten durch Vernichtung des kryptografischen Schlüssels unlesbar zu machen. Datenträger, die nicht sicher gelöscht werden können (z.B. bestimmte Festspeicher), werden physisch ausgebaut und nachweislich vernichtet. Der gesamte Prozess wird auditiert und ein lückenloser Nachweis wird für den gesamten Lebenszyklus des Fahrzeugs aufbewahrt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Institution verfügt über detaillierte Anleitungen für jeden Fahrzeugtyp, wie die IT-Systeme sicher gelöscht oder ausgebaut werden können. Für die physische Zerstörung von Datenträgern wird ein zertifizierter Dienstleister beauftragt, der ein Vernichtungszertifikat ausstellt. Die Aussonderung wird per Video dokumentiert oder nach dem Vier-Augen-Prinzip durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die detaillierten technischen Anleitungen und die Vernichtungszertifikate des Dienstleisters. Es wird geprüft, ob ein lückenloser Nachweis von der Beschaffung bis zur zertifizierten Vernichtung der Daten für jedes Fahrzeug geführt wird. Die Aufzeichnungen (Video, Protokolle) der Aussonderung werden stichprobenartig geprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "48acdfef-4bd6-494e-b03f-c201efdf21ab",
                "control-id": "GEB.6.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.11.A13-m3",
                    "uuid": "1035da28-64ae-41bf-aa23-1175f6041890",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Je nach Art der Fahrzeuge SOLLTEN geeignete Maßnahmen ergriffen werden, um die Fahrzeuge vor potentieller Fremdeinwirkung in der geplanten Einsatzumgebung zu schützen, wie z. B. störenden Funkstrahlen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es besteht ein Bewusstsein für Risiken wie GPS-Jamming. In der Fahrereinweisung wird auf das mögliche Verhalten des Navigationssystems bei Störungen hingewiesen und alternative Navigationsmethoden (z.B. Karte, App auf dem Smartphone) werden als Backup empfohlen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Schulungsunterlagen auf Hinweise zu Fremdeinwirkungen. Es wird befragt, ob eine Risikobetrachtung für solche Szenarien stattgefunden hat."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A13-m4",
                    "uuid": "d68515e4-f705-4428-9f53-772c2b1dd634",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Risikobewertung wird durchgeführt, um wahrscheinliche externe Bedrohungen (z.B. GPS-Jamming, starke RF-Interferenzen) zu identifizieren. Basierend darauf werden Gegenmaßnahmen wie geschirmte Kabel, gefilterte Antennen oder redundante Navigationssysteme (z.B. inertiale Navigation als Ergänzung zum GPS) implementiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Für Fahrzeuge, die in kritischen Bereichen eingesetzt werden, werden Navigationssysteme beschafft, die neben GPS auch andere Satellitensysteme (Galileo, GLONASS) nutzen und über eine Trägheitsnavigation verfügen. Die Verkabelung von kritischen Systemen wird speziell geschirmt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Risikobewertung und die daraus abgeleiteten Schutzmaßnahmen. Die technischen Spezifikationen der verbauten Komponenten (Navigationssysteme, Kabel) werden geprüft, um die Umsetzung der Maßnahmen zu verifizieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A13-m5",
                    "uuid": "c73b5ec8-4c76-4c59-a6eb-fc5af60b8bd8",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Fahrzeug ist mit aktiven Gegenmaßnahmen und Detektionssystemen für externe Bedrohungen ausgestattet. Zum Beispiel wird ein GPS-Anti-Jamming-System verwendet und das Funkspektrum wird auf Anomalien überwacht. Wo erforderlich, ist das Fahrzeug gegen elektromagnetische Impulse (EMP) gehärtet."
                      },
                      {
                        "name": "guidance",
                        "value": "Spezialfahrzeuge sind mit militärischen oder industriellen Anti-Jamming- und Anti-Spoofing-GPS-Empfängern ausgestattet. Ein Spektrumanalysator an Bord warnt den Fahrer und das SOC vor ungewöhnlichen Funksignalen. Die Elektronik ist in einem EMP-geschützten Gehäuse untergebracht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Zertifizierungen und Spezifikationen der aktiven Schutzsysteme. Die Konfiguration der Überwachungssysteme und die Alarm-Logs werden analysiert. Nachweise zur EMP-Härtung (z.B. Testzertifikate) werden eingesehen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "edf6f7c2-85f8-47d7-9dc3-eaf0e5206df4",
                "control-id": "GEB.7.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SENS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.11.A7-m3",
                    "uuid": "5a9ca4c4-8c09-43ca-9e4f-b4b20aa61cad",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE Regelungen ergänzen, wann, wie und wo Fahrzeuge sachgerecht abgestellt werden, um sie vor unbefugtem Zutritt oder Sachbeschädigung zu schützen. Es SOLLTE berücksichtigt werden, welche Informationen und IT-Systeme in den Fahrzeugen aufbewahrt werden dürfen. Ausreichende Maßnahmen zum Zutrittsschutz SOLLTEN ergriffen werden. Schützenswerte Informationen SOLLTEN nicht von außerhalb einsehbar oder mithörbar sein. Mitarbeitende SOLLTEN mit der grundlegenden Funktionsweise der Fahrzeuge und IT-Komponenten vertraut gemacht und über Sicherheitsrisiken informiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "In der Fahrzeug-Sicherheitsrichtlinie werden klare Regeln zum Parken (z.B. 'bevorzugt in beleuchteten Bereichen'), zum Verschließen des Fahrzeugs und zum Umgang mit Informationen (z.B. 'keine Dokumente offen liegen lassen', 'Laptop im Kofferraum verstauen') definiert. Im Rahmen der Fahrzeugeinweisung werden die Benutzer auf diese Regeln und auf allgemeine Risiken (z.B. Relay-Angriffe auf Keyless-Systeme) hingewiesen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Richtlinie auf entsprechende Regelungen. Durch Beobachtung auf dem Firmenparkplatz oder durch unangekündigte Begehungen wird die Einhaltung der Regeln stichprobenartig kontrolliert (z.B. sind Fahrzeuge verschlossen, liegen Laptops sichtbar im Auto?). Mitarbeiter werden zu den ihnen bekannten Risiken befragt."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A7-m4",
                    "uuid": "f65216c3-fe12-405a-84ed-3b6834e5753a",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Richtlinie definiert sichere Parkorte (z.B. Firmengarage, bewachte Parkplätze) und verbietet das Parken in bekannten Hochrisikogebieten. Es wird genau spezifiziert, welche Arten von Dokumenten und Geräten bei Abwesenheit aus dem Fahrzeug entfernt werden müssen. Technische Maßnahmen wie Blickschutzfolien für Laptops oder fest verbaute, abschließbare Kassetten werden für bestimmte Szenarien vorgeschrieben. Das Thema wird in der jährlichen Sicherheitsunterweisung behandelt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Institution stellt für den Transport von vertraulichen Unterlagen abschließbare Dokumentenkoffer zur Verfügung. Laptops, die im Fahrzeug verbleiben, müssen in einem fest installierten Safe im Kofferraum eingeschlossen werden. Die Schulungsinhalte umfassen konkrete Demonstrationen von Angriffen (z.B. Videos zu Relay-Angriffen)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert, ob die vorgeschriebene Zusatzausstattung (Safes, Koffer, Blickschutzfolien) in den relevanten Fahrzeugen vorhanden und genutzt wird. Schulungsunterlagen werden auf die spezifischen Inhalte geprüft. Die Einhaltung der Parkplatzregeln wird ggf. über die Auswertung von GPS-Trackingdaten verifiziert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A7-m5",
                    "uuid": "60a659ce-5343-4632-9f9a-0901c126337f",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Standort des Fahrzeugs wird aktiv überwacht. Beim Parken in nicht autorisierten oder als unsicher eingestuften Zonen werden Alarme ausgelöst. Alle Daten auf mitgeführten Geräten sind standardmäßig vollverschlüsselt. Die Wirksamkeit der Richtlinie und der Schutzmaßnahmen wird durch regelmäßige, unangekündigte Kontrollen (Spot-Checks) überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Geofencing-System im Flottenmanagement löst einen Alarm im SOC aus, wenn ein Fahrzeug für längere Zeit in einem als kritisch eingestuften Bereich abgestellt wird. Alle Laptops und Smartphones sind mit BitLocker bzw. einer äquivalenten Verschlüsselung gesichert, die per MDM erzwungen wird. Das Sicherheitspersonal führt regelmäßig Kontrollen auf dem Firmengelände durch und dokumentiert Verstöße."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des Geofencing-Systems und die zugehörigen Alarm-Logs im SIEM. Die MDM-Konfiguration zur Verschlüsselung wird geprüft. Die Protokolle der durchgeführten Spot-Checks werden ausgewertet, um die Regelkonformität in der Praxis zu bewerten. Mittels `manage-bde -status` auf Windows-Laptops kann der Verschlüsselungsstatus automatisiert überprüft werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "f227c71f-a3c1-4d23-81de-f19b75d65477",
                "control-id": "KONF.3.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BER",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.11.A14-m3",
                    "uuid": "16c6be23-afe2-4bed-a01f-26445aeb38d7",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Fahrzeuge und die zugehörigen IT-Komponenten SOLLTEN so abgesichert werden, dass sensible Informationen durch Unbefugte nicht ausgelesen, manipuliert oder gelöscht werden können. Hierbei SOLLTEN die vorhandenen Schutzvorkehrungen der herstellenden Unternehmen überprüft und bei Bedarf angepasst werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Grundlegende Sicherheitsfunktionen der Fahrzeug-IT werden aktiviert. Dazu gehört das Setzen eines PIN-Codes für das Infotainment-System und das Deaktivieren von nicht benötigten drahtlosen Schnittstellen wie Bluetooth oder WLAN, wenn sie nicht in Gebrauch sind. Die Herstellerdokumentation wird auf Sicherheitsempfehlungen geprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert bei einer Fahrzeugbegehung, ob die grundlegenden Sicherheitsmechanismen (z.B. PIN-Schutz) aktiv sind. Die Konfigurationseinstellungen des Infotainmentsystems werden überprüft. Es wird geprüft, ob eine dokumentierte Auseinandersetzung mit den Sicherheitshinweisen des Herstellers stattgefunden hat."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A14-m4",
                    "uuid": "e81a54e5-fb3f-4a53-b24f-74aeaa334b48",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Datenspeicher innerhalb des Fahrzeugs, sowohl in den On-Board-Systemen als auch auf hinzugefügten Geräten, sind verschlüsselt. Die Zugriffskontrollen auf die Systeme sind nach dem Prinzip der geringsten Rechte gehärtet. Eine Sicherheitsbewertung der Fahrzeug-IT-Systeme wird durchgeführt und identifizierte Schwachstellen werden behoben oder risikobewertet akzeptiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Festplatten in nachgerüsteten Industrie-PCs sind mit BitLocker oder einer vergleichbaren Lösung verschlüsselt. Der Zugang zu administrativen Funktionen der Fahrzeug-IT erfordert eine Zwei-Faktor-Authentifizierung. Eine externe Firma wird mit einem Penetrationstest der Fahrzeug-IT beauftragt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert den Verschlüsselungsstatus der Datenträger. Die Konfiguration der Zugriffskontrollen wird analysiert. Der Bericht des Penetrationstests und die Nachverfolgung der darin enthaltenen Feststellungen werden geprüft. Mittels `manage-bde -status` (Windows) oder `lsblk -f` (Linux) kann die Verschlüsselung von Datenträgern verifiziert werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A14-m5",
                    "uuid": "4a47ac6a-3bb5-4963-bec6-40f469867714",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Hardware-Sicherheitsmodule (HSM) oder Trusted Platform Modules (TPM) werden zur sicheren Speicherung von kryptografischen Schlüsseln und für kryptografische Operationen verwendet. Die Datenübertragung wird durch starke, gegenseitig authentifizierte Protokolle (z.B. mTLS) geschützt. Die IT des Fahrzeugs wird kontinuierlich auf unbefugte Zugriffsversuche oder Konfigurationsänderungen überwacht."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Festplattenverschlüsselung nutzt Schlüssel, die im TPM des Bordrechners geschützt sind. Die Kommunikation zwischen Fahrzeug und Zentrale ist durch ein VPN mit Zertifikatsauthentifizierung gesichert. Ein Host-based Intrusion Detection System (HIDS) auf dem Bordrechner meldet Integritätsverletzungen an das SIEM."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der Schlüsselverwaltung (TPM, HSM) und die Konfiguration des HIDS. Die VPN-Konfiguration wird auf starke Algorithmen und mTLS geprüft. Die SIEM-Logs werden auf relevante Alarme von den Fahrzeugen hin analysiert. Automatisierte Skripte können die TPM-Konfiguration (z.B. via `tpm_version` unter Linux) und die HIDS-Regeln prüfen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "28159d08-7edb-4320-bb55-162a1defda47",
                "control-id": "KONF.3.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.11.A12-m3",
                    "uuid": "65955714-5c7e-4e98-877e-838a068cf1b5",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Alarmanlage SOLLTE vorhanden sein. Bei Bodenfahrzeugen SOLLTE darüber hinaus eine Wegfahrsperre vorhanden sein. Wird das Fahrzeug verlassen, SOLLTEN die Alarmanlage und Wegfahrsperre aktiviert werden. Alternativ SOLLTEN die Fahrzeuge bewacht werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle Fahrzeuge sind mindestens mit der serienmäßigen Alarmanlage und Wegfahrsperre ausgestattet. Die Fahrzeugnutzer werden in der Einweisung und in der Nutzungsrichtlinie dazu verpflichtet, das Fahrzeug immer abzuschließen, wodurch diese Systeme aktiviert werden. In besonders kritischen Situationen wird das Fahrzeug durch Personal bewacht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Ausstattung der Fahrzeuge anhand der Fahrzeugspezifikationen. Die Nutzungsrichtlinie wird auf die Verpflichtung zur Aktivierung der Sicherungssysteme geprüft. Durch Beobachtung wird die Einhaltung dieser Regel stichprobenartig kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A12-m4",
                    "uuid": "862ff926-374f-420f-8037-a1ae9ec9ea93",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine zertifizierte Alarmanlage mit GPS-Ortung und der Möglichkeit zur Fernstilllegung des Motors ist installiert. Die Richtlinie schreibt die Aktivierung bei jedem Verlassen des Fahrzeugs zwingend vor. In Hochrisikogebieten, die durch eine Risikobewertung identifiziert wurden, wird zusätzlich eine Bewachung eingesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle Fahrzeuge sind mit einem Telematiksystem ausgestattet, das neben der GPS-Ortung auch die Ansteuerung der Wegfahrsperre erlaubt. Das Flottenmanagement ist angewiesen, die Fernstilllegung nach einer Diebstahlmeldung und in Absprache mit der Polizei zu aktivieren. Eine Liste von Hochrisikogebieten wird gepflegt und den Fahrern mitgeteilt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Spezifikation der Alarmanlage und die Funktionsfähigkeit der Fernsteuerungsoptionen im Telematiksystem. Die Risikobewertung für die Identifizierung von Hochrisikogebieten wird eingesehen. Die Prozessanweisung für den Fall eines Diebstahls wird auditiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A12-m5",
                    "uuid": "0d3446eb-f979-46f0-9478-aec3f9ba0436",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Fahrzeug ist durch ein mehrschichtiges System geschützt: eine zertifizierte Alarmanlage, GPS-Ortung, Fernstilllegung und Geofencing, das einen Alarm auslöst, wenn das Fahrzeug ohne Autorisierung bewegt wird. Bei kritischen Gütern oder in Hochrisikosituationen wird eine ständige Überwachung (entweder durch physisches Personal oder durch ferngesteuerte Videoüberwachung) aufrechterhalten."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Geofencing ist so konfiguriert, dass es einen stillen Alarm an das SOC sendet, wenn ein Fahrzeug einen definierten Bereich (z.B. den Parkplatz) außerhalb der Betriebszeiten verlässt. Für den Transport von hochkritischen Gütern wird ein Begleitfahrzeug oder eine permanente Videoüberwachung via 4G/5G eingesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des Geofencing-Systems und die zugehörigen Alarm-Logs im SIEM. Die Pläne und Protokolle der Überwachungsmaßnahmen für kritische Transporte werden geprüft. Die Funktionsfähigkeit des Gesamtsystems kann durch einen simulierten Diebstahltest verifiziert werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "625ebe47-4168-4a03-9d7e-ab79a5470040",
                "control-id": "KONF.3.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.11.A15-m3",
                    "uuid": "70eecae9-531c-4e3e-afd6-3a76f6e77acb",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle physischen internen und externen Schnittstellen der Fahrzeuge SOLLTEN physisch gegen unbefugte Benutzung und äußere Einflüsse abgesichert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Leicht zugängliche USB-Ports im Fahrgastraum werden mit einfachen Plastikstopfen verschlossen, wenn sie nicht benutzt werden. Die Fahrer werden angewiesen, keine unbekannten USB-Geräte anzuschließen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer führt eine Sichtkontrolle der zugänglichen Schnittstellen im Fahrzeug durch. Die Nutzungsrichtlinie wird auf entsprechende Anweisungen an die Fahrer geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A15-m4",
                    "uuid": "185acbd0-ed9e-4c57-b4ce-61571d83e475",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Nicht genutzte physische Schnittstellen (USB, Ethernet etc.) werden in der Software deaktiviert oder physisch mit abschließbaren Mechanismen blockiert. Die OBD-II-Schnittstelle wird mit einem Schloss gesichert oder an einen schwer zugänglichen Ort verlegt."
                      },
                      {
                        "name": "guidance",
                        "value": "USB-Ports werden über die BIOS/UEFI-Einstellungen oder per Gruppenrichtlinie deaktiviert. Für die OBD-II-Schnittstelle wird ein spezielles Schloss (OBD-Saver) verwendet. Der Einbau wird dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert physisch die Sicherung der Schnittstellen, insbesondere des OBD-II-Ports. Es wird versucht, ein Gerät an einen deaktivierten USB-Port anzuschließen, um die Wirksamkeit der Maßnahme zu testen. Die Konfiguration der Software-Deaktivierung wird überprüft, z.B. durch Auslesen der BIOS-Einstellungen."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A15-m5",
                    "uuid": "470a8cbd-29d7-4ff3-b986-1a77d2492346",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Kombination aus physischen und logischen Kontrollen wird eingesetzt. Der Zugriff auf physische Schnittstellen erfordert eine Authentifizierung (z.B. port-basierte Netzwerkzugriffskontrolle nach IEEE 802.1X). Kritische Schnittstellen befinden sich in manipulationssicheren, versiegelten und verschlossenen Gehäusen."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Ethernet-Port des Bordrechners ist mit 802.1X konfiguriert und erlaubt nur Verbindungen von Geräten mit einem gültigen Zertifikat. Der Rechner selbst ist in einem Gehäuse mit Siegeln untergebracht, deren Unversehrtheit regelmäßig geprüft wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der port-basierten Zugriffskontrolle (z.B. auf dem Switch oder dem Endgerät). Die Unversehrtheit der Siegel wird physisch kontrolliert. Es wird versucht, ein nicht autorisiertes Gerät zu verbinden, um die Abweisung durch die Zugriffskontrolle zu provozieren und in den Logs zu verifizieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ebe2e1ad-b2fd-4cbf-bf7e-3c1ed0c68798",
                "control-id": "KONF.9.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Treatment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.11.A11-m3",
                    "uuid": "a65ce8cf-3d6a-4065-baf0-0e617068cfa2",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für den Fall, dass Fahrzeuge oder Fahrzeugführende ausfallen, SOLLTEN innerhalb der Institution vorbereitende Maßnahmen getroffen werden. Abhängig von der Bedeutung der Fahrzeuge SOLLTEN Ersatzfahrzeuge bereitstehen oder alternativ ein Rahmenvertrag mit einer geeigneten Fremdinstitution geschlossen werden. Zusätzlich dazu SOLLTEN Ersatzfahrzeugführende verfügbar sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Für kritische Fahrzeugtypen wird mindestens ein Ersatzfahrzeug im eigenen Fuhrpark vorgehalten. Zusätzlich existiert ein Rahmenvertrag mit einem Autovermieter, der die kurzfristige Bereitstellung weiterer Fahrzeuge zusichert. Es gibt eine Liste mit qualifizierten Mitarbeitern, die als Ersatzfahrer einspringen können."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz des Ersatzfahrzeugs im Fuhrpark. Der Rahmenvertrag mit dem Autovermieter wird eingesehen und auf seine Gültigkeit und die zugesicherten Reaktionszeiten geprüft. Die Liste der Ersatzfahrer wird auf Aktualität und die Qualifikation der Personen geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A11-m4",
                    "uuid": "de7f9c9b-10f1-4f7e-bf93-1388e12c0acc",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein formaler Business Continuity Plan (BCP) für den Fahrzeugbetrieb ist dokumentiert. Dieser Plan stellt die garantierte Verfügbarkeit von Ersatzfahrzeugen und -fahrern durch Verträge mit definierten Service Level Agreements (SLAs) sicher. Der Plan wird regelmäßig getestet."
                      },
                      {
                        "name": "guidance",
                        "value": "Der BCP beschreibt genau, in welcher Zeit (z.B. innerhalb von 4 Stunden) ein voll ausgestattetes Ersatzfahrzeug zur Verfügung stehen muss. Dies ist vertraglich mit einem Dienstleister geregelt. Die Verfügbarkeit der Ersatzfahrer wird über einen Bereitschaftsplan sichergestellt. Jährlich wird eine BCP-Übung durchgeführt, bei der ein Fahrzeugausfall simuliert wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert den BCP auf Vollständigkeit und Plausibilität. Die Verträge mit Dienstleistern werden auf die Einhaltung der definierten SLAs geprüft. Die Planungs- und Ergebnisdokumentation der BCP-Übungen wird auditiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.11.A11-m5",
                    "uuid": "db5c55a6-5516-4a9b-bfa3-6517f0b98608",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der BCP für den Fahrzeugbetrieb ist vollständig in das übergeordnete Business Continuity Management (BCM) der Institution integriert. Eine 'Hot-Standby'-Flotte von voll ausgestatteten und sofort einsatzbereiten Fahrzeugen wird vorgehalten. Die Verfügbarkeit der Fahrer wird in Echtzeit verfolgt. Der Umschaltprozess auf Ersatzressourcen ist so weit wie möglich automatisiert und kann innerhalb kürzester Zeit durchgeführt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Ersatzfahrzeuge stehen vollgetankt und mit allen geladenen IT-Systemen in einer Garage bereit. Ein Personaleinsatzplanungssystem zeigt jederzeit an, welche qualifizierten Fahrer sofort verfügbar sind. Im Falle eines Ausfalls kann der Disponent im Flottenmanagement-System mit wenigen Klicks ein Ersatzfahrzeug und einen Fahrer zuweisen und alarmieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Integration des Fahrzeug-BCP in das ISMS/BCMS. Der Zustand und die Einsatzbereitschaft der Hot-Standby-Flotte werden vor Ort geprüft. Die Funktionsweise des Personaleinsatzplanungssystems und des Alarmierungsprozesses wird demonstriert oder durch Protokolle belegt."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}