{
  "component-definition": {
    "uuid": "2cc0f624-2e62-40d6-833a-09e4ec936ae2",
    "metadata": {
      "title": "INF.14 OT-Systeme - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:08:00.634367+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "8ac52339-289b-4413-adf5-3979b7ad49c7",
        "type": "physical",
        "title": "INF.14 OT-Systeme",
        "description": "This component represents the implementation of all controls for Baustein INF.14.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Die Gebäudeautomation (GA, englisch Building Automation and Control Systems, BACS) automatisiert den gewerkübergreifenden Betrieb von Gebäuden ganz oder teilweise und stellt hierfür die technische Infrastruktur zur Verfügung. Wesentliche technische Funktionen eines Gebäudes werden durch die technische Gebäudeausrüstung (TGA) bereitgestellt, die mit den Leistungen des technischen Gebäudemanagements (TGM) betrieben, gepflegt und weiterentwickelt werden. Die GA ist somit ein zentrales Werkzeug des TGM, um für den Gebäudebetrieb die gesetzte Zielrichtung umzusetzen. Sie umfasst alle Produkte und Dienstleistungen zum übergreifenden, automatisierten Betrieb der TGA. Kriterien für die Zielrichtung können Funktionalität, Energieeffizienz und Nachhaltigkeit, Sicherheit, Verfügbarkeit oder Komfort sein. Die GA kann auf Leistungen für Gebäude, Gebäudekomplexe, Liegenschaften oder Liegenschaftsportfolios skaliert werden. Im Folgenden wird hierfür einheitlich der Begriff Gebäude genutzt. Ausnahmen hiervon werden explizit genannt.\nDie GA führt unter anderem Automatisierungsaufgaben wie automatisiertes Messen, Steuern und Regeln (MSR) sowie Aufgaben für Monitoring, Service und Diagnose, Optimierung, Bedienung und Management für die TGA eines Gebäudes durch.\nDie GA wird innerhalb eines Gebäudes für eine oder gegebenenfalls mehrere Nachfrageorganisationen, beispielsweise Mietparteien, bereitgestellt. Hierfür wird die TGA meist separat für verschiedene GA-Bereiche, beispielsweise für Nachfrageorganisationen oder für Gebäudeteile, gesteuert.\nIn einem Gebäude kann die GA abhängig von der genutzten TGA durch mehrere parallele GA-Systeme umgesetzt werden. Ein GA-System stellt die technische Realisierung der GA dar und kann auch übergreifend für mehrere Gebäude innerhalb eines Gebäudekomplexes oder einer Liegenschaft genutzt werden. Verschiedene GA-Systeme können kooperieren, aber auch vollständig unabhängig voneinander betrieben werden.\nWährend die TGA in der Vergangenheit oft nicht übergreifend automatisiert betrieben wurde, werden heute zunehmend GA-Systeme zur übergeordneten, gewerkübergreifenden Steuerung der TGA genutzt. Hierfür werden zunehmend auch Techniken genutzt, die ursprünglich nur in der Informationstechnik (IT) und der industriellen Prozessleit- und Automatisierungstechnik (Operational Technology, OT) verwendet wurden, z. B. eine Kommunikation via Internet und Cloud-Diensten."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es, die Informationssicherheit als integralen Bestandteil bei Planung, Realisierung und Betrieb von GA zu etablieren."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein INF.14 Gebäudeautomation ist auf die GA einer Institution anzuwenden, sobald die TGA in Gebäuden mittels GA gesteuert wird. Der Baustein ist nur auf die Schnittstellen der GA zu den TGA-Anlagen anzuwenden, die TGA-Anlagen mit den anlageninternen Netzen und Netzstrukturen sind nicht im Fokus dieses Bausteins.\nDer Baustein INF.14 Gebäudeautomation behandelt Systeme und Leistungen, die zu beachten und zu erfüllen sind, wenn die GA, gegebenenfalls bestehend aus mehreren GA-Systemen, geplant, aufgebaut und betrieben wird. Hierbei werden auch spezifische Gegebenheiten behandelt, die für Netze und Netzkomponenten der GA gelten.\nFolgende Inhalte sind ebenfalls von Bedeutung und werden an anderer Stelle behandelt:\n\n• Die allgemeinen Anforderungen für GA und TGA, die nicht überwiegenden Aspekte für ein übergreifendes, automatisiertes Messen, Steuern und Regeln thematisieren, werden im Baustein INF.13 Technisches Gebäudemanagement behandelt. Dieser ist stets mitzubetrachten.\n• Anforderungen an die allgemeine Infrastruktur, insbesondere Gebäude und Räume bzw. Arbeitsplätze, werden in den Bausteinen der Schicht INF Infrastruktur behandelt (z. B. Baustein INF.1 Allgemeines Gebäude).\n• Werden Teile der GA, die für eine Institution erforderlich sind, von einer anderen Institution, z. B. von Dienstleistenden in der Rolle als Gebäudebetreibende (betreibende Organisation), erbracht, so muss für die Bereitstellung und den Betrieb der GA der Baustein OPS.2.3 Nutzung von Outsourcing angewendet werden.\n• Spezifische Anforderungen an GA-Komponenten, die auch für den Bereich der industriellen IT oder OT genutzt werden können, werden in den Bausteinen der Schicht IND Industrielle IT thematisiert (siehe z. B. Baustein IND.2.3 Sensoren und Aktoren oder Baustein IND.2.7 Safety Instrumented Systems).\n• Der Baustein NET.1.1 Netzarchitektur und -design behandelt die grundsätzlichen Aspekte für Netze, wie sie neben der Büro-IT auch in der GA und der industriellen IT anwendbar sind. Generelle Anforderungen an die Absicherung von Netzkomponenten behandeln die Bausteine in NET.3 Netzkomponenten (z. B. Baustein NET.3.1 Router und Switches).\n• Außerdem sind alle passenden organisatorischen und technischen Bausteine für Server und Anwendungen anzuwenden. Beispielsweise ist für den Fernzugriff auf die GA-Komponenten der Baustein OPS.1.2.5 Fernwartung anzuwenden.\n• Erfolgt die Vernetzung von Gebäuden Cloud-basiert, so ist zusätzlich der Baustein OPS.2.2 Cloud-Nutzung anzuwenden."
          },
          {
            "name": "2.1. Unzureichende Planung der GA",
            "value": "Die GA dient der koordinierten, übergreifenden Steuerung der Anlagen der TGA. Eine unzureichende Planung der GA kann damit zu Sach- oder Vermögensschäden und im schlimmsten Fall zu Personenschäden führen.\nDies kann beispielsweise dann passieren, wenn durch unzureichende Redundanzplanung das zentrale Steuersystem einer Vereinzelungsanlage ausfällt und Personen in einer Schleuse eingeschlossen werden.\nDie beschriebene Gefährdungslage verschärft sich in der GA zudem durch die Komplexität der Planung. Hier sind heterogene Gruppen von TGA-Anlagen (Gewerke) sowie eine Vielzahl unterschiedlicher Dienstleistenden und GA-Bereiche zu berücksichtigen."
          },
          {
            "name": "2.2. Fehlerhafte Integration von TGA-Anlagen in die GA",
            "value": "Die GA steuert die Anlagen der TGA übergreifend. Ist nur eine Anlage fehlerhaft oder unzureichend integriert, kann die Funktionalität der gesamten GA eingeschränkt werden.\nBeispielsweise können eingehende Meldungen falsch interpretiert werden oder Meldungen erreichen die GA nicht, so dass die GA falsch oder gar nicht reagiert. Werden beispielsweise die Informationen der Zugangskontrollanlage nicht korrekt oder gar nicht empfangen, können Heizung und Beschattung für die entsprechenden Räume gegebenenfalls nicht angemessen gesteuert werden."
          },
          {
            "name": "2.3. Nutzung unsicherer Systeme und Protokolle in der GA",
            "value": "In den durch die GA gesteuerten TGA-Anlagen werden häufig Komponenten genutzt, die z. B. aufgrund ihres Alters keine Aktualisierungen mehr erhalten, Schwachstellen aufweisen bzw. nicht mehr dem aktuellen Stand der Technik entsprechen. Dies resultiert oft aus einer unzureichenden Qualität in den Entwicklungs- und Wartungsprozessen der herstellenden Unternehmen oder aus Software, die aufgrund mangelnder Rechen- und Speicherkapazität unsichere Protokolle nutzt. Darüber hinaus stellen die herstellenden Unternehmen häufig keine Patches bereit, so dass unsichere GA-relevante Komponenten auch über einen sehr langen Zeitraum genutzt werden. Verstärkt wird die Gefährdung dadurch, dass in der GA Zugriffe auch auf solche Komponenten freigeschaltet werden müssen."
          },
          {
            "name": "2.4. Fehlerhafte Konfiguration der Gebäudeautomation",
            "value": "Je nachdem, welche Bereiche der GA fehlerhaft konfiguriert sind, kann es zu Beeinträchtigungen in Betriebsabläufen, zu nicht erlaubtem physischen Zugang zu geschützten Bereichen, zu Schäden an Systemen bis hin zu Gebäude- und Personenschäden kommen.\nBeispiele hierfür sind:\n\n• Fehlerhaft konfigurierte Klimatisierung, die zu Überhitzung und Ausfall von IT-Systemen oder bei entsprechenden Wetterlagen sogar zu Beeinträchtigungen der Gesundheit von Personen führen kann.\n• Nicht abgestimmt konfigurierte Systeme der Gebäudetechnik können zu Personen- und Systemschäden führen, wenn beispielsweise Strom- und Löschanlagen nicht koordiniert betrieben werden.\n• Ebenso können fehlerhaft konfigurierte Zugangssysteme zu Personenschaden führen, wenn Türen im Notfall nicht geöffnet werden können.\n\nDie Gefährdung ist für die GA besonders relevant, da aus Mangel an Testmöglichkeiten eine fehlerhafte Konfiguration vor Produktivsetzung häufig nicht erkannt werden kann. Dies kann auch bei einem fehlerhaften Update oder einem fehlerbehafteten Update-Verlauf, der ein System der GA unbrauchbar macht, auftreten."
          },
          {
            "name": "2.5. Manipulation der Schnittstellen von eigenständigen TGA-Anlagen zur Gebäudeautomation",
            "value": "Manipulierte Schnittstellen zwischen GA-Systemen und gekoppelten TGA-Anlagen können in der GA zu fehlerhaften Reaktionen führen.\nEin Beispiel hierfür ist, dass eine manipulierte Meldung einer Brandmeldeanlage dazu führen kann, dass alle Türen automatisiert geöffnet werden und so unbefugten Personen Zutritt zum Gebäude gewährt wird."
          },
          {
            "name": "2.6. Unzureichend geschützte Zugänge zur GA",
            "value": "Die GA umfasst eine Vielzahl von Komponenten, die anlagenübergreifende Informationen bereitstellen, austauschen und empfangen, z. B. zur Standortbestimmung von Personal oder zur Raumautomatisierung. Die Geräte kommunizieren über LAN und WLAN, aber auch über sonstige drahtlose Techniken wie beispielsweise Bluetooth.\nSind solche Netzzugänge nicht angemessen geschützt, können hierüber DoS-Angriffe durchgeführt werden. Auch können die Systeme der GA manipuliert oder sabotiert und gegebenenfalls sogar die gesamte IT der Institution erreicht werden. Manipulierte Systeme der GA können dann ein erhöhtes Datenaufkommen bis hin zu einer Überlastung der Netze und Komponenten bedingen. Auch ein Datenabfluss oder das Einspielen von Schadsoftware ist über einen unzureichend geschützten Zugang möglich."
          },
          {
            "name": "2.7. Unzureichend abgesicherte Bedienelemente der GA",
            "value": "Wenn gut zugängliche Bedienelemente der GA unzureichend abgesichert sind, kann über diese die GA angegriffen werden. Beispiele hierfür sind wandmontierte Bedienelemente oder aber auch Bedienelemente von Pfortenpersonal, mit denen z. B. entfernte Türen oder Tore geöffnet werden können.\nIst der Zugang zu solchen Bedienelementen unzureichend geschützt, z. B. durch fehlende Authentisierung, kann ein unbefugter Zugriff ermöglicht werden.\nEbenfalls können unzureichend geschützte Anschlüsse von Bedienelementen, wie LAN- oder USB-Schnittstellen, einen unbefugten Zugang bieten."
          },
          {
            "name": "2.8. Unzureichend abgesicherte Mobilfunk-Anschlüsse",
            "value": "Häufig müssen insbesondere in der Feld- und Automatisierungsebene GA-Komponenten genutzt werden, die über eine Mobilfunkschnittstelle mit dem jeweiligen herstellenden Unternehmen oder mit Dienstleistenden wie etwa einem Wetterdienst verbunden sind. Sind diese Schnittstellen und die Kommunikation unzureichend geschützt und dauerhaft aktiv, bieten sie Unbefugten oder bei Angriffen einen Zugriff auf das GA-Netz."
          }
        ],
        "control-implementations": [
          {
            "uuid": "dabc887a-4bcd-4aed-80cc-0e73c15d9905",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/ot-systeme_profile.json",
            "description": "Implementation for all controls in Baustein INF.14",
            "implemented-requirements": [
              {
                "uuid": "0793c44a-8b84-46d2-bd48-8bb1ae213eed",
                "control-id": "ARCH.2.2.11",
                "description": "Implementation for ARCH.2.2.11 based on BSI INF.14.A10",
                "statements": [
                  {
                    "statement-id": "inf.14.a10-m3",
                    "uuid": "1bf097c4-d9d0-4e6b-b2ad-cd01b42a84eb",
                    "description": "In der GA SOLLTEN GA-Bereiche derart geplant und umgesetzt werden, dass Abhängigkeiten zwischen den GA-Bereichen minimiert werden und GA-Bereiche unabhängig gesteuert werden können. Eine Störung in einem GA-Bereich SOLLTE keine oder nur geringe Auswirkungen auf andere GA-Bereiche haben."
                  },
                  {
                    "statement-id": "inf.14.a10-m4",
                    "uuid": "1db63354-e048-469a-9f44-0b9f14a64854",
                    "description": "Insbesondere SOLLTEN die Gebäude innerhalb eines Gebäudekomplexes oder einer Liegenschaft separat steuerbar sein. Die eingerichteten GA-Bereiche SOLLTEN auch im GA-Managementsystem entsprechend sichtbar sein."
                  },
                  {
                    "statement-id": "inf.14.a10-m5",
                    "uuid": "b7a2ca46-b7eb-4e56-a5e0-9f4e81a0c13b",
                    "description": "Die Unabhängigkeit der GA-Bereiche wird regelmäßig durch automatisierte Tests überprüft. Dabei wird der Ausfall eines Bereichscontrollers simuliert und verifiziert, dass die anderen Bereiche ungestört weiterfunktionieren. Die Ergebnisse dieser 'Chaos Engineering'-Tests werden zur kontinuierlichen Verbesserung der Architektur genutzt."
                  }
                ]
              },
              {
                "uuid": "9ff3ba80-f1c8-422a-a0ec-9a1a5365d7c3",
                "control-id": "ARCH.2.2.5",
                "description": "Implementation for ARCH.2.2.5 based on BSI INF.14.A6",
                "statements": [
                  {
                    "statement-id": "inf.14.a6-m1",
                    "uuid": "e3f005ee-b0c7-48cb-a070-bac9aec28f5b",
                    "description": "GA-Netze und Büro-Netze sind nicht voneinander getrennt. Komponenten der Gebäudeautomation befinden sich im selben Netzwerk wie Büro-PCs und Server."
                  },
                  {
                    "statement-id": "inf.14.a6-m2",
                    "uuid": "ad334928-8d82-4dc1-80fd-d09e73515b2f",
                    "description": "GA-Netze sind von Büro-Netzen durch eine einfache Firewall getrennt, deren Regelwerk jedoch sehr pauschal und freizügig ist ('any-any'). Eine Kontrolle der Kommunikation findet nur unzureichend statt."
                  },
                  {
                    "statement-id": "inf.14.a6-m3",
                    "uuid": "d17fc66e-bbc6-425a-9d34-c1bab0e5f3fb",
                    "description": "GA-Netze MÜSSEN von Büro-Netzen und sonstigen Netzen der Institution mindestens logisch getrennt werden. Jegliche Kommunikation zwischen GA-Systemen und sonstigen IT-Systemen MUSS kontrolliert und reglementiert werden. Hierfür MÜSSEN an allen Übergängen einer solchen Segmentierung entsprechende Komponenten mit Sicherheitsfunktionen, mindestens mit Firewall-Funktion, vorgesehen werden."
                  },
                  {
                    "statement-id": "inf.14.a6-m4",
                    "uuid": "e2bd93d1-f0ff-445b-ac3e-beb170c51394",
                    "description": "Wird die GA für einen Gebäudekomplex oder eine Liegenschaft zentral eingerichtet, so MUSS die gebäudeübergreifende GA-Kommunikation über LAN-, WLAN-, WAN-, Funknetz- oder Internet-Verbindungen auch auf Ebene des Netzes separiert werden."
                  },
                  {
                    "statement-id": "inf.14.a6-m5",
                    "uuid": "dd8b7ced-611f-4ca1-a59d-4b58d0de10ec",
                    "description": "GA-Netze werden physisch von allen anderen Netzen getrennt betrieben. An den wenigen, notwendigen Kopplungspunkten werden Application Layer Gateways oder Datendioden eingesetzt, um die Kommunikation auf das absolut notwendige Minimum zu beschränken und eine Protokollvalidierung durchzuführen."
                  }
                ]
              },
              {
                "uuid": "dfac0d35-9422-467c-8c44-c5ae48845ef3",
                "control-id": "KONF.2.1",
                "description": "Implementation for KONF.2.1 based on BSI INF.14.A5",
                "statements": [
                  {
                    "statement-id": "inf.14.a5-m1",
                    "uuid": "39e79387-a230-4ea0-96f2-ee17259b0276",
                    "description": "Eine Dokumentation der GA ist nur für einzelne Komponenten oder Systeme vorhanden. Es gibt keinen Gesamtüberblick über alle Komponenten, Zugänge und deren Abhängigkeiten."
                  },
                  {
                    "statement-id": "inf.14.a5-m2",
                    "uuid": "2ce35c2c-fe40-4766-8dc7-573da4235873",
                    "description": "Es gibt eine grundlegende Dokumentation, die die meisten Komponenten und Zugänge der GA erfasst. Diese wird jedoch nicht regelmäßig geprüft oder bei Änderungen zeitnah angepasst."
                  },
                  {
                    "statement-id": "inf.14.a5-m3",
                    "uuid": "3e28f8c5-45db-4ef3-9968-e0360d81a255",
                    "description": "Für die GA MUSS die Vielzahl unterschiedlicher Komponenten und Zugänge dokumentiert werden. Insbesondere MÜSSEN auch alle deaktivierten physischen Kommunikationsschnittstellen, Protokolle und Zugänge bzw. Zugriffsmöglichkeiten zur GA dokumentiert werden. Darüber hinaus MÜSSEN alle Wechselwirkungen und Abhängigkeiten von GA-relevanten Komponenten sowie von TGA-Anlagen dokumentiert werden. Die Dokumentation MUSS regelmäßig und bei Änderungen innerhalb der GA geprüft und angepasst werden."
                  },
                  {
                    "statement-id": "inf.14.a5-m4",
                    "uuid": "6717dc05-2ba4-454e-ab44-35a0ad0cc746",
                    "description": "Die verfügbaren und genutzten Sicherheitseigenschaften der verwendeten Protokolle SOLLTEN dokumentiert werden. Die Dokumentation SOLLTE für alle GA-Systeme übergreifend hinsichtlich Inhalten und deren Datenstrukturen abgestimmt werden, um eine einfache, systemübergreifende Auswertung zu ermöglichen."
                  },
                  {
                    "statement-id": "inf.14.a5-m5",
                    "uuid": "aacac1a8-107f-4694-885d-b10e80c76a82",
                    "description": "Die Dokumentation der GA wird durch automatisierte Inventarisierungs- und Scanning-Tools kontinuierlich erstellt und aktuell gehalten. Abweichungen zwischen der automatisch erfassten Realität und der Solldokumentation (z.B. aus dem BIM-Modell) werden automatisch gemeldet."
                  }
                ]
              },
              {
                "uuid": "410494b0-03b2-4102-8276-8a7e606464c0",
                "control-id": "KONF.3.7",
                "description": "Implementation for KONF.3.7 based on BSI INF.14.A11",
                "statements": [
                  {
                    "statement-id": "inf.14.a11-m2",
                    "uuid": "3e3f3af1-5811-4f65-aea5-676b784e7fe3",
                    "description": "Frei zugängliche Ports (Ethernet, USB) an GA-Komponenten sind organisatorisch zur Deaktivierung vorgesehen, die Umsetzung wird aber nicht kontrolliert. Eine Netzzugangskontrolle ist nicht implementiert."
                  },
                  {
                    "statement-id": "inf.14.a11-m3",
                    "uuid": "b9eb0171-7d5f-4a3f-b64d-d9798a5c53fe",
                    "description": "Der Anschluss von Komponenten, speziell von unautorisierten, unbekannten Komponenten und Fremdgeräten, SOLLTE insbesondere an frei zugänglichen Ethernet-Ports, USB-Ports und anderen Schnittstellen der GA kontrolliert und eingeschränkt werden. Frei zugängliche Schnittstellen für temporäre Wartungszwecke, wie beispielsweise USB-Ports an GA-Komponenten, SOLLTEN nur bei Bedarf aktiviert werden."
                  },
                  {
                    "statement-id": "inf.14.a11-m4",
                    "uuid": "f4698811-7b55-4cd5-a0b0-e0f1f2c51cb1",
                    "description": "Für frei zugängliche LAN- oder WLAN-Zugänge SOLLTE eine Netzzugangskontrolle gemäß IEEE 802.1X oder vergleichbare Sicherheitsmechanismen eingesetzt werden. Der Anschluss einer unautorisierten oder unbekannten Komponente SOLLTE in die Ereignisprotokollierung aufgenommen werden. Eine direkte IP-basierte Kommunikation von solchen Komponenten mit Systemen der GA SOLLTE unterbunden werden."
                  },
                  {
                    "statement-id": "inf.14.a11-m5",
                    "uuid": "8c086c24-50b6-4904-8954-1669fca8a367",
                    "description": "Der Anschluss unautorisierter Geräte wird nicht nur verhindert, sondern löst auch einen automatisierten Sicherheitsvorfall aus. Der betroffene Port wird sofort physisch gesperrt und eine Benachrichtigung an das Sicherheitsteam gesendet, die den genauen Standort des Ports enthält. Die Kommunikation im Quarantäne-Netz wird aktiv überwacht, um Angriffsversuche zu erkennen."
                  }
                ]
              },
              {
                "uuid": "e5cd23d3-1a9a-4bab-a616-db306ea8e64f",
                "control-id": "KONF.6.4",
                "description": "Implementation for KONF.6.4 based on BSI INF.14.A3",
                "statements": [
                  {
                    "statement-id": "inf.14.a3-m1",
                    "uuid": "3a271322-0a49-4231-941f-a4543aa819c1",
                    "description": "Die Anbindung von TGA-Anlagen an GA-Systeme erfolgt ohne definierte Sicherheitsregeln. Es wird nicht systematisch festgelegt, welche Aktionen ausgelöst werden dürfen, was zu unvorhersehbarem Verhalten führen kann."
                  },
                  {
                    "statement-id": "inf.14.a3-m2",
                    "uuid": "55b31be7-3c87-4dd5-a3e0-112126ae4104",
                    "description": "Es gibt grundlegende Festlegungen, welche TGA-Anlagen mit GA-Systemen interagieren dürfen. Die Anbindung wird jedoch nicht durch technische Maßnahmen abgesichert und die Ablaufketten werden nicht umfassend geplant oder getestet."
                  },
                  {
                    "statement-id": "inf.14.a3-m3",
                    "uuid": "135a6ee1-65bb-4f7d-8a74-24837fb240e2",
                    "description": "Für alle TGA-Anlagen, GA-Systeme und GA-relevanten Komponenten MUSS festgelegt werden, ob durch andere Systeme Aktionen ausgelöst werden dürfen. Sowohl die Integration von TGA-Anlagen in ein GA-System als auch die rückwirkungsfreie Kopplung von TGA-Anlagen an GA-Systeme MÜSSEN angemessen abgesichert sein. Ebenfalls MUSS die Anbindung von GA-Systemen untereinander angemessen abgesichert werden. Hierzu MÜSSEN insbesondere die Ablauf- und Funktionsketten innerhalb eines GA-Systems bzw. zwischen GA-Systemen angemessen geplant und getestet werden. Die Festlegungen MÜSSEN vollumfänglich dokumentiert werden."
                  },
                  {
                    "statement-id": "inf.14.a3-m4",
                    "uuid": "303eb965-994b-4b20-9305-6d408b788c5d",
                    "description": "Falls eine Integration zulässig ist, SOLLTE reglementiert werden, welche automatisierten Aktionen durch welche Informationen eines GA-Systems ausgelöst werden dürfen. Die Ablauf- und Funktionsketten SOLLTEN umfassend getestet und bei Fehlverhalten nachjustiert werden. Die Dokumentation SOLLTE regelmäßig und ergänzend bei Bedarf geprüft werden, ob sie noch aktuell ist."
                  },
                  {
                    "statement-id": "inf.14.a3-m5",
                    "uuid": "00d014b7-89eb-4751-8243-d6c49c2c0050",
                    "description": "Die gesamte Kommunikation zwischen TGA-Anlagen und GA-Systemen wird in Echtzeit überwacht. Abweichungen von den definierten Ablauf- und Funktionsketten werden automatisch erkannt und gemeldet. Bei erkannten Abweichungen werden die betroffenen Interaktionen blockiert und ein Incident-Prozess ausgelöst. Die Testfälle werden automatisiert aus den Spezifikationen generiert und ausgeführt."
                  }
                ]
              },
              {
                "uuid": "27eea903-cc76-4b36-b656-60f77dd8a408",
                "control-id": "KONF.7.15",
                "description": "Implementation for KONF.7.15 based on BSI INF.14.A4",
                "statements": [
                  {
                    "statement-id": "inf.14.a4-m1",
                    "uuid": "65024ee5-f42c-4bd2-b807-c5ac94b8d0c0",
                    "description": "Gefahrenmeldeanlagen sind teilweise in GA-Systeme integriert, ohne dass die Rückwirkungsfreiheit sichergestellt ist. Die netztechnische Anbindung erfolgt über das allgemeine GA-Netz."
                  },
                  {
                    "statement-id": "inf.14.a4-m2",
                    "uuid": "c03cec2e-9eb3-43f5-80f8-ff90df2c92d7",
                    "description": "Gefahrenmeldeanlagen sind an GA-Systeme gekoppelt, aber die Rückwirkungsfreiheit ist nur konzeptionell vorgesehen und nicht technisch durchgesetzt. Die netztechnische Anbindung erfolgt logisch getrennt, aber nicht physisch."
                  },
                  {
                    "statement-id": "inf.14.a4-m3",
                    "uuid": "3dc8cbc6-b01a-48dd-824d-54b0b5381d84",
                    "description": "Gefahrenmeldeanlagen inklusive Sicherheitsanlagen MÜSSEN rückwirkungsfrei an GA-Systeme gekoppelt werden. Sie DÜRFEN NICHT in ein GA-System integriert werden. Für die netztechnische Anbindung MÜSSEN physisch getrennte Netzkomponenten und physisch getrennte Segmente genutzt werden."
                  },
                  {
                    "statement-id": "inf.14.a4-m4",
                    "uuid": "81d4cce5-9829-4a4d-b4e7-9c7b237c7754",
                    "description": "Werden Funknetze zur Kopplung genutzt, MÜSSEN solche TGA-Anlagen als Primärnutzende für die verwendeten Frequenzbereiche festgelegt werden. Für die Kommunikation über Funknetze SOLLTEN zertifizierte Mechanismen genutzt werden."
                  },
                  {
                    "statement-id": "inf.14.a4-m5",
                    "uuid": "44a7fa30-5d30-4368-90db-3270cd3b6ca4",
                    "description": "Die Kommunikation von der GMA zur GA wird zusätzlich auf Integrität und Authentizität auf Applikationsebene geprüft. Jeglicher Versuch einer Kommunikation von der GA zur GMA wird aktiv blockiert und als schwerwiegender Sicherheitsvorfall gemeldet. Die physikalische Trennung wird durch manipulationssichere Gehäuse und plombierte Ports ergänzt."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}