{
  "component-definition": {
    "uuid": "9ea3b670-3988-45ff-96aa-3de7e44091dc",
    "metadata": {
      "title": "INF.12 Räume für technische Infrastruktur - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:08:00.539811+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "8904e3ef-fed4-478b-af82-eb0045d9fc4e",
        "type": "physical",
        "title": "INF.12 Räume für technische Infrastruktur",
        "description": "This component represents the implementation of all controls for Baustein INF.12.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Die ordnungsgemäße und normgerechte Ausführung der Verkabelung ist Grundlage für einen sicheren IT-Betrieb. Dabei muss grundsätzlich zwischen der elektrotechnischen Verkabelung und der IT-Verkabelung unterschieden werden.\nDie elektrotechnische Verkabelung von IT-Systemen und anderen Geräten umfasst alle Kabel und Verteilungen im Gebäude vom Einspeisepunkt des Verteilungsnetzbetreibers (VNB) bis zu den Anschlüssen der Endgeräte.\nDie IT-Verkabelung in einer Institution umfasst alle Kommunikationskabel und passiven Komponenten wie Rangier- bzw. Spleißverteiler oder Patchfelder. Sie bildet also die physikalische Grundlage der internen Kommunikationsnetze. Die IT-Verkabelung reicht von den Übergabepunkten aus einem Fremdnetz bis zu den Anschlusspunkten der Netzteilnehmenden. Übergabepunkte sind z. B. der Anschluss eines Telekommunikationsunternehmens oder die DSL-Anbindung eines Internet-Providers.\nTrotz dieser Unterscheidung sind die grundlegenden Anforderungen an beide Arten der Verkabelung identisch. Daher sollte die Verkabelung innerhalb einer Institution immer auch als Ganzes betrachtet werden."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es, die gesamte elektrotechnische Verkabelung und IT-Verkabelung vor Ausfall, Manipulation und Störung zu schützen."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein INF.12 Verkabelung ist einmal auf die Verkabelung in Gebäuden und Räumen anzuwenden, zusätzlich zum Baustein INF.1 Allgemeines Gebäude. Die Anforderungen des Bausteins sind immer sowohl auf die IT- als auch auf die elektronische Verkabelung anzuwenden."
          },
          {
            "name": "2.1. Kabelbrand",
            "value": "Kabelbrände können einen Informationsverbund erheblich schädigen. Ein Kabelbrand verursacht z. B. Kurzschlüsse oder unterbricht Leiter. Infolgedessen fallen auch Schutzeinrichtungen aus. Zudem können bei Kabelbränden, abhängig von den Materialien der Isolierungen, aggressive Gase entstehen."
          },
          {
            "name": "2.2. Unzureichende Dimensionierung der Verkabelung",
            "value": "Werden Arbeitsplätze, Serverräume oder Rechenzentren geplant, dann werden diese Pläne häufig ausschließlich am aktuellen Bedarf ausgerichtet. Jedoch verlangen zukünftige neue Anforderungen oft auch nach weiteren Kapazitäten des Stromnetzes und der Datenkabel. Dies kann z. B. notwendig werden, sobald zusätzliche Server eingesetzt werden oder sich technische Standards ändern. Die Verkabelung kann aber nur in dem Umfang erweitert werden, den die bereits vorhandenen und verlegten Kabel und Kabeltrassen zulassen."
          },
          {
            "name": "2.3. Unzureichende Dokumentation der Verkabelung",
            "value": "Wenn die genaue Lage von Kabeln nicht bekannt ist, weil sie unzureichend dokumentiert wurde, dann können diese Kabel bei Bauarbeiten außerhalb oder innerhalb eines Gebäudes beschädigt werden. Eine unzureichende Dokumentation erschwert es auch, Kabel zu prüfen und zu reparieren.\nDarüber hinaus kann nicht davon ausgegangen werden, dass alle Kabel in den Installationszonen nach aktuell gültigen Normen installiert sind."
          },
          {
            "name": "2.4. Unzureichend geschützte Verteiler",
            "value": "Gelegentlich sind Verteilungen des Stromversorgungs- oder Datennetzes unverschlossen in Bereichen installiert, die allgemein zugänglich sind. Unbefugte Personen können solche Verteiler öffnen, manipulieren und so Ausfälle in der Strom- oder Datenversorgung herbeizuführen."
          },
          {
            "name": "2.5. Leitungsbeschädigungen",
            "value": "Je ungeschützter ein Kabel verlegt ist, desto größer ist die Gefahr, dass es absichtlich oder unabsichtlich beschädigt wird. Beschädigungen verursachen nicht nur direkte Ausfälle von Verbindungen, sondern können auch später zu Störungen führen. Eine beschädigte Isolierung beeinträchtigt unter Umständen erst mit großer zeitlicher Verzögerung die funktionellen Eigenschaften eines Kabels."
          },
          {
            "name": "2.6. Spannungsschwankungen, Überspannung, Unterspannung",
            "value": "Schwankungen der Versorgungsspannung können in allen Bereichen der Netze entstehen. Extrem kurze und kleine Ereignisse wirken sich kaum oder gar nicht auf IT-Systeme aus. Größere Schwankungen führen jedoch zu Funktionsstörungen. Die angeschlossenen Systeme können beschädigt werden bis hin zu Totalausfällen. Auch zerstörerische Überspannungen können auftreten."
          },
          {
            "name": "2.7. Verwendung qualitativ unzureichender Steckdosenleisten",
            "value": "Oft reichen die fest installierten Steckdosen für die zu betreibenden Geräte nicht aus. Um dies auszugleichen, werden häufig Steckdosenleisten verwendet. Sind diese Steckdosenleisten jedoch qualitativ unzureichend, dann können sie zur Zündquelle und damit zu einer großen Brandgefahr werden.\nIn vielen Fällen werden mehrere Steckdosenleisten hintereinander geschaltet, um Steckplätze für alle Geräte bereitzustellen. Bei einer solchen Reihenschaltung besteht die Gefahr der Überlastung. Die Folge kann ein unvollständiger Kurzschluss mit hoher Brandgefahr sein."
          },
          {
            "name": "2.8. Unzulässige Kabelverbindungen",
            "value": "In manchen Fällen werden zwischen IT-Systemen oder anderen technischen Komponenten Kabelverbindungen hergestellt, die nicht vorgesehen und unzulässig sind. Dies kann Sicherheitsprobleme oder Betriebsstörungen verursachen.\nSo ermöglichen solche Kabelverbindungen unter Umständen, dass unerlaubt auf Datennetze, IT-Systeme, Informationen oder Anwendungen zugegriffen werden kann. Durch unzulässige Kabelverbindungen können Informationen auch zu falschen Empfangenden übertragen werden. Zudem kann die Verbindung gestört werden."
          },
          {
            "name": "2.9. Leitungsbeeinträchtigungen",
            "value": "Die elektrische Signalübertragung in Kommunikationskabeln kann durch elektrische und magnetische Felder negativ beeinflusst werden. Eine spezielle Form dieser Leitungsbeeinträchtigung ist Übersprechen. Dabei werden Ströme und Spannungen von benachbarten Leitungen als Störsignale auf das Kommunikationskabel übertragen."
          },
          {
            "name": "2.10. Abhören und Manipulation von Kabeln",
            "value": "Abhörangriffe auf Datenkabel sind eine Gefahr für die Informationssicherheit, die nicht vernachlässigt werden sollte. Grundsätzlich gibt es keine abhörsicheren Kabel. Die Kabel unterscheiden sich in ihrer Qualität lediglich hinsichtlich des Aufwands, der zum Abhören der Leitung betrieben werden muss. Ob ein Kabel tatsächlich abgehört wird, ist nur mit hohem messtechnischem Aufwand feststellbar.\nDaneben stellen bewusste Manipulationen von Kabeln bis hin zu ihrer Zerstörung eine Gefahr für die Institution dar. Fehlfunktionen von Kabeln können in manipulativer Absicht bewusst herbeigeführt werden. Solche Manipulationen verfolgen oftmals das Ziel, den IT-Betrieb zu stören oder die Institution zu schädigen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "e29b98a5-9989-4800-a5e8-603fb3bdf519",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/rume_fr_technische_infrastruktur_profile.json",
            "description": "Implementation for all controls in Baustein INF.12",
            "implemented-requirements": [
              {
                "uuid": "d1f9a459-0825-4786-b540-77801585feb1",
                "control-id": "GEB.1.5",
                "description": "Implementation for GEB.1.5 based on BSI INF.12.A10",
                "statements": [
                  {
                    "statement-id": "inf.12.a10-m1",
                    "uuid": "238d8745-9eca-4cca-88a3-e72003460c87",
                    "description": "Eine Dokumentation der Verkabelung existiert nicht oder ist stark veraltet und unvollständig. Kabel und Anschlüsse sind nicht oder inkonsistent gekennzeichnet."
                  },
                  {
                    "statement-id": "inf.12.a10-m2",
                    "uuid": "8336f9a5-9194-4d61-bebb-37f714ebd543",
                    "description": "Es existiert eine grundlegende Dokumentation, meist in Form von Excel-Listen und einfachen Plänen. Die Kennzeichnung der Anschlüsse ist vorhanden, aber nicht immer systematisch oder aktuell. Änderungen werden nur unregelmäßig nachgepflegt."
                  },
                  {
                    "statement-id": "inf.12.a10-m3",
                    "uuid": "a3a4d99d-0067-4bfe-9028-30575aa0d5b3",
                    "description": "Eine Institution SOLLTE sicherstellen, dass sie für ihre Verkabelung sowohl über eine interne (detaillierte) als auch eine externe (neutrale Beschriftung der Anschlüsse) Dokumentation verfügt. Die interne Dokumentation MUSS alle Aufzeichnungen zur Installation und zum Betrieb enthalten. Jede Veränderung im Netz SOLLTE dokumentiert werden, wobei die Stammdokumentation spätestens 4 Wochen nach Abschluss der Arbeiten aktualisiert sein MUSS. Die Dokumentation SOLLTE regelmäßig überprüft und aktualisiert werden."
                  },
                  {
                    "statement-id": "inf.12.a10-m4",
                    "uuid": "ca67fd8e-5e7d-49d5-aa07-c0e323726221",
                    "description": "Die Verkabelungsdokumentation ist mit anderen Verwaltungssystemen, wie dem Netzwerk-Monitoring oder dem Asset-Management, verknüpft. Die Konsistenz der Daten zwischen den Systemen wird regelmäßig automatisiert geprüft. Die Kennzeichnung der Kabel erfolgt mit langlebigen, maschinenlesbaren Etiketten (z.B. Barcodes)."
                  },
                  {
                    "statement-id": "inf.12.a10-m5",
                    "uuid": "b1b0b393-5522-43a0-b976-ed8ddd68d245",
                    "description": "Die Dokumentation und Kennzeichnung ist vollständig automatisiert durch ein Automated Infrastructure Management (AIM) System. Jede physische Änderung an der Verkabelung wird von Sensoren am Patchfeld in Echtzeit erfasst und die Dokumentation wird sofort und ohne manuelles Eingreifen aktualisiert. Unautorisierte Änderungen lösen einen Alarm aus."
                  }
                ]
              },
              {
                "uuid": "55c360aa-8023-4ca5-9d54-d7677a99f432",
                "control-id": "GEB.10.1",
                "description": "Implementation for GEB.10.1 based on BSI INF.12.A4",
                "statements": [
                  {
                    "statement-id": "inf.12.a4-m1",
                    "uuid": "4ffa427f-fc7e-4e31-8a12-031f14dd2a9a",
                    "description": "Die Stromversorgung wird ohne besondere Berücksichtigung der elektromagnetischen Verträglichkeit (EMV) installiert. Die Netzform (z.B. TN-C oder TN-S) ist nicht durchgängig bekannt oder dokumentiert."
                  },
                  {
                    "statement-id": "inf.12.a4-m2",
                    "uuid": "b25dae1f-84dd-4b07-9850-cc8c353c60b9",
                    "description": "In Neubauten oder bei größeren Sanierungen wird ein TN-S-System als Standard für die Stromversorgung umgesetzt. Eine detaillierte EMV-Planung, wie die Einhaltung von Trennungsabständen oder Maßnahmen gegen Einstrahlungen, erfolgt jedoch nicht systematisch."
                  },
                  {
                    "statement-id": "inf.12.a4-m3",
                    "uuid": "0d253514-7eee-483b-ac9b-fe0a050c3228",
                    "description": "Die Stromversorgung MUSS EMV-tauglich sein. Dafür MUSS das Stromverteilnetz als TN-S-System aufgebaut sein. Bei Aufbau und Betrieb MÜSSEN die in den entsprechenden Normen empfohlenen Trennungsabstände soweit wie möglich eingehalten werden. Grundlegende Vorkehrungen gegen Einstrahlungen von außen, Abstrahlung durch die Stromleitung sowie zur Erkennung von Ausgleichsströmen MÜSSEN getroffen werden."
                  },
                  {
                    "statement-id": "inf.12.a4-m4",
                    "uuid": "10f6f2ed-404f-42a9-8f79-3e3f3ca42add",
                    "description": "Zusätzlich zum EMV-gerechten Aufbau werden an kritischen Stellen, wie in Serverräumen oder bei empfindlichen Geräten, Netzfilter und/oder spezielle EMV-geschirmte Verteiler eingesetzt, um Störungen weiter zu reduzieren. Es finden regelmäßige Messungen statt, um die Einhaltung der EMV-Parameter im Betrieb zu überwachen."
                  },
                  {
                    "statement-id": "inf.12.a4-m5",
                    "uuid": "c869b44c-6e4f-4cb5-8b02-01a6f79e1b35",
                    "description": "Die Stromversorgung ist Teil eines umfassenden EMV-Schutzkonzeptes, das alle Infrastrukturbereiche (Blitzschutz, Erdung, Verkabelung) integriert. Die Netzqualität und potenzielle Störgrößen werden durch ein permanentes Monitoringsystem in Echtzeit überwacht. Bei Abweichungen werden automatisch Alarme ausgelöst."
                  }
                ]
              },
              {
                "uuid": "5c581262-a9bb-4fa9-9eee-6ba59b679e0c",
                "control-id": "GEB.10.1.1",
                "description": "Implementation for GEB.10.1.1 based on BSI INF.12.A5",
                "statements": [
                  {
                    "statement-id": "inf.12.a5-m1",
                    "uuid": "5ad4ffc0-824f-40b1-a07d-b71c311efb33",
                    "description": "Die Planung der Verkabelung orientiert sich ausschließlich am unmittelbaren, aktuellen Bedarf. Zukünftige Entwicklungen oder Schutzziele wie Vertraulichkeit werden nicht berücksichtigt."
                  },
                  {
                    "statement-id": "inf.12.a5-m2",
                    "uuid": "6edf775d-0ab9-4e61-880e-15abf82625c8",
                    "description": "Bei der Planung der Verkabelung wird eine pauschale Reserve für zukünftiges Wachstum eingeplant. Die grundlegenden Schutzziele Verfügbarkeit und Integrität werden implizit durch die Verwendung von Standardkomponenten adressiert."
                  },
                  {
                    "statement-id": "inf.12.a5-m3",
                    "uuid": "596cbc30-93ef-4778-8353-bd41cae43970",
                    "description": "Grundsätzlich SOLLTEN die Anforderungen analysiert werden, die Einfluss auf eine zukunftssichere, bedarfsgerechte und wirtschaftliche Ausführung der Verkabelung haben. In dieser Anforderungsanalyse SOLLTE zunächst die kurzfristige Nutzung abgeschätzt werden. Darauf aufbauend SOLLTE die längerfristige Entwicklung abgeschätzt werden. Darüber hinaus MÜSSEN die Schutzziele der Verfügbarkeit, Integrität und Vertraulichkeit bei der Anforderungsanalyse mit betrachtet werden."
                  },
                  {
                    "statement-id": "inf.12.a5-m4",
                    "uuid": "842c5f7c-0c0d-4117-b2ed-e04f0cf1dc6e",
                    "description": "Die Anforderungsanalyse ist ein formalisierter und wiederkehrender Prozess. Sie basiert auf strukturierten Kapazitätsprognosen und einer detaillierten Risikoanalyse. Die Ergebnisse fließen nicht nur in die technische Planung, sondern auch in die Budgetplanung und die strategische IT-Ausrichtung ein."
                  },
                  {
                    "statement-id": "inf.12.a5-m5",
                    "uuid": "f10845c4-c1a8-4982-8beb-4373282285e5",
                    "description": "Die Anforderungsanalyse wird durch ein automatisiertes System unterstützt, das kontinuierlich Nutzungs- und Leistungsdaten der Netzwerkinfrastruktur sammelt. Mithilfe von KI-gestützten Prognosemodellen wird der zukünftige Bedarf dynamisch vorhergesagt und es werden proaktiv Vorschläge für notwendige Erweiterungen oder Modernisierungen generiert."
                  }
                ]
              },
              {
                "uuid": "e675ccbe-c7c6-479d-a51f-9c73e1ed8199",
                "control-id": "GEB.10.1.3",
                "description": "Implementation for GEB.10.1.3 based on BSI INF.12.A14",
                "statements": [
                  {
                    "statement-id": "inf.12.a14-m3",
                    "uuid": "be850085-9264-4c8c-a3dc-67192f0c12e8",
                    "description": "Es SOLLTE geprüft werden, ob anstelle einer einzügigen Stromversorgung eine zweizügige sogenannte A-B-Versorgung geschaffen werden soll, die wichtige IT-Komponenten und andere Verbraucher versorgt. Die grundsätzliche Planung einer solchen Versorgung wird erstellt, jedoch ohne permanente Überwachung der Funktionsfähigkeit."
                  },
                  {
                    "statement-id": "inf.12.a14-m4",
                    "uuid": "71db0a40-b0d9-4083-9e79-13150af13625",
                    "description": "Eine zweizügige A-B-Versorgung ist für alle wichtigen IT-Komponenten implementiert. Die Funktionsfähigkeit beider Stromversorgungswege wird permanent durch geeignete technische Einrichtungen überwacht. Die Überwachung umfasst die USV-Systeme und die PDUs."
                  },
                  {
                    "statement-id": "inf.12.a14-m5",
                    "uuid": "1c6bfa31-49bb-4654-be86-76c8a20cf619",
                    "description": "Die A-B-Versorgung ist durchgängig redundant bis zu den einzelnen Komponenten aufgebaut und wird durch zwei physisch getrennte und aus unterschiedlichen Quellen gespeiste Netzeinspeisungen realisiert. Die Umschaltung im Fehlerfall erfolgt vollautomatisch und wird regelmäßig getestet. Die Lastverteilung zwischen A- und B-Weg wird aktiv gemanagt, um eine gleichmäßige Auslastung sicherzustellen."
                  }
                ]
              },
              {
                "uuid": "455b29c0-8ef2-45d8-a645-fe347bf768b8",
                "control-id": "GEB.10.2",
                "description": "Implementation for GEB.10.2 based on BSI INF.12.A12",
                "statements": [
                  {
                    "statement-id": "inf.12.a12-m1",
                    "uuid": "1219d4d3-cd4e-4d6c-89fb-1510b559da88",
                    "description": "Prüfungen elektrischer Anlagen und Betriebsmittel finden nicht oder nur auf explizite Anforderung nach einem Vorfall statt. Es gibt keinen präventiven Prüfprozess."
                  },
                  {
                    "statement-id": "inf.12.a12-m2",
                    "uuid": "006f741f-2107-483d-a0a2-99d052092935",
                    "description": "Ortsveränderliche elektrische Betriebsmittel (z.B. Monitore, Netzteile) werden in unregelmäßigen Abständen geprüft. Ortsfeste Anlagen wie die Elektroverteilung werden selten oder gar nicht geprüft."
                  },
                  {
                    "statement-id": "inf.12.a12-m3",
                    "uuid": "755cbf44-1947-4c3b-9bd7-ac8a4df48c72",
                    "description": "Alle elektrischen Anlagen und Betriebsmittel SOLLTEN gemäß DGUV Vorschrift 3 regelmäßig geprüft werden. Alle Unregelmäßigkeiten MÜSSEN unverzüglich dokumentiert und den zuständigen Organisationseinheiten gemeldet werden. Diese MÜSSEN die Mängel so zeitnah beheben, dass eine Gefährdung von Personen ausgeschlossen werden kann. Die Verfügbarkeit MUSS hierbei im erforderlichen Maß sichergestellt sein."
                  },
                  {
                    "statement-id": "inf.12.a12-m4",
                    "uuid": "f0b61847-c4c2-477e-8beb-bc9c2b77c0c9",
                    "description": "Die Verwaltung der Prüfungen, Fristen und Protokolle erfolgt über eine spezialisierte Softwarelösung. Diese erinnert automatisch an anstehende Prüfungen und eskaliert überfällige Prüfungen. Mängel werden direkt in der Software erfasst und als Workflows an die zuständigen Techniker zur Behebung weitergeleitet."
                  },
                  {
                    "statement-id": "inf.12.a12-m5",
                    "uuid": "162a685e-f9d4-4bdf-b328-178942393ada",
                    "description": "Kritische elektrische Anlagen werden permanent durch Monitoringsysteme überwacht (z.B. Isolationsüberwachung, Differenzstrom-Monitoring). Dies ermöglicht die Erkennung von schleichenden Fehlern, lange bevor sie zu einer Gefahr oder einem Ausfall führen, und reduziert die Notwendigkeit von Prüfungen, die eine Abschaltung erfordern."
                  }
                ]
              },
              {
                "uuid": "a90196cf-8237-4f3e-9283-25ade083f929",
                "control-id": "GEB.10.4",
                "description": "Implementation for GEB.10.4 based on BSI INF.12.A7",
                "statements": [
                  {
                    "statement-id": "inf.12.a7-m1",
                    "uuid": "38facd9c-aa39-4c42-b3de-27eda0b1d107",
                    "description": "Ein Überspannungsschutz ist nur punktuell, z.B. in Form von Steckdosenleisten mit integriertem Schutz für einzelne, als wichtig erachtete Geräte, vorhanden. Ein systematisches Konzept fehlt."
                  },
                  {
                    "statement-id": "inf.12.a7-m2",
                    "uuid": "42c417ea-6200-49f0-8089-980793d43ab1",
                    "description": "Am Gebäudeeintritt ist ein Grobschutz (Typ 1) für die Stromversorgung installiert. Ein weiterführendes, koordiniertes Schutzkonzept für Mittel- und Feinschutz (Typ 2, Typ 3) fehlt jedoch oder ist nur lückenhaft umgesetzt."
                  },
                  {
                    "statement-id": "inf.12.a7-m3",
                    "uuid": "b6b857ae-cdd2-430d-a92e-980598f32149",
                    "description": "Jedes elektrisch leitende Netz SOLLTE gegen Überspannungen geschützt werden. Hierfür MUSS ein entsprechendes Überspannungsschutzkonzept erstellt werden, das den gültigen Normen entspricht. Das Konzept MUSS alle relevanten Netze (Strom, Daten, Telekommunikation) umfassen. Netzersatzanlagen (NEA) und unterbrechungsfreie Stromversorgungen (USV) MÜSSEN in das Konzept aufgenommen werden."
                  },
                  {
                    "statement-id": "inf.12.a7-m4",
                    "uuid": "80301d28-7a9b-482d-96ec-33154d93b3d1",
                    "description": "Das Überspannungsschutzkonzept wird regelmäßig, z.B. alle 2 Jahre, auf seine Aktualität und Wirksamkeit überprüft und bei Bedarf angepasst. Die Funktionsfähigkeit der installierten Überspannungsschutzgeräte (SPDs) wird regelmäßig durch Messungen oder durch Geräte mit Statusanzeige kontrolliert."
                  },
                  {
                    "statement-id": "inf.12.a7-m5",
                    "uuid": "36e89206-b532-4548-95ea-8b0069149a3a",
                    "description": "Ein intelligentes Überspannungsschutzsystem überwacht kontinuierlich den Zustand der Schutzgeräte und misst gleichzeitig auftretende Überspannungsereignisse. Die gesammelten Daten werden analysiert, um das Schutzkonzept dynamisch zu optimieren und potenzielle Schwachstellen proaktiv zu identifizieren."
                  }
                ]
              },
              {
                "uuid": "f8a8e001-be44-4560-8d81-e9f734377252",
                "control-id": "GEB.10.5",
                "description": "Implementation for GEB.10.5 based on BSI INF.12.A3",
                "statements": [
                  {
                    "statement-id": "inf.12.a3-m1",
                    "uuid": "623cfd2b-c713-4f2c-bc27-c07126b8c42c",
                    "description": "Die Installation der Verkabelung wird ohne formale Abnahme oder Überprüfung durch eine fachkundige Person durchgeführt. Die Qualität der Arbeit hängt allein vom ausführenden Dienstleister ab. Normen werden nicht explizit eingefordert oder überprüft."
                  },
                  {
                    "statement-id": "inf.12.a3-m2",
                    "uuid": "9a800985-8a61-4f1f-81be-12d5ffa90f44",
                    "description": "Die Installationsarbeiten werden von als fachkundig angesehenen Dienstleistern durchgeführt. Es wird eine grundlegende Funktionsprüfung nach der Installation vorgenommen (z.B. Link-Test), aber eine detaillierte Überprüfung aller normativen Vorgaben oder eine formale Abnahme findet nicht statt."
                  },
                  {
                    "statement-id": "inf.12.a3-m3",
                    "uuid": "7715a806-7aa8-46a1-90c4-eeb3e224307e",
                    "description": "Die Installationsarbeiten der Verkabelung MÜSSEN fachkundig und sorgfältig erfolgen, wobei alle relevanten Normen beachtet werden. Die fachgerechte Ausführung MUSS durch eine fachkundige Person in allen Phasen überprüft werden. Dies beinhaltet die Prüfung des Materials bei Anlieferung, die Überwachung der Montage auf Beschädigungen und die Sicherstellung, dass die Kabelwege so gewählt sind, dass eine Beschädigung durch die normale Nutzung des Gebäudes ausgeschlossen ist."
                  },
                  {
                    "statement-id": "inf.12.a3-m4",
                    "uuid": "8511b61b-59f2-4f09-82c4-aa9a80d01505",
                    "description": "Die Installationsqualität wird durch einen mehrstufigen, formalisierten Abnahmeprozess sichergestellt. Zusätzlich zur Überprüfung durch eine interne fachkundige Person wird die Abnahme stichprobenartig durch einen unabhängigen Dritten (Gutachter) begleitet und verifiziert. Alle Installationsschritte werden fotografisch dokumentiert."
                  },
                  {
                    "statement-id": "inf.12.a3-m5",
                    "uuid": "ad900b55-b6e5-4f27-95bb-a42c5e58b9db",
                    "description": "Die gesamte Verkabelungsinfrastruktur wird mit intelligenten Komponenten (z.B. automatisierte Infrastrukturmanagement-Systeme, AIM) ausgestattet, die eine kontinuierliche physikalische Überwachung der Verbindungen ermöglichen. Installationsfehler oder spätere unautorisierte Änderungen am Patching werden sofort automatisch erkannt und gemeldet."
                  }
                ]
              },
              {
                "uuid": "e5fb1bc2-f923-4960-b34c-9b62e502cbc3",
                "control-id": "GEB.10.5.1",
                "description": "Implementation for GEB.10.5.1 based on BSI INF.12.A15",
                "statements": [
                  {
                    "statement-id": "inf.12.a15-m3",
                    "uuid": "38fb8887-53af-4318-8479-ca12550802d6",
                    "description": "Es SOLLTE überlegt werden, Kabel und Verteiler gegen unbefugte Zugriffe zu sichern. Die Zahl und der Umfang derjenigen Stellen, an denen Einrichtungen der Energieversorgung und Zugangspunkte des Datennetzes für Unbefugte zugänglich sind, SOLLTE möglichst gering gehalten werden. Haupt- und Etagenverteiler werden in abschließbaren Räumen oder Schränken untergebracht."
                  },
                  {
                    "statement-id": "inf.12.a15-m4",
                    "uuid": "7f14cd1e-b587-4c68-a2da-c8a181d40ff0",
                    "description": "Zusätzlich zum Verschluss der Räume und Schränke werden diese mit Einbruchmeldeanlagen (EMA) bzw. Öffnungskontakten überwacht. Kabeltrassen, die durch nicht permanent kontrollierte Bereiche führen, werden als geschlossene, abschließbare Stahlblechkanäle ausgeführt. Netzwerkdosen in öffentlichen Bereichen werden bei Nichtbenutzung deaktiviert."
                  },
                  {
                    "statement-id": "inf.12.a15-m5",
                    "uuid": "eced9681-175a-4060-ad17-a4e810c88fe6",
                    "description": "Die gesamte kritische Verkabelungsinfrastruktur wird durch ein Leitungswegemonitoring permanent überwacht. Spezielle Überwachungskabel oder -fasern, die zusammen mit den Datenkabeln verlegt werden, erkennen Manipulationsversuche wie das Anbohren oder Öffnen der Kabeltrasse und lösen sofort einen Alarm aus. Der Zugang zu allen Verteilern wird über ein elektronisches Zutrittskontrollsystem mit Protokollierung gesteuert."
                  }
                ]
              },
              {
                "uuid": "10865383-e3cd-45ae-a120-1ad9033d3c48",
                "control-id": "GEB.11.1",
                "description": "Implementation for GEB.11.1 based on BSI INF.12.A13",
                "statements": [
                  {
                    "statement-id": "inf.12.a13-m1",
                    "uuid": "cf744c91-2800-45b4-87db-1712c457e2a1",
                    "description": "Die Nutzung von privaten Elektrogeräten und Mehrfachsteckdosen ist nicht geregelt und wird geduldet. Eine Prüfung dieser Geräte findet nicht statt."
                  },
                  {
                    "statement-id": "inf.12.a13-m2",
                    "uuid": "1f450a2b-4f8d-4133-ae5c-4d85d6017ea0",
                    "description": "Es gibt eine Anweisung, die die Nutzung privater Elektrogeräte einschränkt. Die Verwendung von Steckdosenleisten ist erlaubt, solange diese eine CE-Kennzeichnung haben. Eine systematische Kontrolle oder Prüfung findet nicht statt."
                  },
                  {
                    "statement-id": "inf.12.a13-m3",
                    "uuid": "1f0059a0-8524-4409-8950-3affe36657f3",
                    "description": "Die Nutzung privater Elektrogeräte innerhalb der Institution SOLLTE klar geregelt werden. Alle Elektrogeräte MÜSSEN durch eine Elektrofachkraft geprüft und für sicher befunden werden, bevor sie eingesetzt werden. Die Verwendung von Steckdosenleisten SOLLTE soweit wie möglich vermieden werden. Fehlende Steckdosen SOLLTEN durch eine Elektrofachkraft fachgerecht nachgerüstet werden."
                  },
                  {
                    "statement-id": "inf.12.a13-m4",
                    "uuid": "c33c2925-74ec-44d7-8694-4e9609cd094a",
                    "description": "Die Einhaltung der Regeln zur Vermeidung von Zündquellen wird proaktiv durch regelmäßige, angekündigte Begehungen durch die Elektrofachkraft oder den Brandschutzbeauftragten überprüft. Die Mitarbeiter werden regelmäßig für die Gefahren sensibilisiert."
                  },
                  {
                    "statement-id": "inf.12.a13-m5",
                    "uuid": "673702c4-349f-42a0-8bb3-65eb76243a91",
                    "description": "Es werden technische Maßnahmen eingesetzt, um die Entstehung von Zündquellen durch Überlastung oder Fehlerströme aktiv zu verhindern. In kritischen Bereichen werden flächendeckend Brandschutzschalter (AFDDs) eingesetzt, die gefährliche Lichtbögen erkennen und den Stromkreis abschalten, bevor ein Brand entstehen kann."
                  }
                ]
              },
              {
                "uuid": "8f17e950-7624-42b7-b3b4-bc5e2db41537",
                "control-id": "GEB.11.1.5",
                "description": "Implementation for GEB.11.1.5 based on BSI INF.12.A9",
                "statements": [
                  {
                    "statement-id": "inf.12.a9-m1",
                    "uuid": "2e26d85c-b97c-45c8-bdd2-9789a1a31b39",
                    "description": "Kabeltrassen werden ohne Berücksichtigung von Brandschutzaspekten wie Überfüllung oder Belüftung geplant und betrieben. Die Brandlast wird nicht bewertet."
                  },
                  {
                    "statement-id": "inf.12.a9-m2",
                    "uuid": "4e10c5dc-976c-490f-9d5b-121474097b15",
                    "description": "Bei der Planung von Kabeltrassen wird darauf geachtet, dass diese nicht überfüllt werden. Eine aktive Belüftung oder eine detaillierte Betrachtung der Brandlast findet jedoch nicht statt."
                  },
                  {
                    "statement-id": "inf.12.a9-m3",
                    "uuid": "b3933720-d99c-4393-a430-b7be04f15eac",
                    "description": "Trassen SOLLTEN ausreichend dimensioniert werden, um eine Überfüllung und damit eine erhöhte Brandlast zu vermeiden. Sie SOLLTEN über eine ausreichende Be- und Entlüftung verfügen, um einen Wärmestau zu verhindern."
                  },
                  {
                    "statement-id": "inf.12.a9-m4",
                    "uuid": "05cc2215-45d7-441c-82a3-a40914b0bec4",
                    "description": "In kritischen Bereichen wie Flucht- und Rettungswegen oder Serverräumen werden zusätzliche Brandschutzmaßnahmen für Trassen umgesetzt. Dies kann die Verwendung von Kabeln mit verbesserter Brandverhaltensklasse (z.B. B2ca), die Installation von Brandmeldern direkt in den Trassen oder die Nutzung von speziellen I- oder E-Kanal-Systemen für den Funktionserhalt umfassen."
                  },
                  {
                    "statement-id": "inf.12.a9-m5",
                    "uuid": "0cb2483a-35d4-44d2-8fab-97b774cf0c1f",
                    "description": "Die Temperatur und der Rauchstatus in allen kritischen Kabeltrassen werden permanent durch ein engmaschiges Sensornetzwerk überwacht. Die Daten fließen in die Gebäudeleittechnik und ein KI-System zur Anomalieerkennung. Bei kritischer Erwärmung werden proaktive Maßnahmen wie die Erhöhung der Raumlüftung ausgelöst, noch bevor ein Brand entsteht."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}