{
  "component-definition": {
    "uuid": "1b835e2d-ab73-4f19-9513-7a5a4f7ef4f8",
    "metadata": {
      "title": "INF.1 Gebäude - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:08:00.330752+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "b4eac2f6-3c5f-43e3-bb38-d686160ba4c7",
        "type": "physical",
        "title": "INF.1 Gebäude",
        "description": "This component represents the implementation of all controls for Baustein INF.1.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Ein Gebäude umschließt alle stationären Arbeitsplätze, die verarbeiteten Informationen sowie die aufgestellte Informationstechnik. Es gewährleistet somit einen Schutz vor äußeren Einflüssen. Daher ist nicht nur das Bauwerk an sich zu betrachten, also Wände, Decken, Böden, Dach, Fenster sowie Türen, sondern auch alle gebäudeweiten Infrastruktur- und Versorgungseinrichtungen wie Strom, Wasser, Gas, Heizung und Kühlung.\nBetrachtet wird ein Gebäude, das von einer oder mehreren Organisationseinheiten einer Institution genutzt wird. Diese können unterschiedliche Sicherheitsansprüche haben. Zudem muss in alle Überlegungen einfließen, dass ein Gebäude fast immer auch von institutionsfremden Personen, wie Besuch, Kundschaft oder Liefernden, betreten wird. Wenn ein Gebäude von verschiedenen Parteien genutzt wird, dann müssen Gestaltung und Ausstattung des Gebäudes und das Nutzungskonzept für das Gebäude zueinander passen. Es soll eine optimale Umgebung für die dort tätigen Menschen sichergestellt werden. Unberechtigte sollen dort keinen Zutritt erhalten, wo sie die Sicherheit beeinträchtigen könnten. Die im Gebäude installierte Technik soll zudem sicher und effizient betrieben werden können."
          },
          {
            "name": "Zielsetzung",
            "value": "In diesem Baustein wird beschrieben, welche Anforderungen zu erfüllen sind, um ein Gebäude aus Sicht der Informationssicherheit optimal zu schützen. Die sich aus den Anforderungen ergebenden Maßnahmen hängen von der Art und Größe der Institution sowie Art und Größe des Gebäudes ab. Anforderungen aus diesem Baustein können auch auf große Liegenschaften mit mehreren Gebäuden oder auf die Nutzung einzelner Gebäudeteile in Mehrparteienhäusern übertragen werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein INF.1 Allgemeines Gebäude ist für jedes Gebäude einmal anzuwenden.\nDieser Baustein betrachtet technische und nicht-technische Sicherheitsaspekte bei der Planung und Nutzung von typischen Gebäuden für Unternehmen und Behörden. Dabei wird der gesamte Lebenszyklus von Gebäuden aus Sicht der Informationssicherheit betrachtet, beginnend von der Erstellung eines Anforderungskataloges, über die Konzeption, Einrichtung, Nutzung bis hin zu Umbauten oder dem Auszug."
          },
          {
            "name": "2.1. Feuer",
            "value": "Gebäude und Einrichtung können durch ein Feuer schwer beschädigt, Menschen schwer verletzt oder getötet werden. Neben den direkt durch das Feuer verursachten Schäden müssen auch die Folgeschäden betrachtet werden. So dauert die Wiederinbetriebnahme durch Brand beschädigter Bereiche in der Regel Wochen oder gar Monate. Eine sehr große Gefahr bei einem Feuer ist der giftige Brandrauch. Die meisten Personenschäden entstehen daher durch Rauchvergiftungen. Aber auch an Einrichtungen und IT-Systemen kann Brandrauch schwere Schäden anrichten.\nWenn PVC verbrennt, entstehen etwa Chlorgase, die zusammen mit der Luftfeuchtigkeit und dem Löschwasser Salzsäure bilden. Werden die Salzsäuredämpfe über die Klimaanlage verteilt, können auf diese Weise auch Schäden an empfindlichen elektronischen Geräten entstehen, die in einem vom Brandort weit entfernten Teil des Gebäudes stehen."
          },
          {
            "name": "2.2. Blitz",
            "value": "Während eines Gewitters sind Blitzeinschläge die größte Gefahr für Gebäude und Informationstechnik. Blitze erreichen bei Spannungen von mehreren 100.000 Volt Ströme bis zu 200.000 Ampere. Diese enorme elektrische Energie wird innerhalb von 50 bis 100 Mikrosekunden freigesetzt und abgebaut. Ein Blitz mit diesen Werten, der in einem Abstand von etwa zwei Kilometern einschlägt, verursacht auf elektrischen Leitungen im Gebäude immer noch Spannungsspitzen, die zur Zerstörung empfindlicher elektronischer Geräte führen können. Diese indirekten Schäden nehmen zu, je näher am Gebäude der Blitz einschlägt.\nSchlägt der Blitz direkt in ein Gebäude ein, können durch die dynamische Energie des Blitzes große Schäden verursacht werden. Dies können zum Beispiel Beschädigungen an Dach und Fassade sowie Schäden durch auftretende Brände oder Überspannungsschäden an elektrischen Geräten sein."
          },
          {
            "name": "2.3. Wasser",
            "value": "Wasser kann von außen, beispielsweise durch Regen, Hochwasser oder Überschwemmungen, oder von innen, etwa durch defekte wasserführende Leitungen, Schäden an einem Gebäude und seinen Einrichtungen verursachen."
          },
          {
            "name": "2.4. Elementarschäden und Naturkatastrophen",
            "value": "Je nach Standort ist ein Gebäude den Risiken durch Elementarschäden und Naturkatastrophen unterschiedlich stark ausgesetzt. Ursachen für Naturkatastrophen können seismische, klimatische oder vulkanische Phänomene sein, wie beispielsweise Erdbeben, Hochwasser, Erdrutsche, Tsunamis, Lawinen oder Vulkanausbrüche. Beispiele für extreme meteorologische Phänomene sind Unwetter, Orkane oder Starkregen."
          },
          {
            "name": "2.5. Umfeld-Gefährdungen",
            "value": "Gebäude können auch durch Ereignisse in der unmittelbaren Umgebung beschädigt werden, beispielsweise wenn giftige Substanzen austreten. Durch Rettungsarbeiten, Straßensperrungen oder Evakuierungen kann es auch möglich sein, dass das Gebäude nur noch eingeschränkt oder nicht mehr genutzt werden kann."
          },
          {
            "name": "2.6. Unbefugter Zutritt",
            "value": "Wenn Unbefugte in ein Gebäude oder einzelne Räume gelangen, kann dies verschiedene andere Gefährdungen nach sich ziehen. Unbefugte Personen können einerseits durch vorsätzliche Handlungen wie Diebstahl oder Manipulation von Informationen, IT-Systemen oder IT-Komponenten, andererseits aber auch durch unbeabsichtigtes Fehlverhalten, z. B. aufgrund mangelnder Fachkenntnisse, Schäden verursachen.\nDabei können nicht offensichtliche Manipulationen weit höhere Schäden verursachen als direkte Zerstörung. Schon durch das unbefugte Eindringen können Sachschäden entstehen. Fenster und Türen werden gewaltsam geöffnet und dabei beschädigt. Diese zu reparieren oder zu ersetzen, beansprucht in der Regel Zeit und finanzielle Mittel, in der diese ihre Schutzfunktion nicht oder nur eingeschränkt bereitstellen."
          },
          {
            "name": "2.7. Verstoß gegen Gesetze oder Regelungen",
            "value": "Wird ein Gebäude errichtet, sind viele Gesetze und Vorgaben zu beachten, die beispielsweise den Brandschutz oder andere Aspekte der baulichen Sicherheit betreffen. Wenn gegen diese Gesetze verstoßen wird, fällt dies unter Umständen lange nicht auf, kann aber katastrophale Folgen nach sich ziehen, etwa wenn Brandschotten nicht bestimmungsgemäß eingebaut wurden."
          },
          {
            "name": "2.8. Unzureichende Brandschottungen",
            "value": "Jedes Gebäude, in dem IT betrieben wird, ist von einer Vielzahl von Kabeln und Leitungen durchzogen, wie beispielsweise Frisch- und Abwasserleitungen, Heizungsrohre oder Leitungen zur Energieversorgung oder Datenübertragung. Es ist dabei unvermeidlich, dass solche Rohr- und Kabeltrassen Brandschutzwände und Geschossdecken queren müssen. Wenn an solchen Stellen keine geeigneten Brandschotten eingebaut sind, können sich darüber unter Umständen Brände und Rauch unkontrolliert ausbreiten.\nDie hohe Dynamik der IT macht es auch im Leitungsnetz immer wieder erforderlich, dass Kabel auch über Brandschotten hinweg nachverlegt werden müssen. In welcher Form dies korrekt erfolgen kann, ist unmittelbar von dem vorhandenen Schott abhängig und kann sehr unterschiedlich sein. Werden Änderungen an einem Brandschott nicht nach den Vorgaben des jeweiligen Unternehmens, das das Schott herstellt, ausgeführt, kann es im Fall eines Brandes versagen. Der Brand könnte sich dann in Bereiche ausweiten, die eigentlich durch das Schott geschützt wären."
          },
          {
            "name": "2.9. Ausfall der Stromversorgung",
            "value": "Bei einem Stromausfall können ganze Gebäude oder Teile davon unbenutzbar werden. Von der Stromversorgung sind nicht nur die offensichtlichen, direkten Stromverbraucher wie IT oder Beleuchtung abhängig. Auch alle Infrastruktureinrichtungen sind heute direkt oder indirekt vom Strom abhängig, z. B. Aufzüge, Klimatechnik, Gefahrenmeldeanlagen, Sicherheitsschleusen, automatische Türschließanlagen, Sprinkler- oder Telefonnebenstellenanlagen. Selbst die Wasserversorgung ist in Hoch- oder Tiefgeschossen aufgrund der erforderlichen Pumpen auf Strom angewiesen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "ad481ad7-92bb-48e8-8e0f-4cfb68b298f9",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/gebude_profile.json",
            "description": "Implementation for all controls in Baustein INF.1",
            "implemented-requirements": [
              {
                "uuid": "c21f76f1-e7c6-4bd0-b680-210a6ac23450",
                "control-id": "GEB.1.3",
                "description": "Implementation for GEB.1.3 based on BSI INF.1.A1",
                "statements": [
                  {
                    "statement-id": "INF.1.A1-m1",
                    "uuid": "2a021f1c-2c60-4c80-82df-bbba924cc1f0",
                    "description": "Die Gebäudeabsicherung wird nur für einzelne, als besonders kritisch angesehene Bereiche ad-hoc geplant, ohne einen ganzheitlichen Ansatz zu verfolgen."
                  },
                  {
                    "statement-id": "INF.1.A1-m2",
                    "uuid": "2046104e-9602-44dc-b21f-cf39407f8710",
                    "description": "Es existiert ein grundlegendes, schriftliches Konzept für die Gebäudeabsicherung, das die wichtigsten Bereiche wie Brandschutz und Zutrittskontrolle abdeckt. Die verschiedenen Sicherheitsaspekte werden jedoch isoliert betrachtet."
                  },
                  {
                    "statement-id": "INF.1.A1-m3",
                    "uuid": "a89e1fb2-6bfc-4c13-922e-6f75aaa90d54",
                    "description": "Je nach der (geplanten) Nutzung eines Gebäudes und dem Schutzbedarf der dort betriebenen Geschäftsprozesse MUSS festgelegt werden, wie das Gebäude abzusichern ist. Bei einem Gebäude MÜSSEN insbesondere Sicherheitsaspekte zum Schutz von Personen im Gebäude, dem Schutz der Wirtschaftsgüter und der IT beachtet werden, von Brandschutz über Elektrik bis hin zur Zutrittskontrolle."
                  },
                  {
                    "statement-id": "INF.1.A1-m4",
                    "uuid": "7a71b27f-d795-40b8-b452-8fbc81a10768",
                    "description": "Die Sicherheitsanforderungen aus den verschiedenen Bereichen (Brandschutz, Zutritt, IT etc.) MÜSSEN aufeinander abgestimmt werden. Das resultierende, integrierte Sicherheitskonzept wird regelmäßig, mindestens alle zwei Jahre, überprüft und bei Bedarf aktualisiert."
                  },
                  {
                    "statement-id": "INF.1.A1-m5",
                    "uuid": "593bab17-8c2c-4005-9604-1f495e7fcc7f",
                    "description": "Die Planung der Gebäudeabsicherung ist ein vollständig integrierter, risikobasierter Prozess, der mit dem übergeordneten Informationssicherheits-Managementsystem (ISMS) und dem Business Continuity Management (BCM) verknüpft ist. Änderungen am Schutzbedarf oder der Bedrohungslage führen zu einer automatisierten Überprüfung und Anpassung des Konzepts."
                  }
                ]
              },
              {
                "uuid": "e2318d18-84e2-4d98-bbe3-0d1e7b109a57",
                "control-id": "GEB.1.3.1",
                "description": "Implementation for GEB.1.3.1 based on BSI INF.1.A30",
                "statements": [
                  {
                    "statement-id": "INF.1.A30-m1",
                    "uuid": "01ab353b-d841-4067-b4f2-28e4691d2487",
                    "description": "Die Auswahl eines Gebäudes erfolgt ohne Berücksichtigung von Sicherheitsanforderungen. Die Eignung wird nicht geprüft."
                  },
                  {
                    "statement-id": "INF.1.A30-m2",
                    "uuid": "ebe3728e-740c-4a3c-b5a7-3270cc7478cd",
                    "description": "Bei der Auswahl werden grundlegende Sicherheitsaspekte wie ein solider Gesamteindruck berücksichtigt. Eine detaillierte Prüfung anhand einer Checkliste findet jedoch nicht statt."
                  },
                  {
                    "statement-id": "INF.1.A30-m3",
                    "uuid": "ec8e72e6-852b-4177-a395-864f879d94e3",
                    "description": "Bei der Auswahl eines geeigneten Gebäudes SOLLTE geprüft werden, ob alle für die spätere Nutzung relevanten Sicherheitsanforderungen umgesetzt werden können. Für jedes Gebäude SOLLTEN im Vorfeld die vorhandenen Gefährdungen und die erforderlichen Schäden vorbeugenden oder reduzierenden Maßnahmen dokumentiert werden."
                  },
                  {
                    "statement-id": "INF.1.A30-m4",
                    "uuid": "c45783f7-0c60-48e1-afdd-7189c3e40eef",
                    "description": "Die Prüfung des Gebäudes wird durch ein interdisziplinäres Team aus eigenen Fachleuten (Bau, IT, Sicherheit) und bei Bedarf durch externe Sachverständige (z.B. für Brandschutz, Statik) durchgeführt."
                  },
                  {
                    "statement-id": "INF.1.A30-m5",
                    "uuid": "a14f39b8-909a-41cb-b09d-985cc48934c6",
                    "description": "Die Auswahl des Gebäudes ist vollständig in den Prozess der Standortauswahl integriert. Die Ergebnisse der Standortrisikoanalyse und der Gebäude-Due-Diligence werden kombiniert, um eine Gesamtrisikobewertung für die potenziellen Optionen zu erstellen und die beste Alternative objektiv auszuwählen."
                  }
                ]
              },
              {
                "uuid": "7bbb70fa-59cb-4aad-93fb-129958d4b93b",
                "control-id": "GEB.1.4",
                "description": "Implementation for GEB.1.4 based on BSI INF.1.A25",
                "statements": [
                  {
                    "statement-id": "INF.1.A25-m1",
                    "uuid": "dae2d6f1-fc5b-4293-b393-1d6d7bcad965",
                    "description": "Die Standortauswahl erfolgt ausschließlich nach wirtschaftlichen Kriterien wie Mietpreis und Verkehrsanbindung. Umfeldbedingungen und Naturgefahren werden nicht berücksichtigt."
                  },
                  {
                    "statement-id": "INF.1.A25-m2",
                    "uuid": "ddcf877f-ad84-4790-b611-f3519792e647",
                    "description": "Offensichtliche Gefährdungen wie die Lage in einem Hochwassergebiet werden bei der Standortauswahl vermieden. Eine systematische Analyse aller potenziellen Umfeldgefährdungen findet jedoch nicht statt."
                  },
                  {
                    "statement-id": "INF.1.A25-m3",
                    "uuid": "c77d42ba-c53a-4f44-804b-8e7c4e68d14f",
                    "description": "Bei Planung und Auswahl des Gebäudestandortes SOLLTE geprüft werden, welche Umfeldbedingungen Einfluss auf die Informationssicherheit haben könnten. Es SOLLTE eine Übersicht über standortbedingte Gefährdungen geben."
                  },
                  {
                    "statement-id": "INF.1.A25-m4",
                    "uuid": "747f4c2f-8e45-403f-9cc3-d471ee989379",
                    "description": "Diesen Gefährdungen SOLLTE mit zusätzlichen kompensierenden Maßnahmen entgegengewirkt werden. Die Analyse wird durch externe Experten oder spezialisierte Dienstleister unterstützt."
                  },
                  {
                    "statement-id": "INF.1.A25-m5",
                    "uuid": "665a957e-e789-4f37-bcab-da0152bdbba9",
                    "description": "Die Standortrisikoanalyse ist ein kontinuierlicher Prozess, der auch für bestehende Standorte regelmäßig wiederholt wird, um veränderte Umfeldbedingungen (z.B. durch neue Bauprojekte in der Nachbarschaft oder klimatische Veränderungen) zu erkennen. Die Ergebnisse fließen direkt in das Business Continuity Management (BCM) und die Anpassung der Sicherheitsmaßnahmen ein."
                  }
                ]
              },
              {
                "uuid": "409317ff-8c69-4a5d-9655-179c32256b6d",
                "control-id": "GEB.1.5",
                "description": "Implementation for GEB.1.5 based on BSI INF.1.A15",
                "statements": [
                  {
                    "statement-id": "INF.1.A15-m1",
                    "uuid": "107bd0f9-0c0c-4e34-ab37-b18f90c5945e",
                    "description": "Es sind keine oder nur sehr alte, unvollständige Lagepläne der Versorgungsleitungen (Strom, Wasser, Gas) vorhanden."
                  },
                  {
                    "statement-id": "INF.1.A15-m2",
                    "uuid": "f680cc46-3f7f-4941-8fb4-db2207c42ced",
                    "description": "Es existieren Lagepläne vom Zeitpunkt der Errichtung des Gebäudes. Nachträgliche Änderungen wurden jedoch nicht in die Pläne eingetragen."
                  },
                  {
                    "statement-id": "INF.1.A15-m3",
                    "uuid": "847e7774-fec0-455c-92c2-3c7187fadadf",
                    "description": "Es SOLLTEN aktuelle Lagepläne aller Versorgungsleitungen existieren. Es SOLLTE geregelt sein, wer die Lagepläne aller Versorgungsleitungen führt und aktualisiert. Die Pläne SOLLTEN so aufbewahrt werden, dass sie im Bedarfsfall schnell verfügbar sind."
                  },
                  {
                    "statement-id": "INF.1.A15-m4",
                    "uuid": "68c882be-7f09-428b-b9f2-0909a2f214fc",
                    "description": "Die Pläne SOLLTEN so aufbewahrt werden, dass ausschließlich berechtigte Personen darauf zugreifen können. Die Pläne sind versioniert und Änderungen werden nachvollziehbar dokumentiert."
                  },
                  {
                    "statement-id": "INF.1.A15-m5",
                    "uuid": "b5fda0cc-5e84-461b-a7c0-6b18ea59fedf",
                    "description": "Die Lagepläne sind Teil eines digitalen Zwillings (Building Information Model, BIM) des Gebäudes. Im Notfall können Einsatzkräfte über ein mobiles Endgerät auf die Pläne zugreifen und sich die Lage von Absperrventilen oder Schaltern direkt vor Ort anzeigen lassen."
                  }
                ]
              },
              {
                "uuid": "2d8120de-2fde-497f-9ba4-4ac921d19d7f",
                "control-id": "GEB.10.1.1",
                "description": "Implementation for GEB.10.1.1 based on BSI INF.1.A2",
                "statements": [
                  {
                    "statement-id": "INF.1.A2-m1",
                    "uuid": "2bda8bbe-ca6b-4938-967c-98190979b9f5",
                    "description": "Die Aufteilung der Stromkreise folgt keiner klaren Logik. Kritische und unkritische Verbraucher sind oft am selben Stromkreis angeschlossen. Eine Überprüfung der Auslegung findet nicht statt."
                  },
                  {
                    "statement-id": "INF.1.A2-m2",
                    "uuid": "4f088a80-d443-4c2f-907a-ea15ac6b4e56",
                    "description": "Die Stromkreise sind bei der ursprünglichen Installation grundlegend nach Bereichen (z.B. Büros, Serverraum) aufgeteilt worden. Eine regelmäßige Überprüfung oder Anpassung an neue Bedürfnisse erfolgt jedoch nicht."
                  },
                  {
                    "statement-id": "INF.1.A2-m3",
                    "uuid": "2496d5ab-d6be-456b-85b6-b536b92698a6",
                    "description": "Es MUSS regelmäßig überprüft werden, ob die Absicherung und Auslegung der Stromkreise noch den tatsächlichen Bedürfnissen genügen."
                  },
                  {
                    "statement-id": "INF.1.A2-m4",
                    "uuid": "a0dbe43c-5751-47ca-800b-7c9c9ffdf813",
                    "description": "Die Stromkreise sind logisch nach Schutzbedarf und Funktion getrennt (z.B. separate Kreise für IT, allgemeine Verbraucher, Sicherheitstechnik). Die Auslegung der Stromkreise ist detailliert dokumentiert und die Pläne sind stets aktuell."
                  },
                  {
                    "statement-id": "INF.1.A2-m5",
                    "uuid": "ae6b70f9-cfee-4a07-abad-5f4ad3a64d76",
                    "description": "Die Auslastung und der Zustand der Stromkreise werden durch ein intelligentes Power-Monitoring-System kontinuierlich überwacht. Abweichungen vom Normalzustand und sich anbahnende Überlastungen werden automatisch gemeldet, um proaktive Wartung zu ermöglichen."
                  }
                ]
              },
              {
                "uuid": "9a240b7f-7733-4167-a8ed-da057b2d3a03",
                "control-id": "GEB.11.1",
                "description": "Implementation for GEB.11.1 based on BSI INF.1.A3",
                "statements": [
                  {
                    "statement-id": "INF.1.A3-m1",
                    "uuid": "3ddc2d43-2d3c-4605-ab2e-011c19694afa",
                    "description": "Brandschutzvorschriften werden nur reaktiv umgesetzt, oft erst nach Beanstandungen durch Behörden. Fluchtwege sind gelegentlich durch abgestellte Gegenstände blockiert."
                  },
                  {
                    "statement-id": "INF.1.A3-m2",
                    "uuid": "a826bc02-e1a8-41db-bb11-42a592f18736",
                    "description": "Die grundlegenden Brandschutzvorschriften werden eingehalten. Fluchtwege sind ausgeschildert und werden in der Regel freigehalten. Es gibt eine Person, die neben anderen Aufgaben auch für den Brandschutz zuständig ist."
                  },
                  {
                    "statement-id": "INF.1.A3-m3",
                    "uuid": "908a1599-4fd4-44d6-83a0-e8b01781db4e",
                    "description": "Die bestehenden Brandschutzvorschriften sowie die Auflagen der Bauaufsicht MÜSSEN eingehalten werden. Die Fluchtwege MÜSSEN vorschriftsmäßig ausgeschildert und freigehalten werden. Es MUSS regelmäßig kontrolliert werden, dass die Fluchtwege benutzbar und frei von Hindernissen sind. Unnötige Brandlasten MÜSSEN vermieden werden. Es MUSS eine Brandschutzbeauftragte oder einen Brandschutzbeauftragten oder eine mit dem Aufgabengebiet betraute Person geben. Diese Person MUSS geeignet geschult sein."
                  },
                  {
                    "statement-id": "INF.1.A3-m4",
                    "uuid": "040e6374-122e-4b90-9022-fd5667fe5b46",
                    "description": "Bei der Brandschutzplanung SOLLTE die örtliche Feuerwehr hinzugezogen werden, um sicherzustellen, dass das Gebäude in einer Gefahrensituation schnell geräumt werden kann. Alle Brandschutzmaßnahmen werden in einem Brandschutzkonzept dokumentiert, das regelmäßig überprüft wird."
                  },
                  {
                    "statement-id": "INF.1.A3-m5",
                    "uuid": "4be20f74-f21f-4dab-b91c-cb60f066ffa1",
                    "description": "Die Einhaltung der Brandschutzvorschriften wird durch technische Systeme, wie z.B. an die Gebäudeleittechnik gekoppelte Kamerasysteme zur Überwachung der Fluchtwege, unterstützt. Abweichungen, wie blockierte Türen, lösen automatisch einen Alarm beim Sicherheitsdienst aus. Regelmäßige, unangekündigte Evakuierungsübungen werden durchgeführt und deren Ergebnisse zur Optimierung der Pläne genutzt."
                  }
                ]
              },
              {
                "uuid": "2a1e0ffc-432b-4aff-bf57-c802879a8059",
                "control-id": "GEB.11.1.5",
                "description": "Implementation for GEB.11.1.5 based on BSI INF.1.A8",
                "statements": [
                  {
                    "statement-id": "INF.1.A8-m1",
                    "uuid": "89f7a2f5-1bd2-4d85-9c5c-fe3f28215e3d",
                    "description": "Es gibt kein explizites Rauchverbot in der Nähe von IT-Systemen oder Archiven. Das Rauchen wird geduldet."
                  },
                  {
                    "statement-id": "INF.1.A8-m2",
                    "uuid": "56c27810-fd6a-4336-a0ab-1d0eea5deb5b",
                    "description": "Es gibt ein allgemeines Rauchverbot im Gebäude, jedoch ohne spezifischen Fokus auf IT-Bereiche. Ausgewiesene Raucherzonen sind vorhanden, aber deren Lage wird nicht unter Sicherheitsaspekten bewertet."
                  },
                  {
                    "statement-id": "INF.1.A8-m3",
                    "uuid": "a5b2a777-f00b-4154-8a0d-39eb4a30da5b",
                    "description": "Für Räume mit IT oder Datenträgern, in denen Brände oder Verschmutzungen zu hohen Schäden führen können, wie Serverräume, Datenträger- oder Belegarchive, MUSS ein Rauchverbot erlassen werden. Es MUSS regelmäßig kontrolliert werden, dass bei der Einrichtung oder Duldung von Raucherzonen der Zutrittsschutz nicht umgangen wird."
                  },
                  {
                    "statement-id": "INF.1.A8-m4",
                    "uuid": "4db83a3f-af8d-4ea3-b677-ce95929c2558",
                    "description": "Das Rauchverbot erstreckt sich auf das gesamte Gebäude und gilt auch für E-Zigaretten. Raucherzonen sind ausschließlich außerhalb des Gebäudes an definierten Orten eingerichtet, die mit sicheren Aschenbechern ausgestattet sind."
                  },
                  {
                    "statement-id": "INF.1.A8-m5",
                    "uuid": "c9e6307a-006d-4934-9d7d-89474c279427",
                    "description": "In Hochsicherheitsbereichen (z.B. Rechenzentren) sind Rauchdetektoren installiert, die auch auf die Partikel von E-Zigaretten reagieren und bei einer Verletzung des Rauchverbots einen stillen Alarm an den Sicherheitsdienst auslösen."
                  }
                ]
              },
              {
                "uuid": "1c043786-3647-4bdc-b374-a3d9e385cf29",
                "control-id": "GEB.11.1.6",
                "description": "Implementation for GEB.11.1.6 based on BSI INF.1.A4",
                "statements": [
                  {
                    "statement-id": "INF.1.A4-m1",
                    "uuid": "9822e1f0-3362-4b41-84d8-d82964d9d2e2",
                    "description": "Es sind nur einzelne, batteriebetriebene Rauchmelder in wenigen Räumen installiert, die nicht den gesetzlichen Mindestanforderungen entsprechen."
                  },
                  {
                    "statement-id": "INF.1.A4-m2",
                    "uuid": "803e1667-0b62-4e9f-9c47-a690fb3c46f5",
                    "description": "Gebäude sind entsprechend der gesetzlichen Mindestanforderungen mit Rauchmeldern ausgestattet. Diese alarmieren jedoch nur lokal und sind nicht vernetzt."
                  },
                  {
                    "statement-id": "INF.1.A4-m3",
                    "uuid": "9f465175-b2d3-44c1-b30c-0778e652edd6",
                    "description": "Gebäude MÜSSEN entsprechend der Auflagen in der Baugenehmigung und dem Brandschutzkonzept folgend mit einer ausreichenden Anzahl von Rauchmeldern ausgestattet sein. Ist eine lokale Alarmierung am Ort des Melders nicht ausreichend, MÜSSEN alle Melder auf eine Brandmeldezentrale (BMZ) aufgeschaltet werden. Bei Rauchdetektion MUSS eine Alarmierung im Gebäude ausgelöst werden. Es MUSS sichergestellt sein, dass alle im Gebäude anwesenden Personen diese wahrnehmen können. Die Funktionsfähigkeit aller Rauchmelder sowie aller sonstigen Komponenten einer Brandmeldeanlage (BMA) MUSS regelmäßig überprüft werden."
                  },
                  {
                    "statement-id": "INF.1.A4-m4",
                    "uuid": "b81c8aab-1442-47dd-bcd7-5433439ceaff",
                    "description": "Die Brandmeldeanlage ist bei einer ständig besetzten Stelle (z.B. Pforte, Sicherheitsdienst) oder direkt bei der Feuerwehr aufgeschaltet. In schutzbedürftigen Bereichen wie Serverräumen werden anstelle von einfachen Rauchmeldern Rauchansaugsysteme (RAS) zur Frühesterkennung eingesetzt."
                  },
                  {
                    "statement-id": "INF.1.A4-m5",
                    "uuid": "77fed8fa-1a1e-4aa5-a34b-bd4ebd63d074",
                    "description": "Die Brandmeldeanlage ist vollständig in die Gebäudeleittechnik integriert. Im Alarmfall werden automatisch Maßnahmen eingeleitet, wie das Abschalten der Lüftung, das Öffnen von Rauch- und Wärmeabzugsanlagen (RWA) und das Ansteuern der Fluchtwegsteuerung, um eine sichere Evakuierung zu gewährleisten. Die Meldertypen sind spezifisch auf die Umgebungsrisiken (z.B. thermische Melder in Küchen, Multisensormelder in IT-Räumen) ausgelegt."
                  }
                ]
              },
              {
                "uuid": "08dbe45a-aefe-42d6-9097-ddf1489b4ad0",
                "control-id": "GEB.11.1.8",
                "description": "Implementation for GEB.11.1.8 based on BSI INF.1.A18",
                "statements": [
                  {
                    "statement-id": "INF.1.A18-m1",
                    "uuid": "b8a1df60-3abe-4cce-8c78-79252e593801",
                    "description": "Brandschutzbegehungen finden nicht statt, oder nur reaktiv nach einem Vorfall oder einer behördlichen Anordnung."
                  },
                  {
                    "statement-id": "INF.1.A18-m2",
                    "uuid": "f5411a43-338b-4bb1-8f74-5d6bc737fa8b",
                    "description": "Brandschutzbegehungen finden unregelmäßig und ohne feste Checkliste statt. Festgestellte Mängel werden nicht systematisch nachverfolgt."
                  },
                  {
                    "statement-id": "INF.1.A18-m3",
                    "uuid": "c50890d2-1061-4552-add2-ec91f42fa10f",
                    "description": "Brandschutzbegehungen SOLLTEN regelmäßig, d. h. mindestens ein- bis zweimal im Jahr, stattfinden. Bei Brandschutzbegehungen festgestellte Mängel SOLLTEN unverzüglich behoben werden."
                  },
                  {
                    "statement-id": "INF.1.A18-m4",
                    "uuid": "b6ec8dc5-f609-4542-b21d-28fac0225a13",
                    "description": "An den Brandschutzbegehungen nehmen neben dem Brandschutzbeauftragten auch Vertreter der IT, der Verwaltung und des Betriebsrats teil. Die Ergebnisse werden der Geschäftsleitung berichtet."
                  },
                  {
                    "statement-id": "INF.1.A18-m5",
                    "uuid": "d1009140-f6ac-43c7-af78-b22b58daf3eb",
                    "description": "Die Brandschutzbegehungen werden mit einer mobilen App durchgeführt, die eine geführte Prüfung anhand von Checklisten ermöglicht und die Ergebnisse (inkl. Fotos) direkt in ein zentrales Mängelmanagement-System überträgt. Die Behebung der Mängel wird automatisch nachverfolgt und eskalieret."
                  }
                ]
              },
              {
                "uuid": "b14ceeee-7eec-4dfa-8de5-02492b1beaf9",
                "control-id": "GEB.11.2",
                "description": "Implementation for GEB.11.2 based on BSI INF.1.A24",
                "statements": [
                  {
                    "statement-id": "INF.1.A24-m1",
                    "uuid": "a6c81703-5a39-4abe-8701-a6213beded3e",
                    "description": "Es gibt keine Maßnahmen zur selbsttätigen Entwässerung in von Wasser gefährdeten Bereichen."
                  },
                  {
                    "statement-id": "INF.1.A24-m2",
                    "uuid": "96a5bf75-fd7b-4539-8b00-f6ffac93ea1d",
                    "description": "Es sind passive Entwässerungseinrichtungen wie Bodenabläufe vorhanden. Aktive Systeme wie Pumpen fehlen jedoch oder werden nicht gewartet."
                  },
                  {
                    "statement-id": "INF.1.A24-m3",
                    "uuid": "942964a7-a2b2-42e0-801b-a332fd182a61",
                    "description": "Alle von Wasser gefährdeten Bereiche SOLLTEN mit einer selbsttätigen Entwässerung ausgestattet sein. Es SOLLTE regelmäßig geprüft werden, ob die aktiven und passiven Entwässerungseinrichtungen noch funktionieren."
                  },
                  {
                    "statement-id": "INF.1.A24-m4",
                    "uuid": "0e3d52e9-edc6-4aa8-a96a-97f0a13d1855",
                    "description": "Zusätzlich zur Entwässerung sind in kritischen Bereichen Wassermelder installiert, die bei einem Wassereinbruch frühzeitig einen Alarm auslösen."
                  },
                  {
                    "statement-id": "INF.1.A24-m5",
                    "uuid": "12a21613-0bd0-4a48-83fa-a9be6b1ca4f8",
                    "description": "Das System ist vollständig automatisiert. Bei Detektion von Wasser wird nicht nur ein Alarm ausgelöst, sondern es werden auch automatisch Gegenmaßnahmen eingeleitet, wie das Schließen von Hauptwasserabsperrventilen und das Starten von Pumpen. Die Pumpen sind an die Notstromversorgung angeschlossen."
                  }
                ]
              },
              {
                "uuid": "67e33f6c-b65f-44ff-a509-5dc92ac570d3",
                "control-id": "GEB.11.3",
                "description": "Implementation for GEB.11.3 based on BSI INF.1.A14",
                "statements": [
                  {
                    "statement-id": "INF.1.A14-m1",
                    "uuid": "b7664844-5f74-46d5-b67a-c9e54e0ac16a",
                    "description": "Es sind keine oder nur rudimentäre Blitzschutzmaßnahmen vorhanden. Ein Blitzschutzkonzept fehlt."
                  },
                  {
                    "statement-id": "INF.1.A14-m2",
                    "uuid": "da10f0c4-2504-45e5-af90-fd7cbd9628da",
                    "description": "Ein äußerer Blitzschutz (Fangeinrichtungen, Ableiter) ist vorhanden. Ein innerer Blitzschutz ist jedoch nur lückenhaft oder gar nicht umgesetzt."
                  },
                  {
                    "statement-id": "INF.1.A14-m3",
                    "uuid": "30381218-b979-4465-bd0b-e48715a04240",
                    "description": "Es SOLLTE eine Blitzschutzanlage nach geltender Norm installiert sein. Es SOLLTE ein umfassendes Blitz- und Überspannungsschutzkonzept vorhanden sein. Die Blitzschutzanlage SOLLTE regelmäßig geprüft und gewartet werden."
                  },
                  {
                    "statement-id": "INF.1.A14-m4",
                    "uuid": "a0a9cd3d-8280-4088-8f30-1a91c5b368ed",
                    "description": "Die Fangeinrichtungen bei Gebäuden mit umfangreicher IT-Ausstattung SOLLTEN mindestens der Schutzklasse II gemäß DIN EN 62305 Blitzschutz entsprechen. Alle eingeführten metallischen Leitungen (Strom, Daten, Wasser) sind in den Potentialausgleich einbezogen."
                  },
                  {
                    "statement-id": "INF.1.A14-m5",
                    "uuid": "cb0ac0a8-1fc6-41cd-a0b8-dd81bcafbbc9",
                    "description": "Der Zustand der Blitz- und Überspannungsschutzkomponenten wird kontinuierlich überwacht. Sensoren melden das Auslösen oder die Alterung von Überspannungsschutzgeräten (SPDs) an ein zentrales Managementsystem, um einen sofortigen Austausch zu ermöglichen."
                  }
                ]
              },
              {
                "uuid": "e48885ec-ecb8-41a1-96b1-182e0246575c",
                "control-id": "GEB.2.1",
                "description": "Implementation for GEB.2.1 based on BSI INF.1.A35",
                "statements": [
                  {
                    "statement-id": "INF.1.A35-m1",
                    "uuid": "86eb86f2-d94c-4aea-bafb-3710ba26a8e7",
                    "description": "Es gibt keinen Perimeterschutz. Die Grundstücksgrenze ist nicht gesichert."
                  },
                  {
                    "statement-id": "INF.1.A35-m2",
                    "uuid": "1d20b67a-814c-4b51-878b-666aa0e9ff61",
                    "description": "Eine einfache Umfriedung (z.B. ein niedriger Zaun oder eine Hecke) ist vorhanden, um die Grundstücksgrenze zu markieren. Sie bietet jedoch keinen nennenswerten Schutz gegen ein Überwinden."
                  },
                  {
                    "statement-id": "INF.1.A35-m3",
                    "uuid": "7600e680-091c-4144-8e00-400e91a220b8",
                    "description": "Abhängig vom Schutzbedarf des Gebäudes und abhängig vom Gelände SOLLTE dieses über einen Perimeterschutz verfügen. Hierbei SOLLTEN mindestens eine äußere Umschließung oder Umfriedung sowie Sicherungsmaßnahmen gegen unbeabsichtigtes und beabsichtigtes gewaltloses Überwinden der Grundstücksgrenze betrachtet werden."
                  },
                  {
                    "statement-id": "INF.1.A35-m4",
                    "uuid": "e7629439-d342-411d-8b62-ed3a11ee0434",
                    "description": "Es SOLLTEN Maßnahmen zur Erschwerung des beabsichtigten gewaltsamen Überwindens der Grundstücksgrenze sowie Freigelände-Sicherungsmaßnahmen (z.B. Personen- und Fahrzeugdetektion, Videoüberwachung) betrachtet und umgesetzt werden."
                  },
                  {
                    "statement-id": "INF.1.A35-m5",
                    "uuid": "217b161f-b0b7-4875-b93a-6348e5ecf55d",
                    "description": "Der Perimeterschutz ist ein mehrstufiges, intelligentes System. Eine Kombination aus verschiedenen Detektionstechnologien (z.B. Zaun-Detektionssystem, Infrarotlichtschranken, Videoanalyse, Bodensensoren) sorgt für eine hochzuverlässige Detektion mit geringer Falschalarmrate. Im Alarmfall werden automatisch Gegenmaßnahmen wie das Einschalten von Flutlicht und die Aufschaltung von Lautsprecherdurchsagen ausgelöst. Alle Ereignisse werden zur Beweissicherung aufgezeichnet."
                  }
                ]
              },
              {
                "uuid": "668574d8-9f90-404c-a97c-c904804dc322",
                "control-id": "GEB.2.3",
                "description": "Implementation for GEB.2.3 based on BSI INF.1.A16",
                "statements": [
                  {
                    "statement-id": "INF.1.A16-m1",
                    "uuid": "39497b28-5532-42db-83a1-8d04ead8d89d",
                    "description": "An Türen von schutzwürdigen Bereichen hängen große Schilder, die deren Funktion verraten (z.B. 'Serverraum', 'Archiv')."
                  },
                  {
                    "statement-id": "INF.1.A16-m2",
                    "uuid": "a19cb4cd-155c-4aa0-b621-2cd93f938e50",
                    "description": "Es wird versucht, direkte Lagehinweise zu vermeiden, aber die Funktion der Räume ist durch andere Merkmale (z.B. laute Lüftergeräusche, besondere Türen) leicht zu erraten."
                  },
                  {
                    "statement-id": "INF.1.A16-m3",
                    "uuid": "64a9cb22-5b69-419d-bb38-6330f80f08df",
                    "description": "Lagehinweise auf schutzwürdige Bereiche SOLLTEN vermieden werden. Schutzwürdige Gebäudebereiche SOLLTEN von außen nicht leicht einsehbar sein."
                  },
                  {
                    "statement-id": "INF.1.A16-m4",
                    "uuid": "2d766b0c-c51d-466e-b98f-992f143e38b3",
                    "description": "Bei der Planung von Gebäuden oder Umbauten wird aktiv darauf geachtet, schutzwürdige Bereiche ohne Außenfenster und nicht an öffentlich zugänglichen Fluren zu positionieren."
                  },
                  {
                    "statement-id": "INF.1.A16-m5",
                    "uuid": "d25aedea-db41-46b3-8135-f8d327b3c49e",
                    "description": "Schutzwürdige Bereiche sind baulich so gestaltet, dass sie sich nicht von normalen Büroräumen unterscheiden. Es werden Maßnahmen zur Schalldämmung ergriffen, um eine akustische Ortung (z.B. durch Lüftergeräusche) zu verhindern."
                  }
                ]
              },
              {
                "uuid": "d3b7a182-5b0d-417d-a272-095de1f9cb50",
                "control-id": "GEB.3.2",
                "description": "Implementation for GEB.3.2 based on BSI INF.1.A26",
                "statements": [
                  {
                    "statement-id": "INF.1.A26-m1",
                    "uuid": "350c039f-7f56-4f64-92fa-4389917e8153",
                    "description": "Es gibt keinen Empfang oder Sicherheitsdienst. Besucher können das Gebäude unkontrolliert betreten."
                  },
                  {
                    "statement-id": "INF.1.A26-m2",
                    "uuid": "4ae2684b-9d2a-4219-a703-6548b540efd4",
                    "description": "Es gibt einen Empfang, dessen Hauptaufgabe jedoch nicht die Sicherheitskontrolle ist. Die Aufgaben sind nicht klar dokumentiert. Besucher werden nicht immer begleitet."
                  },
                  {
                    "statement-id": "INF.1.A26-m3",
                    "uuid": "b0a3cc2e-4199-4623-ac63-87164952a76f",
                    "description": "Die Aufgaben des Pforten- oder Sicherheitsdienstes SOLLTEN klar dokumentiert sein. Der Pfortendienst SOLLTE alle Personenbewegungen an der Pforte und an allen anderen Eingängen beobachten und, je nach Sicherheitskonzept, kontrollieren. Besuchende SOLLTEN zu den Besuchten begleitet oder an der Pforte abgeholt werden."
                  },
                  {
                    "statement-id": "INF.1.A26-m4",
                    "uuid": "d0d6517a-dc24-4a72-ba54-b7ff4d62445c",
                    "description": "Alle Mitarbeitenden und Besuchenden SOLLTEN sich bei dem Pfortendienst ausweisen können. Der Pfortendienst SOLLTE rechtzeitig darüber informiert werden, wenn sich Zutrittsberechtigungen ändern."
                  },
                  {
                    "statement-id": "INF.1.A26-m5",
                    "uuid": "fd68029d-b88e-47d4-b4bf-73eb65e58b93",
                    "description": "Ein digitales Besuchermanagement-System wird eingesetzt. Besucher müssen sich vorab online registrieren und werden nach Genehmigung durch den Gastgeber automatisch im System freigeschaltet. Der Pfortendienst überwacht die Monitore der Gefahrenmeldeanlagen (EMA, BMA) und der Videoüberwachung und leitet im Alarmfall definierte Maßnahmen ein."
                  }
                ]
              },
              {
                "uuid": "f7714f1b-8264-4b87-b130-33fbdc2bad59",
                "control-id": "GEB.3.3",
                "description": "Implementation for GEB.3.3 based on BSI INF.1.A7",
                "statements": [
                  {
                    "statement-id": "INF.1.A7-m1",
                    "uuid": "a7697f7e-032c-4a2a-a878-70b5e26150ab",
                    "description": "Es gibt keine formale Zutrittsregelung. Türen zu schutzbedürftigen Bereichen sind oft unverschlossen. Fremde Personen können sich weitgehend unkontrolliert im Gebäude bewegen."
                  },
                  {
                    "statement-id": "INF.1.A7-m2",
                    "uuid": "f81fd337-11dc-45d9-babe-28d32c604a73",
                    "description": "Es existiert eine einfache Zutrittsregelung, die besagt, dass Türen zu schutzbedürftigen Bereichen abgeschlossen sein müssen. Eine differenzierte Vergabe von Zutrittsberechtigungen gibt es nicht."
                  },
                  {
                    "statement-id": "INF.1.A7-m3",
                    "uuid": "c081ed85-5f3a-44e6-bc06-6d47631d29a5",
                    "description": "Der Zutritt zu schutzbedürftigen Gebäudeteilen und Räumen MUSS geregelt und kontrolliert werden. Es SOLLTE ein Konzept für die Zutrittskontrolle existieren. Die Zahl der zutrittsberechtigten Personen SOLLTE für jeden Bereich auf ein Mindestmaß reduziert werden. Alle erteilten Zutrittsberechtigungen SOLLTEN dokumentiert werden."
                  },
                  {
                    "statement-id": "INF.1.A7-m4",
                    "uuid": "460417cb-a973-4a80-b79c-0d4adbf36891",
                    "description": "Weitere Personen DÜRFEN erst Zutritt erhalten, nachdem geprüft wurde, ob dies notwendig ist. Die Zutrittskontrollmaßnahmen MÜSSEN regelmäßig auf ihre Wirksamkeit überprüft werden. Zutrittskontrollen SOLLTEN auch während Umzügen soweit wie möglich vorhanden sein."
                  },
                  {
                    "statement-id": "INF.1.A7-m5",
                    "uuid": "0dec4d52-4dfe-41b5-8aa5-bd14b7805d23",
                    "description": "Es ist ein elektronisches Zutrittskontrollsystem (ZKS) im Einsatz, das alle Zutrittsversuche (berechtigt und unberechtigt) protokolliert. Die Protokolle werden automatisiert auf Anomalien (z.B. Zutrittsversuche außerhalb der Geschäftszeiten) überwacht. In Hochsicherheitsbereichen wird eine Zwei-Faktor-Authentisierung (z.B. Karte und PIN oder Biometrie) für den Zutritt gefordert."
                  }
                ]
              },
              {
                "uuid": "40d4bdd1-cb76-4c68-98b5-256f63310f9b",
                "control-id": "GEB.3.5",
                "description": "Implementation for GEB.3.5 based on BSI INF.1.A22",
                "statements": [
                  {
                    "statement-id": "INF.1.A22-m1",
                    "uuid": "3a07a669-e082-4d5d-8c16-70c4edbf769d",
                    "description": "Türen und Fenster haben keine zertifizierte Widerstandsklasse und bieten nur minimalen Schutz gegen Einbruch."
                  },
                  {
                    "statement-id": "INF.1.A22-m2",
                    "uuid": "b7a5bf72-098a-4cca-b74b-62d52053dab7",
                    "description": "An einigen besonders kritischen Stellen, wie der Haupteingangstür, wurden Bauteile mit einer grundlegenden Widerstandsklasse (z.B. RC 2) eingesetzt. Ein durchgängiges Konzept fehlt."
                  },
                  {
                    "statement-id": "INF.1.A22-m3",
                    "uuid": "846b8207-a259-4d3f-9abf-e14ff99085b7",
                    "description": "Türen und Fenster SOLLTEN anhand der Schutzziele des zu sichernden Bereichs und des Schutzbedarfs der Institution in der passenden Klassifizierung nach den einschlägigen Normen ausgewählt werden. Alle raumumschließenden Sicherungsmaßnahmen durch Fenster, Türen und Wände SOLLTEN in Bezug auf Einbruch, Brand und Rauch gleichwertig und angemessen sein."
                  },
                  {
                    "statement-id": "INF.1.A22-m4",
                    "uuid": "beeb7ca7-8eac-43f5-8837-cd14a7d25657",
                    "description": "Es SOLLTE regelmäßig überprüft werden, dass die Sicherheitstüren und -fenster funktionstüchtig sind. Dies beinhaltet die Prüfung der Schlösser, Schließer und der Dichtungen."
                  },
                  {
                    "statement-id": "INF.1.A22-m5",
                    "uuid": "dcf978a9-e1cf-47a5-a704-450ca42cb4a0",
                    "description": "Sicherheitstüren sind mit Sensoren ausgestattet, die den Zustand (offen, geschlossen, verriegelt, blockiert) an eine zentrale Managementkonsole (EMA oder Gebäudeleittechnik) melden. Jede Abweichung vom Soll-Zustand (z.B. eine zu lange offenstehende Brandschutztür) löst einen Alarm aus."
                  }
                ]
              },
              {
                "uuid": "22101b65-e340-43f3-acca-eefdb1701a35",
                "control-id": "GEB.3.6",
                "description": "Implementation for GEB.3.6 based on BSI INF.1.A27",
                "statements": [
                  {
                    "statement-id": "INF.1.A27-m1",
                    "uuid": "6bd800b5-59d9-43cd-a2ef-07d217bf3c81",
                    "description": "Es gibt keine spezifischen Maßnahmen zum Einbruchschutz, außer den standardmäßig verbauten Schlössern an Türen und Fenstern."
                  },
                  {
                    "statement-id": "INF.1.A27-m2",
                    "uuid": "60bc1d7c-c52c-42e2-b69f-4b9f7dd14fd2",
                    "description": "Es wurden punktuell Maßnahmen zum Einbruchschutz umgesetzt, z.B. an der Haupteingangstür. Ein durchgängiges Konzept für das gesamte Gebäude fehlt jedoch."
                  },
                  {
                    "statement-id": "INF.1.A27-m3",
                    "uuid": "428c5568-3573-4134-a2bc-2bd6b406de81",
                    "description": "Es SOLLTEN ausreichende und den örtlichen Gegebenheiten angepasste Maßnahmen zum Einbruchschutz umgesetzt werden. Bei der Planung, der Umsetzung und im Betrieb SOLLTE beim Einbruchschutz darauf geachtet werden, dass er gleichwertig und durchgängig ist."
                  },
                  {
                    "statement-id": "INF.1.A27-m4",
                    "uuid": "21978698-5e34-4135-a548-51542bc50d03",
                    "description": "Der Einbruchschutz SOLLTE regelmäßig durch eine fachkundige Person begutachtet werden. Die Regelungen zum Einbruchschutz SOLLTEN den Mitarbeitenden bekannt sein. Zusätzlich zu mechanischen Sicherungen ist eine Einbruchmeldeanlage (EMA) installiert."
                  },
                  {
                    "statement-id": "INF.1.A27-m5",
                    "uuid": "4e4bbf42-f23c-4a82-b9a4-e95e8beebb95",
                    "description": "Ein integriertes Sicherheitskonzept kombiniert mechanische Sicherungen (z.B. RC 3), eine VdS-zertifizierte Einbruchmeldeanlage mit Aufschaltung auf einen Wachdienst und Videoüberwachung an kritischen Punkten. Einbruchsversuche werden nicht nur gemeldet, sondern auch videotechnisch aufgezeichnet."
                  }
                ]
              },
              {
                "uuid": "f346ab80-ebb4-475b-b137-94041cb3be57",
                "control-id": "GEB.5.1",
                "description": "Implementation for GEB.5.1 based on BSI INF.1.A23",
                "statements": [
                  {
                    "statement-id": "INF.1.A23-m1",
                    "uuid": "5ca394bb-eb8e-4b53-a2f7-748c9ad5230e",
                    "description": "Es gibt keine definierte Zonenstruktur. Räume mit hohem und niedrigem Schutzbedarf sind vermischt."
                  },
                  {
                    "statement-id": "INF.1.A23-m2",
                    "uuid": "b9a15707-7d36-4062-b97a-2951798b9a4f",
                    "description": "Es gibt eine grobe Einteilung in einen öffentlichen und einen nicht-öffentlichen Bereich. Innerhalb des nicht-öffentlichen Bereichs gibt es jedoch keine weitere Unterteilung."
                  },
                  {
                    "statement-id": "INF.1.A23-m3",
                    "uuid": "2386cdfb-c02c-41b6-8b75-f72062becbd8",
                    "description": "Räume ähnlichen Schutzbedarfs SOLLTEN in Zonen zusammengefasst werden, um vergleichbare Risiken einheitlich behandeln und Kosten für erforderliche Sicherheitsmaßnahmen reduzieren zu können."
                  },
                  {
                    "statement-id": "INF.1.A23-m4",
                    "uuid": "189f6c9e-8079-4c97-9848-48da41704ce5",
                    "description": "Das Zonenkonzept wird bereits bei der Planung von Neu- oder Umbauten berücksichtigt, um eine optimale räumliche Anordnung zu erreichen. Die Übergänge zwischen den Zonen sind als kontrollierte Sicherheitsschleusen ausgebildet."
                  },
                  {
                    "statement-id": "INF.1.A23-m5",
                    "uuid": "b228c899-4a9c-40fb-a9f7-e08354fa09a7",
                    "description": "Das Zonenkonzept ist dynamisch und an die jeweiligen Risiken und Prozesse gekoppelt. Zutrittsberechtigungen für Zonen sind nicht nur an Personen, sondern auch an bestimmte Zeiten und Bedingungen (z.B. Freigabe durch eine zweite Person) geknüpft. Die Einhaltung der Zonenregeln wird automatisiert überwacht."
                  }
                ]
              },
              {
                "uuid": "36de4be4-4ca1-4be9-aec1-27091cca840a",
                "control-id": "GEB.5.2",
                "description": "Implementation for GEB.5.2 based on BSI INF.1.A13",
                "statements": [
                  {
                    "statement-id": "INF.1.A13-m1",
                    "uuid": "74dfd9e7-0e36-4ae7-8751-950401eabe91",
                    "description": "Verteilerschränke (Strom, Netzwerk) sind oft unverschlossen und für jedermann zugänglich. Es gibt keine Regelung für den Zutritt."
                  },
                  {
                    "statement-id": "INF.1.A13-m2",
                    "uuid": "09f03bb1-92b8-4de7-8943-9462ac30e0bf",
                    "description": "Die meisten Verteilerschränke sind abgeschlossen. Der Kreis der Personen mit Schlüssel ist jedoch sehr groß und nicht klar definiert oder dokumentiert."
                  },
                  {
                    "statement-id": "INF.1.A13-m3",
                    "uuid": "05296b92-4b40-4027-be62-971395af918b",
                    "description": "Der Zutritt zu den Verteilern aller Versorgungseinrichtungen in einem Gebäude SOLLTE auf einen engen Kreis von Berechtigten beschränkt sein. Der Zutritt SOLLTE im Bedarfsfall schnell möglich sein."
                  },
                  {
                    "statement-id": "INF.1.A13-m4",
                    "uuid": "634cec03-abab-4608-9102-dffb5ed60706",
                    "description": "Der Zutritt zu Verteilern wird protokolliert. Bei elektronischen Schließsystemen erfolgt dies automatisch, bei mechanischen Schlüsseln durch Eintrag in ein Logbuch."
                  },
                  {
                    "statement-id": "INF.1.A13-m5",
                    "uuid": "bd604c42-940f-43ab-8d88-45e25212b494",
                    "description": "Der Zutritt zu kritischen Verteilern wird zusätzlich durch Videoüberwachung überwacht. Unautorisierte Öffnungsversuche der Schränke (z.B. durch Aufbohren) werden durch Sensoren erkannt und lösen einen Alarm aus."
                  }
                ]
              },
              {
                "uuid": "efd11c44-66a5-481c-b91e-fa59441ea835",
                "control-id": "GEB.8.1",
                "description": "Implementation for GEB.8.1 based on BSI INF.1.A12",
                "statements": [
                  {
                    "statement-id": "INF.1.A12-m1",
                    "uuid": "f87f6080-e331-4581-9114-10d2566419da",
                    "description": "Es gibt keine zentrale Schlüsselverwaltung. Schlüssel werden bei Bedarf nachgemacht und die Ausgabe wird nicht dokumentiert. Es ist unklar, wer welche Schlüssel besitzt."
                  },
                  {
                    "statement-id": "INF.1.A12-m2",
                    "uuid": "6739f7ad-35c9-4d64-97c8-aae78e4bb610",
                    "description": "Es gibt eine einfache Liste, in der die Ausgabe von Schlüsseln notiert wird. Es gibt jedoch keinen Schließplan und Reserveschlüssel werden unsicher aufbewahrt."
                  },
                  {
                    "statement-id": "INF.1.A12-m3",
                    "uuid": "a24364e1-00c5-4755-a2c5-cfec89e64f14",
                    "description": "Für alle Schlüssel des Gebäudes SOLLTE ein Schließplan vorliegen. Die Herstellung, Aufbewahrung, Verwaltung und Ausgabe von Schlüsseln SOLLTE zentral geregelt sein. Jede Schlüsselausgabe SOLLTE dokumentiert werden. Nicht ausgegebene Schlüssel SOLLTEN sicher aufbewahrt werden."
                  },
                  {
                    "statement-id": "INF.1.A12-m4",
                    "uuid": "b963a58c-39b4-4fdf-8254-a544327c7456",
                    "description": "Reserveschlüssel SOLLTEN vorgehalten und gesichert, aber für Notfälle griffbereit aufbewahrt werden. Die Dokumentation der Schlüsselausgabe wird regelmäßig, mindestens jährlich, daraufhin überprüft, ob die Empfänger die Schlüssel noch benötigen."
                  },
                  {
                    "statement-id": "INF.1.A12-m5",
                    "uuid": "e8aeb567-4d5c-408a-a69a-d3c16e40bf91",
                    "description": "Anstelle einer mechanischen Schließanlage wird ein elektronisches Zutrittskontrollsystem (ZKS) mit programmierbaren Schlüsseln (z.B. RFID-Karten) verwendet. Die Schlüsselverwaltung ist vollständig automatisiert und mit dem Personalverwaltungssystem gekoppelt. Bei Verlust eines Schlüssels kann dieser sofort elektronisch gesperrt werden."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}