{
  "component-definition": {
    "uuid": "d2fb578b-7fc4-48a5-b1e6-422b83db8270",
    "metadata": {
      "title": "INF.2 Serverräume - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:08:00.736935+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "a0a5e93c-440c-4843-8cd0-449d9880cce4",
        "type": "physical",
        "title": "INF.2 Serverräume",
        "description": "This component represents the implementation of all controls for Baustein INF.2.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Heute werden fast alle strategischen und operativen Funktionen und Aufgaben durch Informationstechnik (IT) maßgeblich unterstützt oder sind ohne IT nicht ausführbar. Dadurch steigen die Anforderungen an die Leistungsfähigkeit und Verfügbarkeit der IT-Systeme und deren Anbindung an die Netzumgebung stetig. Um diesem Leistungsbedarf gerecht zu werden, um entsprechende Reserven vorzuhalten und um die IT auch wirtschaftlich betreiben zu können, konzentrieren Institutionen jeglicher Größe ihre IT-Landschaft in Rechenzentren.\n\nEin Rechenzentrum (RZ) ist wie folgt definiert:\n1. Hat eine IT-nutzende Institution nur einen zentralen IT-Betriebsbereich, ist dieser gemeinsam mit den erforderlichen Supportbereichen grundsätzlich immer wie ein RZ entsprechend dem Schutzbedarf zu behandeln. Unter „IT-Betriebsbereich“ sind Räume zu verstehen, in denen die Hardware aufgebaut ist und betrieben wird, die der Bereitstellung von Diensten und Daten dient. Das RZ umfasst neben dem IT-Betriebsbereich alle weiteren technischen Supportbereiche (z. B. Stromversorgung, Kälteversorgung, Löschtechnik, Sicherheitstechnik), die dem bestimmungsgemäßen Betrieb und der Sicherheit des IT-Betriebsbereichs dienen.\n2. Wird die IT der Institution innerhalb eines Gebäudes oder einer Liegenschaft verteilt in mehreren Bereichen betrieben und sind diese Bereiche untereinander und zu den IT-Benutzenden hin durch hauseigene LAN-Verbindungen angeschlossen, ist mindestens der funktional bedeutendste dieser Bereiche als RZ zu behandeln. Des Weiteren sind Bereiche, von deren ordnungsgemäßem Betrieb 50 % und mehr IT-Benutzenden abhängig sind oder aus denen heraus 50% und mehr an Diensten und Daten (gemessen an der Gesamtheit der Bereiche) bereitgestellt werden, als RZ zu behandeln.\n3. Ist die IT-nutzende Institution an mehreren räumlich voneinander getrennten Standorten angesiedelt und sind diese durch andere als hauseigene LAN-Verbindungen miteinander gekoppelt, ist jeder der Standorte entsprechend (1) separat zu betrachten und zu behandeln.\n4. Ein IT-Betriebsbereich, in dem für kritische Geschäftsprozesse (Prozesse, deren Störung oder Ausfall zu wesentlichen Beeinträchtigungen der Erledigung primärer Aufgaben einer Institution führen) erforderliche IT angesiedelt ist, ist immer als RZ zu behandeln, unabhängig von Größe oder Anteilsregeln aus Nummer (2).\n5. IT-Betriebsbereiche, aus denen heraus Dienste oder Dienstleistungen für Dritte erbracht werden, sind immer als Teil eines RZ zu betrachten. Dabei ist es unerheblich, ob dies gegen Entgelt erfolgt oder nicht.\n6. Besteht ein begründetes Interesse, einen IT-Betriebsbereich gemeinsam mit seinem Supportbereich abweichend von den vorgenannten Regelungen als Serverraum zu behandeln, ist dies samt den sich daraus ergebenden Reduzierungen von Sicherheitsanforderungen zu begründen.\n\nDie Auflistung der sechs Punkte bedeutet nicht, dass alle Punkte gemeinsam erfüllt sein müssen, damit ein Bereich als Rechenzentrum betrachtet wird. Vielmehr werden verschiedene Möglichkeiten beschrieben, wann ein Bereich als RZ anzusehen ist. Weicht ein Rechenzentrum von dieser Definition ab, wird der betrachtete IT-Betriebsbereich als Serverraum bezeichnet. Diese Definition orientiert sich ausschließlich an der Bedeutung der IT-Struktur für die Aufgabenerfüllung der nutzenden Institution und steht damit im methodischen Einklang mit der DIN EN 50600.\n\nSoll ein Serverraum abgesichert werden, können die Anforderungen dieses Bausteins entsprechend reduziert werden. Dies muss jedoch stichhaltig und nachvollziehbar begründet werden (6) und es müssen mindestens die Basis-Anforderungen umgesetzt werden."
          },
          {
            "name": "Zielsetzung",
            "value": "Dieser Baustein richtet sich einerseits an Institutionen, die ein Rechenzentrum betreiben und im Rahmen einer Revision prüfen möchten, ob sie geeignete Sicherheitsmaßnahmen umgesetzt haben. Andererseits kann der Baustein auch dazu benutzt werden, die Sicherheitsmaßnahmen abzuschätzen, die umgesetzt werden müssen, wenn die IT in einem Rechenzentrum zentralisiert werden soll. Das oberste Ziel der in diesem Baustein beschriebenen Anforderungen ist es, den sicheren Betrieb des Rechenzentrums zu gewährleisten."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein INF.2 Rechenzentrum sowie Serverraum ist auf jedes Rechenzentrum und jeden Serverraum anzuwenden.\n\nDer vorliegende Baustein eignet sich nicht für kleine Informationsverbünde mit z. B. nur einem oder sehr wenigen Servern oder IT-Systemen. Ein Beispiel dafür ist eine kleine Institution mit wenigen IT-Arbeitsplätzen und einem Server, der in einem separaten Raum betrieben wird. In solchen Fällen genügt es oft, den Baustein INF.5 Raum sowie Schrank für technische Infrastruktur umzusetzen.\n\nAnforderungen an Gebäude und die Verkabelung im Allgemeinen sind nicht Teil dieses Bausteins. Diese sind in den Bausteinen INF.1 Allgemeines Gebäude und INF.12 Verkabelung zu finden, die immer auf Räume und Gebäude bzw. die Verkabelung anzuwenden sind.\n\nUm den Baustein überschaubar zu halten, wurde bewusst auf technische Details und planerische Größen verzichtet. Nähere Informationen liefern einschlägige Normen und weitere Veröffentlichungen des BSI."
          },
          {
            "name": "2.1. Fehlerhafte Planung",
            "value": "Wenn ein Rechenzentrum konzipiert und dabei nicht berücksichtigt wird, es gegen elementare Gefährdungen abzusichern, besteht ein sehr hohes Ausfallrisiko. So können z. B. Standortrisiken wie Luftverkehr, Erdbeben oder Hochwasser die Betriebssicherheit und Verfügbarkeit gefährden. Ebenso massiv kann es sich auf den Betrieb eines Rechenzentrums auswirken, wenn durch eine fehlerhafte Konzeptionierung nicht genügend Bandbreite verfügbar ist oder die Energieversorgung am gewählten Standort nicht ausreicht."
          },
          {
            "name": "2.2. Fehlende oder fehlerhafte Zutrittskontrollen",
            "value": "Fehlen Zutrittskontrollen oder sind diese unzureichend, erhöht sich die Gefahr, dass unberechtigte Personen das Rechenzentrum betreten und dort fahrlässig, z. B. aufgrund mangelnder Fachkenntnisse, oder vorsätzlich Schaden anrichten. Angreifende können so z. B. schützenswerte Daten entwenden, Geräte stehlen oder Server manipulieren. Unzureichende Zutrittskontrollen wirken sich somit auf die Verfügbarkeit, Vertraulichkeit und die Integrität von Daten und IT-Komponenten aus."
          },
          {
            "name": "2.3. Unzureichende Überwachung",
            "value": "Wird die im Rechenzentrum betriebene IT und Infrastruktur unzureichend überwacht und betreut, können Komponenten unbemerkt ausfallen. Dadurch wird eventuell die Verfügbarkeit und fehlerfreie Funktion des Rechenzentrums stark beeinträchtigt. Ausfälle treten zudem oftmals schleichend ein. Ohne eine aktive Überwachung könnten diese zu spät bemerkt werden. Es ist dann oft nicht mehr möglich, rechtzeitig zu reagieren."
          },
          {
            "name": "2.4. Unzureichende Klimatisierung im Rechenzentrum",
            "value": "IT-Komponenten benötigen bestimmte Betriebsbedingungen, um zuverlässig zu funktionieren. Auch setzen sie die von ihnen aufgenommene elektrische Leistung in zusätzliche Wärme um. Wenn in einem IT-Betriebsbereich die Temperatur, die Luftfeuchte oder der Schwebestoffanteil nicht innerhalb der von den Geräteherstellenden vorgegebenen Grenzwerte gehalten werden, kann dies dazu führen, dass technische Komponenten nicht mehr richtig funktionieren oder ausfallen."
          },
          {
            "name": "2.5. Feuer",
            "value": "Feuer ist zwar eine Gefahr, die eher selten eintritt. Entsteht aber tatsächlich ein Brand, hat dieser meist schwerwiegende Auswirkungen. Denn durch Feuer und Rauch können große Schäden entstehen. Während innerhalb des IT-Betriebsbereichs Elektrobrände die häufigste Ursache für Feuer sind, kann ein Feuer außerhalb des IT-Betriebsbereichs und insbesondere in Supportbereichen, wie der Energieversorgung (inklusive NEA und USV) oder der Klimaanlage, zahlreiche weitere Ursachen haben. Haben der IT-Betriebsbereich oder die Supportbereiche sowie andere Nachbarbereiche keinen oder nur einen unzureichenden Brandschutz, kann sich ein Feuer schnell ausbreiten. Zudem könnten außerhalb entstehende Brände auf das Rechenzentrum übergreifen."
          },
          {
            "name": "2.6. Wasser",
            "value": "Durch undichte Wasserleitungen, Hochwasser, Rohrbruch, defekte Sprinkler- oder Klimaanlagen kann Wasser in das Rechenzentrum eintreten. Hierdurch können Geräte beschädigt werden und nicht mehr funktionieren. Es kann auch ein Kurzschluss ausgelöst werden, durch den einzelne Bereiche des Rechenzentrums ausfallen oder ein Brand entstehen könnte."
          },
          {
            "name": "2.7. Fehlender oder unzureichender Einbruchschutz",
            "value": "Selbst wenn eine gut funktionierende Zutrittskontrolle eingerichtet ist, können unbefugte Personen in ein Rechenzentrum eindringen, sofern es nicht ausreichend vor Einbrüchen geschützt wird. Täter und Täterinnen könnten so z. B. IT-Komponenten stehlen oder manipulieren und an vertrauliche Informationen gelangen. Auch könnten sie die Geräte zerstören oder das Rechenzentrum insgesamt beschädigen."
          },
          {
            "name": "2.8. Ausfall der Stromversorgung",
            "value": "Wenn der Strom ausfällt, kann der Betriebsablauf eines Rechenzentrums und damit der Institution erheblich gestört werden. So sind bei einem Stromausfall eventuell die vom Rechenzentrum bereitgestellten IT-Services plötzlich nicht mehr erreichbar. Ebenso können Daten verloren gehen. Zudem ist es möglich, dass durch einen plötzlichen Stromausfall IT-Systeme, TK-Systeme oder Überwachungstechnik beschädigt werden."
          },
          {
            "name": "2.9. Verschmutzung",
            "value": "Staub und andere Verschmutzungen in einem Rechenzentrum können dazu führen, dass technische Komponenten (z. B. Lüfter) nicht mehr funktionieren. Durch Verschmutzungen verschleißen Geräte früher und fallen häufiger aus."
          }
        ],
        "control-implementations": [
          {
            "uuid": "5b90c261-619f-4174-873a-48c4c8e44209",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/serverrume_profile.json",
            "description": "Implementation for all controls in Baustein INF.2",
            "implemented-requirements": [
              {
                "uuid": "830a9c71-1172-4077-8f14-187be2ea2f37",
                "control-id": "GEB.1.3.1",
                "description": "Implementation for GEB.1.3.1 based on BSI INF.2.A1",
                "statements": [
                  {
                    "statement-id": "inf.2.a1-m1",
                    "uuid": "118bd320-622e-4f31-bf45-875907b64fb7",
                    "description": "Nur grundlegende, informelle und meist undokumentierte Anforderungen an die Sicherheit des Rechenzentrums oder Serverraums existieren. Ein Konzept für Sicherheitszonen fehlt gänzlich oder wird nicht durchgesetzt."
                  },
                  {
                    "statement-id": "inf.2.a1-m2",
                    "uuid": "6cc2939c-bf29-414b-ab97-6ec2fc76667d",
                    "description": "Die grundlegenden technischen und organisatorischen Anforderungen an das Rechenzentrum sind dokumentiert, aber oft generisch und nicht spezifisch auf den Schutzbedarf zugeschnitten. Eine einfache Einteilung in einen gesicherten IT-Bereich und einen ungesicherten Außenbereich ist vorhanden, aber eine feingranulare Zonierung fehlt."
                  },
                  {
                    "statement-id": "inf.2.a1-m3",
                    "uuid": "fdd1edb2-f58c-491a-a4cc-e3f0056a2086",
                    "description": "Für ein Rechenzentrum MÜSSEN angemessene technische und organisatorische Vorgaben definiert und umgesetzt werden. Wenn ein Rechenzentrum geplant wird oder geeignete Räumlichkeiten ausgewählt werden, MÜSSEN auch geeignete Sicherheitsmaßnahmen unter Berücksichtigung des Schutzbedarfs der IT-Komponenten (insbesondere der Verfügbarkeit) mit geplant werden. Ein Rechenzentrum MUSS insgesamt als geschlossener Sicherheitsbereich konzipiert werden. Es MUSS zudem unterschiedliche Sicherheitszonen aufweisen. Dafür MÜSSEN z. B. Verwaltungs-, Logistik-, IT-Betriebs- und Support-Bereiche klar voneinander getrennt werden."
                  },
                  {
                    "statement-id": "inf.2.a1-m4",
                    "uuid": "d101b3dd-db92-4951-9df7-a5088315896e",
                    "description": "Die definierten Anforderungen werden formal überprüft, versioniert und sind direkt an die Business-Continuity-Pläne der Institution gekoppelt. Für Serverräume SOLLTE geprüft werden, ob unterschiedliche Sicherheitszonen eingerichtet werden können. Das Zonenkonzept ist detailliert ausgearbeitet und berücksichtigt auch die Schutzwirkung der baulichen Hülle der jeweiligen Zonen."
                  },
                  {
                    "statement-id": "inf.2.a1-m5",
                    "uuid": "fff7f651-eb83-4211-a2d3-d1e479c7b9fe",
                    "description": "Die Anforderungen basieren auf einer formalen Risikoanalyse, die sich an internationalen Standards wie DIN EN 50600 oder ISO/IEC 27001 orientiert. Das Sicherheitszonenkonzept ist vollständig mit physischer und logischer Trennung umgesetzt, wird durch automatisierte Systeme (z. B. Zutrittskontrolle, Videoüberwachung) überwacht und die Wirksamkeit wird regelmäßig durch Audits und Tests verifiziert."
                  }
                ]
              },
              {
                "uuid": "f75d12c1-f704-4f56-9fce-49ee4a05560d",
                "control-id": "GEB.10.1",
                "description": "Implementation for GEB.10.1 based on BSI INF.2.A3",
                "statements": [
                  {
                    "statement-id": "inf.2.a3-m1",
                    "uuid": "c4485af8-86d3-462c-8838-1cbe374aad42",
                    "description": "Einzelne, kleine USV-Systeme (Desktop-Klasse) werden sporadisch für einige wenige, als kritisch erachtete Server eingesetzt. Netzwerkkomponenten, Speichersysteme oder die Steuerung der Klimaanlage sind nicht abgesichert."
                  },
                  {
                    "statement-id": "inf.2.a3-m2",
                    "uuid": "242f4927-e2cf-475a-b409-d3ff122ff9ae",
                    "description": "Eine zentrale USV ist installiert, die die IT-Lasten versorgt. Ihre Kapazität wird jedoch nicht regelmäßig an den tatsächlichen Verbrauch angepasst, was das Risiko einer Überlastung birgt. Die Klimaanlage ist nicht an die USV angeschlossen. Für einen Serverraum wird die Notwendigkeit einer USV nur auf Basis der Verfügbarkeitsanforderungen geprüft."
                  },
                  {
                    "statement-id": "inf.2.a3-m3",
                    "uuid": "15bfc2fd-a9bb-4a97-bfe6-f96a53da2835",
                    "description": "Für alle betriebsrelevanten Komponenten des Rechenzentrums MUSS eine unterbrechungsfreie Stromversorgung (USV) installiert werden. Die USV MUSS ausreichend dimensioniert sein. Mindestens die Steuerung der Klimaanlagen MUSS an die USV angeschlossen werden. Die USV MUSS regelmäßig gemäß Herstellervorgaben gewartet und auf Funktionsfähigkeit getestet werden. Bei USV-Systemen mit Batterie als Energiespeicher MUSS die Batterie im erforderlichen Temperaturbereich gehalten werden."
                  },
                  {
                    "statement-id": "inf.2.a3-m4",
                    "uuid": "91540521-ef0c-479d-9039-f787bacdf546",
                    "description": "Die Batterie der USV SOLLTE vorzugsweise räumlich getrennt von der Leistungselektronik der USV platziert werden, um die gegenseitige Beeinflussung (z.B. durch Wärme oder im Brandfall) zu minimieren. Die Auslastung der USV wird kontinuierlich überwacht, und es werden automatische Warnungen generiert, wenn sich die Last einem Grenzwert nähert."
                  },
                  {
                    "statement-id": "inf.2.a3-m5",
                    "uuid": "4284d126-891a-49fd-a895-ffda1759abdd",
                    "description": "Es wird ein modulares, redundantes (z. B. N+1) USV-System eingesetzt, bei dem der Ausfall einer Komponente unterbrechungsfrei kompensiert wird. Die USV führt wöchentlich automatisierte Selbsttests und halbjährlich automatisierte Lasttests durch, deren Ergebnisse protokolliert und zentral ausgewertet werden. Dies gewährleistet eine konstant hohe Verfügbarkeit und Zuverlässigkeit."
                  }
                ]
              },
              {
                "uuid": "332696c5-c0ec-4515-b8db-a9c8bf037a01",
                "control-id": "GEB.10.1.3",
                "description": "Implementation for GEB.10.1.3 based on BSI INF.2.A25",
                "statements": [
                  {
                    "statement-id": "inf.2.a25-m1",
                    "uuid": "4f85e31c-b210-445a-b3ba-32e1f425442c",
                    "description": "Es ist keine USV im Einsatz. Die IT-Systeme sind direkt an das öffentliche Stromnetz angeschlossen und fallen bei jeder Störung sofort aus."
                  },
                  {
                    "statement-id": "inf.2.a25-m2",
                    "uuid": "36b9b312-d821-44a0-ae64-532ac4c02300",
                    "description": "Eine einzelne (nicht-redundante) USV-Anlage ist installiert. Sie verfügt nicht über einen Wartungsbypass, was bedeutet, dass für Wartungsarbeiten die gesamte angeschlossene IT abgeschaltet werden muss."
                  },
                  {
                    "statement-id": "inf.2.a25-m3",
                    "uuid": "995e9755-0291-41c3-ae19-5e47ab667abc",
                    "description": "Eine einzelne USV-Anlage ist installiert, die jedoch über einen internen oder externen Wartungsbypass verfügt. Dies ermöglicht Wartungsarbeiten an der USV, ohne die angeschlossenen Verbraucher abschalten zu müssen, obwohl diese während der Wartung ungeschützt sind."
                  },
                  {
                    "statement-id": "inf.2.a25-m4",
                    "uuid": "607005f2-581e-41e3-8e87-d5006268ddee",
                    "description": "USV-Systeme SOLLTEN modular und so aufgebaut sein, dass der Ausfall durch ein redundantes Modul unterbrechungsfrei kompensiert wird (N+1-Redundanz). Dies erhöht die Verfügbarkeit und vereinfacht die Wartung erheblich."
                  },
                  {
                    "statement-id": "inf.2.a25-m5",
                    "uuid": "bcdf822a-32a1-473b-b177-0e9fc760e393",
                    "description": "Sofern für die IT-Betriebsbereiche eine zweizügige sogenannte A-B-Versorgung aufgebaut ist, SOLLTE jeder der beiden Strompfade mit einem eigenständigen USV-System ausgestattet sein (2N-Redundanz). Dies stellt die höchste Stufe der Fehlertoleranz dar."
                  }
                ]
              },
              {
                "uuid": "593302de-aeef-4d4d-8a2e-49221b5c769a",
                "control-id": "GEB.10.1.4",
                "description": "Implementation for GEB.10.1.4 based on BSI INF.2.A14",
                "statements": [
                  {
                    "statement-id": "inf.2.a14-m1",
                    "uuid": "ee86be83-cc97-468e-a86a-d96f621bbb82",
                    "description": "Ein mobiles Notstromaggregat ist vorhanden, aber nicht fest angeschlossen oder wird nicht regelmäßig getestet. Im Notfall ist ein manuelles Anschließen und Starten erforderlich, was zu langen Ausfallzeiten führt."
                  },
                  {
                    "statement-id": "inf.2.a14-m2",
                    "uuid": "22130eb0-fbea-4ebe-976b-2006f21a1102",
                    "description": "Eine fest installierte Netzersatzanlage (NEA) ist vorhanden und wird wöchentlich im Leerlauf getestet. Es finden jedoch keine Tests unter Last statt, sodass unklar ist, ob die NEA im Ernstfall die volle Last des Rechenzentrums tragen kann."
                  },
                  {
                    "statement-id": "inf.2.a14-m3",
                    "uuid": "6e7cc4a6-85ac-4273-95f2-a47d3c1d5e35",
                    "description": "Die Energieversorgung eines Rechenzentrums SOLLTE um eine Netzersatzanlage (NEA) ergänzt werden. Wird eine NEA verwendet, MUSS sie regelmäßig gewartet werden. Der Betriebsmittelvorrat einer NEA MUSS regelmäßig daraufhin überprüft werden, ob er ausreichend ist und noch verwendbar ist. Für einen Serverraum SOLLTE alternativ eine USV mit angemessener Autonomiezeit realisiert werden."
                  },
                  {
                    "statement-id": "inf.2.a14-m4",
                    "uuid": "2883d260-1ee2-4a85-b5fa-092381d3d832",
                    "description": "Bei den regelmäßigen Wartungen MÜSSEN auch Belastungs- und Funktionstests sowie Testläufe unter Last durchgeführt werden. Die Tankvorgänge von Brennstoffen MÜSSEN protokolliert werden, einschließlich Art des Brennstoffs, genutzter Additive, Tankdatum und Menge. Nach Möglichkeit SOLLTE statt Diesel-Kraftstoff schwefelarmes Heizöl verwendet werden, um die sogenannte Dieselpest zu vermeiden."
                  },
                  {
                    "statement-id": "inf.2.a14-m5",
                    "uuid": "56e81126-9f35-4ec2-8174-4e81f50b2087",
                    "description": "Das Rechenzentrum verfügt über zwei oder mehr redundante Netzersatzanlagen in einer 2N-Konfiguration. Der Kraftstoff wird durch eine automatische Filter- und Polieranlage permanent in einem sauberen Zustand gehalten. Die monatlichen Lasttests werden unter Volllast des Rechenzentrums über einen längeren Zeitraum (z.B. 4 Stunden) durchgeführt."
                  }
                ]
              },
              {
                "uuid": "b3d21281-b451-4dc1-a2e4-485e64f7f7fe",
                "control-id": "GEB.10.2",
                "description": "Implementation for GEB.10.2 based on BSI INF.2.A19",
                "statements": [
                  {
                    "statement-id": "inf.2.a19-m1",
                    "uuid": "66529da3-85db-4973-8146-e2fc6086f1c4",
                    "description": "Funktionstests werden nur reaktiv durchgeführt, nachdem ein Vorfall eine Schwachstelle im Zusammenspiel der Systeme aufgedeckt hat."
                  },
                  {
                    "statement-id": "inf.2.a19-m2",
                    "uuid": "9bd1a54a-8255-4b87-ad4b-14f9202061aa",
                    "description": "Es werden regelmäßige Funktionstests einzelner Komponenten durchgeführt (z. B. ein USV-Test, ein NEA-Leerlauftest). Das Zusammenspiel der Systeme in einer vollständigen Reaktionskette wird jedoch nicht getestet."
                  },
                  {
                    "statement-id": "inf.2.a19-m3",
                    "uuid": "64adf83a-a8f9-4955-b7d3-e8904f85da70",
                    "description": "Die technische Infrastruktur eines Rechenzentrums SOLLTE regelmäßig (zumindest ein- bis zweimal jährlich) sowie nach Systemumbauten und umfangreichen Reparaturen getestet werden. Die Ergebnisse SOLLTEN dokumentiert werden."
                  },
                  {
                    "statement-id": "inf.2.a19-m4",
                    "uuid": "6b2cd11e-900c-4edd-ba0b-1afd21dcba2c",
                    "description": "Besonders ganze Reaktionsketten SOLLTEN einem echten Funktionstest unterzogen werden. Die Tests sind umfassend und simulieren beispielsweise einen Ausfall der öffentlichen Stromversorgung, um den nahtlosen Übergang von Netz auf USV und dann auf NEA und zurück zu verifizieren."
                  },
                  {
                    "statement-id": "inf.2.a19-m5",
                    "uuid": "8759f224-c4d6-4671-9f94-047630747f36",
                    "description": "Es werden jährlich 'Black Building'-Tests durchgeführt, bei denen die Stromversorgung des gesamten Gebäudes unterbrochen wird, um die Reaktion aller redundanten Systeme (Strom, Klima, Sicherheitstechnik) unter Volllast zu testen. Diese Tests werden als formales Projekt mit detaillierten Ablaufplänen (Method of Procedure, MOP) und der Einbeziehung aller Stakeholder geplant und durchgeführt."
                  }
                ]
              },
              {
                "uuid": "ca80382f-9ffa-4b05-87b1-377fa373981d",
                "control-id": "GEB.10.3",
                "description": "Implementation for GEB.10.3 based on BSI INF.2.A4",
                "statements": [
                  {
                    "statement-id": "inf.2.a4-m1",
                    "uuid": "6d7fc608-720e-4421-b1d3-029e640f779f",
                    "description": "Ein einziger, ungeschützter Not-Aus-Schalter ist vorhanden, der bei Betätigung das gesamte Rechenzentrum inklusive USV und sicherheitsrelevanter Systeme (z. B. Notbeleuchtung) abschaltet. Dies stellt ein hohes Risiko für Datenverlust und Folgeschäden dar."
                  },
                  {
                    "statement-id": "inf.2.a4-m2",
                    "uuid": "263d91d1-54d1-4c91-8cdb-2dc8aff08e7d",
                    "description": "Es sind Not-Aus-Schalter vorhanden, aber sie sind nicht eindeutig beschriftet oder ausreichend gegen Fehlbedienung geschützt. Es ist unklar, welche Bereiche oder Systeme von welchem Schalter betroffen sind."
                  },
                  {
                    "statement-id": "inf.2.a4-m3",
                    "uuid": "760300f3-650f-447d-bc64-aac71001ffb3",
                    "description": "Es MUSS geeignete Möglichkeiten geben, elektrische Verbraucher im Rechenzentrum spannungsfrei zu schalten. Dabei MUSS darauf geachtet werden, ob und wie eine vorhandene USV eingebunden ist. Werden klassische Not-Aus-Schalter eingesetzt, MUSS darauf geachtet werden, dass darüber nicht das komplette Rechenzentrum abgeschaltet wird. Die Notabschaltung MUSS sinnvoll parzelliert und zielgerichtet erfolgen. Alle Not-Aus-Schalter MÜSSEN so geschützt sein, dass sie nicht unbeabsichtigt oder unbefugt betätigt werden können."
                  },
                  {
                    "statement-id": "inf.2.a4-m4",
                    "uuid": "5463d956-64e7-45aa-82b7-e66a8b40feb7",
                    "description": "Das Not-Aus-System (in Deutschland als NOT-HALT bezeichnet) ist zoniert und ermöglicht das gezielte Abschalten einzelner Bereiche (z. B. einer Rack-Reihe) oder Systeme (z. B. der Kälteerzeugung). Das System ist klar dokumentiert, und das Personal wird regelmäßig in seiner Anwendung geschult, um im Notfall korrekt und ohne Zögern handeln zu können."
                  },
                  {
                    "statement-id": "inf.2.a4-m5",
                    "uuid": "f23dee86-36df-4c89-9cbc-0baefa8a723f",
                    "description": "Das Not-Aus-System ist in die Brandmelde- und Löschanlage integriert. Eine Auslösung wird über ein zentrales Gebäudemanagementsystem verwaltet und erfordert zur Vermeidung von Fehlbedienungen eine Bestätigung durch zwei Faktoren (z.B. Tasterbetätigung und Software-Bestätigung durch eine zweite Person)."
                  }
                ]
              },
              {
                "uuid": "36578e41-38a7-411f-bf1a-e5388f11db67",
                "control-id": "GEB.10.4",
                "description": "Implementation for GEB.10.4 based on BSI INF.2.A15",
                "statements": [
                  {
                    "statement-id": "inf.2.a15-m1",
                    "uuid": "6b2ec20b-8cdb-40ca-95ec-eb67bcb83d05",
                    "description": "Ausschließlich handelsübliche Überspannungsschutz-Steckdosenleisten werden für die IT-Geräte verwendet. Ein übergeordnetes Schutzkonzept existiert nicht."
                  },
                  {
                    "statement-id": "inf.2.a15-m2",
                    "uuid": "dad8c263-37ca-4842-ac62-ed7bb7d13bf7",
                    "description": "Am Gebäudeeingang ist ein Grobschutz (Typ 1 SPD) installiert. Es fehlt jedoch ein koordiniertes System mit Mittel- (Typ 2) und Feinschutz (Typ 3) näher an den Endgeräten. Dies kann dazu führen, dass die Schutzwirkung unzureichend ist."
                  },
                  {
                    "statement-id": "inf.2.a15-m3",
                    "uuid": "b8dd4f34-868a-46ba-a86f-90b1beafe857",
                    "description": "Es wird ein grundlegendes, aber dokumentiertes Überspannungsschutzkonzept umgesetzt. Dies beinhaltet mindestens einen koordinierten Grob- und Mittelschutz (Typ 1 und Typ 2 SPD) für die Stromversorgung des Rechenzentrums. Alle Einrichtungen des Überspannungsschutzes werden regelmäßig einer Sichtprüfung unterzogen."
                  },
                  {
                    "statement-id": "inf.2.a15-m4",
                    "uuid": "ab1fef31-d4c9-4210-9072-85a6b63bfc12",
                    "description": "Es SOLLTE auf Basis der aktuell gültigen Norm (DIN EN 62305 Teil 1 bis 4) ein Blitz- und Überspannungsschutzkonzept erstellt werden. Dabei sind die für den ordnungsgemäßen Betrieb des RZ erforderlichen Blitzschutzzonen (LPZ) festzulegen. Für alle erforderlichen Einrichtungen SOLLTE das mindestens die LPZ 2 sein. Alle Einrichtungen des Überspannungsschutzes SOLLTEN gemäß DIN EN 62305-3, Tabelle E.2 ein Mal im Jahr einer umfassenden Prüfung unterzogen werden."
                  },
                  {
                    "statement-id": "inf.2.a15-m5",
                    "uuid": "eee5ee74-f7ff-4bd3-aeb3-45dceb8d71dc",
                    "description": "Das Schutzkonzept ist vollständig mit koordinierten SPDs der Typen 1, 2 und 3 umgesetzt. Alle SPDs sind mit einer Fernsignalisierung ausgestattet, die ihren Funktions- bzw. Defektstatus an das GMS/DCIM-System meldet. Dies ermöglicht einen proaktiven Austausch von defekten Schutzmodulen, bevor die Schutzwirkung beeinträchtigt ist."
                  }
                ]
              },
              {
                "uuid": "358bd66d-fb25-4c23-bd8b-90de05a97703",
                "control-id": "GEB.10.5.1",
                "description": "Implementation for GEB.10.5.1 based on BSI INF.2.A23",
                "statements": [
                  {
                    "statement-id": "inf.2.a23-m1",
                    "uuid": "dcd390a5-86dc-491d-9881-1d0527089fbe",
                    "description": "Im Rechenzentrum herrscht 'Kabel-Spaghetti'. Strom- und Datenkabel werden ungetrennt und ungeordnet verlegt. Dies führt zu Störungen, erschwert die Wartung und erhöht die Brandlast."
                  },
                  {
                    "statement-id": "inf.2.a23-m2",
                    "uuid": "d698f7a3-db8c-4fb3-a2ec-a48305bb2b2a",
                    "description": "Kabel werden in Kabeltrassen geführt, um eine grundlegende Ordnung zu schaffen. Strom- und Datenkabel teilen sich jedoch dieselben Trassen, und eine klare Beschriftung der Kabel fehlt."
                  },
                  {
                    "statement-id": "inf.2.a23-m3",
                    "uuid": "b9296526-2562-4f2b-9e83-104b1b088511",
                    "description": "Strom- und Datenkabel werden konsequent in getrennten Kabeltrassen geführt, um elektromagnetische Störungen zu vermeiden. Kabelmanagement-Systeme in den Racks sorgen für eine saubere und geordnete Verkabelung. Alle Kabel sind an beiden Enden eindeutig beschriftet."
                  },
                  {
                    "statement-id": "inf.2.a23-m4",
                    "uuid": "6de271f4-033b-44be-8802-20d61aa458e8",
                    "description": "Kabeltrassen in Rechenzentren SOLLTEN sorgfältig geplant und ausgeführt werden. Trassen SOLLTEN hinsichtlich Anordnung und Dimensionierung so ausgelegt sein, dass eine Trennung der Spannungsebenen sowie eine sinnvolle Verteilung von Kabeln auf den Trassen möglich ist und dass auch für zukünftige Bedarfsmehrung ausreichend Platz zur Verfügung steht."
                  },
                  {
                    "statement-id": "inf.2.a23-m5",
                    "uuid": "6081b353-cabf-4e3d-91e6-e6c48eb6bcfe",
                    "description": "Zur optimalen Versorgung von IT-Hardware, die über zwei Netzteile verfügt, SOLLTE ab der Niederspannungshauptverteilung für die IT-Betriebsbereiche eine zweizügige sogenannte A-B-Versorgung aufgebaut werden. Einander Redundanz gebende Leitungen (z. B. der A- und B-Stromversorgung) SOLLTEN über getrennte Trassen verlegt werden, um eine maximale Verfügbarkeit sicherzustellen."
                  }
                ]
              },
              {
                "uuid": "bdc70524-444c-4796-85d8-ef3f318bebf9",
                "control-id": "GEB.10.7",
                "description": "Implementation for GEB.10.7 based on BSI INF.2.A29",
                "statements": [
                  {
                    "statement-id": "inf.2.a29-m1",
                    "uuid": "063a8e22-5cb8-4a6c-863f-ea28d8f3678e",
                    "description": "Wasser-, Abwasser- oder Gasleitungen, die nicht der Versorgung des Rechenzentrums dienen, verlaufen ungeschützt direkt über oder neben den IT-Racks. Das von diesen Leitungen ausgehende Risiko wird ignoriert."
                  },
                  {
                    "statement-id": "inf.2.a29-m2",
                    "uuid": "c0ae9062-8871-4c24-9090-983fbc8dc2b8",
                    "description": "Das Vorhandensein von fremden Versorgungsleitungen ist bekannt und dokumentiert. Es wurden jedoch keine spezifischen Maßnahmen zur Risikominimierung ergriffen."
                  },
                  {
                    "statement-id": "inf.2.a29-m3",
                    "uuid": "68a55879-fc10-46da-9f30-24e23c17c386",
                    "description": "In einem Rechenzentrum DÜRFEN NUR Leitungen verlegt werden, die der unmittelbaren Versorgung der im Rechenzentrum aufgebauten Technik dienen. Ist es aus baulichen Gründen unabwendbar, Leitungen durch das Rechenzentrum zu führen, MUSS dies einschließlich Begründung dokumentiert werden. Die Risiken, die von solchen Leitungen ausgehen, MÜSSEN durch geeignete Maßnahmen minimiert werden, z. B. durch Einhausung und Überwachung. Durch Serverräume dürfen vorgenannte Leitungen geführt werden, diese MÜSSEN aber genauso behandelt werden. Meldungen aus der Überwachung der Leitungen MÜSSEN unverzüglich geprüft und bewertet werden."
                  },
                  {
                    "statement-id": "inf.2.a29-m4",
                    "uuid": "e7c47e3b-7f27-4a81-be3d-38ff43bea8f0",
                    "description": "Alle fremden Leitungen (insbesondere wasserführende) werden in dedizierten, versiegelten Einhausungen oder Schächten geführt. Diese sind mit Leckagesensoren ausgestattet, die an das zentrale Überwachungssystem angeschlossen sind. Die Überwachung ist rund um die Uhr sichergestellt."
                  },
                  {
                    "statement-id": "inf.2.a29-m5",
                    "uuid": "157f0663-78b8-4548-9e6d-4d164a334f1d",
                    "description": "Die Planung des Rechenzentrums verbietet grundsätzlich die Durchleitung von nicht betriebsnotwendigen Versorgungsleitungen durch die IT-Betriebsräume. Notwendige Leitungen, wie z.B. für die Kaltwasserversorgung der Klimaanlage oder für die Löschanlage, sind doppelwandig ausgeführt und werden permanent auf Druckabfall überwacht, um Leckagen sofort zu erkennen."
                  }
                ]
              },
              {
                "uuid": "6e6b3a31-b16a-413d-b7b4-0eef6d7d151d",
                "control-id": "GEB.11.1",
                "description": "Implementation for GEB.11.1 based on BSI INF.2.A13",
                "statements": [
                  {
                    "statement-id": "inf.2.a13-m1",
                    "uuid": "eb78034d-08ba-40cb-9edb-1b94bfaa9dfd",
                    "description": "Einzelne Gefahrenmelder (z.B. ein Wassermelder) sind installiert, lösen aber nur einen lokalen, akustischen Alarm aus und sind nicht Teil eines Gesamtkonzepts."
                  },
                  {
                    "statement-id": "inf.2.a13-m2",
                    "uuid": "164bbcdd-2484-4808-a920-b5f0b69bae45",
                    "description": "Eine zentrale Gefahrenmeldeanlage (GMA) ist installiert, aber der Übertragungsweg zur externen Alarmempfangsstelle ist nicht redundant ausgelegt (z. B. nur über eine Internetverbindung). Bei Ausfall dieses Weges bleiben Alarme unbemerkt."
                  },
                  {
                    "statement-id": "inf.2.a13-m3",
                    "uuid": "4da809c3-727b-4442-ac46-f525b3010e6f",
                    "description": "Basierend auf dem Sicherheitskonzept des Gebäudes wird geplant, welche Gefahrenmeldeanlagen (GMA) für welche Bereiche benötigt werden. Der Umgang mit Alarmmeldungen wird festgelegt. Es wird eine zum Einsatzzweck passende GMA installiert. Die Meldungen der GMA werden an eine Alarmempfangsstelle aufgeschaltet, die jederzeit erreichbar sein MUSS und geeignet auf die Gefährdung reagieren kann."
                  },
                  {
                    "statement-id": "inf.2.a13-m4",
                    "uuid": "653580ad-b983-40b3-8ae8-f1dcb677d1da",
                    "description": "Der Übertragungsweg zwischen der eingesetzten GMA und der Alarmempfangsstelle SOLLTE entsprechend den Technischen Anschlussbedingungen (TAB) und nach Möglichkeit redundant ausgelegt werden. Alle vorhandenen Übertragungswege MÜSSEN regelmäßig getestet werden. Das Konzept SOLLTE immer angepasst werden, wenn sich die Nutzung der Gebäudebereiche verändert."
                  },
                  {
                    "statement-id": "inf.2.a13-m5",
                    "uuid": "d20d0c2d-74f4-48e1-8624-29b976372187",
                    "description": "Es wird eine hochwertige, zertifizierte GMA (z. B. VdS-Klasse C) eingesetzt. Alarme werden nicht nur an eine externe Stelle weitergeleitet, sondern lösen über eine Integration mit anderen Sicherheitssystemen auch automatisierte lokale Reaktionen aus, wie z. B. die Aktivierung von Videoaufzeichnungen, die Verriegelung von Bereichen oder das Einschalten von zusätzlicher Beleuchtung."
                  }
                ]
              },
              {
                "uuid": "a3623d07-22f1-4706-a34e-b5b7ee3a27b7",
                "control-id": "GEB.11.1.2",
                "description": "Implementation for GEB.11.1.2 based on BSI INF.2.A2",
                "statements": [
                  {
                    "statement-id": "inf.2.a2-m1",
                    "uuid": "ae319acf-51a1-4cf4-8bce-5018aac359d2",
                    "description": "Ausschließlich die gesetzlich vorgeschriebenen, minimalen Brandschutzanforderungen sind umgesetzt, ohne besondere Berücksichtigung des Schutzes der IT-Systeme oder der Verfügbarkeit. Bestehende Brandabschnitte weisen möglicherweise unversiegelte Durchbrüche auf."
                  },
                  {
                    "statement-id": "inf.2.a2-m2",
                    "uuid": "2166eb32-cee1-446b-bb21-9ee64990e598",
                    "description": "Der zentrale IT-Betriebsraum ist als eigenständiger Brandabschnitt ausgebildet. Supportbereiche wie Technik- oder Lagerräume sind jedoch nicht durch separate Brandabschnitte geschützt und stellen ein Risiko dar."
                  },
                  {
                    "statement-id": "inf.2.a2-m3",
                    "uuid": "ea783e04-fc14-4665-869b-56ca8aec5955",
                    "description": "Es MÜSSEN geeignete Brand- und Rauchabschnitte für die Räumlichkeiten eines Rechenzentrums festgelegt werden. Die Brand- und Rauchabschnitte MÜSSEN über den baurechtlich vorgeschriebenen Rahmen hinaus auch Schutz für die darin befindlichen technischen Einrichtungen und deren Verfügbarkeit bieten. Es MUSS verhindert werden, dass sich Brand und Rauch ausbreiten."
                  },
                  {
                    "statement-id": "inf.2.a2-m4",
                    "uuid": "f5aa3222-cf61-4169-b5c3-503b95df7094",
                    "description": "Im Falle eines Serverraums SOLLTE geprüft werden, ob geeignete Brand- und Rauchabschnitte für die Räumlichkeiten umsetzbar sind. Die Feuerwiderstandsklasse der Wände, Türen und Schottungen ist explizit dokumentiert und wird regelmäßig auf Unversehrtheit überprüft, insbesondere nach Baumaßnahmen."
                  },
                  {
                    "statement-id": "inf.2.a2-m5",
                    "uuid": "afdcf0f5-b696-4fc2-aef3-515cfff9d765",
                    "description": "Die Brandabschnitte sind mit einer höheren Feuerwiderstandsklasse (z. B. F90/F120) als gesetzlich gefordert ausgelegt. Lüftungsleitungen, die Brandabschnitte durchdringen, sind mit automatischen Brandschutzklappen ausgestattet, die von der Brandmeldeanlage angesteuert werden, um die Ausbreitung von Rauch und Feuer aktiv zu verhindern."
                  }
                ]
              },
              {
                "uuid": "e7009c3f-1fba-4d71-b266-5440e717ef69",
                "control-id": "GEB.11.1.6",
                "description": "Implementation for GEB.11.1.6 based on BSI INF.2.A8",
                "statements": [
                  {
                    "statement-id": "inf.2.a8-m1",
                    "uuid": "f8adac2d-3dbb-4a53-b13c-174acfed4063",
                    "description": "Es sind nur die standardmäßigen, batteriebetriebenen Rauchmelder vorhanden, die von der Bauordnung gefordert werden. Diese sind nicht vernetzt und lösen nur einen lokalen akustischen Alarm aus."
                  },
                  {
                    "statement-id": "inf.2.a8-m2",
                    "uuid": "4c125445-efc5-48e7-b411-953ec70377e5",
                    "description": "Eine zentrale Brandmeldeanlage (BMA) ist installiert, überwacht aber nur den Haupt-IT-Raum. Supportbereiche wie Elektroräume oder USV-Räume sind nicht an die BMA angeschlossen."
                  },
                  {
                    "statement-id": "inf.2.a8-m3",
                    "uuid": "cc878c3c-c8b3-4cfb-b97a-776c0a94abf8",
                    "description": "In einem Rechenzentrum MUSS eine Brandmeldeanlage installiert sein. Diese MUSS alle Flächen überwachen. Alle Meldungen der Brandmeldeanlage MÜSSEN geeignet weitergeleitet werden. Die Brandmeldeanlage MUSS regelmäßig gewartet werden. Es MUSS sichergestellt werden, dass in Räumen des Rechenzentrums keine besonderen Brandlasten vorhanden sind."
                  },
                  {
                    "statement-id": "inf.2.a8-m4",
                    "uuid": "41ac4d3d-6fa0-4d44-aeea-321ec075b75f",
                    "description": "Die Brandmeldeanlage ist adressierbar, d.h. sie kann den exakten Melder, der den Alarm ausgelöst hat, auf einem Display anzeigen. Dies ermöglicht eine schnelle Lokalisierung des Brandherdes. Die Anlage ist an eine zertifizierte Notruf- und Serviceleitstelle (NSL) aufgeschaltet."
                  },
                  {
                    "statement-id": "inf.2.a8-m5",
                    "uuid": "c46e4923-b070-49f9-87be-308254c57d0a",
                    "description": "Es wird ein Rauchansaugsystem (RAS), auch als Brandfrühesterkennungsanlage bekannt, eingesetzt. Dieses System detektiert Brandpartikel in der Luft, lange bevor ein herkömmlicher Rauchmelder auslösen würde. Das RAS ist in die Löschanlagensteuerung und das Not-Aus-System integriert, um automatisierte Gegenmaßnahmen einzuleiten."
                  }
                ]
              },
              {
                "uuid": "b362c5c4-c24d-4acc-a45e-d1fd94cb3ac5",
                "control-id": "GEB.11.1.7",
                "description": "Implementation for GEB.11.1.7 based on BSI INF.2.A9",
                "statements": [
                  {
                    "statement-id": "inf.2.a9-m1",
                    "uuid": "c354f369-10d8-4eab-8e39-05a471aae1cf",
                    "description": "Es sind einige wenige Handfeuerlöscher vorhanden, die jedoch für Brände in elektrischen Anlagen ungeeignet sind (z. B. Wasserlöscher). Das Personal ist nicht in deren Gebrauch geschult."
                  },
                  {
                    "statement-id": "inf.2.a9-m2",
                    "uuid": "298c0728-d6e0-44a7-9458-ecae7f1e4c7b",
                    "description": "Es sind ausreichend Handfeuerlöscher mit geeignetem Löschmittel (z. B. CO2) vorhanden und diese werden regelmäßig gewartet. Das Personal hat eine grundlegende Einweisung erhalten. Es gibt jedoch keine automatische Löschanlage oder ein definiertes Team für eine schnelle Reaktion."
                  },
                  {
                    "statement-id": "inf.2.a9-m3",
                    "uuid": "c38e7dab-c873-498f-9bb7-fd5026a071aa",
                    "description": "In einem Rechenzentrum MUSS entweder eine Lösch- oder Brandvermeidungsanlage nach aktuellem Stand der Technik installiert sein ODER durch technische (insbesondere eine flächendeckende Brandfrüherkennung gemäß INF.2.A17) und organisatorische Maßnahmen (geschultes Personal und Reaktionspläne) MUSS sichergestellt sein, dass unmittelbar (innerhalb von maximal 3 Minuten) auf Meldungen der Brandfrüherkennung reagiert wird. In Serverräumen ohne solche Anlagen MÜSSEN Handfeuerlöscher mit geeigneten Löschmitteln in ausreichender Zahl und Größe vorhanden sein und alle Mitarbeitenden MÜSSEN in deren Benutzung eingewiesen werden."
                  },
                  {
                    "statement-id": "inf.2.a9-m4",
                    "uuid": "8b51b5e0-92d7-4b9e-938c-0c7d291f2581",
                    "description": "In den primären IT-Betriebsbereichen ist eine automatische Gaslöschanlage (z.B. mit Inertgasen wie Argon oder Stickstoff oder chemischen Löschmitteln wie Novec 1230) installiert. Die Reaktionspläne für eine Auslösung werden vierteljährlich geübt."
                  },
                  {
                    "statement-id": "inf.2.a9-m5",
                    "uuid": "cf247299-6455-44db-a407-edcf827a4c09",
                    "description": "Es ist eine Brandvermeidungsanlage mittels Sauerstoffreduktion installiert. Diese Anlage schafft permanent eine Atmosphäre, in der sich ein Brand gar nicht erst entzünden kann. Das System wird kontinuierlich überwacht und stellt das höchste Schutzniveau dar, da es Brände proaktiv verhindert statt sie nur zu bekämpfen."
                  }
                ]
              },
              {
                "uuid": "12e41f39-752f-4f69-9320-c8d6aa18257e",
                "control-id": "GEB.11.1.8",
                "description": "Implementation for GEB.11.1.8 based on BSI INF.2.A10",
                "statements": [
                  {
                    "statement-id": "inf.2.a10-m1",
                    "uuid": "75858340-353a-4589-a2dd-7e78c0b3f991",
                    "description": "Wartungs- und Inspektionsarbeiten werden rein reaktiv durchgeführt, also erst dann, wenn eine Komponente bereits ausgefallen ist. Es gibt keine präventive Instandhaltung."
                  },
                  {
                    "statement-id": "inf.2.a10-m2",
                    "uuid": "d86f2de0-3bb0-4b26-960d-6120fa410d32",
                    "description": "Es existiert ein grundlegender Wartungsplan für die wichtigsten Systeme wie USV und Klimaanlage. Dieser wird jedoch nicht immer strikt befolgt oder lückenhaft dokumentiert."
                  },
                  {
                    "statement-id": "inf.2.a10-m3",
                    "uuid": "a8659099-56c9-47e7-8b79-14c293f7a5bc",
                    "description": "Für alle Komponenten der baulich-technischen Infrastruktur MÜSSEN mindestens die vom herstellenden Unternehmen empfohlenen oder durch Normen festgelegten Intervalle und Vorschriften für Inspektion und Wartung eingehalten werden. Inspektionen und Wartungsarbeiten MÜSSEN protokolliert werden. Brandschotten MÜSSEN daraufhin geprüft werden, ob sie unversehrt sind. Die Ergebnisse MÜSSEN dokumentiert werden."
                  },
                  {
                    "statement-id": "inf.2.a10-m4",
                    "uuid": "30deb16f-22a7-4323-a2df-347d7bb26a18",
                    "description": "Zur Planung, Steuerung und Dokumentation aller Wartungsaktivitäten wird ein computergestütztes Instandhaltungsplanungssystem (IPS) oder ein Computerized Maintenance Management System (CMMS) eingesetzt. Dieses System generiert automatisch Wartungsaufträge und eskaliert überfällige Arbeiten."
                  },
                  {
                    "statement-id": "inf.2.a10-m5",
                    "uuid": "276d4531-02a2-4b45-8478-5f4b68f4a9e1",
                    "description": "Es werden vorausschauende Wartungstechniken (Predictive Maintenance) eingesetzt. Anhand von Sensordaten (z. B. Schwingungen, Temperaturen, Laufzeiten) und Analysen werden Ausfälle vorhergesagt, bevor sie auftreten, und Wartungsarbeiten proaktiv und bedarfsgerecht geplant."
                  }
                ]
              },
              {
                "uuid": "71f83119-1695-4de7-8a0d-04635856f7dc",
                "control-id": "GEB.11.2.2",
                "description": "Implementation for GEB.11.2.2 based on BSI INF.2.A11",
                "statements": [
                  {
                    "statement-id": "inf.2.a11-m1",
                    "uuid": "97ae2e1c-0655-47cf-a6de-5b92852b1ed1",
                    "description": "Es gibt keine automatische Überwachung. Die Funktionsfähigkeit der Infrastruktur wird nur durch manuelle Kontrollgänge oder bei einem Ausfall festgestellt."
                  },
                  {
                    "statement-id": "inf.2.a11-m2",
                    "uuid": "f5ca9e2c-106a-4aba-a4d2-a26feb04cbb3",
                    "description": "Einige Systeme, wie z. B. die USV, verfügen über lokale Alarme (z. B. eine rote Lampe oder ein Piepton). Es gibt jedoch keine zentrale Überwachung oder ein automatisches Benachrichtigungssystem, das die Alarme an zuständiges Personal weiterleitet."
                  },
                  {
                    "statement-id": "inf.2.a11-m3",
                    "uuid": "46347005-90c6-44f9-b735-f48fb0d73f4a",
                    "description": "Alle Einrichtungen der Infrastruktur, wie z. B. Leckageüberwachung, Klima-, Strom- und USV-Anlagen, MÜSSEN automatisch überwacht werden. Erkannte Störungen MÜSSEN schnellstmöglich in geeigneter Weise weitergeleitet und bearbeitet werden. Die verantwortlichen Mitarbeitenden MÜSSEN zeitnah alarmiert werden."
                  },
                  {
                    "statement-id": "inf.2.a11-m4",
                    "uuid": "5386900d-208a-4cd2-a527-ff45af1f7055",
                    "description": "Im Falle eines Serverraums SOLLTEN IT- und Supportgeräte, die nicht oder nur selten von einer Person bedient werden müssen, mit einer Fernanzeige für Störungen ausgestattet werden. Ein zentrales Gebäudemanagementsystem (GMS) oder ein Data Center Infrastructure Management (DCIM) Tool fasst alle Alarme zusammen und bietet ein einheitliches Dashboard für den schnellen Überblick."
                  },
                  {
                    "statement-id": "inf.2.a11-m5",
                    "uuid": "8bfcf574-2c21-45f4-b270-876bb1719005",
                    "description": "Das Überwachungssystem nutzt KI/ML-basierte Verfahren, um Ereignisse aus verschiedenen Systemen zu korrelieren, die eigentliche Ursache (Root Cause) zu identifizieren und potenzielle zukünftige Ausfälle auf der Grundlage von Mustern geringfügiger Alarme vorherzusagen (AIOps)."
                  }
                ]
              },
              {
                "uuid": "9bb44f50-d7f3-4c1d-9a3a-fcf497b4bf39",
                "control-id": "GEB.2.1",
                "description": "Implementation for GEB.2.1 based on BSI INF.2.A12",
                "statements": [
                  {
                    "statement-id": "inf.2.a12-m1",
                    "uuid": "a5d5ef62-17fd-4404-ac1d-416d5abc1a01",
                    "description": "Es ist kein klar definierter Perimeter um das Rechenzentrumsgebäude vorhanden. Die Grundstücksgrenze ist unmarkiert und frei zugänglich."
                  },
                  {
                    "statement-id": "inf.2.a12-m2",
                    "uuid": "2368fc9c-64a6-4709-834c-51de00a46aac",
                    "description": "Ein einfacher Zaun (z. B. Maschendraht) ist als physische Barriere um das Grundstück installiert. Es gibt jedoch keine zusätzliche Überwachung des Perimeters."
                  },
                  {
                    "statement-id": "inf.2.a12-m3",
                    "uuid": "7b6835fc-f29d-42b0-a5d7-71c326676dc6",
                    "description": "Es existiert ein definierter Perimeter mit physischen Barrieren (z. B. ein stabiler Zaun). Es sind Schilder vorhanden, die Unbefugte vom Betreten abhalten und auf eine Überwachung hinweisen. Der Zugang wird über kontrollierte Tore oder Pforten geregelt."
                  },
                  {
                    "statement-id": "inf.2.a12-m4",
                    "uuid": "04a2dd3a-e197-4c0f-a993-fa42f5bb8220",
                    "description": "Für Rechenzentren SOLLTE ein Perimeterschutz existieren. Je nach festgelegtem Schutzbedarf SOLLTE der Perimeterschutz aus folgenden Komponenten bestehen: äußere Umschließung, Sicherungsmaßnahmen gegen unbeabsichtigtes und beabsichtigtes gewaltloses Überwinden der Grundstücksgrenze, Freiland-Sicherungsmaßnahmen (z. B. Videoüberwachung), äußere Personen- und Fahrzeugdetektion und automatische Alarmierung."
                  },
                  {
                    "statement-id": "inf.2.a12-m5",
                    "uuid": "c87ec1ef-510e-40e7-bdd2-6ce11c8ee94c",
                    "description": "Der Perimeterschutz umfasst mehrere gestaffelte Verteidigungslinien und Maßnahmen gegen beabsichtigtes gewaltsames Überwinden. Dies beinhaltet einen übersteigsicheren Zaun mit integrierter Detektionstechnik, eine sterile Zone mit Mikrowellen- oder Infrarotbarrieren und eine lückenlose Abdeckung durch PTZ-Kameras (Pan-Tilt-Zoom), die Eindringlinge automatisch verfolgen können (Auto-Tracking)."
                  }
                ]
              },
              {
                "uuid": "7885d5ff-6e61-4a34-867a-9af21b6e92e5",
                "control-id": "GEB.3.1.1",
                "description": "Implementation for GEB.3.1.1 based on BSI INF.2.A24",
                "statements": [
                  {
                    "statement-id": "inf.2.a24-m1",
                    "uuid": "81cd16a8-d801-4d33-892d-be959c3465c7",
                    "description": "Es werden Attrappen von Videokameras eingesetzt, die keine echte Überwachungsfunktion haben. Eine Beweissicherung ist nicht möglich."
                  },
                  {
                    "statement-id": "inf.2.a24-m2",
                    "uuid": "01f9146f-894a-4a4e-a7f4-361fd37694b3",
                    "description": "Ein CCTV-System mit Live-Bildern ist vorhanden, es werden jedoch keine Aufzeichnungen gespeichert. Eine nachträgliche Auswertung von Vorfällen ist nicht möglich."
                  },
                  {
                    "statement-id": "inf.2.a24-m3",
                    "uuid": "d6f4611a-c0a0-4b9b-a453-11d758ef602f",
                    "description": "Videokameras sind an Ein- und Ausgängen sowie an anderen strategischen Punkten installiert. Die Aufzeichnungen werden für einen definierten Zeitraum (z. B. 72 Stunden) gespeichert, bevor sie überschrieben werden. Der Einsatz der Videoüberwachung wurde mit dem Datenschutzbeauftragten abgestimmt und die Mitarbeiter wurden informiert."
                  },
                  {
                    "statement-id": "inf.2.a24-m4",
                    "uuid": "a81f46d4-7397-489b-a2a2-23d21fe0aeee",
                    "description": "Die Zutrittskontrolle und die Einbruchmeldung SOLLTEN durch Videoüberwachungsanlagen ergänzt werden. Eine Videoüberwachung SOLLTE in das gesamte Sicherheitskonzept eingebettet werden. Bei der Planung, Konzeption und eventuellen Auswertung von Videoaufzeichnungen MUSS der Datenschutzbeauftragte immer mit einbezogen werden. Die für eine Videoüberwachung benötigten zentralen Technikkomponenten SOLLTEN geschützt aufgestellt werden. Es SOLLTE regelmäßig überprüft werden, ob die Anlage korrekt funktioniert und ob die abgestimmten Blickwinkel eingehalten werden."
                  },
                  {
                    "statement-id": "inf.2.a24-m5",
                    "uuid": "5453c6e3-39a2-4050-86d7-c51ba7b49f78",
                    "description": "Ein hochauflösendes Videoüberwachungssystem ist mit dem Zutrittskontrollsystem gekoppelt. Wenn eine Zutrittskarte verwendet wird oder ein Einbruchalarm ausgelöst wird, zeichnen die relevanten Kameras automatisch in höherer Qualität auf und markieren das Ereignis. Das Videomaterial wird mit KI-basierter Analyse auf Anomalien (z. B. eine Person, die sich verdächtig lange in einem Bereich aufhält, zurückgelassene Objekte) überwacht."
                  }
                ]
              },
              {
                "uuid": "fbaa3e0c-d6cc-4029-80a3-34df51af41ed",
                "control-id": "GEB.3.3",
                "description": "Implementation for GEB.3.3 based on BSI INF.2.A6",
                "statements": [
                  {
                    "statement-id": "inf.2.a6-m1",
                    "uuid": "e4cd063f-c521-4618-98d0-4fbb906eaf74",
                    "description": "Die Tür zum Serverraum ist mit einem einfachen mechanischen Schloss gesichert. Schlüssel wurden an eine unbestimmte Anzahl von Personen ohne formale Dokumentation oder Rückgabeprozess ausgegeben."
                  },
                  {
                    "statement-id": "inf.2.a6-m2",
                    "uuid": "aa2cb073-c2fe-426b-a69e-b8fcd352f2c1",
                    "description": "Am Haupteingang des Rechenzentrums ist ein elektronisches Zutrittskontrollsystem (z. B. mit Kartenleser) installiert. Die Zutrittsprotokolle werden jedoch nicht regelmäßig oder nur bei einem konkreten Verdacht ausgewertet."
                  },
                  {
                    "statement-id": "inf.2.a6-m3",
                    "uuid": "fc3dc294-7df7-4090-ba1b-94e0ac462215",
                    "description": "Der Zutritt zum Rechenzentrum MUSS kontrolliert werden. Zutrittsrechte MÜSSEN gemäß der Vorgaben des Bausteins ORP.4 Identitäts- und Berechtigungsmanagement vergeben werden. Für im Rechenzentrum tätige Personen MUSS sichergestellt werden, dass diese keinen Zutritt zu IT-Systemen außerhalb ihres Tätigkeitsbereiches erhalten. Alle Zutrittsmöglichkeiten zum Rechenzentrum MÜSSEN mit Zutrittskontrolleinrichtungen ausgestattet sein. Jeder Zutritt zum Rechenzentrum MUSS von der Zutrittskontrolle individuell erfasst werden. Es MUSS regelmäßig kontrolliert werden, ob die Regelungen eingehalten werden. Die Anforderungen MÜSSEN in einem Konzept dokumentiert sein."
                  },
                  {
                    "statement-id": "inf.2.a6-m4",
                    "uuid": "5625bebb-8647-4c69-a1ac-6e0f94adedff",
                    "description": "Im Falle eines Serverraums SOLLTE geprüft werden, ob eine Überwachung aller Zutrittsmöglichkeiten sinnvoll ist. Für besonders schutzbedürftige Bereiche innerhalb des Rechenzentrums wird ein Zwei-Faktor-Authentisierungssystem (z.B. Karte + PIN) eingesetzt. Die Überprüfung der Zutrittsberechtigungen (Re-Zertifizierung) wird mindestens vierteljährlich durchgeführt."
                  },
                  {
                    "statement-id": "inf.2.a6-m5",
                    "uuid": "e761afb8-9ae0-4199-a592-001b383a0583",
                    "description": "Der Zutritt wird durch biometrische Merkmale in Kombination mit Personenschleusen (Mantraps) kontrolliert, um Tailgating (das unerlaubte Hindurchschlüpfen einer zweiten Person) wirksam zu verhindern. Die Zutrittsprotokolle werden in Echtzeit automatisiert auf anomale Muster (z.B. Zutritt zu ungewöhnlichen Zeiten, wiederholte abgelehnte Versuche) analysiert, und bei Verdacht werden Sicherheitsalarme ausgelöst."
                  }
                ]
              },
              {
                "uuid": "5e170f74-2942-4485-a4e2-b1a627436603",
                "control-id": "GEB.3.5",
                "description": "Implementation for GEB.3.5 based on BSI INF.2.A7",
                "statements": [
                  {
                    "statement-id": "inf.2.a7-m1",
                    "uuid": "d4df52fb-e71c-4ef1-9430-e3f07049068f",
                    "description": "Türen zum Serverraum werden aus Bequemlichkeit oft offengelassen oder mit Keilen blockiert, insbesondere während Wartungsarbeiten."
                  },
                  {
                    "statement-id": "inf.2.a7-m2",
                    "uuid": "295af0b5-6990-4e14-b3ed-dc0437b4d2af",
                    "description": "Türen und Fenster werden geschlossen gehalten, sind aber in Standardbauweise ausgeführt und bieten nur minimalen Widerstand gegen gewaltsames Eindringen. Ein Sichtschutz fehlt."
                  },
                  {
                    "statement-id": "inf.2.a7-m3",
                    "uuid": "666679e2-da26-4f79-9f0e-0d5ae8511835",
                    "description": "Alle Türen des Rechenzentrums MÜSSEN stets verschlossen gehalten werden. Fenster MÜSSEN möglichst schon bei der Planung vermieden werden. Falls sie doch vorhanden sind, MÜSSEN sie ebenso wie die Türen stets verschlossen gehalten werden. Türen und Fenster MÜSSEN einen dem Sicherheitsniveau angemessenen Schutz gegen Angriffe und Umgebungseinflüsse bieten. Sie MÜSSEN mit einem Sichtschutz versehen sein. Dabei MUSS beachtet werden, dass die bauliche Ausführung aller raumbildenden Elemente in Bezug auf die erforderliche Schutzwirkung gleichwertig sein muss."
                  },
                  {
                    "statement-id": "inf.2.a7-m4",
                    "uuid": "4201c7f6-5ee4-4eff-bde6-c6d925ec5cb2",
                    "description": "Türen und Fenster sind nach einer definierten Widerstandsklasse (z. B. RC 2 nach DIN EN 1627) zertifiziert. Es sind Türöffnungssensoren installiert, die überwacht werden und einen Alarm auslösen, wenn eine Tür zu lange offensteht (Tür-offen-Alarm)."
                  },
                  {
                    "statement-id": "inf.2.a7-m5",
                    "uuid": "18dcde09-a500-4299-94c6-7d090d3165aa",
                    "description": "Alle Hüllflächenelemente (Wände, Türen, Fenster) sind nach einer hohen Widerstandsklasse (z. B. RC 3 oder höher) zertifiziert. Zusätzlich sind Einbruchmeldeanlagen (z. B. Bewegungsmelder, Glasbruchsensoren) installiert und an eine zentrale Alarmanlage aufgeschaltet, die einen Einbruchsversuch detektiert und meldet."
                  }
                ]
              },
              {
                "uuid": "f683f13f-5ee7-4b2f-a786-c3464169f456",
                "control-id": "GEB.3.6",
                "description": "Implementation for GEB.3.6 based on BSI INF.2.A28",
                "statements": [
                  {
                    "statement-id": "inf.2.a28-m1",
                    "uuid": "2becba24-4770-40d3-9175-54160fe0b1f6",
                    "description": "Es werden Gefahrenmelder aus dem Consumer-Bereich (z.B. batteriebetriebene Rauchmelder aus dem Baumarkt) eingesetzt. Diese bieten keine ausreichende Zuverlässigkeit für ein Rechenzentrum."
                  },
                  {
                    "statement-id": "inf.2.a28-m2",
                    "uuid": "f3ec1607-497b-45ed-b5e4-f7f6a861797d",
                    "description": "Es ist eine kommerzielle, aber nicht nach VdS oder einer vergleichbaren Norm zertifizierte Gefahrenmeldeanlage installiert. Ihre Zuverlässigkeit und Sabotagesicherheit ist nicht nachgewiesen."
                  },
                  {
                    "statement-id": "inf.2.a28-m3",
                    "uuid": "ad5e55c4-2782-4622-bdda-6dd3a8494744",
                    "description": "Es wird eine Gefahrenmeldeanlage eingesetzt, deren Komponenten nach relevanten EN-Normen zertifiziert sind. Die Anlage bietet ein definiertes und nachvollziehbares Sicherheitsniveau."
                  },
                  {
                    "statement-id": "inf.2.a28-m4",
                    "uuid": "5090107c-1d18-4e0a-b8df-bb99eada6151",
                    "description": "Es wird eine nach VdS (Vertrauen durch Sicherheit) zertifizierte Gefahrenmeldeanlage der Klassen A oder B eingesetzt. Diese bieten eine höhere Zuverlässigkeit und einen besseren Schutz gegen Sabotage als nicht-zertifizierte Systeme."
                  },
                  {
                    "statement-id": "inf.2.a28-m5",
                    "uuid": "382e166a-2957-4b8f-9030-147026cab8fb",
                    "description": "Für Rechenzentrumsbereiche mit erhöhtem Schutzbedarf SOLLTEN ausschließlich Gefahrenmeldeanlagen der VdS-Klasse C (gemäß VdS-Richtlinie 2311) eingesetzt werden. Diese Klasse bietet das höchste Niveau an Sicherheit, Zuverlässigkeit und Sabotageschutz."
                  }
                ]
              },
              {
                "uuid": "3c7e85c0-5e72-4753-a2f2-b4b01373dce2",
                "control-id": "GEB.4.1",
                "description": "Implementation for GEB.4.1 based on BSI INF.2.A16",
                "statements": [
                  {
                    "statement-id": "inf.2.a16-m1",
                    "uuid": "7e17e887-ff95-400f-ad83-3ca596043ff5",
                    "description": "Es wird Komfort-Klimatisierung (übliche Büro-Klimaanlagen) eingesetzt, die nicht für den 24/7-Dauerbetrieb oder die hohe sensible Wärmelast von IT-Geräten ausgelegt ist. Dies führt oft zu Ausfällen und unzureichender Kühlung."
                  },
                  {
                    "statement-id": "inf.2.a16-m2",
                    "uuid": "6b8fa9dc-9e04-4a89-96dd-38e89c00e08a",
                    "description": "Ein dediziertes Präzisionsklimagerät ist installiert, es ist jedoch nur ein einzelnes Gerät ohne Redundanz (N-Konfiguration) vorhanden. Bei einem Ausfall dieses Geräts fällt die gesamte Kühlung aus."
                  },
                  {
                    "statement-id": "inf.2.a16-m3",
                    "uuid": "72454673-4910-4b93-af6d-c4d9cf7bd32d",
                    "description": "Es SOLLTE sichergestellt werden, dass im Rechenzentrum geeignete klimatische Bedingungen geschaffen und aufrechterhalten werden. Die Klimatisierung SOLLTE für das Rechenzentrum ausreichend dimensioniert sein."
                  },
                  {
                    "statement-id": "inf.2.a16-m4",
                    "uuid": "3b48e806-7603-4268-afb6-a113046fff9e",
                    "description": "Alle relevanten Werte (Temperatur, Feuchte) SOLLTEN ständig überwacht werden. Weicht ein Wert von der Norm ab, SOLLTE automatisch alarmiert werden. Die Klimaanlagen SOLLTEN in IT-Betriebsbereichen möglichst ausfallsicher, z.B. durch eine N+1 Redundanz, ausgelegt sein."
                  },
                  {
                    "statement-id": "inf.2.a16-m5",
                    "uuid": "65cd53b7-d85b-487f-bb70-eb0a2fa147db",
                    "description": "Ein vollständig redundantes (2N) Kühlsystem ist im Einsatz, das oft unterschiedliche Technologien kombiniert (z. B. Kaltwassersatz und Direktverdampfung). Zur Maximierung der Effizienz ist eine Kaltgang- oder Warmgangeinhausung implementiert. Das gesamte System wird von einer DCIM-Plattform basierend auf Echtzeit-Temperaturdaten auf Rack-Ebene dynamisch gesteuert."
                  }
                ]
              },
              {
                "uuid": "328a5c20-239b-4a7a-bd7c-9e30988e8a3f",
                "control-id": "GEB.4.1.2",
                "description": "Implementation for GEB.4.1.2 based on BSI INF.2.A5",
                "statements": [
                  {
                    "statement-id": "inf.2.a5-m1",
                    "uuid": "eafed905-b94d-41cf-a7f4-7022cf12372b",
                    "description": "Es ist eine Klimatisierung vorhanden, diese wird jedoch nicht überwacht. Die Temperatur wird nur sporadisch und manuell (z.B. durch Fühlen) kontrolliert, ohne systematische Erfassung."
                  },
                  {
                    "statement-id": "inf.2.a5-m2",
                    "uuid": "186cdddd-ca80-44ba-8607-88c8af68b9b3",
                    "description": "Temperatur und Luftfeuchtigkeit werden durch Sensoren überwacht, es gibt jedoch keine automatisierte Aufzeichnung der Werte oder eine Alarmierung bei Grenzwertüberschreitungen. Die Werte müssen manuell von einem Display abgelesen werden."
                  },
                  {
                    "statement-id": "inf.2.a5-m3",
                    "uuid": "be387529-a722-4dbe-9c85-a23c71705687",
                    "description": "Es MUSS sichergestellt werden, dass die Lufttemperatur und Luftfeuchtigkeit im IT-Betriebsbereich innerhalb der von den Herstellern vorgeschriebenen Grenzwerte liegen. Die tatsächliche Wärmelast in den gekühlten Bereichen MUSS in regelmäßigen Abständen überprüft werden. Eine vorhandene Klimatisierung MUSS regelmäßig gewartet werden. Die Parameter Temperatur und Feuchtigkeit MÜSSEN mindestens so aufgezeichnet werden, dass sich rückwirkend erkennen lässt, ob Grenzwerte überschritten wurden."
                  },
                  {
                    "statement-id": "inf.2.a5-m4",
                    "uuid": "ee5571f0-087d-4b41-acb3-2d174a7ec820",
                    "description": "Es ist eine automatische Alarmierung bei jeder Abweichung von den definierten Schwellenwerten für Temperatur und Luftfeuchtigkeit eingerichtet. Die aufgezeichneten Daten werden regelmäßig analysiert, um Trends zu erkennen und die Kühlleistung proaktiv anzupassen, bevor es zu Problemen kommt."
                  },
                  {
                    "statement-id": "inf.2.a5-m5",
                    "uuid": "d3604eec-f4c6-42dd-9f4f-65c7f6b238da",
                    "description": "Ein hochentwickeltes Umgebungsüberwachungssystem mit Sensoren an mehreren strategischen Punkten (z. B. Lufteinlass und -auslass jedes Racks, im Kalt- und Warmgang) ist im Einsatz. Das System ist in ein Gebäudemanagementsystem (GMS) oder DCIM (Data Center Infrastructure Management) integriert und ermöglicht die automatisierte, dynamische Steuerung und Optimierung der Kühlsysteme, beispielsweise durch Kaltgangeinhausung."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}