{
  "component-definition": {
    "uuid": "3b18c2b2-985c-4ccc-8d38-a997436bfda7",
    "metadata": {
      "title": "INF.6 Datenträgerarchiv - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:08:00.839892+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "9b7e26c8-b8d2-4ead-b862-81322c7e0540",
        "type": "physical",
        "title": "INF.6 Datenträgerarchiv",
        "description": "This component represents the implementation of all controls for Baustein INF.6.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Datenträgerarchive sind abgeschlossene Räumlichkeiten innerhalb einer Institution, in denen Datenträger jeder Art gelagert werden. Dazu gehören neben Datenträgern, auf denen digitale Informationen abgespeichert sind, auch Papierdokumente, Filme oder sonstige Medien."
          },
          {
            "name": "Zielsetzung",
            "value": "In diesem Baustein werden die typischen Gefährdungen und Anforderungen bezüglich der Informationssicherheit für ein Datenträgerarchiv beschrieben. Ziel ist der Schutz der Informationen, die sich auf den dort archivierten Datenträgern und weiteren Medien befinden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein INF.6 Datenträgerarchiv ist für alle Räume anzuwenden, die als Archiv von Datenträgern genutzt werden.\nDieser Baustein betrachtet technische und nichttechnische Sicherheitsanforderungen für Datenträgerarchive. Empfehlungen zur korrekten Archivierung werden in diesem Baustein nicht behandelt. Hinweise dazu finden sich im Baustein OPS.1.2.2 Archivierung.\nIm Rahmen des IT-Grundschutzes werden an die Archivräume hinsichtlich des Brandschutzes keine erhöhten Anforderungen gestellt. Zusätzliche Anforderungen an den Brandschutz können aber durch die Behältnisse erfüllt werden, in denen die Datenträger aufbewahrt werden."
          },
          {
            "name": "2.1. Unzulässige Temperatur und Luftfeuchtigkeit",
            "value": "Bei der Lagerung von digitalen Langzeitspeichermedien können Temperaturschwankungen oder zu hohe Luftfeuchtigkeit zu Datenfehlern und reduzierter Speicherdauer führen."
          },
          {
            "name": "2.2. Fehlende oder unzureichende Regelungen",
            "value": "Wenn Mitarbeitende die Fenster und Türen nach Verlassen des Datenträgerarchivs nicht schließen oder verschließen, können Datenträger oder andere Informationen entwendet werden. Sensible Informationen könnten dann von unberechtigten Personen eingesehen oder weitergegeben werden. Wenn Mitarbeitenden die entsprechenden Regelungen nicht hinreichend bekannt sind, können Sicherheitslücken auftreten. Regelungen lediglich festzulegen ist nicht ausreichend. Sie müssen beachtet werden, damit der Betrieb störungsfrei ist. Viele Probleme entstehen, wenn Regelungen zwar vorhanden, aber nicht bekannt sind."
          },
          {
            "name": "2.3. Unbefugter Zutritt zu schutzbedürftigen Räumen",
            "value": "Fehlen Zutrittskontrollen oder sind diese unzureichend, können unberechtigte Personen ein Datenträgerarchiv betreten und schützenswerte Informationen einsehen, entwenden oder manipulieren. Dadurch kann die Verfügbarkeit, Vertraulichkeit und Integrität der archivierten Informationen beeinträchtigt werden. Selbst wenn keine unmittelbaren Schäden zu erkennen sind, kann der Betriebsablauf gestört werden."
          },
          {
            "name": "2.4. Diebstahl",
            "value": "Da viele Datenträger sehr handlich sind, ist es umso leichter, sie unbemerkt in eine Tasche oder unter die Kleidung zu stecken und mitzunehmen. Gibt es keine Kopien von den Informationen, sind die auf den gestohlenen Datenträgern abgespeicherten Informationen verloren. Darüber hinaus könnten die Personen, die Datenträger entwendet haben, vertrauliche Informationen einsehen und offenlegen. Dadurch können weitere Schäden entstehen. Diese wiegen in den meisten Fällen deutlich schwerer als die Kosten von ersatzweise angeschafften Datenträgern."
          }
        ],
        "control-implementations": [
          {
            "uuid": "74b20d25-48ae-4fc2-8569-8453e24d8132",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/datentrgerarchiv_profile.json",
            "description": "Implementation for all controls in Baustein INF.6",
            "implemented-requirements": [
              {
                "uuid": "05beee35-b730-4a5c-a574-dec1f249751a",
                "control-id": "GEB.11.1",
                "description": "Implementation for GEB.11.1 based on BSI INF.6.A1",
                "statements": [
                  {
                    "statement-id": "INF.6.A1-m1",
                    "uuid": "13973bf6-ab8d-4786-b755-9f5a429d1deb",
                    "description": "Es ist nur ein einziger Handfeuerlöscher vorhanden, dessen Standort nicht allen relevanten Mitarbeitenden bekannt ist. Es finden keine regelmäßigen Inspektionen oder Schulungen statt."
                  },
                  {
                    "statement-id": "INF.6.A1-m2",
                    "uuid": "52885335-8b94-455d-8241-2d59186bb2e9",
                    "description": "Geeignete Handfeuerlöscher sind an mehreren strategischen Punkten im und am Datenträgerarchiv platziert. Die Wartungsintervalle werden jedoch nur unregelmäßig eingehalten. Eine grundlegende Einweisung in die Benutzung wird auf Nachfrage erteilt."
                  },
                  {
                    "statement-id": "INF.6.A1-m3",
                    "uuid": "160c2b18-e87d-4bbf-9d05-060793dd0da6",
                    "description": "Im Brandfall MÜSSEN im Datenträgerarchiv geeignete Handfeuerlöscher leicht erreichbar sein. Diese Handfeuerlöscher MÜSSEN regelmäßig inspiziert und gewartet werden. Mitarbeitende, die in der Nähe eines Datenträgerarchivs tätig sind, MÜSSEN in die Benutzung der Handfeuerlöscher eingewiesen werden."
                  },
                  {
                    "statement-id": "INF.6.A1-m4",
                    "uuid": "2fae1645-d7d4-4677-8be6-8910bd5f418a",
                    "description": "Zusätzlich zu den definierten Maßnahmen sind automatische Brandmelder (z.B. Rauchmelder) installiert, die an eine interne Alarmierungsstelle gekoppelt sind. Die Art der Feuerlöscher ist spezifisch auf die gelagerten Medien abgestimmt (z.B. CO2-Löscher, um Schäden an Elektronik zu vermeiden)."
                  },
                  {
                    "statement-id": "INF.6.A1-m5",
                    "uuid": "bb94a7f2-518c-405c-8e01-fc2b9b3ab23a",
                    "description": "Es ist eine automatische, für IT-Medien unschädliche Gaslöschanlage installiert. Die Anlage wird regelmäßig geprüft und ist an das zentrale Sicherheitsmanagementsystem gekoppelt, um im Alarmfall sofortige Reaktionen und eine automatische Abschaltung von Lüftungsanlagen auszulösen."
                  }
                ]
              },
              {
                "uuid": "d58e0db0-4792-48ab-a697-cc4096c449ff",
                "control-id": "GEB.11.1.6",
                "description": "Implementation for GEB.11.1.6 based on BSI INF.6.A9",
                "statements": [
                  {
                    "statement-id": "INF.6.A9-m2",
                    "uuid": "0183d777-b5b1-4f0d-ab4d-2f0d081b4c29",
                    "description": "Es sind batteriebetriebene Standalone-Rauchmelder sowie ein einfacher Tür-Magnetkontakt installiert, der bei Öffnung einen lokalen Alarm (Sirene) auslöst."
                  },
                  {
                    "statement-id": "INF.6.A9-m3",
                    "uuid": "1bbbd269-b1aa-4fa1-8e93-32f4dc7bb7c1",
                    "description": "Es SOLLTE in Datenträgerarchiven eine angemessene Gefahrenmeldeanlage eingerichtet werden. Diese Gefahrenmeldeanlage SOLLTE regelmäßig geprüft und gewartet werden. Es SOLLTE sichergestellt sein, dass diejenigen Personen, die Gefahrenmeldungen empfangen, in der Lage sind, auf Alarmmeldungen angemessen zu reagieren."
                  },
                  {
                    "statement-id": "INF.6.A9-m4",
                    "uuid": "c1f9b691-dcde-4af2-8a9c-750f2405f23a",
                    "description": "Es ist eine integrierte Gefahrenmeldeanlage installiert, die Einbruch (Öffnungs- und Bewegungsmelder), Brand (Rauch- und Wärmemelder) sowie Wassereinbruch abdeckt. Die Anlage ist auf eine 24/7 besetzte Sicherheitsleitstelle (intern oder extern) aufgeschaltet. Die Reaktionsprozeduren sind detailliert dokumentiert und werden regelmäßig geübt."
                  },
                  {
                    "statement-id": "INF.6.A9-m5",
                    "uuid": "b77a02d7-5549-4c75-b3b2-34520d465917",
                    "description": "Die Gefahrenmeldeanlage ist nach VdS-Klasse C zertifiziert. Sie integriert multiple, redundante Sensortypen (z.B. Lichtschranken, Körperschallsensoren, Brandfrühesterkennung durch Rauchansaugsysteme). Alarme werden automatisch mit den Aufzeichnungen der Videoüberwachungsanlage korreliert und dem Interventionspersonal bereitgestellt. Die Integrität der Anlage und ihrer Kommunikationswege wird permanent überwacht (Sabotageschutz)."
                  }
                ]
              },
              {
                "uuid": "85fe46e9-b61a-4a27-b87d-babfa05c39ca",
                "control-id": "GEB.11.2",
                "description": "Implementation for GEB.11.2 based on BSI INF.6.A6",
                "statements": [
                  {
                    "statement-id": "INF.6.A6-m1",
                    "uuid": "b4668d36-0873-4072-92c2-9b911e21cb7e",
                    "description": "Die Existenz von wasserführenden Leitungen im oder über dem Archivraum ist bekannt, es werden jedoch keine spezifischen Schutzmaßnahmen ergriffen."
                  },
                  {
                    "statement-id": "INF.6.A6-m2",
                    "uuid": "eeb8ef00-35fc-4014-966a-c3e71665ec7a",
                    "description": "Wasserführende Leitungen werden im Rahmen von allgemeinen, regelmäßigen Gebäudebegehungen visuell auf Dichtigkeit und Korrosion überprüft."
                  },
                  {
                    "statement-id": "INF.6.A6-m3",
                    "uuid": "8f1887d1-39e4-45d4-a2ba-2454d23c4329",
                    "description": "In Datenträgerarchiven SOLLTEN unnötige wasserführende Leitungen generell vermieden werden. Sind dennoch Wasserleitungen durch das Datenträgerarchiv hinweg verlegt, SOLLTEN diese regelmäßig daraufhin überprüft werden, ob sie noch dicht sind. Zudem SOLLTEN Vorkehrungen getroffen werden, um frühzeitig erkennen zu können, ob dort Wasser austritt. Für ein Datenträgerarchiv mit Hochverfügbarkeitsanforderungen SOLLTE es Reaktionspläne geben, die genau vorgeben, wie im Fall eines Lecks vorzugehen ist."
                  },
                  {
                    "statement-id": "INF.6.A6-m4",
                    "uuid": "f3404925-9640-46e2-b135-1398b657de53",
                    "description": "Am Boden des Archivraums sind Wassermelder installiert, die an eine Alarmierungsanlage gekoppelt sind. Die Leitungen sind, wo möglich, mit einer sekundären Abdichtung oder Auffangwannen versehen."
                  },
                  {
                    "statement-id": "INF.6.A6-m5",
                    "uuid": "55601b4a-361f-4c9a-981a-968f7d62c1ff",
                    "description": "Ein automatisches Absperrventil, das mit den Wassermeldern gekoppelt ist, ist am Eintrittspunkt der wasserführenden Leitungen in den Bereich des Archivs installiert. Die Alarmierung erfolgt an eine 24/7 besetzte Stelle. Die Reaktionspläne sind detailliert und werden mindestens jährlich unter realistischen Bedingungen geübt."
                  }
                ]
              },
              {
                "uuid": "67e66e8c-0da0-462e-8584-615f11e932d3",
                "control-id": "GEB.3.3",
                "description": "Implementation for GEB.3.3 based on BSI INF.6.A2",
                "statements": [
                  {
                    "statement-id": "INF.6.A2-m1",
                    "uuid": "c868e9cf-0781-40ed-91be-8265ca85073a",
                    "description": "Der Zutritt zum Archivraum wird durch ein einfaches Standardschloss gesichert. Eine Liste der Schlüsselbesitzer existiert, wird aber nicht regelmäßig aktualisiert oder auf Notwendigkeit geprüft."
                  },
                  {
                    "statement-id": "INF.6.A2-m2",
                    "uuid": "65912946-1eb0-403f-9768-056d73eb47c1",
                    "description": "Es ist ein Sicherheitsschloss installiert. Der Zutritt ist auf eine definierte Personengruppe beschränkt und in einer Richtlinie festgelegt, es findet jedoch keine Protokollierung der Zutritte statt."
                  },
                  {
                    "statement-id": "INF.6.A2-m3",
                    "uuid": "b068c702-d625-4ebb-818f-c01b32b96e65",
                    "description": "Der Zutritt zum Datenträgerarchiv DARF NUR für befugte Personen möglich sein. Der Zutritt MUSS auf ein Mindestmaß an Mitarbeitenden reduziert sein. Daher MUSS der Zutritt geregelt und kontrolliert werden. Für die Zutrittskontrolle MUSS ein Konzept entwickelt werden. Die darin festgelegten Maßnahmen für die Zutrittskontrolle SOLLTEN regelmäßig daraufhin überprüft werden, ob sie noch wirksam sind. Der komplette Raum MUSS einen dem Schutzbedarf genügenden mechanischen Widerstand aufweisen, der keinesfalls unter RC2 (gemäß DIN EN 1627) liegen darf."
                  },
                  {
                    "statement-id": "INF.6.A2-m4",
                    "uuid": "241dcbae-5eda-4718-844a-51d3914d0856",
                    "description": "Es wird ein elektronisches Zutrittskontrollsystem (z. B. Kartenleser) eingesetzt, das alle Zutrittsversuche (sowohl erfolgreich als auch fehlgeschlagen) protokolliert. Die Protokolle werden regelmäßig, mindestens monatlich, auf Anomalien überprüft. Die mechanische Widerstandsfähigkeit des Raumes wird auf RC3 erhöht."
                  },
                  {
                    "statement-id": "INF.6.A2-m5",
                    "uuid": "c539fcbc-0406-4109-9072-ee5db6e82c90",
                    "description": "Für den Zutritt wird ein Zwei-Faktor-Authentifizierungssystem (z. B. Karte und PIN oder Biometrie) verwendet. Das Zutrittskontrollsystem ist mit einer Videoüberwachung gekoppelt, die bei jedem Zutrittsversuch eine Aufzeichnung startet. Eine Einbruchmeldeanlage mit Aufschaltung auf einen Wachdienst sichert den Raum außerhalb der Geschäftszeiten."
                  }
                ]
              },
              {
                "uuid": "1c7fcb5d-35e4-42c0-87ca-cb28dfd9c007",
                "control-id": "GEB.3.5",
                "description": "Implementation for GEB.3.5 based on BSI INF.6.A8",
                "statements": [
                  {
                    "statement-id": "INF.6.A8-m2",
                    "uuid": "cf488e85-d0a6-4dfd-8b31-47bf18ac5ed5",
                    "description": "Die Tür des Archivs ist eine Vollholztür mit einem Sicherheitsschließblech und einem Schloss mit Aufbohrschutz. Eventuell vorhandene Fenster sind abschließbar und nicht im Erdgeschoss."
                  },
                  {
                    "statement-id": "INF.6.A8-m3",
                    "uuid": "b4565aa1-22ab-456c-928b-e169a7cec355",
                    "description": "Sicherungsmaßnahmen wie Fenster, Türen und Wände SOLLTEN bezüglich Einbruch, Brand und Rauch gleichwertig und angemessen sein. Abhängig vom Schutzbedarf SOLLTE eine geeignete Widerstandsklasse gemäß der DIN EN 1627 erfüllt werden. Alle Sicherheitstüren und -fenster SOLLTEN regelmäßig daraufhin überprüft werden, ob sie noch entsprechend funktionieren. Der komplette Raum SOLLTE einen dem Schutzbedarf genügenden mechanischen Widerstand aufweisen, der keinesfalls unter RC3 (gemäß DIN EN 1627) liegt."
                  },
                  {
                    "statement-id": "INF.6.A8-m4",
                    "uuid": "dfa1b4bb-17fe-4929-9ffa-ab18297b08a1",
                    "description": "Alle Komponenten des Raumes (Türen, Fenster, Wände, Decke, Boden) sind nachweislich nach der Widerstandsklasse RC4 gemäß DIN EN 1627 zertifiziert. Zusätzlich sind alle Öffnungen mit Einbruchmeldesensoren (z.B. Magnetkontakte, Glasbruchsensoren) ausgestattet, die Teil einer Einbruchmeldeanlage sind."
                  },
                  {
                    "statement-id": "INF.6.A8-m5",
                    "uuid": "a170d3b9-f9e5-419f-8124-94a7ac29680b",
                    "description": "Der Archivraum ist als zertifiziertes Raum-in-Raum-System (modularer Wertschutzraum) mit einer Widerstandsklasse von RC5 oder höher ausgeführt. Alle Öffnungen werden nicht nur durch Öffnungs- und Glasbruchsensoren, sondern zusätzlich durch Körperschallsensoren an Wänden und Decke überwacht. Die Einbruchmeldeanlage hat eine VdS-Klasse C Zertifizierung."
                  }
                ]
              },
              {
                "uuid": "7a2a7f1c-79be-4611-9605-c3ea318fd623",
                "control-id": "GEB.4.1",
                "description": "Implementation for GEB.4.1 based on BSI INF.6.A7",
                "statements": [
                  {
                    "statement-id": "INF.6.A7-m1",
                    "uuid": "6b43ae1e-b8bd-4387-8d51-86039d8ab3fb",
                    "description": "Im Raum ist ein Thermometer angebracht. Die Werte werden gelegentlich abgelesen, es gibt jedoch keine definierten Sollwerte oder systematische Protokollierung."
                  },
                  {
                    "statement-id": "INF.6.A7-m2",
                    "uuid": "97f21093-2a6d-4b6f-9a10-65783a2d4dcb",
                    "description": "Eine einfache Klimaanlage ist installiert, um die Temperatur im Sommer zu regulieren. Die Temperatur und Luftfeuchtigkeit werden täglich manuell in einer Liste protokolliert."
                  },
                  {
                    "statement-id": "INF.6.A7-m3",
                    "uuid": "b5552415-f78f-4a95-af3b-6c465d5389dc",
                    "description": "Es SOLLTE sichergestellt werden, dass die zulässigen Höchst- und Tiefstwerte für Temperatur und Luftfeuchtigkeit sowie der Schwebstoffanteil in der Raumluft im Datenträgerarchiv eingehalten werden. Die Werte von Lufttemperatur und -feuchte SOLLTEN mehrmals im Jahr für die Dauer von einer Woche aufgezeichnet und dokumentiert werden. Dabei festgestellte Abweichungen vom Sollwert SOLLTEN zeitnah behoben werden. Die eingesetzten Klimageräte SOLLTEN regelmäßig gewartet werden."
                  },
                  {
                    "statement-id": "INF.6.A7-m4",
                    "uuid": "df22543b-ce44-4ea7-9288-3efa15a06d3b",
                    "description": "Ein permanentes Umgebungsmonitoring-System ist installiert, das Temperatur und Luftfeuchtigkeit kontinuierlich aufzeichnet. Das System versendet automatisch Warnungen per E-Mail oder SMS, wenn vordefinierte Schwellenwerte über- oder unterschritten werden. Es sind redundante Klimageräte vorhanden."
                  },
                  {
                    "statement-id": "INF.6.A7-m5",
                    "uuid": "8ce73505-d8d7-4589-bbaa-a828bb3d9b45",
                    "description": "Das Umgebungsmonitoring-System ist vollständig in das Gebäudeleitsystem integriert. Die Klimaregelung ist vollautomatisiert, mit redundanten Einheiten, die ein sofortiges Failover ermöglichen. Historische Daten werden analysiert, um den Wartungsbedarf vorherzusagen und den Energieverbrauch zu optimieren."
                  }
                ]
              },
              {
                "uuid": "267da778-d814-4451-acf8-1b46a11e3f0d",
                "control-id": "GEB.9.1",
                "description": "Implementation for GEB.9.1 based on BSI INF.6.A5",
                "statements": [
                  {
                    "statement-id": "INF.6.A5-m1",
                    "uuid": "93fc6680-bb54-4593-a899-6ca12bc72fcd",
                    "description": "Nur einige besonders sensible Datenträger werden in einem abschließbaren Büroschrank aufbewahrt. Der Großteil der Medien lagert auf offenen Regalen."
                  },
                  {
                    "statement-id": "INF.6.A5-m2",
                    "uuid": "a12eb111-8888-4878-baf7-1d2fe622d9e2",
                    "description": "Alle Datenträger und Medien werden in standardmäßigen, abschließbaren Büroschränken aus Stahlblech gelagert."
                  },
                  {
                    "statement-id": "INF.6.A5-m3",
                    "uuid": "e1e9712e-2b7b-4c3a-ae59-f47881127ea3",
                    "description": "Die Datenträger und Medien in Datenträgerarchiven SOLLTEN in geeigneten Schutzschränken gelagert werden."
                  },
                  {
                    "statement-id": "INF.6.A5-m4",
                    "uuid": "00087848-0740-4f37-9ea9-0db3edae10d6",
                    "description": "Es werden Schutzschränke mit zertifiziertem Feuerschutz (z.B. S 60 DIS oder S 120 DIS nach EN 1047-1) für digitale Datenträger verwendet. Der Zugriff auf die Schränke ist ebenfalls geregelt und wird protokolliert."
                  },
                  {
                    "statement-id": "INF.6.A5-m5",
                    "uuid": "690f2dd0-a9e2-43f3-9738-e167caf86c7a",
                    "description": "Es werden hochsichere Wertschutzschränke verwendet, die sowohl einen hohen Einbruchschutz (z.B. Widerstandsgrad III nach EN 1143-1) als auch einen zertifizierten Feuerschutz bieten. Zusätzlich sind die Schränke klimatisiert oder enthalten Trockenmittel, um eine optimale Luftfeuchtigkeit für die Langzeitlagerung zu gewährleisten."
                  }
                ]
              },
              {
                "uuid": "915f0412-8e91-403a-b479-e9c4aaae0b10",
                "control-id": "GEB.9.2",
                "description": "Implementation for GEB.9.2 based on BSI INF.6.A3",
                "statements": [
                  {
                    "statement-id": "INF.6.A3-m1",
                    "uuid": "8da23ee2-346b-4f43-be11-ea32a020401b",
                    "description": "Der Raum wird gelegentlich im Rahmen der allgemeinen Büroreinigung gesäubert. Ein Rauchverbot ist in der allgemeinen Hausordnung erwähnt, wird aber für das Archiv nicht explizit durchgesetzt."
                  },
                  {
                    "statement-id": "INF.6.A3-m2",
                    "uuid": "c26ba9ef-b474-4507-8532-07ad2361f8f7",
                    "description": "Es existieren regelmäßige Reinigungspläne für das Archiv. Ein striktes Rauch-, Ess- und Trinkverbot ist durch Schilder am Eingang gekennzeichnet und wird im Allgemeinen befolgt. Datenträger werden in einfachen Kunststoffboxen gelagert, um sie vor direktem Staub zu schützen."
                  },
                  {
                    "statement-id": "INF.6.A3-m3",
                    "uuid": "37b53d73-b733-4dcd-a7da-29697b23cfde",
                    "description": "Es MUSS sichergestellt werden, dass die Datenträger im Datenträgerarchiv ausreichend vor Staub und Verschmutzung geschützt sind. Die Anforderungen dafür MÜSSEN bereits in der Planungsphase analysiert werden. Es MUSS in Datenträgerarchiven ein striktes Rauchverbot eingehalten werden."
                  },
                  {
                    "statement-id": "INF.6.A3-m4",
                    "uuid": "f582fe78-c5f3-4444-a1ac-657ae831c60c",
                    "description": "Der Archivraum ist mit einem dedizierten Luftfiltersystem ausgestattet, um Schwebstoffe zu kontrollieren. Datenträger werden in versiegelten, antistatischen Spezialbehältern aufbewahrt. Der Raum wird in einem leichten Überdruck zum Rest des Gebäudes gehalten."
                  },
                  {
                    "statement-id": "INF.6.A3-m5",
                    "uuid": "a926ded6-860e-4287-958d-7efb9a8273d4",
                    "description": "Das Archiv ist als Reinraumumgebung mit Partikelschleuse, positivem Luftdruck und einem HEPA-Filtersystem (High-Efficiency Particulate Air) ausgelegt. Die Umgebungsparameter, einschließlich der Partikelkonzentration in der Luft, werden kontinuierlich überwacht und protokolliert."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}