{
  "component-definition": {
    "uuid": "d7aaf88c-c92a-4253-a18e-9818afc33c45",
    "metadata": {
      "title": "INF.8 Räume - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:08:00.937493+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "9de04c41-e9bb-4fcb-a77d-6e3fa21ec86a",
        "type": "physical",
        "title": "INF.8 Räume",
        "description": "This component represents the implementation of all controls for Baustein INF.8.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Telearbeitende, freie Mitarbeitende oder Selbstständige arbeiten typischerweise von häuslichen Arbeitsplätzen aus. Im Gegensatz zum Arbeitsplatz im Büro nutzen diese Mitarbeitenden einen Arbeitsplatz in der eigenen Immobilie. Dabei muss ermöglicht werden, dass die berufliche Umgebung hinreichend von der privaten getrennt ist. Wenn Mitarbeitende häusliche Arbeitsplätze dauerhaft benutzen, müssen zudem diverse rechtliche Anforderungen erfüllt sein, beispielsweise müssen die Arbeitsplätze arbeitsmedizinischen und ergonomischen Bestimmungen entsprechen.\nBei einem häuslichen Arbeitsplatz kann nicht die gleiche infrastrukturelle Sicherheit vorausgesetzt werden, wie sie in den Büroräumen einer Institution anzutreffen ist. So ist z. B. der Arbeitsplatz oft auch für Besuch oder Familienangehörige zugänglich. Deshalb müssen Maßnahmen ergriffen werden, mit denen sich ein Sicherheitsniveau erreichen lässt, das mit einem Büroraum vergleichbar ist."
          },
          {
            "name": "Zielsetzung",
            "value": "In diesem Baustein wird aufgezeigt, wie sich die Infrastruktur eines häuslichen Arbeitsplatzes sicher aufbauen und betreiben lässt. Kernziel des Bausteins ist der Schutz der Informationen der Institution am häuslichen Arbeitsplatz."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein INF.8 Häuslicher Arbeitsplatz ist für alle Räume anzuwenden, die als Telearbeitsplatz genutzt werden.\nDer Baustein enthält grundsätzliche Anforderungen, die zu beachten und zu erfüllen sind, um den Gefährdungen für einen häuslichen Arbeitsplatz entgegenwirken zu können. Dabei werden jedoch nur spezifische Anforderungen an die Infrastruktur für einen ortsfesten Arbeitsplatz mit Zugang durch Dritte definiert. Sicherheitsanforderungen für die eingesetzten IT-Systeme, z. B. Clients und Multifunktionsgeräte und insbesondere für die technischen Anteile der Telearbeit, z. B. Kommunikationsverbindungen, sind dagegen nicht Gegenstand des vorliegenden Bausteins. Sie werden im Baustein OPS.1.2.4 Telearbeit bzw. in den jeweiligen systemspezifischen Bausteinen beschrieben."
          },
          {
            "name": "2.1. Fehlende oder unzureichende Regelungen für den häuslichen Arbeitsplatz",
            "value": "Da ein häuslicher Arbeitsplatz außerhalb der Institution liegt, sind die Mitarbeitenden dort weitgehend auf sich allein gestellt. Dadurch können durch fehlende oder unzureichende Regelungen für das häusliche Arbeitsplatzumfeld IT-Probleme mit höheren Ausfallzeiten entstehen. Wenn IT-Probleme nicht per Fernadministration geklärt werden können, muss beispielsweise eine Person vom IT-Betrieb aus der Institution erst zum häuslichen Arbeitsplatz fahren, um dort die Probleme zu beseitigen. Wenn der Umgang mit internen und vertraulichen Informationen am häuslichen Arbeitsplatz nicht nachvollziehbar geregelt ist, könnten Mitarbeitende solche Informationen falsch aufbewahren. Wenn nicht verhindert werden kann, dass Informationen ausgespäht oder modifiziert werden, kann die Vertraulichkeit und Integrität der Informationen gefährdet sein."
          },
          {
            "name": "2.2. Unbefugter Zutritt zu schutzbedürftigen Räumen des häuslichen Arbeitsplatzes",
            "value": "Räume eines häuslichen Arbeitsplatzes, in denen schutzbedürftige Informationen aufbewahrt und weiterverarbeitet werden oder in denen schutzbedürftige Geräte aufbewahrt oder betrieben werden, werden dadurch zu schutzbedürftigen Räumen. Wenn unbefugte Personen diese Räume unbeaufsichtigt betreten können, ist die Vertraulichkeit, Integrität und Verfügbarkeit dieser Daten und Informationen erheblich gefährdet.\nBeispiele:\n• Ein Heimarbeitsplatz befindet sich zwar in einem separaten Arbeitszimmer, ist aber nicht konsequent abgeschlossen. Als kleine Kinder kurz unbeaufsichtigt waren, spielten sie in dem nicht verschlossenen Arbeitszimmer. Dabei wurden wichtige Dokumente als Malgrundlage verwendet.\n• Als eine Person am häuslichen Arbeitsplatz in eine Projektarbeit vertieft war, traf überraschend Besuch ein. Während die Person in der Küche Kaffee kochte, wollte der Besuch am nicht gesperrten Client schnell etwas im Internet recherchieren und hat diesen dabei versehentlich mit Schadsoftware infiziert."
          },
          {
            "name": "2.3. Beeinträchtigung der IT-Nutzung durch ungünstige Arbeitsbedingungen am häuslichen Arbeitsplatz",
            "value": "Ein nicht nach ergonomischen Gesichtspunkten eingerichteter häuslicher Arbeitsplatz oder ein ungünstiges Arbeitsumfeld können dazu führen, dass dort nicht ungestört gearbeitet werden kann. Auch die verwendete IT kann möglicherweise nicht oder nicht optimal benutzt werden. Ungünstig auswirken können sich etwa Lärm, Störungen durch Familienmitglieder sowie eine schlechte Beleuchtung oder Belüftung. Dadurch werden Arbeitsabläufe und Potenziale der Mitarbeitenden eingeschränkt. Es könnten sich bei der Arbeit auch Fehler einschleichen. Außerdem kann der Schutz der Integrität von Daten vermindert werden."
          },
          {
            "name": "2.4. Ungesicherter Akten- und Datenträgertransport",
            "value": "Wenn Dokumente, Datenträger oder Akten zwischen der Institution und dem häuslichen Arbeitsplatz transportiert werden, können diese Daten und Informationen verlorengehen. Auch könnten sie von unbefugten Dritten entwendet, gelesen oder manipuliert werden. Der Akten- und Datenträgertransport kann auf verschiedene Arten unzureichend gesichert sein:\n• Werden Unikate transportiert und fehlt ein entsprechendes Backup, können Ziele und Aufgaben nicht wie geplant erreicht werden, wenn das Unikat verlorengeht.\n• Fallen unverschlüsselte Datenträger in falsche Hände, kann das zu einem schwerwiegenden Verlust der Vertraulichkeit führen.\n• Wenn unterwegs kein ausreichender Zugriffsschutz vorhanden ist, können Akten oder Datenträger unbemerkt kopiert oder manipuliert werden."
          },
          {
            "name": "2.5. Ungeeignete Entsorgung der Datenträger und Dokumente",
            "value": "Ist es am häuslichen Arbeitsplatz nicht möglich, Datenträger und Dokumente in geeigneter Weise zu entsorgen, könnten sie einfach in den Hausmüll geworfen werden. Hieraus können jedoch wertvolle Informationen gewonnen werden, die sich gezielt für Erpressungsversuche oder zur Wirtschaftsspionage missbrauchen lassen. Die Folgen reichen vom Wissensverlust bis zur Existenzgefährdung der Institution, z. B. wenn dadurch wichtige Aufträge nicht zustande kommen oder geschäftliche Partnerschaften scheitern."
          },
          {
            "name": "2.6. Manipulation oder Zerstörung von IT, Zubehör, Informationen und Software am häuslichen Arbeitsplatz",
            "value": "IT-Geräte, Zubehör, Informationen und Software, die am häuslichen Arbeitsplatz benutzt werden, können unter Umständen einfacher manipuliert oder zerstört werden als in der Institution. Der häusliche Arbeitsplatz ist oft für Angehörige und Besuch der Familie zugänglich. Auch sind hier die zentralen Schutzmaßnahmen der Institution nicht vorhanden, zum Beispiel Pfortendienste. Wenn IT-Geräte, Zubehör, Informationen oder Software manipuliert oder zerstört werden, sind Mitarbeitende am häuslichen Arbeitsplatz oft nur noch eingeschränkt arbeitsfähig. Des Weiteren müssen womöglich zerstörte IT-Komponenten, Informationen und Softwarelösungen ersetzt werden, was sowohl finanzielle als auch zeitliche Ressourcen erfordert."
          },
          {
            "name": "2.7. Erhöhte Diebstahlgefahr am häuslichen Arbeitsplatz",
            "value": "Der häusliche Arbeitsplatz ist meistens nicht so gut abgesichert wie der Arbeitsplatz in einem Unternehmen oder in einer Behörde. Durch aufwendige Vorkehrungen wie z. B. Sicherheitstüren oder einem Pfortendienst ist dort die Gefahr, dass jemand unbefugt in das Gebäude eindringt, weitaus geringer als bei einem Privathaus. Bei einem Einbruch werden meistens vorrangig Gegenstände gestohlen, die schnell und einfach verkauft werden können. Dabei kann auch dienstliche IT gestohlen werden. Die auf den entwendeten dienstlichen IT-Systemen vorhandenen Informationen besitzen aber oft einen höheren Wert als die IT-Systeme selbst. Dritte könnten versuchen, durch Erpressung oder Weitergabe der Daten an Konkurrenzunternehmen einen höheren Gewinn als durch den Verkauf der Hardware zu erzielen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "6e9135e3-b004-4ff0-b3bc-adedc1df94fe",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/rume_profile.json",
            "description": "Implementation for all controls in Baustein INF.8",
            "implemented-requirements": [
              {
                "uuid": "ebb3edd6-5abd-4388-8ba7-03423ddb5e99",
                "control-id": "ASST.7.5",
                "description": "Implementation for ASST.7.5 based on BSI INF.8.A5",
                "statements": [
                  {
                    "statement-id": "INF.8.A5-m2",
                    "uuid": "2556269a-204c-4f92-8bab-229a63fdc143",
                    "description": "Mitarbeitende werden angewiesen, vertrauliche Dokumente nicht im Hausmüll zu entsorgen, sondern gesammelt zur Vernichtung in der Institution mitzubringen. Es werden jedoch keine speziellen Behälter oder Fristen dafür vorgegeben."
                  },
                  {
                    "statement-id": "INF.8.A5-m3",
                    "uuid": "f79b6c08-0015-4c94-95b1-11df5b68afaa",
                    "description": "Vertrauliche Informationen SOLLTEN sicher entsorgt werden. In einer speziellen Sicherheitsrichtlinie SOLLTE daher geregelt werden, wie schutzbedürftiges Material zu beseitigen ist. Es SOLLTEN die dafür benötigten Entsorgungsmöglichkeiten verfügbar sein."
                  },
                  {
                    "statement-id": "INF.8.A5-m4",
                    "uuid": "0df416b8-2807-405f-91b8-01183ff12b53",
                    "description": "Die Entsorgungsanforderungen sind nach der Schutzbedürftigkeit der Informationen differenziert. Für Informationen mit hohem Schutzbedarf ist die Nutzung eines Aktenvernichters mit höherer Schutzklasse (z.B. P-5) oder die zwingende Rückführung in versiegelten Behältern vorgeschrieben. Die Vernichtung wird dokumentiert."
                  },
                  {
                    "statement-id": "INF.8.A5-m5",
                    "uuid": "acf01aa6-6446-412e-be16-d0e42358dfa0",
                    "description": "Ein zertifizierter externer Dienstleister wird beauftragt, versiegelte Sicherheitsbehälter mit vertraulichen Materialien regelmäßig direkt bei den Mitarbeitenden zu Hause abzuholen und nachweislich zu vernichten. Die private Anschaffung und Nutzung von Aktenvernichtern ist untersagt, um eine gleichbleibend hohe Qualität der Vernichtung sicherzustellen."
                  }
                ]
              },
              {
                "uuid": "f1163c34-d664-4c69-8c04-bc878d6122a1",
                "control-id": "GEB.3.5",
                "description": "Implementation for GEB.3.5 based on BSI INF.8.A3",
                "statements": [
                  {
                    "statement-id": "INF.8.A3-m1",
                    "uuid": "0a6f414c-cbca-4b64-ad53-a21045435a5f",
                    "description": "Mitarbeitende werden mündlich daran erinnert, die Wohnungstür abzuschließen, aber es gibt keine formellen Anweisungen zum Schutz des spezifischen Arbeitsbereichs vor unbefugtem Zutritt durch Dritte (z. B. Familienangehörige, Besucher)."
                  },
                  {
                    "statement-id": "INF.8.A3-m2",
                    "uuid": "5964f43f-1662-462e-b667-051ef145c363",
                    "description": "Es gibt eine schriftliche Regelung, dass der Arbeitsplatz beim Verlassen zu sichern ist (z. B. Computer sperren). Maßnahmen zum physischen Schutz des Raumes oder der Wohnung (Türen, Fenster) werden erwähnt, aber nicht weiter spezifiziert oder überprüft."
                  },
                  {
                    "statement-id": "INF.8.A3-m3",
                    "uuid": "d96c4b65-75ca-468e-ab9c-8bf68f740b3d",
                    "description": "Den Mitarbeitenden MUSS mitgeteilt werden, welche Regelungen und Maßnahmen zum Einbruchs- und Zutrittsschutz zu beachten sind. So MUSS darauf hingewiesen werden, Fenster zu schließen und Türen abzuschließen, wenn der häusliche Arbeitsplatz nicht besetzt ist. Es MUSS sichergestellt werden, dass unbefugte Personen zu keiner Zeit den häuslichen Arbeitsplatz betreten und auf dienstliche IT und Unterlagen zugreifen können."
                  },
                  {
                    "statement-id": "INF.8.A3-m4",
                    "uuid": "817b732a-8d72-423e-b46c-61effed7de3d",
                    "description": "Es ist zwingend vorgeschrieben, dass der häusliche Arbeitsplatz in einem separaten, abschließbaren Raum eingerichtet wird. Die Qualität der Schlösser an Türen und Fenstern des Raumes oder der Wohnung muss einem definierten Mindeststandard (z.B. RC2-Klassifizierung) entsprechen. Die Anwesenheit betriebsfremder Personen im Arbeitsraum während der Arbeitszeit ist untersagt."
                  },
                  {
                    "statement-id": "INF.8.A3-m5",
                    "uuid": "8ea91ef5-8896-4df2-b8d6-10dadce3e708",
                    "description": "Der Arbeitsraum ist mit einer an eine zentrale Leitstelle angeschlossenen Einbruchmeldeanlage und/oder einer Videoüberwachung ausgestattet, die bei Abwesenheit des Mitarbeitenden aktiv ist. Der Zutritt zum Raum wird über ein biometrisches oder Smart-Lock-System mit zentraler Protokollierung gesteuert. Die physische Sicherheit des Arbeitsplatzes wird regelmäßig durch einen externen Sicherheitsdienstleister auditiert."
                  }
                ]
              },
              {
                "uuid": "0cbff7f4-65df-4aec-adcf-114204398e4a",
                "control-id": "GEB.5.1",
                "description": "Implementation for GEB.5.1 based on BSI INF.8.A4",
                "statements": [
                  {
                    "statement-id": "INF.8.A4-m2",
                    "uuid": "f976d5f7-c75a-4018-a4bb-2abe810dcd53",
                    "description": "Die Institution gibt Empfehlungen für eine ergonomische Einrichtung, überlässt die Umsetzung aber vollständig dem Mitarbeitenden. Grundlegende Sicherheitsaspekte wie Einbruchschutz werden nicht systematisch behandelt."
                  },
                  {
                    "statement-id": "INF.8.A4-m3",
                    "uuid": "80ff8130-e3e0-4335-b462-a958c32f862a",
                    "description": "Der häusliche Arbeitsplatz SOLLTE durch eine geeignete Raumaufteilung von den privaten Bereichen der Wohnung getrennt sein. Der häusliche Arbeitsplatz SOLLTE mit Büromöbeln eingerichtet sein, die ergonomischen Anforderungen entsprechen. Ebenso SOLLTE der häusliche Arbeitsplatz durch geeignete technische Sicherungsmaßnahmen vor Einbrüchen geschützt werden. Die Schutzmaßnahmen SOLLTEN an die örtlichen Gegebenheiten und den vorliegenden Schutzbedarf angepasst sein."
                  },
                  {
                    "statement-id": "INF.8.A4-m4",
                    "uuid": "bb52d1b0-32cc-484d-ae4a-e3e53cb04214",
                    "description": "Eine formale Gefährdungsbeurteilung für den häuslichen Arbeitsplatz wird durchgeführt, die Ergonomie, Beleuchtung, Lärm und psychische Belastungsfaktoren umfasst. Basierend auf der Beurteilung werden spezifische, verbindliche Maßnahmen umgesetzt. Die Anforderungen an den Einbruchschutz sind klar definiert (z.B. Widerstandsklasse RC2 für Fenster/Türen im Erdgeschoss)."
                  },
                  {
                    "statement-id": "INF.8.A4-m5",
                    "uuid": "592acd8e-9747-4747-8ed7-1c76430687cb",
                    "description": "Der häusliche Arbeitsplatz wird vor der Inbetriebnahme von einem externen, zertifizierten Auditor für Arbeitssicherheit und Gebäudesicherheit abgenommen. Alle Einrichtungsgegenstände und Sicherheitsinstallationen werden von der Institution bereitgestellt, professionell installiert und regelmäßig gewartet, um einen durchgehend hohen Standard zu gewährleisten."
                  }
                ]
              },
              {
                "uuid": "0c428cc0-5c2f-4cfa-ab21-34df931079ec",
                "control-id": "GEB.5.2",
                "description": "Implementation for GEB.5.2 based on BSI INF.8.A6",
                "statements": [
                  {
                    "statement-id": "INF.8.A6-m3",
                    "uuid": "90471db7-37e3-4839-9a64-4e95c1e7cdcc",
                    "description": "Wenn Informationen mit erhöhtem Schutzbedarf bearbeitet werden, SOLLTE überlegt werden, von einem häuslichen Arbeitsplatz ganz abzusehen. Anderenfalls SOLLTE der häusliche Arbeitsplatz durch erweiterte, hochwertige technische Sicherungsmaßnahmen geschützt werden."
                  },
                  {
                    "statement-id": "INF.8.A6-m4",
                    "uuid": "351e762b-2aff-43c2-82ce-519eadc7ff62",
                    "description": "Die Verarbeitung von Informationen mit erhöhtem Schutzbedarf am häuslichen Arbeitsplatz ist nur nach einer dokumentierten, positiven Sicherheitsüberprüfung des Arbeitsplatzes gestattet. Die vorgeschriebenen, erweiterten Sicherheitsmaßnahmen umfassen zwingend eine Einbruchmeldeanlage, zertifizierten Einbruchschutz für Türen und Fenster (z.B. RC3) und die Nutzung von Blickschutzfolien auf allen Monitoren."
                  },
                  {
                    "statement-id": "INF.8.A6-m5",
                    "uuid": "4263c73e-a0a1-4e01-9b1d-c7532a393457",
                    "description": "Die Verarbeitung von Informationen mit sehr hohem Schutzbedarf am häuslichen Arbeitsplatz ist grundsätzlich verboten. Ausnahmen erfordern eine Genehmigung auf Geschäftsführungsebene und sind nur möglich, wenn der häusliche Arbeitsplatz durch einen externen Auditor als physischer Sicherheitsbereich (vergleichbar mit einem Serverraum) zertifiziert wurde. Dies umfasst Maßnahmen wie biometrische Zutrittskontrolle, Videoüberwachung und ggf. Abhörschutz."
                  }
                ]
              },
              {
                "uuid": "2614a34f-2461-424f-ad10-853f000fb383",
                "control-id": "GEB.9.1",
                "description": "Implementation for GEB.9.1 based on BSI INF.8.A1",
                "statements": [
                  {
                    "statement-id": "INF.8.A1-m1",
                    "uuid": "bb07c64b-fb0b-4409-9f5a-a87051a653c5",
                    "description": "Nur vereinzelt werden dienstliche Unterlagen und Datenträger am häuslichen Arbeitsplatz diebstahlsicher aufbewahrt, beispielsweise in einer Schublade ohne Schloss. Eine durchgängige Regelung oder deren Umsetzung fehlt."
                  },
                  {
                    "statement-id": "INF.8.A1-m2",
                    "uuid": "0c8b5462-bc5d-408b-b66e-f9a8dbd5e8de",
                    "description": "Abschließbare Behältnisse stehen am häuslichen Arbeitsplatz zur Verfügung. Es gibt eine grundlegende Anweisung, sensible Unterlagen zu sichern, aber die Einhaltung einer konsequenten „Clean-Desk-Policy“ wird nicht überprüft."
                  },
                  {
                    "statement-id": "INF.8.A1-m3",
                    "uuid": "8714c101-ac4d-4213-a883-85ce6a05adaf",
                    "description": "Dienstliche Unterlagen und Datenträger MÜSSEN am häuslichen Arbeitsplatz so aufbewahrt werden, dass keine unbefugten Personen darauf zugreifen können. Daher MÜSSEN ausreichend verschließbare Behältnisse (z. B. abschließbare Rollcontainer oder Schränke) vorhanden sein. Alle Mitarbeitenden MÜSSEN ihre Arbeitsplätze aufgeräumt hinterlassen und sicherstellen, dass keine vertraulichen Informationen frei zugänglich sind (Clean-Desk-Policy)."
                  },
                  {
                    "statement-id": "INF.8.A1-m4",
                    "uuid": "387b5d53-537d-4199-a2b2-2e100ae4d112",
                    "description": "Die Einhaltung der Clean-Desk-Policy wird regelmäßig durch dokumentierte Selbstauskünfte der Mitarbeitenden überprüft. Die bereitgestellten abschließbaren Behältnisse entsprechen einer definierten Sicherheitsklasse. Der Zugriff auf Unterlagen mit hohem Schutzbedarf ist durch separate, besonders gesicherte Behältnisse geregelt."
                  },
                  {
                    "statement-id": "INF.8.A1-m5",
                    "uuid": "82890207-42b6-4dfc-aab0-5c4ece4fd84f",
                    "description": "Für die Aufbewahrung von dienstlichen Unterlagen und Datenträgern werden ausschließlich zertifizierte Wertschutzschränke (Tresore) eingesetzt. Der Arbeitsraum selbst ist zutrittsgesichert, beispielsweise durch ein Smart-Lock-System mit Protokollierung. Alle ausgedruckten vertraulichen Dokumente werden automatisch mit einem digitalen Wasserzeichen versehen, um ihre Herkunft nachverfolgen zu können."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}