{
  "component-definition": {
    "uuid": "58709506-861f-4f98-964f-14c27d09a524",
    "metadata": {
      "title": "ISMS ISMS - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:08:01.043866+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "46b83f0a-5cf8-4ef4-8c11-dbdf21cb32aa",
        "type": "policy",
        "title": "ISMS ISMS",
        "description": "This component represents the implementation of all controls for Baustein ISMS.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Mit (Informations-)Sicherheitsmanagement wird die Planungs-, Lenkungs- und Kontrollaufgabe bezeichnet, die erforderlich ist, um einen durchdachten und wirksamen Prozess zur Herstellung von Informationssicherheit aufzubauen und kontinuierlich umzusetzen. Ein funktionierendes Sicherheitsmanagement muss in die existierenden Managementstrukturen jeder Institution eingebettet werden. Daher ist es praktisch nicht möglich, eine für jede Institution unmittelbar anwendbare Organisationsstruktur für das Sicherheitsmanagement anzugeben. Vielmehr werden häufig Anpassungen an spezifische Gegebenheiten erforderlich sein."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es aufzuzeigen, wie ein funktionierendes Managementsystem für Informationssicherheit (ISMS) eingerichtet und im laufenden Betrieb weiterentwickelt werden kann. Der Baustein beschreibt dazu Schritte eines systematischen Sicherheitsprozesses und gibt Anleitungen zur Erstellung eines Sicherheitskonzeptes."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein ISMS.1 Sicherheitsmanagement ist auf den Informationsverbund einmal anzuwenden.\nDer Baustein baut auf den BSI-Standards 200-1 „Managementsysteme für Informationssicherheit“ und 200-2 „IT-Grundschutz-Methodik“ auf. Er fasst daraus die wichtigsten Aspekte zum Sicherheitsmanagement zusammen.\nIn der Institution sollten regelmäßig Sicherheitsrevisionen durchgeführt werden. Ausführliche Anforderungen dazu sind nicht in diesem Baustein, sondern im Baustein DER 3.1 Audits und Revisionen zu finden. Außerdem sollten alle Mitarbeitenden der Institution sowie alle relevanten Externen systematisch und zielgruppengerecht zu Sicherheitsrisiken sensibilisiert und zu Fragen der Informationssicherheit geschult werden. Ausführliche Anforderungen dazu sind im Baustein ORP.3 Sensibilisierung und Schulung zur Informationssicherheit zu finden.\nDieser Baustein behandelt ebenso keine spezifischen Aspekte zu Personal oder zum Bereich Organisation. Diese Anforderungen werden in den Bausteinen ORP.2 Personal bzw. ORP.1 Organisation behandelt."
          },
          {
            "name": "Fehlende persönliche Verantwortung im Sicherheitsprozess",
            "value": "Sind in einer Institution die Rollen und Zuständigkeiten im Sicherheitsprozess nicht eindeutig festgelegt, dann ist es wahrscheinlich, dass viele Mitarbeitende ihre Verantwortung für die Informationssicherheit mit dem Verweis auf übergeordnete Hierarchie-Ebenen ablehnen oder vergessen. Als Folge werden Sicherheitsmaßnahmen nicht umgesetzt, da diese zunächst fast immer einen Mehraufwand im gewohnten Arbeitsablauf darstellen."
          },
          {
            "name": "Mangelnde Unterstützung durch die Institutionsleitung",
            "value": "Werden die Sicherheitsverantwortlichen nicht uneingeschränkt durch die Institutionsleitung unterstützt, kann es schwierig werden, die notwendigen Maßnahmen einzufordern. Dies gilt insbesondere für Personen, die in der Linienstruktur über den Sicherheitsverantwortlichen stehen. In diesem Fall ist der Sicherheitsprozess nicht vollständig durchführbar."
          },
          {
            "name": "Unzureichende strategische und konzeptionelle Vorgaben",
            "value": "In vielen Institutionen wird zwar ein Sicherheitskonzept erstellt, dessen Inhalt ist dann aber häufig nur wenigen Personen in der Institution bekannt. Dies führt dazu, dass Vorgaben an Stellen, an denen organisatorischer Aufwand zu betreiben wäre, bewusst oder unbewusst nicht eingehalten werden.\nAuch wenn das Sicherheitskonzept strategische Zielsetzungen enthält, werden diese von der Institutionsleitung vielfach als bloße Sammlung von Absichtserklärungen betrachtet. Häufig werden dann keine ausreichenden Ressourcen zur Umsetzung zur Verfügung gestellt. Oft wird fälschlicherweise auch davon ausgegangen, dass in einer automatisierten Umgebung Sicherheit automatisch hergestellt wird.\nOhne strategische Vorgaben wird bei Schadensfällen häufig unstrukturiert vorgegangen. Dadurch können bestenfalls Teilaspekte verbessert werden."
          },
          {
            "name": "Unzureichende oder fehlgeleitete Investitionen",
            "value": "Wenn die Institutionsleitung nicht ausreichend über den Sicherheitszustand sämtlicher Geschäftsprozesse, IT-Systeme und Anwendungen sowie über vorhandene Mängel unterrichtet ist, werden nicht genügend Ressourcen für den Sicherheitsprozess bereitgestellt oder diese nicht sachgerecht eingesetzt. In letzterem Fall kann dies dazu führen, dass einem übertrieben hohen Sicherheitsniveau in einem Teilbereich schwerwiegende Mängel in einem anderen gegenüberstehen.\nHäufig ist auch zu beobachten, dass teure technische Sicherheitslösungen falsch eingesetzt werden und somit unwirksam sind oder sogar selbst zur Gefahrenquelle werden."
          },
          {
            "name": "Unzureichende Durchsetzbarkeit von Sicherheitsmaßnahmen",
            "value": "Um ein durchgehendes und angemessenes Sicherheitsniveau zu erreichen, müssen unterschiedliche Zuständigkeitsbereiche innerhalb einer Institution miteinander kooperieren. Fehlende strategische Leitaussagen und unklare Zielsetzungen führen mitunter aber zu unterschiedlichen Interpretationen der Bedeutung von Informationssicherheit. Dies kann zur Folge haben, dass die notwendige Kooperation nicht zustande kommt, etwa weil die Aufgabe „Informationssicherheit“ als unnötig angesehen wird oder zumindest keine Priorität hat. Somit könnten Sicherheitsmaßnahmen nicht umgesetzt werden."
          },
          {
            "name": "Fehlende Aktualisierung im Sicherheitsprozess",
            "value": "Neue Geschäftsprozesse, Anwendungen und IT-Systeme sowie neue Bedrohungen beeinflussen permanent den Status der Informationssicherheit innerhalb einer Institution. Fehlt ein effektives Revisionskonzept, das auch das Bewusstsein für neue Bedrohungen stärkt, verringert sich das Sicherheitsniveau. Aus der realen Sicherheit wird dann schleichend eine gefährliche Scheinsicherheit."
          },
          {
            "name": "Verstoß gegen gesetzliche Regelungen und vertragliche Vereinbarungen",
            "value": "Wenn Informationen, Geschäftsprozesse und IT-Systeme einer Institution unzureichend abgesichert sind, beispielsweise durch ein unzureichendes Sicherheitsmanagement, kann gegen Rechtsvorschriften mit Bezug zur Informationsverarbeitung oder gegen bestehende Verträge mit Geschäftspartnern und -partnerinnen verstoßen werden. Welche Gesetze jeweils zu beachten sind, hängt von der Art der Institution beziehungsweise ihrer Geschäftsprozesse und Dienstleistungen ab.\nJe nachdem, wo sich die Standorte einer Institution befinden, können auch verschiedene nationale und internationale Vorschriften zu beachten sein. Verfügt eine Institution über unzureichende Kenntnisse hinsichtlich internationaler Gesetzesvorgaben, z. B. zu Datenschutz, Informationspflicht, Insolvenzrecht, Haftung oder Informationszugriff für Dritte, erhöht dies das Risiko entsprechender Verstöße. Dann drohen rechtliche Konsequenzen.\nIn vielen Branchen ist es üblich, dass Anwendende ihre Zuliefer- und Dienstleistungsunternehmen dazu verpflichten, bestimmte Qualitäts- und Sicherheitsstandards einzuhalten. Verstößt ein Vertragspartner oder -partnerin gegen vertraglich geregelte Sicherheitsanforderungen, kann dies Vertragsstrafen, Vertragsauflösungen oder sogar den Verlust von Geschäftsbeziehungen nach sich ziehen."
          },
          {
            "name": "Störung der Geschäftsabläufe aufgrund von Sicherheitsvorfällen",
            "value": "Sicherheitsvorfälle können durch ein einzelnes Ereignis oder eine Verkettung unglücklicher Umstände ausgelöst werden. Sie können dazu führen, dass die Vertraulichkeit, Integrität oder Verfügbarkeit von Informationen und IT-Systemen beeinträchtigt werden. Dies wirkt sich dann schnell negativ auf wesentliche Fachaufgaben und Geschäftsprozesse der betroffenen Institution aus. Auch wenn nicht alle Sicherheitsvorfälle in der Öffentlichkeit bekannt werden, können sie trotzdem zu negativen Auswirkungen in den Beziehungen zu Geschäftspartnern und -partnerinnen sowie Kunden und Kundinnen führen. Auch könnten gesetzliche Vorgaben missachtet werden. Dabei ist es nicht so, dass die schwersten und weitreichendsten Sicherheitsvorfälle durch die größten Sicherheitsschwachstellen ausgelöst wurden. In vielen Fällen führt die Verkettung kleiner Ursachen zu großen Schäden."
          },
          {
            "name": "Unwirtschaftlicher Umgang mit Ressourcen durch unzureichendes Sicherheitsmanagement",
            "value": "Ein unzureichendes Sicherheitsmanagement kann dazu führen, dass falsche Prioritäten gesetzt werden und nicht an denjenigen Stellen investiert wird, die den größten Mehrwert für die Institution bringen. Dies kann zu folgenden Fehlern führen:\n• Es wird in teure Sicherheitslösungen investiert, ohne dass eine Basis an notwendigen organisatorischen Regelungen vorhanden ist. Nicht geklärte Zuständigkeiten und Verantwortlichkeiten können trotz teurer Investitionen zu schweren Sicherheitsvorfällen führen.\n• Es wird in den Bereichen einer Institution in Informationssicherheit investiert, die für Informationssicherheit besonders sensibilisiert sind. Andere Bereiche, die vielleicht für die Erfüllung der Fachaufgaben und die Erreichung der Geschäftsziele wichtiger sind, werden aufgrund von knappen Mitteln oder Desinteresse der Verantwortlichen vernachlässigt. Es wird dann unausgewogen in Teilbereiche investiert, während für das Gesamtsystem besonders bedeutsame Sicherheitsrisiken unbeachtet bleiben.\n• Durch die einseitige Erhöhung des Schutzes einzelner Grundwerte kann sich der Gesamtschutz sogar verringern, beispielsweise indem eine Verschlüsselung von Informationen die Vertraulichkeit zwar erhöht, aber die Verfügbarkeit verringern kann.\n• Ein inhomogener und unkoordinierter Einsatz von Sicherheitsprodukten kann zu hohem finanziellen und personellen Ressourceneinsatz führen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "36de287e-9ac8-453e-800c-36a549b33daa",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/isms_profile.json",
            "description": "Implementation for all controls in Baustein ISMS",
            "implemented-requirements": [
              {
                "uuid": "24a59bc5-6173-4366-979a-add6174a02df",
                "control-id": "ARCH.1.1",
                "description": "Implementation for ARCH.1.1 based on BSI CON.11.1.A16",
                "statements": [
                  {
                    "statement-id": "con.11.1.a16-m3",
                    "uuid": "88040223-0ea4-4183-b61c-1b220ba660d5",
                    "description": "Bevor VS-IT mit anderer VS-IT zusammengeschaltet wird, MUSS geprüft werden, ob und inwieweit Informationen ausgetauscht werden dürfen, wobei das Schutzniveau und der Grundsatz „Kenntnis nur, wenn nötig“ zu berücksichtigen sind. Es MÜSSEN IT-Sicherheitsfunktionen zum Schutz der Systemübergänge implementiert werden. Es MUSS bewertet und dokumentiert werden, ob die Zusammenschaltung zwingend erforderlich ist, eine besondere Gefährdung entsteht und ob der Gesamtbestand der Daten höher einzustufen ist."
                  }
                ]
              },
              {
                "uuid": "e152e03f-a362-4fdf-be65-2e9f98e96f58",
                "control-id": "ASST.1.1",
                "description": "Implementation for ASST.1.1 based on BSI ORP.1.A8",
                "statements": [
                  {
                    "statement-id": "ORP.1.A8-m1",
                    "uuid": "f0eb5642-28cd-46c6-a5ba-0b22a2369744",
                    "description": "Nur die wichtigsten IT-Geräte wie Server und Laptops werden in einer einfachen Liste erfasst. Andere sicherheitsrelevante Betriebsmittel wie USVs, Netzwerkkomponenten oder Feuerlöscher werden nicht inventarisiert. Eine regelmäßige Bedarfsplanung findet nicht statt; Betriebsmittel werden reaktiv beschafft, wenn sie ausfallen."
                  },
                  {
                    "statement-id": "ORP.1.A8-m2",
                    "uuid": "88341b08-483c-469c-b894-676975cc932f",
                    "description": "Eine Inventarisierung der meisten IT-Geräte findet statt, ist aber oft nicht aktuell, da Änderungen nicht zeitnah nachgepflegt werden. Ein einfacher Beschaffungsprozess existiert, aber ohne formales, sicherheitsbezogenes Genehmigungsverfahren. Ein grundlegender Prozess zur Löschung von Datenträgern ist vorhanden, wird aber nicht dokumentiert."
                  },
                  {
                    "statement-id": "ORP.1.A8-m3",
                    "uuid": "4e196aea-ec4b-4d6e-b910-944daa65b988",
                    "description": "Alle Geräte und Betriebsmittel, die Einfluss auf die Informationssicherheit haben, SOLLTEN in ausreichender Menge vorhanden sein. Es SOLLTE geeignete Prüf- und Genehmigungsverfahren vor Einsatz der Geräte und Betriebsmittel geben. Geräte und Betriebsmittel SOLLTEN in geeigneten Bestandsverzeichnissen aufgelistet werden. Um den Missbrauch von Daten zu verhindern, SOLLTE die zuverlässige Löschung oder Vernichtung von Geräten und Betriebsmitteln geregelt sein."
                  },
                  {
                    "statement-id": "ORP.1.A8-m4",
                    "uuid": "e0d6e505-f108-4556-bd08-035811d19030",
                    "description": "Die Bestandsverzeichnisse sind in einer zentralen Datenbank (z.B. CMDB) zusammengefasst und werden regelmäßig durch automatisierte Erkennungswerkzeuge (z.B. Netzwerkscanner, Agenten) auf ihre Aktualität und Vollständigkeit überprüft. Der gesamte Lebenszyklus jedes Betriebsmittels, von der Beschaffung über Wartung und Änderung bis zur Entsorgung, ist lückenlos dokumentiert. Wartungsintervalle (z.B. für USV-Batterien) werden aktiv überwacht."
                  },
                  {
                    "statement-id": "ORP.1.A8-m5",
                    "uuid": "e723d276-8bba-481b-a786-1bf92984a3bd",
                    "description": "Die Betriebsmittelverwaltung ist vollständig in ein integriertes IT-Service-Management-System (ITSM) integriert. Dieses System steuert und automatisiert Prozesse wie Patch-Management, Lizenzmanagement und die Kapazitätsplanung basierend auf den CMDB-Daten. Die Vernichtung von Datenträgern wird ausschließlich durch zertifizierte Dienstleister durchgeführt, deren Vernichtungszertifikate digital archiviert und mit den jeweiligen Assets in der CMDB verknüpft werden."
                  }
                ]
              },
              {
                "uuid": "0d60e567-5a76-43dc-9480-6d7e3c5b7c08",
                "control-id": "ASST.2.1",
                "description": "Implementation for ASST.2.1 based on BSI CON.1.A19",
                "statements": [
                  {
                    "statement-id": "con.1.a19-m1",
                    "uuid": "e74ebbe2-e1a1-4344-b22a-a5fa96982a54",
                    "description": "Es gibt kein zentrales Verzeichnis (Kataster) über die im Einsatz befindliche Kryptografie. Informationen dazu sind, wenn überhaupt, nur dezentral bei den jeweiligen Systemadministratoren als ungeschriebenes Wissen vorhanden."
                  },
                  {
                    "statement-id": "con.1.a19-m2",
                    "uuid": "63a499fd-10f8-4cb4-b882-c870e44aa9df",
                    "description": "Eine einfache Liste, meist in Form einer Tabellenkalkulation, existiert, ist aber oft unvollständig, wird nicht regelmäßig aktualisiert und deckt nur einen Teilaspekt ab (z. B. nur SSL/TLS-Zertifikate, aber keine Festplattenverschlüsselung oder VPNs)."
                  },
                  {
                    "statement-id": "con.1.a19-m3",
                    "uuid": "523b5629-b817-4fbc-80f4-2a9492d99a31",
                    "description": "Für jede Gruppe von IT-Systemen SOLLTEN folgende Informationen im Krypto-Kataster festgehalten werden: Einsatzzweck (z. B. Festplattenverschlüsselung), Zuständige, eingesetztes kryptografisches Verfahren, eingesetzte Hard- oder Software mit kryptografischen Funktionen und eingesetzte sicherheitsrelevante Parameter (z. B. Schlüssellängen). Die Pflege des Katasters ist ein definierter Prozess."
                  },
                  {
                    "statement-id": "con.1.a19-m4",
                    "uuid": "845b0ece-e093-4144-aae7-748b23964c08",
                    "description": "Das Krypto-Kataster wird in einer zentralen Datenbank, idealerweise als Teil der Configuration Management Database (CMDB), gepflegt. Der Prozess zur Aktualisierung des Katasters ist in den formalen IT-Change-Management-Prozess integriert. Die Vollständigkeit und Genauigkeit des Katasters wird regelmäßig, z. B. jährlich, auditiert."
                  },
                  {
                    "statement-id": "con.1.a19-m5",
                    "uuid": "a61eb58e-ee78-475f-a9eb-c2877e54b8c9",
                    "description": "Das Krypto-Kataster wird weitgehend automatisch durch den Einsatz von Netzwerk- und System-Scanning-Tools erzeugt und aktuell gehalten. Es ist dynamisch mit den Risiko- und Schwachstellenmanagement-Systemen gekoppelt, um eine Echtzeit-Ansicht der kryptografischen Sicherheitslage der Organisation zu liefern."
                  }
                ]
              },
              {
                "uuid": "41f2474b-3ae6-457a-a653-ee04749b0ad0",
                "control-id": "ASST.2.2",
                "description": "Implementation for ASST.2.2 based on BSI OPS.1.1.1.A6",
                "statements": [
                  {
                    "statement-id": "ops.1.1.1-a6-m3",
                    "uuid": "20c9d029-d2fc-47a6-8827-1ad3b2245104",
                    "description": "Der IT-Betrieb SOLLTE eine Übersicht aller vorhandenen IT-Assets erstellen, regelmäßig prüfen und aktuell halten. Im IT-Asset-Management (ITAM) SOLLTEN alle produktiven IT-Komponenten, Test-Instanzen und IT-Komponenten der Reservevorhaltung erfasst werden. Auch vorhandene, aber nicht mehr genutzte IT-Assets SOLLTEN erfasst werden."
                  },
                  {
                    "statement-id": "ops.1.1.1-a6-m4",
                    "uuid": "9ddf41a8-496c-4fac-9157-e4aa7b45eb72",
                    "description": "Es SOLLTEN ITAM-Tools eingesetzt werden, die eine zentrale Verwaltung der IT-Assets ermöglichen. Die Erfassung und Aktualisierung der Asset-Informationen erfolgt weitgehend automatisiert durch Discovery-Scans. Die CMDB erfasst nicht nur Hardware, sondern auch Software, Lizenzen und die Beziehungen zwischen den Assets."
                  },
                  {
                    "statement-id": "ops.1.1.1-a6-m5",
                    "uuid": "e5b7457a-5330-461e-9a30-7853d8342227",
                    "description": "Das ITAM ist vollständig in alle relevanten IT-Service-Management-Prozesse integriert (Incident, Problem, Change, Schwachstellenmanagement). Die CMDB ist die alleinige 'Single Source of Truth' für alle Konfigurationsdaten. Unbekannte oder nicht autorisierte Assets, die im Netzwerk erkannt werden, lösen automatisch einen Sicherheitsvorfall aus und werden ggf. unter Quarantäne gestellt."
                  }
                ]
              },
              {
                "uuid": "abc6b754-f6b7-412e-8f92-0946daaaf10a",
                "control-id": "ASST.3.13",
                "description": "Implementation for ASST.3.13 based on BSI CON.1.A18",
                "statements": [
                  {
                    "statement-id": "con.1.a18-m1",
                    "uuid": "67c35fd1-4fcf-49c1-ae15-f296430e1135",
                    "description": "Es wird keine spezielle Ersatzhardware für kryptografische Komponenten vorgehalten. Im Falle eines Ausfalls unterliegt die Neubeschaffung den Standard-Beschaffungszeiten, was zu langen Ausfallzeiten führen kann."
                  },
                  {
                    "statement-id": "con.1.a18-m2",
                    "uuid": "422f20a4-c3d0-4c8d-823b-158267a99dd2",
                    "description": "Für einige gängige, kostengünstige Krypto-Komponenten wie Smartcard-Leser oder USB-Token wird Ersatzhardware vorgehalten. Für teure, spezialisierte Hardware wie HSMs existiert jedoch kein Ersatz, hier verlässt man sich auf Serviceverträge mit dem Hersteller."
                  },
                  {
                    "statement-id": "con.1.a18-m3",
                    "uuid": "f2e7a791-4bfc-4b66-b717-524e5a29b249",
                    "description": "Hardware mit kryptografischen Funktionen (z. B. Hardware-Token für Zwei-Faktor-Authentifizierung) SOLLTE vorrätig sein. Im Kryptokonzept SOLLTE dokumentiert werden, für welche Hardware mit kryptografischen Funktionen Ersatzhardware zur Verfügung steht und wie diese ausgetauscht wird."
                  },
                  {
                    "statement-id": "con.1.a18-m4",
                    "uuid": "d9cacd17-6ef3-433d-8873-f966dd0f531b",
                    "description": "Die vorrätige Ersatzhardware wird nicht nur gelagert, sondern ist bereits vorkonfiguriert ('Cold Standby') und wird regelmäßig (z. B. jährlich) getestet, um ihre Funktionsfähigkeit sicherzustellen. Der dokumentierte Austauschprozess wird regelmäßig geübt."
                  },
                  {
                    "statement-id": "con.1.a18-m5",
                    "uuid": "48886e09-4669-4c7c-8240-51695456d337",
                    "description": "Für alle kritischen kryptografischen Funktionen ist eine vollredundante, hochverfügbare Hardware-Architektur ('Hot Standby') implementiert, die ein automatisches Failover im Fehlerfall ohne manuellen Eingriff ermöglicht. Der Austausch einer defekten Komponente ist ein unterbrechungsfreier Routinevorgang."
                  }
                ]
              },
              {
                "uuid": "392b1caf-7952-4c84-bf80-cbbe898972c9",
                "control-id": "ASST.3.2",
                "description": "Implementation for ASST.3.2 based on BSI CON.11.1.A7",
                "statements": [
                  {
                    "statement-id": "con.11.1.a7-m3",
                    "uuid": "486f39f9-9d44-43fc-b5f8-f040458c438a",
                    "description": "Elektronische VS MÜSSEN nach den Vorgaben der VSA gekennzeichnet werden, sodass die Kennzeichnung jederzeit erkennbar ist und auch bei Kopiervorgängen erhalten bleibt. E-Mails MÜSSEN entsprechend des Musters 11 der Anlage VIII zur VSA gekennzeichnet werden. Datenträger mit unverschlüsselten VS-NfD MÜSSEN mit dem Geheimhaltungsgrad gekennzeichnet werden. Ergibt sich durch die Zusammenstellung von VS auf einem Datenträger ein höherer Schutzbedarf, MUSS der Datenträger entsprechend höher (z.B. VS-VERTRAULICH) gekennzeichnet werden."
                  },
                  {
                    "statement-id": "con.11.1.a7-m4",
                    "uuid": "1a6a6f71-7ccf-423d-855d-8f9485767ea7",
                    "description": "Die Kennzeichnung von elektronischen VS wird durch technische Mittel unterstützt. Der Dateiname einer elektronischen VS SOLLTE eine Kennzeichnung enthalten, die den VS-Charakter erkennen lässt, ohne die VS öffnen zu müssen. Es wird geprüft, ob IT-Sicherheitsprodukte die Kennzeichnung (im Sinne von Metadaten) übernehmen und durchsetzen können."
                  },
                  {
                    "statement-id": "con.11.1.a7-m5",
                    "uuid": "47f3aeb3-c418-4375-9f7d-a6675d6901ea",
                    "description": "Ein durchgängiges Datenklassifizierungssystem ist implementiert, das die Kennzeichnung von VS als Metadaten in den Dateien selbst speichert. Dieses System erzwingt die Kennzeichnung bei der Erstellung und kann basierend auf Inhalten oder Kontext automatisch Klassifizierungsvorschläge machen. Andere Sicherheitssysteme (z.B. DLP, Verschlüsselungsgateways) nutzen diese Metadaten zur automatisierten Durchsetzung von Sicherheitsrichtlinien."
                  }
                ]
              },
              {
                "uuid": "2197f723-0311-4eed-b30d-eef8afa32907",
                "control-id": "ASST.6.1",
                "description": "Implementation for ASST.6.1 based on BSI CON.7.A6",
                "statements": [
                  {
                    "statement-id": "CON.7.A6-m3",
                    "uuid": "1eb86a56-bce7-49d2-a9e0-093d37568d51",
                    "description": "Mitarbeitende MÜSSEN ihrer Institution umgehend melden, wenn Informationen, IT-Systeme oder Datenträger verloren gegangen sind oder gestohlen wurden. Hierfür MUSS es klare Meldewege und Kontaktpersonen innerhalb der Institution geben. Die Institution MUSS die möglichen Auswirkungen des Verlustes bewerten und geeignete Gegenmaßnahmen ergreifen."
                  },
                  {
                    "statement-id": "CON.7.A6-m4",
                    "uuid": "520f1fac-6184-4b14-a1bd-a8c0847c2a19",
                    "description": "Eine rund um die Uhr erreichbare Hotline (24/7) ist für die Meldung von verlorenen Geräten eingerichtet. Der Meldeprozess löst automatisch einen dokumentierten Incident-Response-Workflow aus, der die Fernlöschung des Geräts, das Zurücksetzen von Passwörtern zugehöriger Konten und eine formale Auswirkungsanalyse umfasst."
                  },
                  {
                    "statement-id": "CON.7.A6-m5",
                    "uuid": "c8481c32-32a7-4755-8100-7c5c63e30aad",
                    "description": "Der Incident-Response-Prozess bei Geräteverlust ist hochgradig automatisiert. Die Fernlöschung wird bei Meldung sofort ausgeführt. Der Prozess umfasst die automatisierte Benachrichtigung aller relevanten Stakeholder (z.B. Datenschutzbeauftragter, Management) basierend auf der Klassifikation der Daten, die sich wahrscheinlich auf dem Gerät befanden."
                  }
                ]
              },
              {
                "uuid": "9334039a-8b8e-4725-8177-bf838fe2e775",
                "control-id": "ASST.7.6",
                "description": "Implementation for ASST.7.6 based on BSI DER.2.3.A9",
                "statements": [
                  {
                    "statement-id": "der.2.3-a9-m3",
                    "uuid": "b346f173-f3ff-4f3b-a6da-089c674da1c5",
                    "description": "Es SOLLTE erwogen werden, nach einem APT-Vorfall die Hardware komplett auszutauschen. Insbesondere wenn nach einer Bereinigung bei einzelnen IT-Systemen noch verdächtiges Verhalten beobachtet wird, SOLLTEN die betroffenen IT-Systeme ausgetauscht werden. Die Entscheidung hierzu wird risikobasiert durch das Leitungsgremium getroffen."
                  },
                  {
                    "statement-id": "der.2.3-a9-m4",
                    "uuid": "00a3be88-9c53-4ce5-b622-e5faf0530a00",
                    "description": "Es gibt eine formale Richtlinie, die die Bedingungen für einen obligatorischen Hardwaretausch festlegt. Dies betrifft standardmäßig alle Systeme in als hochkritisch eingestuften Zonen oder Systeme, die bestimmte Arten von Daten verarbeiten. Der Prozess für die Beschaffung der Ersatzhardware über eine vertrauenswürdige Lieferkette ist definiert."
                  },
                  {
                    "statement-id": "der.2.3-a9-m5",
                    "uuid": "d53aa3f3-ed5e-4801-9c52-09b4c21a503d",
                    "description": "Eine 'Scorched Earth'-Policy ist standardmäßig für alle als kompromittiert identifizierten Netzwerksegmente etabliert. Die gesamte Hardware (Server, Clients, Netzwerkgeräte, Drucker, etc.) in diesen Segmenten wird ohne weitere Analyse ausgetauscht. Die neu beschaffte Hardware wird vor der Inbetriebnahme einer hardwarenahen Integritätsprüfung unterzogen (z.B. 'Secure Boot' Baseline)."
                  }
                ]
              },
              {
                "uuid": "d1a2049c-e9fe-4343-84d5-2ce7d2032bd5",
                "control-id": "BER.1.1",
                "description": "Implementation for BER.1.1 based on BSI ORP.4.A1",
                "statements": [
                  {
                    "statement-id": "ORP.4.A1-m3",
                    "uuid": "94246457-da0f-489f-ac1f-43d3a0e9a444",
                    "description": "Es MUSS ein definierter Prozess existieren, wie Benutzendenkennungen und -gruppen einzurichten und zu löschen sind. Jede Kennung MUSS eindeutig einer Person zugeordnet sein. Inaktive Kennungen SOLLTEN nach einer definierten Zeitspanne deaktiviert werden. Die Einrichtung und Löschung von Konten und Gruppen DARF NUR über separate administrative Rollen erfolgen. Standardmäßig eingerichtete Konten (z. B. Gastkonten) MÜSSEN deaktiviert oder gelöscht werden."
                  },
                  {
                    "statement-id": "ORP.4.A1-m4",
                    "uuid": "540d47f8-7276-4764-88dd-a8397330cb3f",
                    "description": "Der Prozess zur Verwaltung von Benutzendenkonten ist weitgehend automatisiert. Die Deaktivierung inaktiver Konten erfolgt automatisch. Es finden regelmäßige, protokollierte Rezertifizierungen aller Konten und Gruppen durch die jeweiligen Fachverantwortlichen statt."
                  },
                  {
                    "statement-id": "ORP.4.A1-m5",
                    "uuid": "247e6e17-70fd-47ff-9a05-7f8b2c505024",
                    "description": "Der gesamte Lebenszyklus von Identitäten (einschließlich digitaler Zertifikate und Service-Konten) wird durch ein zentrales, hochintegriertes Identity-and-Access-Management-System (IAM) vollautomatisiert verwaltet. Das System überwacht kontinuierlich die Gültigkeit von Konten und Gruppen und passt diese bei Bedarf in Echtzeit an. Anomalien im Kontoerstellungsprozess lösen automatische Warnmeldungen aus."
                  }
                ]
              },
              {
                "uuid": "7e75a1db-0eaa-4274-95dd-b65e030c0ec7",
                "control-id": "BER.1.4",
                "description": "Implementation for BER.1.4 based on BSI ORP.4.A3",
                "statements": [
                  {
                    "statement-id": "ORP.4.A3-m3",
                    "uuid": "b72efed9-d325-4fd4-9e57-fb6413eca2d6",
                    "description": "Es MUSS dokumentiert werden, welche Benutzendenkennungen, Benutzendengruppen und Rechteprofile angelegt und zugelassen sind. Diese Dokumentation MUSS regelmäßig daraufhin überprüft werden, ob sie den tatsächlichen Stand widerspiegelt und den aktuellen Anforderungen entspricht. Die Dokumentation MUSS vor unberechtigtem Zugriff geschützt werden und SOLLTE in das Datensicherungsverfahren einbezogen werden."
                  },
                  {
                    "statement-id": "ORP.4.A3-m4",
                    "uuid": "ef2518d1-f2c2-49b9-9af7-03c2f9687d12",
                    "description": "Die Dokumentation der Benutzendenkennungen, Gruppen und Rechteprofile wird durch ein IAM-System oder spezialisierte Reporting-Tools weitgehend automatisiert erstellt. Die regelmäßige Überprüfung wird durch automatisierte Vergleiche zwischen Soll-Konzept (in der Dokumentation) und Ist-Zustand (in den Systemen) unterstützt."
                  },
                  {
                    "statement-id": "ORP.4.A3-m5",
                    "uuid": "e5b56b89-9496-46e3-9d2b-a4c3ea19cc4e",
                    "description": "Die Dokumentation ist integraler Bestandteil eines zentralen IAM-Systems oder einer CMDB und wird in Echtzeit aktualisiert. Jede Änderung an Konten, Gruppen oder Rollen wird automatisch protokolliert und dokumentiert. Die Überprüfung ist ein kontinuierlicher Prozess, bei dem Abweichungen von der definierten Baseline sofort gemeldet und nachverfolgt werden."
                  }
                ]
              },
              {
                "uuid": "fb0072f1-7675-4ff6-8bc9-31c29baede1b",
                "control-id": "BER.3.1",
                "description": "Implementation for BER.3.1 based on BSI ORP.6.A14",
                "statements": [
                  {
                    "statement-id": "ORP.6.A14_L3",
                    "uuid": "3fa83ad7-9d0a-4dad-b4c7-126191b66c34",
                    "description": "In einer Multi-Cloud-Umgebung werden Berechtigungen nativ in jedem einzelnen Cloud-Anbieter verwaltet. Es existieren ähnliche, aber getrennte Richtlinien und Prozesse für jeden Anbieter."
                  },
                  {
                    "statement-id": "ORP.6.A14_L5",
                    "uuid": "d158766c-7501-494f-90c9-43d27b45a299",
                    "description": "In Multi-Cloud-Szenarien SOLLTE eine zentrale IAM-Lösung (Cloud Infrastructure Entitlement Management, CIEM) eingesetzt werden, um eine einheitliche Übersicht und Kontrolle über die Berechtigungen über alle Cloud-Anbieter hinweg zu gewährleisten."
                  }
                ]
              },
              {
                "uuid": "f6892ca3-41d5-4f89-bc58-d92e606a1624",
                "control-id": "BER.3.13",
                "description": "Implementation for BER.3.13 based on BSI ORP.4.A24",
                "statements": [
                  {
                    "statement-id": "ORP.4.A24-m3",
                    "uuid": "d0c7e429-5652-4467-a578-2950005baf20",
                    "description": "Administrative Tätigkeiten SOLLTEN nur durch zwei Personen durchgeführt werden können (Vier-Augen-Prinzip). Bei MFA SOLLTEN die Faktoren auf die zwei Personen verteilt werden. Bei Passwörtern SOLLTEN diese in zwei Teile zerlegt werden, wobei jede Person einen Teil erhält."
                  },
                  {
                    "statement-id": "ORP.4.A24-m4",
                    "uuid": "b2c60f03-fb66-4c72-90d5-b25cee644987",
                    "description": "Das Vier-Augen-Prinzip wird durch technische Maßnahmen für kritische Änderungen durchgesetzt. Änderungen an Systemen müssen von einer Person initiiert und von einer zweiten, unabhängigen Person genehmigt werden, bevor sie wirksam werden."
                  },
                  {
                    "statement-id": "ORP.4.A24-m5",
                    "uuid": "abe2642c-eebe-4934-8c3b-a1882356b563",
                    "description": "Alle administrativen Sitzungen auf kritischen Systemen erfordern eine Echtzeit-Dual-Control-Genehmigung über eine PAM-Lösung. Kryptografische Operationen mit hoher Tragweite erfordern die Beteiligung mehrerer Personen durch den Einsatz von Schwellenwert-Kryptografie (z.B. Shamir's Secret Sharing)."
                  }
                ]
              },
              {
                "uuid": "0dc18467-d48f-48e2-b236-6fd977707b7c",
                "control-id": "BER.4.1",
                "description": "Implementation for BER.4.1 based on BSI ORP.6.A2",
                "statements": [
                  {
                    "statement-id": "ORP.6.A2_L3",
                    "uuid": "b8fa27ba-870c-42f4-81fd-9f26e1a22b1b",
                    "description": "Es MUSS ein grundlegendes, rollenbasiertes Zugriffskonzept (RBAC) umgesetzt werden, das mindestens zwischen Lesenden, Bearbeitern und Besitzern von Ressourcen unterscheidet."
                  },
                  {
                    "statement-id": "ORP.6.A2_L4",
                    "uuid": "0c18d17a-5920-4a14-b170-e38d0806e2de",
                    "description": "Das RBAC-Modell ist detailliert dokumentiert und umfasst zusätzlich zu den Standardrollen auch benutzerdefinierte Rollen, die granularer sind und spezifisch auf die Aufgaben von Teams oder Anwendungen zugeschnitten sind. Die Nutzung von breiten Rollen wie 'Besitzer' ist auf wenige Ausnahmen beschränkt."
                  },
                  {
                    "statement-id": "ORP.6.A2_L5",
                    "uuid": "fa4689c0-7877-4a3a-80d7-d20af3da66c7",
                    "description": "Das RBAC-Modell wird zentral verwaltet, ist versioniert (z. B. über Git) und wird automatisiert mittels Infrastructure-as-Code (IaC) auf die Cloud-Umgebung angewendet. Rollendefinitionen und -zuweisungen werden regelmäßig und automatisiert auf Basis der tatsächlichen Nutzung und der Teamverantwortlichkeiten überprüft und angepasst."
                  }
                ]
              },
              {
                "uuid": "503c6274-7397-4dfa-a8da-f39eca93b573",
                "control-id": "BER.4.3",
                "description": "Implementation for BER.4.3 based on BSI ORP.6.A9",
                "statements": [
                  {
                    "statement-id": "ORP.6.A9_L3",
                    "uuid": "dc341fb4-648b-421f-aebe-27a531731d1b",
                    "description": "Die zugewiesenen Berechtigungen für alle Identitäten SOLLTEN in regelmäßigen Abständen überprüft werden. Nicht mehr benötigte oder überprivilegierte Zugriffe SOLLTEN entfernt werden. Dieser Prozess SOLLTE, wo möglich, automatisiert werden."
                  },
                  {
                    "statement-id": "ORP.6.A9_L4",
                    "uuid": "5943a25e-0336-4686-b5f2-c5037b455a4b",
                    "description": "Halbautomatisierte Access Reviews werden vierteljährlich für alle Identitäten durchgeführt. Ressourcen-Verantwortliche oder Vorgesetzte werden automatisch benachrichtigt, um den fortgesetzten Zugriff zu genehmigen oder zu verweigern. Eine ausbleibende Reaktion führt nach einer Nachfrist zur automatischen Entziehung des Zugriffs."
                  },
                  {
                    "statement-id": "ORP.6.A9_L5",
                    "uuid": "d3aafed3-b2ad-4dc6-b5da-85251a1e86ad",
                    "description": "Access Reviews sind mithilfe eines CIEM-Tools vollständig automatisiert. Das System bietet kontinuierliche Transparenz über effektive Berechtigungen und deren Nutzung und initiiert automatisch Mikro-Zertifizierungen basierend auf Risiko, Inaktivität oder Änderungen der Benutzerrolle. Veralteter Zugriff wird ohne manuelles Eingreifen automatisch entzogen."
                  }
                ]
              },
              {
                "uuid": "30d49894-87a5-4475-8ea2-176f439922c0",
                "control-id": "BER.4.4",
                "description": "Implementation for BER.4.4 based on BSI DER.2.3.A4",
                "statements": [
                  {
                    "statement-id": "der.2.3-a4-m1",
                    "uuid": "4dd3a64d-74ec-4f5a-9a24-d36d46b3bd7d",
                    "description": "Es werden nur die Passwörter der bekannten Administratoren geändert. Passwörter von regulären Benutzern, Dienstkonten oder Systemkonten werden nicht berücksichtigt. Kryptografische Schlüssel werden nicht geändert."
                  },
                  {
                    "statement-id": "der.2.3-a4-m2",
                    "uuid": "d7a1597d-97ab-45cc-964f-25578861ae19",
                    "description": "Alle Passwörter von menschlichen Benutzern (Administratoren und Standardbenutzer) werden zurückgesetzt. Dienstkonten und in Anwendungen hartkodierte Zugangsdaten werden jedoch größtenteils übersehen. Ein Austausch von TLS-Zertifikaten oder anderen Schlüsseln findet nicht statt."
                  },
                  {
                    "statement-id": "der.2.3-a4-m3",
                    "uuid": "358977be-ad2e-43a5-a949-cff4a6273559",
                    "description": "Alle Zugangsdaten MÜSSEN geändert werden, nachdem das Netz isoliert wurde. Zentral verwaltete Zugangsdaten (z.B. in Active Directory) MÜSSEN zurückgesetzt werden. Ist der zentrale Authentisierungsserver kompromittiert, MÜSSEN sämtliche dort vorhandenen Zugänge gesperrt und ihre Passwörter ausgetauscht werden. Wurden TLS-Schlüssel oder eine interne CA kompromittiert, MÜSSEN entsprechende Schlüssel, Zertifikate und Infrastrukturen neu erzeugt und die kompromittierten Artefakte zuverlässig gesperrt und zurückgerufen werden."
                  },
                  {
                    "statement-id": "der.2.3-a4-m4",
                    "uuid": "a6e91a35-9f46-4575-b798-99b64ea2cd09",
                    "description": "Der Prozess zum Zurücksetzen aller Zugangsdaten ist weitgehend automatisiert und umfasst alle Arten von Secrets, einschließlich API-Schlüssel, SSH-Schlüssel und in Konfigurationen gespeicherte Passwörter. Der Prozess ist dokumentiert und wird regelmäßig geübt. Eine dedizierte Public Key Infrastructure (PKI) wird genutzt, um den Austausch und die Verteilung neuer Zertifikate effizient zu gestalten."
                  },
                  {
                    "statement-id": "der.2.3-a4-m5",
                    "uuid": "e9e04750-e2d8-4549-912b-26a3ed35b08b",
                    "description": "Die Rotation aller Zugangsdaten und kryptografischen Schlüssel im gesamten Informationsverbund ist vollständig automatisiert und kann innerhalb weniger Minuten ausgelöst werden. Der Prozess ist in die SOAR-Plattform integriert. Es werden kurzlebige, dynamisch erzeugte Zertifikate und Zugangsdaten verwendet, um das Zeitfenster für deren Missbrauch drastisch zu reduzieren."
                  }
                ]
              },
              {
                "uuid": "99e52335-4867-49bc-9f36-74b1c39ec017",
                "control-id": "BER.5.4",
                "description": "Implementation for BER.5.4 based on BSI ORP.4.A10",
                "statements": [
                  {
                    "statement-id": "ORP.4.A10-m3",
                    "uuid": "47cadfe5-b93b-4540-86ae-a1e3c8718b18",
                    "description": "Benutzendenkennungen mit weitreichenden Berechtigungen (z.B. Administratorenkonten) SOLLTEN mit einer Mehr-Faktor-Authentisierung (MFA) geschützt werden. Als Faktoren können beispielsweise kryptografische Zertifikate, Chipkarten oder Token verwendet werden."
                  },
                  {
                    "statement-id": "ORP.4.A10-m4",
                    "uuid": "0a3297e7-b121-405c-b1d4-9f83a1cb059a",
                    "description": "Für alle administrativen Zugriffe werden physisch-resistente MFA-Methoden, wie z.B. Hardware-Token (FIDO2), eingesetzt. Privilegierte Zugriffe erfolgen über eine dedizierte Privileged Access Workstation (PAW), um die Angriffsfläche zu reduzieren."
                  },
                  {
                    "statement-id": "ORP.4.A10-m5",
                    "uuid": "7cef66cd-ae5f-4545-86cf-b783275930be",
                    "description": "Alle privilegierten Zugriffe werden über eine Privileged Access Management (PAM)-Lösung abgewickelt. Diese erzwingt MFA, vaulting von Anmeldedaten, Just-in-Time (JIT) Zugriff und zeichnet alle administrativen Sitzungen auf."
                  }
                ]
              },
              {
                "uuid": "157f4676-6d94-4d69-baea-dec75d2962d4",
                "control-id": "BER.5.7",
                "description": "Implementation for BER.5.7 based on BSI ORP.4.A8",
                "statements": [
                  {
                    "statement-id": "ORP.4.A8-m3",
                    "uuid": "fee21000-5baf-40b4-8199-183663e8a401",
                    "description": "Die Institution MUSS den Passwortgebrauch verbindlich regeln. Passwörter DÜRFEN NICHT mehrfach verwendet werden. Leicht zu erratende Passwörter DÜRFEN NICHT verwendet werden. Passwörter MÜSSEN geheim gehalten und DÜRFEN NUR unbeobachtet eingegeben werden. Sie DÜRFEN NICHT auf Funktionstasten gespeichert werden. Ein Passwort DARF NUR für eine Notfall-Hinterlegung schriftlich fixiert und dann sicher aufbewahrt werden. Die Nutzung eines Passwort-Managers SOLLTE geprüft werden; Synchronisierungsfunktionen über Drittanbieter MÜSSEN deaktiviert werden. Ein Passwort MUSS bei Kompromittierung oder Verdacht darauf gewechselt werden."
                  },
                  {
                    "statement-id": "ORP.4.A8-m4",
                    "uuid": "1e784251-94a4-4136-9657-66b7400fa252",
                    "description": "Die Einhaltung der Passwortrichtlinie wird durch technische Maßnahmen erzwungen. Dies beinhaltet die Durchsetzung einer Passwort-Historie, um die Wiederverwendung zu verhindern, und die Überprüfung von neuen Passwörtern gegen eine Liste von bekannten schwachen und kompromittierten Passwörtern. Die Nutzung eines zentral verwalteten Passwort-Managers ist für alle Mitarbeiter verpflichtend."
                  }
                ]
              },
              {
                "uuid": "2c93d185-4bc2-48ba-a332-9a23f66a1cba",
                "control-id": "BER.6.3",
                "description": "Implementation for BER.6.3 based on BSI ORP.4.A11",
                "statements": [
                  {
                    "statement-id": "ORP.4.A11-m3",
                    "uuid": "c09b96a3-1406-47b5-ab46-371ce8fd3777",
                    "description": "Für das Zurücksetzen von Passwörtern SOLLTE ein angemessenes sicheres Verfahren definiert und umgesetzt werden. Die Mitarbeitenden des IT-Betriebs, die Passwörter zurücksetzen können, SOLLTEN entsprechend geschult werden. Bei höherem Schutzbedarf SOLLTE eine Strategie definiert werden, falls die Verantwortung für die Übermittlung nicht übernommen werden kann."
                  },
                  {
                    "statement-id": "ORP.4.A11-m4",
                    "uuid": "31f9a84e-df0e-4641-ae14-d397e53c4183",
                    "description": "Ein sicheres Self-Service Password Reset (SSPR)-Portal wird für alle Benutzer bereitgestellt. Die Registrierung für SSPR erfordert eine Mehr-Faktor-Authentisierung. Das Zurücksetzen von Passwörtern durch den Helpdesk ist nur noch in begründeten Ausnahmefällen möglich und folgt einem strengen Protokoll."
                  }
                ]
              },
              {
                "uuid": "d7c428c4-e501-46c0-b102-5cfd3c472704",
                "control-id": "BER.7.1",
                "description": "Implementation for BER.7.1 based on BSI CON.1.A1",
                "statements": [
                  {
                    "statement-id": "con.1.a1-m1",
                    "uuid": "1accd624-f45e-4a84-9710-fb7609421b8e",
                    "description": "Kryptografische Verfahren werden nur für ausgewählte, besonders kritische Systeme eingesetzt. Die Auswahl der Algorithmen und Schlüssellängen erfolgt ad-hoc, oft basierend auf den Standardeinstellungen der jeweiligen Software und ohne eine formale, dokumentierte Bewertung oder Berücksichtigung aktueller Sicherheitsempfehlungen."
                  },
                  {
                    "statement-id": "con.1.a1-m2",
                    "uuid": "dbb7538c-7163-412f-b022-43755f10e50a",
                    "description": "Es existiert eine grundlegende, informelle Liste empfohlener kryptografischer Verfahren und Schlüssellängen, die für neue Systeme verwendet wird. Bestehende Systeme werden jedoch nicht systematisch daraufhin überprüft. Die Auswahl orientiert sich an allgemein bekannten Standards, eine spezifische Anpassung an die Schutzdauer der Daten findet nicht statt."
                  },
                  {
                    "statement-id": "con.1.a1-m3",
                    "uuid": "75f3046b-e602-4ca4-b3b6-ffe32de5bfc2",
                    "description": "Es MÜSSEN geeignete kryptografische Verfahren ausgewählt werden. Dabei MUSS sichergestellt sein, dass etablierte Algorithmen verwendet werden, die von der Fachwelt intensiv untersucht wurden und von denen keine Sicherheitslücken bekannt sind. Ebenso MÜSSEN aktuell empfohlene Schlüssellängen verwendet werden. Diese Auswahlkriterien sind im Kryptokonzept dokumentiert und für alle Systeme verbindlich."
                  },
                  {
                    "statement-id": "con.1.a1-m4",
                    "uuid": "ca9282fe-23ce-4964-b171-a0d985df5165",
                    "description": "Zusätzlich zu den definierten Standards wird bei der Auswahl der Schlüssellänge systematisch die geplante Einsatzdauer des kryptografischen Verfahrens berücksichtigt. Bei einer längeren geplanten Einsatzdauer SOLLTEN vorausschauend längere Schlüssellängen eingesetzt werden. Der Prozess zur Auswahl und Überprüfung von Kryptoverfahren wird regelmäßig, z. B. jährlich, durchgeführt."
                  },
                  {
                    "statement-id": "con.1.a1-m5",
                    "uuid": "d6ab19a9-963b-4d74-95c7-c6b7a99259b0",
                    "description": "Die Auswahl kryptografischer Verfahren ist ein dynamischer, proaktiver Prozess, der in das Risikomanagement integriert ist. Die Organisation überwacht kontinuierlich die Forschung im Bereich der Kryptografie und Post-Quanten-Kryptografie. Die eingesetzten Systeme sind auf Krypto-Agilität ausgelegt, um einen schnellen und automatisierten Austausch von Algorithmen und Schlüsseln zu ermöglichen."
                  }
                ]
              },
              {
                "uuid": "ae8b06e4-6b39-41de-ab5f-89463c537534",
                "control-id": "BER.7.14",
                "description": "Implementation for BER.7.14 based on BSI OPS.1.2.2.A15",
                "statements": [
                  {
                    "statement-id": "ops.1.2.2-a15-m1",
                    "uuid": "ed4656f6-8da1-490f-a2fe-2a27cee6718d",
                    "description": "Kryptografisch gesicherte Daten werden nach ihrer Erstellung nicht mehr betrachtet. Einmal signiert oder verschlüsselt, wird der Zustand nicht mehr überprüft, auch wenn die verwendeten Algorithmen bekanntermaßen unsicher werden."
                  },
                  {
                    "statement-id": "ops.1.2.2-a15-m2",
                    "uuid": "d480bc07-ee86-4b06-b60d-59de462535d4",
                    "description": "Es besteht ein Bewusstsein dafür, dass kryptografische Verfahren altern können. Eine Erneuerung der kryptografischen Sicherung wird jedoch nur reaktiv in Betracht gezogen, wenn ein Algorithmus öffentlich als gebrochen gilt."
                  },
                  {
                    "statement-id": "ops.1.2.2-a15-m3",
                    "uuid": "f5bc764e-4b50-4e7c-aee4-dc18c5ea8aca",
                    "description": "Es SOLLTE kontinuierlich beobachtet werden, wie sich das Gebiet der Kryptografie entwickelt, um beurteilen zu können, ob ein Algorithmus weiterhin zuverlässig und ausreichend sicher ist. Archivdaten, die mit kryptografischen Verfahren gesichert wurden, die sich in absehbarer Zeit nicht mehr zur Sicherung eignen werden, SOLLTEN rechtzeitig mit geeigneten Verfahren neu gesichert werden."
                  },
                  {
                    "statement-id": "ops.1.2.2-a15-m4",
                    "uuid": "5a90a948-04aa-404f-a9b6-2b1452fd695b",
                    "description": "Eine formale Richtlinie zur Krypto-Agilität ist etabliert. Sie definiert, welche Algorithmen mit welchen Parametern als 'sicher', 'gefährdet' oder 'unsicher' gelten und legt Zeiträume für die Migration fest. Ein geplanter, wiederkehrender Prozess führt die Erneuerung der kryptografischen Sicherung (z.B. Nachsignierung) durch, lange bevor die alten Verfahren als unsicher gelten."
                  },
                  {
                    "statement-id": "ops.1.2.2-a15-m5",
                    "uuid": "a2fab3c3-536b-41ca-8f96-2e69a6f0c60b",
                    "description": "Der Prozess der kryptografischen Erneuerung ist vollständig automatisiert. Das Archivsystem führt ein Inventar aller kryptografischen Metadaten (verwendete Algorithmen, Schlüsselstärken, Erstellungsdaten). Basierend auf der Krypto-Agilitäts-Richtlinie kennzeichnet und erneuert das System automatisch Objekte, die eine Erneuerung benötigen."
                  }
                ]
              },
              {
                "uuid": "d2fab288-d9db-44d9-b9c4-0f4603f97fc2",
                "control-id": "BES.1.1",
                "description": "Implementation for BES.1.1 based on BSI ISMS.1.A5",
                "statements": [
                  {
                    "statement-id": "isms.1.a5-m1",
                    "uuid": "b2ff5a6a-156c-4608-8251-5be5dd50bc7f",
                    "description": "Ein externer Dienstleister wird auf informeller Basis oder per Handschlag mit ISB-Aufgaben betraut. Ein detaillierter Vertrag fehlt."
                  },
                  {
                    "statement-id": "isms.1.a5-m2",
                    "uuid": "ccf2ad8d-9b32-4d2c-842a-4315ea4a9b5c",
                    "description": "Es wird ein Standard-Dienstleistungsvertrag verwendet, der die ISB-Aufgaben nur allgemein beschreibt. Spezifische Regelungen zu Vertraulichkeit, Berichtswesen oder einer kontrollierten Beendigung des Verhältnisses fehlen."
                  },
                  {
                    "statement-id": "isms.1.a5-m3",
                    "uuid": "bc3bb832-3bc4-4882-b572-d01fffe97729",
                    "description": "Wenn die Rolle des oder der ISB nicht durch einen internen Mitarbeitenden besetzt werden kann, MUSS die Institutionsleitung einen externen oder eine externe ISB bestellen. Der Vertrag mit einem oder einer externen ISB MUSS alle Aufgaben des oder der ISB sowie die damit verbundenen Rechte und Pflichten umfassen. Der Vertrag MUSS eine geeignete Vertraulichkeitsvereinbarung umfassen. Der Vertrag MUSS eine kontrollierte Beendigung des Vertragsverhältnisses, einschließlich der Übergabe der Aufgaben an die Auftraggebenden, gewährleisten."
                  },
                  {
                    "statement-id": "isms.1.a5-m4",
                    "uuid": "c5505ef9-723a-4310-8dbc-846746246163",
                    "description": "Der Vertrag mit dem externen ISB enthält klare Service Level Agreements (SLAs) für wesentliche Aufgaben. Dies umfasst beispielsweise Reaktionszeiten bei Sicherheitsvorfällen, Fristen für die Lieferung von Berichten und die Verfügbarkeit für Beratungen. Der Vertrag regelt auch Haftungsfragen."
                  },
                  {
                    "statement-id": "isms.1.a5-m5",
                    "uuid": "9e7a025a-de21-4add-bd98-933ca808cd41",
                    "description": "Die Leistung des externen ISB wird regelmäßig anhand der vertraglich vereinbarten SLAs und Key Performance Indicators (KPIs) bewertet. Der Vertrag enthält Klauseln, die eine unabhängige Prüfung (Audit) der Dienstleistung des externen ISB durch Dritte ermöglichen. Es bestehen klare Eskalationspfade bei Nichterfüllung."
                  }
                ]
              },
              {
                "uuid": "aab45d80-41b4-4749-af13-6aa69a34889d",
                "control-id": "DET.1.1",
                "description": "Implementation for DET.1.1 based on BSI OPS.1.1.1.A21",
                "statements": [
                  {
                    "statement-id": "ops.1.1.1-a21-m3",
                    "uuid": "980e27df-de67-4e0a-acc7-18668f2d586b",
                    "description": "Die IT-Systeme und -Anwendungen, die als Betriebsmittel genutzt werden, werden in das grundlegende Sicherheitsmonitoring einbezogen. Ihre Log-Dateien werden zentral gesammelt und auf kritische Ereignisse wie fehlgeschlagene Logins oder Konfigurationsänderungen überwacht."
                  },
                  {
                    "statement-id": "ops.1.1.1-a21-m5",
                    "uuid": "98ed9f26-6bff-42d7-8883-ea9494d485e7",
                    "description": "Die IT-Systeme und -Anwendungen, die als Betriebsmittel genutzt werden, SOLLTEN in ein Sicherheitsmonitoring eingebunden werden. Falls die Institution ein System zur zentralen Detektion und automatisierten Echtzeitüberprüfung von Ereignismeldungen einsetzt, SOLLTEN die Betriebsmittel darin eingebunden werden. Betriebsmittel wie IT-Management- und IT-Monitoring-Systeme SOLLTEN als Datenquelle für das Sicherheitsmonitoring genutzt werden."
                  }
                ]
              },
              {
                "uuid": "69e20180-1bca-4609-bda2-2f25e71bfd10",
                "control-id": "DET.2.1",
                "description": "Implementation for DET.2.1 based on BSI OPS.1.1.4.A9",
                "statements": [
                  {
                    "statement-id": "OPS.1.1.4.A9-m1",
                    "uuid": "b8111cda-8c78-4ff2-8be9-80bf764d1085",
                    "description": "Alarme des Virenschutzprogramms werden nur auf dem lokalen System des Benutzers angezeigt. Es liegt in der Verantwortung des Benutzers, diese zu bemerken und an die IT zu melden. Es gibt keine zentrale Protokollierung oder Alarmierung."
                  },
                  {
                    "statement-id": "OPS.1.1.4.A9-m2",
                    "uuid": "dd10795b-931c-4c9f-b476-450f709bf932",
                    "description": "Alarme des Virenschutzprogramms werden an eine zentrale Konsole oder per E-Mail an einen IT-Administrator weitergeleitet. Es existiert ein informeller, nicht dokumentierter Prozess zur Bearbeitung dieser Alarme."
                  },
                  {
                    "statement-id": "OPS.1.1.4.A9-m3",
                    "uuid": "9c25299a-f56a-44f1-b4b2-97b042e616f9",
                    "description": "Das eingesetzte Virenschutzprogramm SOLLTE eine Infektion mit einem Schadprogramm automatisch blockieren und melden. Die automatische Meldung SOLLTE an einer zentralen Stelle angenommen werden. Dabei SOLLTEN die zuständigen Mitarbeitenden je nach Sachlage über das weitere Vorgehen entscheiden. Das Vorgehen bei Meldungen und Alarmen der Virenschutzprogramme SOLLTE geplant, dokumentiert und getestet werden. Es SOLLTE insbesondere geregelt sein, was im Falle einer bestätigten Infektion geschehen soll."
                  },
                  {
                    "statement-id": "OPS.1.1.4.A9-m4",
                    "uuid": "25868812-35b7-43f1-9200-23aacd310358",
                    "description": "Die zentrale Alarmierung ist in ein Ticketsystem integriert, um sicherzustellen, dass alle Alarme nachverfolgt und bearbeitet werden. Der dokumentierte Reaktionsplan enthält unterschiedliche Vorgehensweisen für verschiedene Arten von Schadprogrammen (z. B. Adware, Spyware, Ransomware). Der Plan wird mindestens jährlich durch Übungen (Tabletop-Exercises) getestet."
                  },
                  {
                    "statement-id": "OPS.1.1.4.A9-m5",
                    "uuid": "468b688b-1609-4937-b986-1a91fa6c524a",
                    "description": "Die Alarmierung des Virenschutzprogramms ist vollständig in eine Security Orchestration, Automation, and Response (SOAR)-Plattform integriert. Basierend auf der Art und Kritikalität des Alarms werden erste Reaktionsschritte, wie die Isolierung des betroffenen Systems vom Netzwerk oder die Sperrung von C2-Kommunikation auf der Firewall, automatisch ausgeführt. Nach jedem größeren Vorfall wird eine 'Post-Mortem'-Analyse durchgeführt, um die Präventions- und Reaktionsmaßnahmen zu verbessern."
                  }
                ]
              },
              {
                "uuid": "a72c3a62-49be-4ff9-a76b-1e7a6d48f1ec",
                "control-id": "DET.2.2",
                "description": "Implementation for DET.2.2 based on BSI DER.1.A14",
                "statements": [
                  {
                    "statement-id": "der.1.a14-m2",
                    "uuid": "576f2426-87db-485a-b8ef-fd3f5769c723",
                    "description": "Ein Team hat die Überwachung von Protokolldaten als eine seiner vielen Verantwortlichkeiten. Es ist jedoch nicht ihre primäre oder alleinige Aufgabe, und es fehlt an tiefgehender Spezialisierung."
                  },
                  {
                    "statement-id": "der.1.a14-m3",
                    "uuid": "41ef3e55-6be9-40f4-abcd-c46c5a73a08f",
                    "description": "Es SOLLTEN Mitarbeitende speziell damit beauftragt werden, alle Protokollierungsdaten zu überwachen. Die Überwachung der Protokollierungsdaten SOLLTE die überwiegende Aufgabe der beauftragten Mitarbeitenden sein. Die beauftragten Mitarbeitenden SOLLTEN spezialisierte weiterführende Schulungen und Qualifikationen erhalten. Ein Personenkreis SOLLTE benannt werden, der ausschließlich für das Thema Auswertung von Protokollierungsdaten verantwortlich ist."
                  },
                  {
                    "statement-id": "der.1.a14-m4",
                    "uuid": "d83a7986-dab3-40f7-967c-7005de4e80c3",
                    "description": "Ein mehrstufiges SOC (z.B. L1, L2, L3 Analysten) mit klar definierten Rollen, Verantwortlichkeiten und Eskalationspfaden ist etabliert. Das Team verfügt über ein festes Budget für fortgeschrittene Schulungen und Zertifizierungen und nimmt regelmäßig an Übungen teil."
                  },
                  {
                    "statement-id": "der.1.a14-m5",
                    "uuid": "0d999464-1948-4e58-8ad8-0725a866580e",
                    "description": "Das spezialisierte Team agiert als anerkannte Expertenorganisation. Die Mitarbeiter führen nicht nur Überwachungsaufgaben durch, sondern betreiben aktiv proaktives Threat Hunting, entwickeln eigene Analysewerkzeuge, führen Reverse Engineering von Malware durch und tragen durch Veröffentlichungen oder Vorträge zur Sicherheits-Community bei."
                  }
                ]
              },
              {
                "uuid": "ccea7033-cac2-4b76-8085-06d58fc28f19",
                "control-id": "DET.3.1",
                "description": "Implementation for DET.3.1 based on BSI ORP.6.A5",
                "statements": [
                  {
                    "statement-id": "ORP.6.A5_L3",
                    "uuid": "9ef33d0b-2962-4173-95ba-831e71bba0a7",
                    "description": "Alle sicherheitsrelevanten IAM-Ereignisse, insbesondere Anmeldeversuche, API-Aufrufe und Änderungen an Berechtigungen, MÜSSEN protokolliert und an einem zentralen Ort gesammelt werden."
                  },
                  {
                    "statement-id": "ORP.6.A5_L4",
                    "uuid": "da03e085-182d-4a92-ab04-183a8d065c7c",
                    "description": "IAM-Protokolle werden in ein SIEM-System (Security Information and Event Management) eingespeist. Es sind spezifische Korrelationsregeln und Alarme für verdächtige IAM-Aktivitäten konfiguriert, wie z. B. versuchte Rechteausweitung, Zugriff von ungewöhnlichen Standorten oder mehrfache fehlgeschlagene Anmeldeversuche."
                  },
                  {
                    "statement-id": "ORP.6.A5_L5",
                    "uuid": "088f2057-af1a-4cf8-bd5e-7eedcd31fe9f",
                    "description": "Die Analyse der IAM-Protokolle ist hochgradig automatisiert und nutzt maschinelles Lernen, um Anomalien im Nutzer- und Entitätsverhalten (UEBA) zu erkennen. Die Alarmierung ist in SOAR-Playbooks (Security Orchestration, Automation and Response) integriert, um automatisierte Reaktionen wie die Sperrung eines Kontos oder die Anforderung einer erneuten Authentifizierung auszulösen."
                  }
                ]
              },
              {
                "uuid": "af58543e-81b0-4b7b-8662-45eb749ae8dd",
                "control-id": "DET.3.4",
                "description": "Implementation for DET.3.4 based on BSI OPS.1.1.5.A10",
                "statements": [
                  {
                    "statement-id": "ops.1.1.5.a10-m1",
                    "uuid": "17b0ad69-e94a-4ab4-96cb-d75592f0ff1d",
                    "description": "Der Zugriff auf Protokolldateien ist auf die Gruppe der Administratoren beschränkt, diese haben jedoch volle Lese-, Schreib- und Löschrechte. Eine Funktionstrennung ist nicht umgesetzt."
                  },
                  {
                    "statement-id": "ops.1.1.5.a10-m2",
                    "uuid": "df61a284-fa6f-4d05-a7a8-2700d991a9fb",
                    "description": "Es werden grundlegende Dateisystemberechtigungen verwendet, um eine direkte Veränderung zu erschweren (z.B. durch Setzen des 'append-only' Attributs). Ein privilegierter Administrator (root) kann diese Schutzmaßnahmen jedoch leicht umgehen."
                  },
                  {
                    "statement-id": "ops.1.1.5.a10-m3",
                    "uuid": "f1d98a63-ae49-4ba1-a5df-8a59ed9b91c6",
                    "description": "Es SOLLTE sichergestellt sein, dass die ausführenden Administratoren, die die Systeme betreuen, selbst keine Berechtigung haben, die aufgezeichneten Protokollierungsdaten zu verändern oder zu löschen. Dies erfordert eine technische Funktionstrennung."
                  },
                  {
                    "statement-id": "ops.1.1.5.a10-m4",
                    "uuid": "ce024533-0c84-4256-ad64-dac71d94aff9",
                    "description": "Eine rollenbasierte Zugriffskontrolle (RBAC) wird im zentralen Protokollierungssystem strikt durchgesetzt. Alle Zugriffe auf Protokolldaten, auch Lesezugriffe, werden selbst protokolliert (Read-Access-Logging) und regelmäßig, stichprobenartig überprüft."
                  },
                  {
                    "statement-id": "ops.1.1.5.a10-m5",
                    "uuid": "367ba39d-4c91-4403-bd06-3a5847e9a780",
                    "description": "Protokolldaten werden auf einen WORM-kompatiblen Speicher (Write-Once, Read-Many) geschrieben, was eine nachträgliche Veränderung technisch unmöglich macht, selbst für den höchstprivilegierten Administrator. Die Zugriffskontrolle wird über ein separates, dediziertes Identitätsmanagementsystem mit verpflichtender Multi-Faktor-Authentifizierung für alle Benutzer verwaltet."
                  }
                ]
              },
              {
                "uuid": "28fa5cbf-a987-4b06-ba5d-a82816d9f83c",
                "control-id": "DET.5.1",
                "description": "Implementation for DET.5.1 based on BSI CON.1.A15",
                "statements": [
                  {
                    "statement-id": "con.1.a15-m1",
                    "uuid": "a7ee51b3-0585-44cc-84ff-b817dd15b8c7",
                    "description": "Auf bekannt gewordene Schwachstellen in Kryptoverfahren wird nur reaktiv reagiert, typischerweise erst, nachdem die Schwachstelle öffentlichkeitswirksam ausgenutzt wurde. Es gibt keinen proaktiven Prozess zur Überprüfung der eingesetzten Verfahren."
                  },
                  {
                    "statement-id": "con.1.a15-m2",
                    "uuid": "f5311bee-7e17-4ec3-abc8-7a4d69ede674",
                    "description": "Es besteht ein informelles Bewusstsein für kryptografische Schwachstellen, z.B. durch das Lesen von IT-Nachrichten. Eine Überprüfung des eigenen Bestands erfolgt jedoch unregelmäßig und ist nicht terminiert. Ein Reaktionsprozess ist nicht dokumentiert."
                  },
                  {
                    "statement-id": "con.1.a15-m3",
                    "uuid": "20c00423-47d9-4242-8e6b-a1787e861e16",
                    "description": "Die Institution SOLLTE mindestens jährlich anhand des Krypto-Katasters überprüfen, ob die eingesetzten kryptografischen Verfahren und die zugehörigen Parameter noch ausreichend sicher sind und keine bekannten Schwachstellen aufweisen. Im Kryptokonzept SOLLTE ein Prozess für den Fall definiert und dokumentiert werden, dass Schwachstellen in kryptografischen Verfahren auftreten. Dabei SOLLTE sichergestellt werden, dass das geschwächte Verfahren entweder abgesichert oder durch eine geeignete Alternative abgelöst wird."
                  },
                  {
                    "statement-id": "con.1.a15-m4",
                    "uuid": "6b84dd09-c998-433b-a752-3352fbf64514",
                    "description": "Der Prozess zur Überprüfung wird durch semi-automatisierte Tools unterstützt, die das Krypto-Kataster oder die Live-Systeme mit Schwachstellendatenbanken abgleichen. Der definierte Reaktionsprozess umfasst einen Kommunikationsplan für interne und externe Stakeholder und ist in das allgemeine Incident- und Change-Management integriert."
                  },
                  {
                    "statement-id": "con.1.a15-m5",
                    "uuid": "29c8410f-1d2b-43eb-8dc7-4a618629df31",
                    "description": "Die Institution hat Prozesse und Technologien zur Erreichung von Krypto-Agilität etabliert. Die Identifizierung und der Austausch geschwächter Kryptografie sind hochgradig automatisiert. Die Überwachung stützt sich auf spezialisierte Threat-Intelligence-Feeds, die proaktiv über potenzielle zukünftige Schwächen (z.B. durch Fortschritte beim Quantencomputing) informieren."
                  }
                ]
              },
              {
                "uuid": "b4f6ca64-e1f7-4605-977e-8dd922e91866",
                "control-id": "DET.5.10",
                "description": "Implementation for DET.5.10 based on BSI OPS.1.1.3.A15",
                "statements": [
                  {
                    "statement-id": "ops.1.1.3-a15-m1",
                    "uuid": "df0b75bd-3157-44ba-8881-3d5e4ff7efed",
                    "description": "Updates werden unregelmäßig und meist nur reaktiv eingespielt, wenn Probleme auftreten. Eine systematische Bewertung oder Priorisierung von Patches findet nicht statt. Es existieren Systeme, deren Support abgelaufen ist."
                  },
                  {
                    "statement-id": "ops.1.1.3-a15-m2",
                    "uuid": "80acb097-b88b-4af9-9629-61f5ff873eae",
                    "description": "Es gibt einen festen Rhythmus für das Einspielen von Patches (z.B. monatlicher Patch-Day). Alle verfügbaren Patches werden in diesem Zuge installiert, jedoch ohne tiefgehende Bewertung ihrer Relevanz oder Dringlichkeit. Der Umgang mit nicht mehr unterstützter Software ist nicht geregelt."
                  },
                  {
                    "statement-id": "ops.1.1.3-a15-m3",
                    "uuid": "3af4b7ea-28c0-4ebf-9da8-b407248c76cd",
                    "description": "Basierend auf dem Konzept für das Patch- und Änderungsmanagement MÜSSEN Patches zeitnah nach Veröffentlichung bewertet und entsprechend ihrer Kritikalität priorisiert werden. Es MUSS entschieden werden, ob der Patch eingespielt wird. Wenn ein Patch nicht eingespielt wird, MÜSSEN die Entscheidung und die Gründe dafür dokumentiert werden. Falls Hardware- oder Software-Produkte eingesetzt werden, die nicht mehr vom Hersteller unterstützt werden, MUSS geprüft werden, ob diese dennoch sicher betrieben werden können. Ist dies nicht der Fall, DÜRFEN diese Produkte NICHT mehr verwendet werden."
                  },
                  {
                    "statement-id": "ops.1.1.3-a15-m4",
                    "uuid": "ef58617f-9378-4f43-8d02-997e05efbf48",
                    "description": "Grundsätzlich SOLLTEN Patches zeitnah nach Veröffentlichung eingespielt werden, insbesondere solche, die bekannte Schwachstellen beheben. Nach dem Einspielen SOLLTE kontrolliert werden, ob der Patch auf allen relevanten Systemen zeitnah und erfolgreich eingespielt wurde. Hierfür werden Verteilungstools eingesetzt, die einen Erfolgsstatus zurückmelden."
                  },
                  {
                    "statement-id": "ops.1.1.3-a15-m5",
                    "uuid": "3d4a2751-b928-483c-88f7-4a2304771220",
                    "description": "Der gesamte Prozess der Schwachstellen- und Patch-Verwaltung ist automatisiert. Dies umfasst das Abonnieren von Threat-Intelligence-Feeds, das automatische Abgleichen mit der CMDB, die Risikobewertung, die Erstellung von Änderungsanträgen und die Bereitstellung. Nicht mehr unterstützte Software wird automatisch erkannt und die betroffenen Systeme werden isoliert, bis eine Lösung gefunden ist."
                  }
                ]
              },
              {
                "uuid": "f5865287-1f16-440b-b010-887a691904d7",
                "control-id": "DET.5.2",
                "description": "Implementation for DET.5.2 based on BSI OPS.1.1.1.A10",
                "statements": [
                  {
                    "statement-id": "ops.1.1.1-a10-m3",
                    "uuid": "b8e7bc4f-e2da-4c0a-b124-c9fbc5f7e974",
                    "description": "Der IT-Betrieb SOLLTE ein Schwachstelleninventar führen, in dem die Schwachstellen aller betriebenen IT-Komponenten und der Umgang mit diesen zentral erfasst und gepflegt werden. Der IT-Betrieb SOLLTE die Behandlung der Schwachstellen initiieren, nachhalten und sicherstellen. Es SOLLTE ein Prozess definiert werden, der den Umgang mit den Schwachstellen festlegt und mindestens spezifiziert, bis wann Updates zu installieren sind und wann Komponenten außer Betrieb zu nehmen sind."
                  },
                  {
                    "statement-id": "ops.1.1.1-a10-m4",
                    "uuid": "0225007d-223c-4cc7-a70c-0f39a70c4dad",
                    "description": "Das Schwachstelleninventar wird durch ein zentrales Schwachstellenmanagement-Tool automatisch befüllt und gepflegt. Das Tool korreliert Scan-Ergebnisse über die Zeit und priorisiert Schwachstellen basierend auf dem Schweregrad (z.B. CVSS-Score) und der Kritikalität des betroffenen Assets. Der Prozess legt auch fest, ob und wie IT-Komponenten mit nicht-behebbaren Schwachstellen separiert werden müssen."
                  },
                  {
                    "statement-id": "ops.1.1.1-a10-m5",
                    "uuid": "041f0840-d422-4631-a372-6c06ec024bab",
                    "description": "Das Schwachstellenmanagement ist tief in die CMDB und das Patch-Management integriert. Die Priorisierung von Schwachstellen erfolgt risikobasiert, unter Einbeziehung von Bedrohungsinformationen (Threat Intelligence) und der tatsächlichen Ausnutzbarkeit im konkreten Kontext. Die Behebung von Schwachstellen ist weitgehend automatisiert. Der gesamte Lebenszyklus einer Schwachstelle, von der Entdeckung bis zur Verifizierung der Behebung, wird lückenlos und automatisiert verfolgt."
                  }
                ]
              },
              {
                "uuid": "ba16b6af-2b6b-4914-add5-76b1b8717d9c",
                "control-id": "DET.5.3",
                "description": "Implementation for DET.5.3 based on BSI OPS.1.1.1.A20",
                "statements": [
                  {
                    "statement-id": "ops.1.1.1-a20-m3",
                    "uuid": "9a159009-c027-4a27-9d45-b77a8d596f1a",
                    "description": "Der IT-Betrieb SOLLTE regelmäßig Informationen über bekannt gewordene Schwachstellen einholen und diese analysieren. Die IT-Komponenten SOLLTEN regelmäßig und anlassbezogen auf Schwachstellen getestet werden. Die Schwachstellen SOLLTEN so schnell wie möglich behoben werden. Solange keine Patches zur Verfügung stehen, MÜSSEN für schwerwiegende Schwachstellen andere Maßnahmen zum Schutz getroffen werden. Falls dies nicht möglich ist, SOLLTE die IT-Komponente nicht weiter betrieben werden."
                  }
                ]
              },
              {
                "uuid": "16795e69-1bab-4108-84f2-62f8087da53c",
                "control-id": "DET.5.4",
                "description": "Implementation for DET.5.4 based on BSI OPS.1.1.1.A23",
                "statements": [
                  {
                    "statement-id": "ops.1.1.1-a23-m5",
                    "uuid": "e888d949-b8eb-432d-ac8c-d399d5263197",
                    "description": "Für alle IT-Komponenten SOLLTEN Penetrationstests durchgeführt werden. Hierfür SOLLTE ein Konzept erstellt und umgesetzt werden, das neben den zu verwendenden Testmethoden und Testtiefen auch die Erfolgskriterien festlegt."
                  }
                ]
              },
              {
                "uuid": "4be9f908-cc41-4a59-9239-3ee1adb55750",
                "control-id": "DET.5.8",
                "description": "Implementation for DET.5.8 based on BSI DER.1.A12",
                "statements": [
                  {
                    "statement-id": "der.1.a12-m1",
                    "uuid": "dcd96cab-0262-4cdb-a878-4284cffd2c9f",
                    "description": "Sicherheitsmitarbeiter lesen informell und unregelmäßig öffentliche Sicherheitsnachrichten-Websites. Es gibt keinen Prozess, um diese Informationen systematisch zu bewerten oder zu nutzen."
                  },
                  {
                    "statement-id": "der.1.a12-m2",
                    "uuid": "68cdd461-f4a4-459b-b6de-84225f755e6e",
                    "description": "Die Organisation hat die kostenlosen Mailinglisten von relevanten CERTs (z.B. CERT-Bund) und wichtigen Herstellern abonniert. Die E-Mails werden gelesen, aber nicht immer systematisch ausgewertet."
                  },
                  {
                    "statement-id": "der.1.a12-m3",
                    "uuid": "af29763f-685b-4ecb-be9e-ab3e6513baf0",
                    "description": "Um neue Erkenntnisse über sicherheitsrelevante Ereignisse zu gewinnen, SOLLTEN externe Quellen herangezogen werden. Meldungen über unterschiedliche Kanäle SOLLTEN von den Mitarbeitenden auch als relevant erkannt und an die richtige Stelle weitergeleitet werden. Informationen aus zuverlässigen Quellen SOLLTEN grundsätzlich ausgewertet werden. Alle gelieferten Informationen SOLLTEN danach bewertet werden, ob sie relevant für den eigenen Informationsverbund sind. Ist dies der Fall, SOLLTEN die Informationen entsprechend der Sicherheitsvorfallbehandlung eskaliert werden."
                  },
                  {
                    "statement-id": "der.1.a12-m4",
                    "uuid": "e803a97d-3450-45ab-aaa7-fe0da533e79d",
                    "description": "Die Organisation abonniert zusätzlich kostenpflichtige, qualitativ hochwertige Threat-Intelligence-Feeds. Es gibt einen formalisierten Prozess zur Verarbeitung von 'Indicators of Compromise' (IoCs), der die systematische Suche nach diesen Indikatoren in den eigenen Systemen umfasst."
                  },
                  {
                    "statement-id": "der.1.a12-m5",
                    "uuid": "62bc6afb-b9f6-4930-9b81-3d2a670df824",
                    "description": "Threat Intelligence wird programmatisch über eine API in das SIEM und andere Sicherheitstools (Firewall, Proxy, EDR) eingespeist, um eine automatisierte Detektion und Blockade zu ermöglichen. Die Organisation beteiligt sich aktiv am Informationsaustausch in ihrer Branche (z.B. durch Mitgliedschaft in einem ISAC - Information Sharing and Analysis Center) und teilt eigene Erkenntnisse mit der Community."
                  }
                ]
              },
              {
                "uuid": "7148ac73-3ef5-4c68-a3aa-60ea9ee68cce",
                "control-id": "DET.5.9",
                "description": "Implementation for DET.5.9 based on BSI DER.7.A1",
                "statements": [
                  {
                    "statement-id": "DER.7.A1_L1",
                    "uuid": "86ee986f-7fe7-4cba-ab39-cf30068b3c40",
                    "description": "Es existieren informelle oder unvollständige Anweisungen zum Umgang mit extern gemeldeten Schwachstellen, die jedoch nicht von der Leitungsebene formell verabschiedet sind."
                  },
                  {
                    "statement-id": "DER.7.A1_L3",
                    "uuid": "effcd64c-5d63-4fad-afce-58774933d456",
                    "description": "Es MUSS eine von der Leitungsebene verabschiedete Richtlinie für den Umgang mit extern gemeldeten Schwachstellen geben. Diese Richtlinie MUSS die grundlegenden Ziele, Verantwortlichkeiten und die Verpflichtung der Institution zur Zusammenarbeit mit Sicherheitsforschern festlegen."
                  },
                  {
                    "statement-id": "DER.7.A1_L4",
                    "uuid": "097dc12d-110d-437c-93e4-1bce90051bcc",
                    "description": "Die verabschiedete Richtlinie wird regelmäßig, mindestens jährlich, überprüft und bei Bedarf aktualisiert. Sie enthält zudem klare Eskalationspfade und ist direkt mit den Prozessen des Incident Managements verknüpft."
                  }
                ]
              },
              {
                "uuid": "83305d80-e5b6-4c24-b26d-ec51ea45a693",
                "control-id": "DET.6.1",
                "description": "Implementation for DET.6.1 based on BSI OPS.1.1.5.A9",
                "statements": [
                  {
                    "statement-id": "ops.1.1.5.a9-m1",
                    "uuid": "0f6f6251-39eb-4e05-8b79-fc3ea884304a",
                    "description": "Analysten haben Lesezugriff auf die rohen, unverarbeiteten Logdateien auf dem zentralen Sammel-Server. Jede Analyse ist vollständig manuell und erfordert den Einsatz von Kommandozeilenwerkzeugen wie `grep` oder `awk`."
                  },
                  {
                    "statement-id": "ops.1.1.5.a9-m2",
                    "uuid": "305d1320-6b65-4017-8c67-81963bfa4387",
                    "description": "Ein grundlegender Log-Viewer ist verfügbar, der einfache Filter- und Suchfunktionen über die gesammelten Rohdaten bietet. Es findet jedoch keine Normalisierung, Aggregation oder Korrelation der Daten statt."
                  },
                  {
                    "statement-id": "ops.1.1.5.a9-m3",
                    "uuid": "afaca909-1ee3-48d5-b26e-7e77bf29e524",
                    "description": "Die gesammelten Protokollierungsdaten SOLLTEN gefiltert, normalisiert, aggregiert und korreliert werden. Die so bearbeiteten Daten SOLLTEN geeignet verfügbar gemacht werden, damit sie ausgewertet werden können. Um eine automatisierte Auswertung zu ermöglichen, SOLLTEN die Protokollanwendungen über entsprechende Schnittstellen für die Auswertungsprogramme verfügen. Die unveränderten Originaldaten SOLLTEN zusätzlich aufbewahrt werden."
                  },
                  {
                    "statement-id": "ops.1.1.5.a9-m4",
                    "uuid": "1d7ce2a7-6584-4f14-a003-c44b1e1f385f",
                    "description": "Das SIEM-System wird verwendet, um Protokolle aus allen relevanten Quellen automatisch zu normalisieren, zu aggregieren und zu korrelieren. Es verfügt über vordefinierte Dashboards und Alarmierungsregeln für häufige Sicherheitsereignisse. Die bei der Auswertung eingehaltenen Sicherheitsanforderungen sind in der Protokollierungsrichtlinie definiert und werden berücksichtigt."
                  },
                  {
                    "statement-id": "ops.1.1.5.a9-m5",
                    "uuid": "1378095b-c3b8-41c6-8b3b-07bcb8ca0d99",
                    "description": "Das SIEM wird durch SOAR-Funktionen (Security Orchestration, Automation, and Response) erweitert. Die Datenanreicherung mit Bedrohungsinformationen, Benutzerinformationen und Asset-Daten erfolgt in Echtzeit. Modelle des maschinellen Lernens (UEBA) werden eingesetzt, um Anomalien und komplexe Angriffsmuster zu erkennen, die regelbasierte Korrelationen übersehen würden."
                  }
                ]
              },
              {
                "uuid": "86376c03-8fd9-4299-a60a-164924e019cc",
                "control-id": "DEV.1.1",
                "description": "Implementation for DEV.1.1 based on BSI CON.8.A1",
                "statements": [
                  {
                    "statement-id": "CON.8.A1-m1",
                    "uuid": "8a7c2694-62d3-4e70-8f60-c44d08b14e09",
                    "description": "Rollen und Zuständigkeiten für den Software-Entwicklungsprozess sind nur für einzelne, kritische Projekte informell benannt. Es gibt keine durchgehende oder formale Dokumentation."
                  },
                  {
                    "statement-id": "CON.8.A1-m2",
                    "uuid": "00978e8c-fc00-4236-83fd-58ed2c0e4ddc",
                    "description": "Grundlegende Rollen wie 'Entwickler' und 'Projektmanager' sind für Entwicklungsprojekte definiert. Eine gesamtzuständige Person für den Entwicklungsprozess ist benannt. Spezifische Rollen für Sicherheit oder Architektur fehlen jedoch noch."
                  },
                  {
                    "statement-id": "CON.8.A1-m3",
                    "uuid": "e6052d1a-3828-4715-b10c-4689cc1f8682",
                    "description": "Für den Software-Entwicklungsprozess SOLLTE eine gesamtzuständige Person benannt werden. Außerdem SOLLTEN die Rollen und Zuständigkeiten für alle Aktivitäten im Rahmen der Software-Entwicklung festgelegt werden. Die Rollen SOLLTEN dabei fachlich die nachfolgenden Themen abdecken: Requirements-Engineering, Software-Entwurf und -Architektur, Informationssicherheit in der Software-Entwicklung, Software-Implementierung und Software-Tests. Für jedes Entwicklungsvorhaben SOLLTE eine zuständige Person für die Informationssicherheit benannt werden."
                  },
                  {
                    "statement-id": "CON.8.A1-m4",
                    "uuid": "03263691-8ce1-47d8-bedc-eaf6d71d89a2",
                    "description": "Die definierten Rollen und Zuständigkeiten werden regelmäßig, mindestens jährlich, auf Aktualität und Angemessenheit überprüft und bei Bedarf angepasst. Es gibt definierte Stellvertreterregelungen für alle kritischen Rollen, einschließlich der für Informationssicherheit."
                  },
                  {
                    "statement-id": "CON.8.A1-m5",
                    "uuid": "87ff880c-7812-463c-bb86-a41c759ac8d8",
                    "description": "Rollen und Zuständigkeiten sind tief in einem ALM-Tool (Application Lifecycle Management) integriert. Berechtigungen innerhalb der Entwicklungswerkzeuge (z.B. Code-Repositories, CI/CD-Pipelines) werden automatisch basierend auf den zugewiesenen Rollen vergeben und durchgesetzt. Änderungen an Rollen oder Zuständigkeiten lösen einen automatisierten Review- und Genehmigungsworkflow aus."
                  }
                ]
              },
              {
                "uuid": "b9b4db15-7584-43bd-9d6d-8da348b9cb61",
                "control-id": "DEV.2.1",
                "description": "Implementation for DEV.2.1 based on BSI CON.8.A5",
                "statements": [
                  {
                    "statement-id": "CON.8.A5-m1",
                    "uuid": "4fa45078-0708-43d3-b43f-8290344e6b78",
                    "description": "Einzelne Aspekte des sicheren Systemdesigns, wie z.B. die Validierung von Eingabedaten, werden von einzelnen Entwicklern ad-hoc umgesetzt. Es gibt keine übergreifenden Design-Prinzipien oder Richtlinien."
                  },
                  {
                    "statement-id": "CON.8.A5-m2",
                    "uuid": "138952e0-24bf-480f-91c1-57e5a7c9798d",
                    "description": "Es gibt eine Checkliste mit grundlegenden Sicherheitsregeln für das Systemdesign, die jedoch nicht für jedes Projekt erzwungen wird. Die Validierung von Eingabedaten ist als Grundregel bekannt, wird aber hauptsächlich auf der Client-Seite umgesetzt."
                  },
                  {
                    "statement-id": "CON.8.A5-m3",
                    "uuid": "9dd3fdec-841a-4a79-9c7f-a49fc3898072",
                    "description": "Folgende Grundregeln des sicheren Systemdesigns MÜSSEN in der zu entwickelnden Software berücksichtigt werden: Eingabedaten MÜSSEN grundsätzlich vor der Weiterverarbeitung geprüft und validiert werden. Bei Client-Server-Anwendungen MÜSSEN die Daten grundsätzlich auf dem Server validiert werden. Die Standardeinstellungen MÜSSEN derart voreingestellt sein, dass ein sicherer Betrieb ermöglicht wird. Bei Fehlern DÜRFEN NICHT schützenswerte Informationen preisgegeben werden. Die Software MUSS mit möglichst geringen Privilegien ausgeführt werden können. Schützenswerte Daten MÜSSEN verschlüsselt übertragen und gespeichert werden. Zur Authentisierung MÜSSEN vertrauenswürdige Mechanismen verwendet werden. Passwörter MÜSSEN mit einem sicheren Hashverfahren gespeichert werden. Sicherheitsrelevante Ereignisse MÜSSEN protokolliert werden. Das Systemdesign MUSS dokumentiert und überprüft werden."
                  },
                  {
                    "statement-id": "CON.8.A5-m4",
                    "uuid": "a5bca7c1-a398-4cd2-a31d-dda0879402a5",
                    "description": "Zusätzlich zu den Grundregeln werden Prinzipien wie 'Defense-in-Depth' und 'Fail-Secure' systematisch im Systemdesign angewendet. Informationen, die für den Produktivbetrieb nicht relevant sind (z. B. Kommentare mit Zugangsdaten für die Entwicklungsumgebung), SOLLTEN in ausgeliefertem Programmcode und ausgelieferten Konfigurationsdateien entfernt werden. Die Einhaltung der Designvorgaben wird durch automatisierte Linting- und Code-Analyse-Werkzeuge im Build-Prozess unterstützt."
                  },
                  {
                    "statement-id": "CON.8.A5-m5",
                    "uuid": "ab1e4513-5e02-47b0-a951-ac4e9aca25d5",
                    "description": "Das sichere Systemdesign basiert auf einer formalen Bedrohungsmodellierung (z.B. nach STRIDE). Wiederverwendbare, geprüfte und gehärtete Sicherheitskomponenten (z.B. für Authentifizierung, Verschlüsselung) werden in einer zentralen Bibliothek bereitgestellt und deren Verwendung ist für alle Entwicklungen verpflichtend. Das Design wird nicht nur einem Peer-Review unterzogen, sondern formal von einem Sicherheitsteam abgenommen."
                  }
                ]
              },
              {
                "uuid": "9ddcc6bc-85ba-4273-8666-4c0cc20c3716",
                "control-id": "DEV.2.4",
                "description": "Implementation for DEV.2.4 based on BSI OPS.1.1.8.A2",
                "statements": [
                  {
                    "statement-id": "OPS.1.1.8.A2.M3",
                    "uuid": "feb0669f-32d0-4816-adb1-b0aaf5202760",
                    "description": "Das zentrale Versionsverwaltungssystem (z. B. Git-Server) MUSS abgesichert sein. Es MUSS ein Berechtigungskonzept umgesetzt sein, das den Zugriff auf Code-Repositories regelt. Alle Änderungen MÜSSEN einer Person zugeordnet werden können."
                  },
                  {
                    "statement-id": "OPS.1.1.8.A2.M4",
                    "uuid": "6ffcbb4a-4eb0-4be9-b726-f09c92164e6e",
                    "description": "Zusätzlich zur grundlegenden Absicherung ist das Versionsverwaltungssystem in ein zentrales Identity Management (IAM) integriert. Für produktiv relevante Branches (z.B. main, release) sind Schutzmechanismen (Branch Protection Rules) aktiviert, die mindestens einen Review erfordern."
                  }
                ]
              },
              {
                "uuid": "8e8180df-1a9a-4b1b-b0ed-66b9e5a9f936",
                "control-id": "DLS.1.1",
                "description": "Implementation for DLS.1.1 based on BSI CON.3.A9",
                "statements": [
                  {
                    "statement-id": "con.3.a9-m3",
                    "uuid": "60f422ee-b292-4a41-906e-90a7bb738ed4",
                    "description": "Wenn für die Datensicherung ein Online-Speicher genutzt werden soll, SOLLTEN mindestens folgende Punkte vertraglich geregelt werden: Gestaltung des Vertrages, Ort der Datenspeicherung, Vereinbarungen zur Dienstgüte (SLA) insbesondere hinsichtlich Verfügbarkeit, geeignete Authentisierungsmethoden für den Zugriff, Verschlüsselung der Daten auf dem Online-Speicher sowie Verschlüsselung auf dem Transportweg. Zudem SOLLTEN Sicherungssystem und Netzanbindung so beschaffen sein, dass die zulässigen Sicherungs- bzw. Wiederherstellungszeiten nicht überschritten werden."
                  },
                  {
                    "statement-id": "con.3.a9-m4",
                    "uuid": "d4ae8960-7dba-4bed-9c3e-7026bff658ab",
                    "description": "Die Institution erzwingt eine client-seitige Verschlüsselung, bevor die Daten an den Anbieter gesendet werden, um sicherzustellen, dass der Anbieter selbst keinen Zugriff auf die Entschlüsselungsschlüssel hat (Zero-Knowledge-Prinzip). Die Sicherheitszertifizierungen des Anbieters (z. B. ISO 27001, BSI C5) werden geprüft, und das Recht, den Anbieter zu auditieren, wird vertraglich vereinbart."
                  },
                  {
                    "statement-id": "con.3.a9-m5",
                    "uuid": "49e94219-82ba-49fb-bc53-82f5b0fbb3cc",
                    "description": "Es wird eine Multi-Cloud-Backup-Strategie verfolgt, bei der verschlüsselte Datensicherungen zu einem zweiten, unabhängigen Online-Anbieter repliziert werden, um das Risiko eines Ausfalls oder Lock-ins bei einem einzelnen Anbieter zu mindern. Die Ausfallsicherheit und die Notfallwiederherstellungsfähigkeiten des Anbieters werden regelmäßig im Rahmen der eigenen DR-Übungen getestet."
                  }
                ]
              },
              {
                "uuid": "c5752b3b-d3b2-46b9-8988-cce0607d100e",
                "control-id": "GC.1.1",
                "description": "Implementation for GC.1.1 based on BSI ISMS.1.A7",
                "statements": [
                  {
                    "statement-id": "isms.1.a7-m1",
                    "uuid": "d1579dfb-d584-495e-bd97-6742954f6182",
                    "description": "Sicherheitsmaßnahmen werden ad hoc und reaktiv implementiert, oft als direkte Reaktion auf einen Sicherheitsvorfall oder eine einzelne Bedrohung. Es gibt keinen systematischen Prozess zur Festlegung der Maßnahmen."
                  },
                  {
                    "statement-id": "isms.1.a7-m2",
                    "uuid": "3aaa02f6-3752-4867-864c-480c553573db",
                    "description": "Ein grundlegender Satz von Standard-Sicherheitsmaßnahmen (z.B. Virenscanner, Firewall) wird auf alle Systeme angewendet. Diese Maßnahmen werden jedoch nicht an den spezifischen Schutzbedarf einzelner Anwendungen oder Daten angepasst."
                  },
                  {
                    "statement-id": "isms.1.a7-m3",
                    "uuid": "d0454289-ca4b-4184-b347-48e09285c077",
                    "description": "Im Rahmen des Sicherheitsprozesses MÜSSEN für die gesamte Informationsverarbeitung ausführliche und angemessene Sicherheitsmaßnahmen festgelegt werden. Die Auswahl der Maßnahmen basiert auf den Sicherheitszielen und einer strukturierten Analyse des Schutzbedarfs der verarbeiteten Informationen."
                  },
                  {
                    "statement-id": "isms.1.a7-m4",
                    "uuid": "2f43f855-3144-4cfd-a11b-944984300926",
                    "description": "Alle Sicherheitsmaßnahmen SOLLTEN systematisch in Sicherheitskonzepten dokumentiert werden. Die Sicherheitsmaßnahmen SOLLTEN regelmäßig aktualisiert werden, um auf neue Bedrohungen oder veränderte Rahmenbedingungen zu reagieren."
                  },
                  {
                    "statement-id": "isms.1.a7-m5",
                    "uuid": "48ee4917-7aa1-46d3-aeea-c3dc1ac5a44f",
                    "description": "Die Auswahl, Implementierung und Überwachung von Sicherheitsmaßnahmen ist vollständig in einen Risiko-Management-Prozess integriert. Die Wirksamkeit jeder wichtigen Sicherheitsmaßnahme wird kontinuierlich durch technische Metriken überwacht. Die Maßnahmen werden dynamisch angepasst, basierend auf den Ergebnissen der Überwachung und aktuellen Bedrohungsinformationen."
                  }
                ]
              },
              {
                "uuid": "9cfca376-6e25-4378-b63e-f18501845066",
                "control-id": "GC.2.2",
                "description": "Implementation for GC.2.2 based on BSI ORP.5.A1",
                "statements": [
                  {
                    "statement-id": "ORP.5.A1-m1",
                    "uuid": "4e80a1e1-1db1-4e5d-a87c-eafc61987f46",
                    "description": "Es werden lediglich einige wenige, offensichtliche gesetzliche Anforderungen (z. B. aus der DSGVO) sporadisch erfasst. Vertragliche, branchenspezifische oder interne Vorgaben werden weitgehend ignoriert. Eine Dokumentation erfolgt nur unvollständig und wird nicht gepflegt."
                  },
                  {
                    "statement-id": "ORP.5.A1-m2",
                    "uuid": "1edcf469-2b79-4778-a204-010c358c795b",
                    "description": "Es existiert eine Liste der wichtigsten gesetzlichen und vertraglichen Vorgaben. Diese Liste wird jedoch nicht systematisch gepflegt oder auf ihre Auswirkungen auf das Informationssicherheitsmanagement hin analysiert. Die Dokumentation ist zentral abgelegt, aber nicht versioniert oder strukturiert."
                  },
                  {
                    "statement-id": "ORP.5.A1-m3",
                    "uuid": "3001c554-4933-4244-b402-f41903d3557b",
                    "description": "Alle gesetzlichen, vertraglichen und sonstigen Vorgaben mit Auswirkungen auf das Informationssicherheitsmanagement MÜSSEN identifiziert und dokumentiert werden. Die für die einzelnen Bereiche der Institution relevanten gesetzlichen, vertraglichen und sonstigen Vorgaben SOLLTEN in einer strukturierten Übersicht herausgearbeitet werden. Die Dokumentation MUSS auf dem aktuellen Stand gehalten werden."
                  },
                  {
                    "statement-id": "ORP.5.A1-m4",
                    "uuid": "95a85b01-e85f-4080-aaac-0af80f7a3aa0",
                    "description": "Der Prozess zur Identifikation und Dokumentation der Anforderungen ist formalisiert und in das Managementsystem der Institution integriert. Die Anforderungen werden nicht nur aufgelistet, sondern auch den jeweiligen Assets, Prozessen und Schutzmaßnahmen zugeordnet. Es werden aktiv Informationsquellen wie juristische Newsletter oder Branchenverbände genutzt, um proaktiv über Änderungen informiert zu sein."
                  },
                  {
                    "statement-id": "ORP.5.A1-m5",
                    "uuid": "19aa1345-2d4f-4be2-8518-3d74b83d10c0",
                    "description": "Der Prozess zur Identifikation der Anforderungen ist weitgehend automatisiert. Das eingesetzte GRC-Tool wird durch externe Feeds von Rechtsdatenbanken automatisch mit neuen und geänderten Vorschriften aktualisiert. Eine KI-gestützte Analyse hilft bei der Bewertung der Relevanz neuer Vorschriften für die Institution. Die Zuordnung zu internen Kontrollen wird automatisch vorgeschlagen und muss nur noch bestätigt werden."
                  }
                ]
              },
              {
                "uuid": "b8766080-0fb1-40e7-9999-f48f1d707154",
                "control-id": "GC.3.1",
                "description": "Implementation for GC.3.1 based on BSI DER.4.A3",
                "statements": [
                  {
                    "statement-id": "DER.4.A3-m3",
                    "uuid": "c1aa7ade-7804-451d-83eb-b908d94298fe",
                    "description": "Der Geltungsbereich für das Notfallmanagementsystem MUSS eindeutig festgelegt werden. Die Institutionsleitung MUSS eine Notfallmanagementstrategie festlegen, welche die angestrebten Ziele und das Risikoakzeptanzniveau darlegt."
                  },
                  {
                    "statement-id": "DER.4.A4",
                    "uuid": "f7f7d65a-6c92-41df-b233-08dfc690f9b7",
                    "description": "Die Notfallmanagementstrategie SOLLTE jährlich überprüft und an die übergeordnete Geschäftsstrategie angepasst werden. Das Risikoakzeptanzniveau SOLLTE quantifiziert werden. Der Geltungsbereich SOLLTE regelmäßig auf Basis der Business-Impact-Analyse (BIA) validiert werden."
                  },
                  {
                    "statement-id": "DER.4.A5",
                    "uuid": "a1cecd46-a2fa-4e4d-a30e-8671cc53e34a",
                    "description": "Geltungsbereich und Strategie werden dynamisch in einem BCMS-Tool verwaltet und sind mit dem Enterprise-Risk-Management-Prozess verknüpft. Die Strategie umfasst quantitative und aus der BIA abgeleitete RTO/RPO-Vorgaben auf Prozessebene, die regelmäßig gegen sich ändernde Bedrohungen und Geschäftsanforderungen überprüft werden."
                  }
                ]
              },
              {
                "uuid": "9d21fe47-2d42-4c3c-9bd3-748f64b2aa94",
                "control-id": "GC.4.1",
                "description": "Implementation for GC.4.1 based on BSI ISMS.1.A4",
                "statements": [
                  {
                    "statement-id": "isms.1.a4-m1",
                    "uuid": "ac9734c4-81f1-4116-bcc0-221a472c7474",
                    "description": "Die Aufgaben der Informationssicherheit werden informell von einem IT-Mitarbeitenden neben seinen anderen Tätigkeiten wahrgenommen, ohne dass eine formelle Benennung zum Informationssicherheitsbeauftragten (ISB) erfolgt ist."
                  },
                  {
                    "statement-id": "isms.1.a4-m2",
                    "uuid": "fa6d26fd-7319-4c0f-b58c-8e1c01302544",
                    "description": "Eine Person wurde formell zum ISB benannt. Der ISB verfügt jedoch nicht über ausreichende Ressourcen, Befugnisse oder eine direkte Berichtslinie zur Leitung, um die Rolle wirksam auszufüllen."
                  },
                  {
                    "statement-id": "isms.1.a4-m3",
                    "uuid": "6ddd94ac-c65a-4475-9d4e-f04560f132cd",
                    "description": "Die Institutionsleitung MUSS einen oder eine ISB benennen. Der oder die ISB MUSS die Informationssicherheit in der Institution fördern und den Sicherheitsprozess mitsteuern und koordinieren. Die Institutionsleitung MUSS den oder die ISB mit angemessenen Ressourcen ausstatten und die Möglichkeit einräumen, bei Bedarf direkt an sie selbst zu berichten. Der oder die ISB MUSS bei allen größeren Projekten sowie bei der Einführung neuer Anwendungen und IT-Systeme frühzeitig beteiligt werden."
                  },
                  {
                    "statement-id": "isms.1.a4-m4",
                    "uuid": "0c5c46c4-5fd1-4023-a3de-0e69fe1b8fb2",
                    "description": "Die Unabhängigkeit des ISB wird sichergestellt, indem die Rolle organisatorisch von der IT-Leitung getrennt ist, um Interessenkonflikte zu vermeiden. Der ISB verfügt über ein eigenes, von der Leitung genehmigtes Budget für Sicherheitsinitiativen, Schulungen und externe Beratungsleistungen."
                  },
                  {
                    "statement-id": "isms.1.a4-m5",
                    "uuid": "59699a8b-712b-47d1-9ebf-dfd2afd96d13",
                    "description": "Die ISB-Funktion wird von einem Team (Information Security Management Team, ISMT) mit unterschiedlichen Spezialisierungen (z.B. für Technik, GRC, Awareness) wahrgenommen. Der ISB und sein Team sind fest in alle strategischen Entscheidungsprozesse der Institution eingebunden, auch außerhalb von IT-Projekten (z.B. bei M&A, Einführung neuer Geschäftsfelder)."
                  }
                ]
              },
              {
                "uuid": "f36ec849-78bf-4fc7-b970-d3d44436fa94",
                "control-id": "GC.4.3",
                "description": "Implementation for GC.4.3 based on BSI ISMS.1.A6",
                "statements": [
                  {
                    "statement-id": "isms.1.a6-m1",
                    "uuid": "81e70e6a-e250-4bc6-84a4-f5ccee4429c6",
                    "description": "Außer der (möglicherweise nur informellen) Rolle des ISB existiert keine weitere definierte Organisationsstruktur für Informationssicherheit. Zuständigkeiten sind unklar."
                  },
                  {
                    "statement-id": "isms.1.a6-m2",
                    "uuid": "f345effe-4e40-4ef1-8779-4cc46938c556",
                    "description": "Einige Rollen für die Informationssicherheit sind benannt (z.B. IT-Sicherheitsbeauftragter, Datenschutzbeauftragter). Ihre Aufgaben, Kompetenzen und die Kommunikationswege sind jedoch nicht klar voneinander abgegrenzt, was zu Lücken oder Überschneidungen führt."
                  },
                  {
                    "statement-id": "isms.1.a6-m3",
                    "uuid": "dfca80c9-08e7-4c24-a7dd-5023c38f9599",
                    "description": "Eine geeignete übergreifende Organisationsstruktur für Informationssicherheit MUSS vorhanden sein. Dafür MÜSSEN Rollen definiert sein, die konkrete Aufgaben übernehmen, um die Sicherheitsziele zu erreichen. Außerdem MÜSSEN qualifizierte Personen benannt werden, denen ausreichend Ressourcen zur Verfügung stehen. Die Aufgaben, Rollen, Verantwortungen und Kompetenzen im Sicherheitsmanagement MÜSSEN nachvollziehbar definiert und zugewiesen sein. Für alle wichtigen Funktionen MUSS es wirksame Vertretungsregelungen geben. Kommunikationswege MÜSSEN geplant, beschrieben, eingerichtet und bekannt gemacht werden."
                  },
                  {
                    "statement-id": "isms.1.a6-m4",
                    "uuid": "88ec4c22-90ea-44df-8f3a-1befc36af6e9",
                    "description": "Es wird regelmäßig, mindestens jährlich, geprüft, ob die Organisationsstruktur für Informationssicherheit noch angemessen ist und an neue Rahmenbedingungen angepasst werden muss. Ein interdisziplinäres Gremium (z.B. ein Informationssicherheits-Lenkungsausschuss) wird eingerichtet, um strategische Entscheidungen zu treffen und die Zusammenarbeit zu fördern."
                  },
                  {
                    "statement-id": "isms.1.a6-m5",
                    "uuid": "09ecf298-4b53-4187-a127-3fd06cedad72",
                    "description": "Die Sicherheitsorganisation ist vollständig in das übergeordnete Governance-, Risiko- und Compliance-Framework (GRC) der Institution integriert. Die Rollen und Zuständigkeiten sind in einem GRC-Tool abgebildet und direkt mit den zugehörigen Richtlinien, Kontrollen und Risiken verknüpft."
                  }
                ]
              },
              {
                "uuid": "18ba08d7-7aee-42ee-a94b-95b355fd65d0",
                "control-id": "GC.4.4",
                "description": "Implementation for GC.4.4 based on BSI ORP.2.A15",
                "statements": [
                  {
                    "statement-id": "orp.2.a15-m1",
                    "uuid": "e777b398-f9da-42d8-85b0-ddbb7985ed22",
                    "description": "Die Qualifikation des Personals wird bei der Einstellung geprüft, aber danach nicht mehr systematisch weiterentwickelt. Schulungen finden nur sporadisch und unkoordiniert statt. Es besteht die Gefahr, dass Mitarbeitende mit veraltetem Wissen arbeiten."
                  },
                  {
                    "statement-id": "orp.2.a15-m2",
                    "uuid": "37f20a95-2f97-4e53-a494-96769159956b",
                    "description": "Für Stellen sind erforderliche Qualifikationen bei der Ausschreibung definiert. Es gibt ein jährliches Budget für Weiterbildungen, aber keinen strukturierten Plan, um Wissenslücken gezielt zu schließen. Eine allgemeine Sicherheitssensibilisierung wird angeboten."
                  },
                  {
                    "statement-id": "orp.2.a15-m3",
                    "uuid": "52e59159-b219-4f7b-9efe-195cb8cf24b0",
                    "description": "Mitarbeitende MÜSSEN regelmäßig geschult bzw. weitergebildet werden, um sicherzustellen, dass kein Mitarbeitender mit veraltetem Wissensstand arbeitet. Werden Stellen besetzt, MÜSSEN die erforderlichen Qualifikationen und Fähigkeiten genau formuliert sein. Es MUSS sichergestellt sein, dass Stellen nur von Mitarbeitenden besetzt werden, für die sie qualifiziert sind."
                  },
                  {
                    "statement-id": "orp.2.a15-m4",
                    "uuid": "52537874-e1d3-4c59-81fa-05ee6fccef59",
                    "description": "Den Mitarbeitenden SOLLTE während ihrer Beschäftigung die Möglichkeit gegeben werden, sich im Rahmen ihres Tätigkeitsfeldes weiterzubilden. Anschließend SOLLTE geprüft werden, ob die erforderlichen Qualifikationen bei den Bewerbenden für die Stelle tatsächlich vorhanden sind. Der Schulungsbedarf wird nicht nur pauschal, sondern individuell im Rahmen von Mitarbeitergesprächen ermittelt und geplant."
                  },
                  {
                    "statement-id": "orp.2.a15-m5",
                    "uuid": "f7cb17de-0d67-48fc-b2b8-608a8ac8c10d",
                    "description": "Ein Skill-Management-System wird eingesetzt, um die Qualifikationen aller Mitarbeitenden zu erfassen, mit den Anforderungen der Rollen abzugleichen und proaktiv Schulungsbedarfe zu identifizieren. Das System ist mit einem Learning Management System (LMS) gekoppelt, das personalisierte Lernpfade anbietet. Der Erfolg von Schulungsmaßnahmen wird gemessen und in die Leistungsbeurteilung einbezogen."
                  }
                ]
              },
              {
                "uuid": "b7bcd697-52cc-48e5-910d-8866aa270eb0",
                "control-id": "GC.4.5",
                "description": "Implementation for GC.4.5 based on BSI ORP.2.A3",
                "statements": [
                  {
                    "statement-id": "orp.2.a3-m1",
                    "uuid": "fdbd3fdd-9a4e-4dd6-a161-9c736b004c80",
                    "description": "Vertretungsregelungen existieren nur informell und für wenige, ausgewählte Schlüsselpersonen. Bei Abwesenheit anderer Mitarbeitender kommt es regelmäßig zu Stillständen in den Arbeitsprozessen, da Aufgaben nicht übernommen werden können."
                  },
                  {
                    "statement-id": "orp.2.a3-m2",
                    "uuid": "094d747c-7396-4b81-a9d0-3ca52e785ec2",
                    "description": "Für die meisten Rollen ist ein Vertreter benannt. Die Vertretungsregelungen sind jedoch nicht detailliert ausformuliert, und es wird nicht systematisch sichergestellt, dass der Vertreter über das notwendige Wissen und die erforderlichen Berechtigungen verfügt."
                  },
                  {
                    "statement-id": "orp.2.a3-m3",
                    "uuid": "e65ab148-0922-46ca-9f22-167db81bcc8a",
                    "description": "Die Vorgesetzten MÜSSEN dafür sorgen, dass im laufenden Betrieb Vertretungsregelungen umgesetzt werden. Dafür MUSS sichergestellt werden, dass es für alle wesentlichen Geschäftsprozesse und Aufgaben praktikable Vertretungsregelungen gibt. Bei diesen Regelungen MUSS der Aufgabenumfang der Vertretung im Vorfeld klar definiert werden. Es MUSS sichergestellt werden, dass die Vertretung über das dafür nötige Wissen verfügt."
                  },
                  {
                    "statement-id": "orp.2.a3-m4",
                    "uuid": "97588672-47c8-4059-87ff-5e21087a58c3",
                    "description": "Die Vertretungsregelungen werden proaktiv gemanagt. Falls der vorgesehene Vertreter nicht ausreichend geschult werden kann, MUSS geprüft werden, wie er zu schulen ist oder ob eine ausreichende Dokumentation genügt. Ist es im Ausnahmefall nicht möglich, einen internen Vertreter zu benennen, MUSS frühzeitig entschieden werden, ob externes Personal dafür hinzugezogen werden kann. Die Regelungen werden regelmäßig, z.B. jährlich, auf Aktualität und Praktikabilität überprüft."
                  },
                  {
                    "statement-id": "orp.2.a3-m5",
                    "uuid": "fb329397-0205-4e07-a51d-7532d35fcc9e",
                    "description": "Vertretungsregelungen sind in einem Skill-Management-System hinterlegt, das aktiv die Qualifikationen von Mitarbeitenden und potenziellen Vertretern abgleicht und Schulungsbedarfe identifiziert. Für hochkritische Rollen gibt es mindestens zwei benannte und voll qualifizierte Vertreter (Prinzip der N+1-Redundanz). Die Aktivierung von Vertretungsberechtigungen erfolgt automatisiert und zeitlich befristet über das IAM-System."
                  }
                ]
              },
              {
                "uuid": "11035186-30f3-4a41-b2fd-89950507773e",
                "control-id": "GC.5.1",
                "description": "Implementation for GC.5.1 based on BSI ISMS.1.A2",
                "statements": [
                  {
                    "statement-id": "isms.1.a2-m1",
                    "uuid": "b439277b-e55a-4677-a3b3-c23ebb02e656",
                    "description": "Es existieren einige unzusammenhängende und undokumentierte Sicherheitsziele, die meist reaktiv formuliert wurden. Eine übergreifende Sicherheitsstrategie fehlt vollständig."
                  },
                  {
                    "statement-id": "isms.1.a2-m2",
                    "uuid": "8efe799b-4b52-493c-9a64-3c14a63fdc98",
                    "description": "Allgemeine Sicherheitsziele und eine grundlegende Strategie sind in einem Dokument festgehalten. Ihnen fehlt jedoch der direkte Bezug zu den spezifischen Geschäftszielen und -prozessen der Institution."
                  },
                  {
                    "statement-id": "isms.1.a2-m3",
                    "uuid": "6223acfc-15c1-49e9-b617-d201434bee80",
                    "description": "Die Institutionsleitung MUSS den Sicherheitsprozess initiieren und etablieren. Dafür MUSS die Institutionsleitung angemessene Sicherheitsziele sowie eine Strategie für Informationssicherheit festlegen und dokumentieren. Es MÜSSEN konzeptionelle Vorgaben erarbeitet und organisatorische Rahmenbedingungen geschaffen werden, um den ordnungsgemäßen und sicheren Umgang mit Informationen zu ermöglichen. Die Institutionsleitung MUSS die Sicherheitsstrategie und -ziele tragen, verantworten und regelmäßig auf Aktualität, Angemessenheit und wirksame Umsetzung überprüfen."
                  },
                  {
                    "statement-id": "isms.1.a2-m4",
                    "uuid": "44e61d62-8b22-4d72-b70d-bfdbf4099e93",
                    "description": "Die Sicherheitsziele werden nach der SMART-Methode (spezifisch, messbar, erreichbar, relevant, terminiert) formuliert. Die Sicherheitsstrategie ist explizit mit den übergeordneten Geschäftszielen verknüpft und leitet daraus ihre Prioritäten ab."
                  },
                  {
                    "statement-id": "isms.1.a2-m5",
                    "uuid": "b875b2f4-9fc2-4aa0-9d17-fa173a805e70",
                    "description": "Die Sicherheitsstrategie ist ein dynamisches, lebendiges Konstrukt, das kontinuierlich an die sich ändernde Bedrohungslandschaft, neue Technologien und Geschäftsstrategien angepasst wird. Der Prozess zur Festlegung der Sicherheitsziele ist vollständig in den jährlichen strategischen Planungszyklus der gesamten Institution integriert."
                  }
                ]
              },
              {
                "uuid": "b79f2295-491e-49c7-992c-3ecc14643bcd",
                "control-id": "GC.5.2",
                "description": "Implementation for GC.5.2 based on BSI ISMS.1.A1",
                "statements": [
                  {
                    "statement-id": "isms.1.a1-m1",
                    "uuid": "bfbd13f4-f076-487d-955f-b8edfd228311",
                    "description": "Die Institutionsleitung hat die Verantwortung für Informationssicherheit nur mündlich oder informell anerkannt. Die Übernahme der Verantwortung ist nicht dokumentiert und wird nicht aktiv kommuniziert, was zu Unklarheiten bei den Mitarbeitenden führt."
                  },
                  {
                    "statement-id": "isms.1.a1-m2",
                    "uuid": "de61307b-b809-479d-b53f-bb9a30a8b694",
                    "description": "Die Gesamtverantwortung für die Informationssicherheit ist formal der Institutionsleitung zugewiesen, z. B. in einer Geschäftsordnung. Die Leitung nimmt diese Verantwortung jedoch nur passiv wahr und delegiert die Aufgaben vollständig ohne aktive Steuerung oder Kontrolle."
                  },
                  {
                    "statement-id": "isms.1.a1-m3",
                    "uuid": "7dfdfa44-cfc9-4062-9893-4de7900bda9f",
                    "description": "Die Institutionsleitung MUSS die Gesamtverantwortung für Informationssicherheit in der Institution übernehmen. Dies MUSS für alle Beteiligten deutlich erkennbar sein. Die Institutionsleitung MUSS den Sicherheitsprozess initiieren, steuern und kontrollieren. Die Institutionsleitung MUSS die Zuständigkeiten für Informationssicherheit festlegen und die zuständigen Mitarbeitenden mit den erforderlichen Kompetenzen und Ressourcen ausstatten. Die Institutionsleitung MUSS sich regelmäßig über den Status der Informationssicherheit sowie über mögliche Risiken und Konsequenzen aufgrund fehlender Sicherheitsmaßnahmen informieren lassen."
                  },
                  {
                    "statement-id": "isms.1.a1-m4",
                    "uuid": "b3bff425-8fed-47bd-a554-1704b514d4f7",
                    "description": "Die Institutionsleitung lebt die Informationssicherheit aktiv vor ('Tone at the Top'). Sie hinterfragt die erhaltenen Statusberichte kritisch, fordert tiefere Analysen bei Abweichungen und verfolgt die Umsetzung von Maßnahmen zur Risikobehandlung konsequent nach. Die Einhaltung der Sicherheitspolicies wird auch auf Leitungsebene demonstriert."
                  },
                  {
                    "statement-id": "isms.1.a1-m5",
                    "uuid": "46444315-cd8a-4b1d-b548-8201a6c8b6a0",
                    "description": "Die Informationssicherheitsziele sind vollständig in die übergeordneten Geschäftsziele und die strategische Planung der Institution integriert. Die Leistung im Bereich der Informationssicherheit ist Teil der Zielvereinbarungen und Leistungsbeurteilungen für das obere Management. Die Leitung fördert aktiv eine positive Sicherheitskultur und investiert proaktiv in zukünftige Sicherheitstechnologien."
                  }
                ]
              },
              {
                "uuid": "829a8578-abf8-47a7-adeb-6e4689a406c3",
                "control-id": "GC.5.3",
                "description": "Implementation for GC.5.3 based on BSI ISMS.1.A3",
                "statements": [
                  {
                    "statement-id": "isms.1.a3-m1",
                    "uuid": "f3fd6f53-4f3a-4573-8719-b49dfbe11ef0",
                    "description": "Ein Entwurf einer Leitlinie zur Informationssicherheit existiert, wurde aber nicht von der Leitung verabschiedet oder an die Mitarbeitenden kommuniziert."
                  },
                  {
                    "statement-id": "isms.1.a3-m2",
                    "uuid": "e592de72-9daf-4e52-90d1-1b6c84637374",
                    "description": "Eine allgemeine Leitlinie zur Informationssicherheit wurde verabschiedet und bekannt gemacht. Sie ist jedoch generisch gehalten und nicht spezifisch auf die Geschäftsziele und Risiken der Institution zugeschnitten."
                  },
                  {
                    "statement-id": "isms.1.a3-m3",
                    "uuid": "346c9d2b-1f33-4117-ae5d-aa35f92aa80c",
                    "description": "Die Institutionsleitung MUSS eine übergeordnete Leitlinie zur Informationssicherheit verabschieden. Diese MUSS den Stellenwert der Informationssicherheit, die Sicherheitsziele, die wichtigsten Aspekte der Sicherheitsstrategie sowie die Organisationsstruktur für Informationssicherheit beschreiben. Für die Sicherheitsleitlinie MUSS ein klarer Geltungsbereich festgelegt sein. In der Leitlinie zur Informationssicherheit MÜSSEN die Sicherheitsziele und der Bezug der Sicherheitsziele zu den Geschäftszielen und Aufgaben der Institution erläutert werden. Die Institutionsleitung MUSS die Leitlinie allen Mitarbeitenden und sonstigen Mitgliedern der Institution bekannt geben."
                  },
                  {
                    "statement-id": "isms.1.a3-m4",
                    "uuid": "e562eb8a-d8a7-403c-b2fd-e89d25f530b5",
                    "description": "Die Leitlinie zur Informationssicherheit wird regelmäßig, mindestens jährlich sowie bei wesentlichen Änderungen in der Organisation oder der Bedrohungslage, aktualisiert. Es existiert ein formaler Prozess zur Verwaltung von Ausnahmen zur Leitlinie."
                  },
                  {
                    "statement-id": "isms.1.a3-m5",
                    "uuid": "8d66d298-79c6-4524-92f2-5147115fae3f",
                    "description": "Die Wirksamkeit der Leitlinie wird aktiv durch Metriken überwacht (z. B. durch die Reduzierung von Vorfällen, die auf Richtlinienverstöße zurückzuführen sind). Die Kenntnisnahme und das Verständnis der Leitlinie durch die Mitarbeitenden werden regelmäßig überprüft, z. B. durch kurze Tests im Rahmen von Awareness-Kampagnen."
                  }
                ]
              },
              {
                "uuid": "454104ef-2a6a-4294-a987-a9948791e0a4",
                "control-id": "GC.6.1",
                "description": "Implementation for GC.6.1 based on BSI OPS.1.2.4.A8",
                "statements": [
                  {
                    "statement-id": "ops.1.2.4-a8-m2",
                    "uuid": "acf84f18-15e9-4d1e-a800-0afbb3c46f24",
                    "description": "Es sind regelmäßige Team-Meetings etabliert (z. B. wöchentlich), um wesentliche Informationen auszutauschen. Wichtige Sicherheitsupdates oder organisatorische Änderungen werden per E-Mail an alle verteilt. Es gibt jedoch keine zentralen, festen Regeln zur Erreichbarkeit oder zum Umgang mit Problemen."
                  },
                  {
                    "statement-id": "ops.1.2.4-a8-m3",
                    "uuid": "499c0fdb-f479-4e01-b501-37ddd3d331a0",
                    "description": "Ein regelmäßiger innerbetrieblicher Informationsaustausch zwischen den Mitarbeitenden und der Institution SOLLTE gewährleistet sein. Alle Mitarbeitenden SOLLTEN zeitnah über geänderte Sicherheitsanforderungen und andere sicherheitsrelevante Aspekte informiert werden. Allen Kollegen und Kolleginnen der jeweiligen Mitarbeitenden SOLLTE bekannt sein, wann und wo diese erreicht werden können. Technische und organisatorische Telearbeitsregelungen zur Aufgabenbewältigung, zu Sicherheitsvorfällen und sonstigen Problemen SOLLTEN geregelt und an die Mitarbeitenden kommuniziert werden."
                  },
                  {
                    "statement-id": "ops.1.2.4-a8-m4",
                    "uuid": "b023ac48-5707-4e8d-a77e-4188f15b50b3",
                    "description": "Eine zentrale Kommunikationsplattform (z. B. ein Intranet-Portal oder ein dedizierter Microsoft Teams-Kanal) wird als verbindliche 'Single Source of Truth' für alle wichtigen Informationen etabliert. Der Anwesenheitsstatus wird automatisch aus dem Kalender in die Kommunikationswerkzeuge integriert. Es gibt einen formalisierten und getesteten Prozess für die Meldung und Bearbeitung von Vorfällen, der speziell auf die Bedürfnisse von Telearbeitenden zugeschnitten ist."
                  },
                  {
                    "statement-id": "ops.1.2.4-a8-m5",
                    "uuid": "c68105c9-9be2-4630-aa74-968dd8f25e01",
                    "description": "Die Kommunikation ist mehrkanalig und wo sinnvoll automatisiert. Es existiert ein dedizierter, überwachter Notfall-Kommunikationskanal für dringende Sicherheitswarnungen. Eine umfassende, durchsuchbare Wissensdatenbank für Telearbeits-spezifische Fragestellungen und Problemlösungen wird aktiv gepflegt und von den Mitarbeitenden genutzt. Die Effektivität des Informationsflusses wird anhand von Metriken (z.B. Lesebestätigungen, Zugriffe auf die Wissensdatenbank) bewertet."
                  }
                ]
              },
              {
                "uuid": "bc24e076-edff-476d-9b05-968380bcff5c",
                "control-id": "GC.7.1",
                "description": "Implementation for GC.7.1 based on BSI ISMS.1.A16",
                "statements": [
                  {
                    "statement-id": "isms.1.a16-m1",
                    "uuid": "543835f4-f1f5-43e7-b014-c1b545c65017",
                    "description": "Es existiert nur eine einzige, sehr allgemeine und hoch-abstrakte Leitlinie zur Informationssicherheit. Detaillierte, themenspezifische Richtlinien fehlen."
                  },
                  {
                    "statement-id": "isms.1.a16-m2",
                    "uuid": "b3545dff-357b-4515-872b-d7cdb99c5e9e",
                    "description": "Es gibt einige themenspezifische Richtlinien (z.B. eine Passwortrichtlinie). Diese sind jedoch als 'One-size-fits-all'-Dokumente für die gesamte Institution verfasst und nicht auf die unterschiedlichen Bedürfnisse und Kenntnisse verschiedener Zielgruppen (z.B. Admin vs. Endanwender) zugeschnitten."
                  },
                  {
                    "statement-id": "isms.1.a16-m3",
                    "uuid": "4d19a573-1922-4a65-8546-5de3325bdf33",
                    "description": "Neben den allgemeinen Vorgaben SOLLTE es auch zielgruppenorientierte Sicherheitsrichtlinien geben, die jeweils bedarfsgerecht die relevanten Sicherheitsthemen abbilden. Es wird ein Prozess etabliert, um den Bedarf an solchen Richtlinien zu erkennen und diese zu erstellen."
                  },
                  {
                    "statement-id": "isms.1.a16-m4",
                    "uuid": "e4246ae7-300a-4a7f-960d-9b38b9e76fa5",
                    "description": "Es ist ein klares Rahmenwerk für das Richtlinienmanagement etabliert, das den gesamten Lebenszyklus aller Richtlinien (Erstellung, Prüfung, Freigabe, Kommunikation, Überprüfung, Außerkraftsetzung) regelt. Die Richtlinien werden in verständlicher Sprache formuliert und visuell ansprechend aufbereitet, um die Akzeptanz zu erhöhen."
                  },
                  {
                    "statement-id": "isms.1.a16-m5",
                    "uuid": "36932631-abeb-48a3-96ad-0cd4b261e986",
                    "description": "Die Kenntnisnahme und das Verständnis der relevanten Richtlinien werden für jeden Mitarbeitenden nachweislich sichergestellt und dokumentiert. Wo immer technisch möglich und sinnvoll, werden die Vorgaben aus den Richtlinien durch technische Kontrollen erzwungen und deren Einhaltung automatisiert überwacht."
                  }
                ]
              },
              {
                "uuid": "5e121e03-558f-4a03-88a3-7c933f0d52da",
                "control-id": "GC.8.1",
                "description": "Implementation for GC.8.1 based on BSI ISMS.1.A15",
                "statements": [
                  {
                    "statement-id": "isms.1.a15-m1",
                    "uuid": "0143d7cf-7ead-4f07-9a36-eb8ae83656dd",
                    "description": "Ressourcen für Informationssicherheit werden nur reaktiv und ohne strategische Planung oder Budgetierung bereitgestellt. Investitionen erfolgen oft auf Basis von Ängsten oder aggressiven Vertriebsargumenten statt auf Basis einer Analyse."
                  },
                  {
                    "statement-id": "isms.1.a15-m2",
                    "uuid": "4e558a81-76b4-401d-b83a-4d567f624b49",
                    "description": "Es gibt ein jährliches Budget für Informationssicherheit. Die Verteilung der Mittel innerhalb dieses Budgets ist jedoch nicht klar begründet und es wird nicht gemessen, ob die Investitionen den gewünschten Nutzen bringen."
                  },
                  {
                    "statement-id": "isms.1.a15-m3",
                    "uuid": "9ce6507e-8bae-4e08-b963-ac2d664e2191",
                    "description": "Die Sicherheitsstrategie SOLLTE wirtschaftliche Aspekte berücksichtigen. Werden Sicherheitsmaßnahmen festgelegt, SOLLTEN die dafür erforderlichen Ressourcen beziffert werden. Die für Informationssicherheit eingeplanten Ressourcen SOLLTEN termingerecht bereitgestellt werden. Bei Arbeitsspitzen oder besonderen Aufgaben SOLLTEN zusätzliche interne Mitarbeitende eingesetzt oder externe Expertise hinzugezogen werden."
                  },
                  {
                    "statement-id": "isms.1.a15-m4",
                    "uuid": "6ff738fa-c8d1-4bf7-8f13-2e934350f463",
                    "description": "Für wesentliche Sicherheitsinvestitionen wird eine formale Kosten-Nutzen-Analyse durchgeführt. Die Gesamtkosten (Total Cost of Ownership, TCO) einer Sicherheitslösung, einschließlich Personal- und Wartungskosten, werden bei der Investitionsentscheidung berücksichtigt."
                  },
                  {
                    "statement-id": "isms.1.a15-m5",
                    "uuid": "8ca13aa7-b483-4051-9fdf-cdaa948db346",
                    "description": "Der Prozess der Ressourcenzuweisung ist direkt mit dem Risikomanagement-Framework verknüpft. Investitionen werden klar priorisiert, um die größten Risiken für die Geschäftsziele der Institution zu mitigieren. Die Wirksamkeit der Ausgaben wird systematisch über Sicherheitsmetriken und KPIs gemessen und berichtet."
                  }
                ]
              },
              {
                "uuid": "0e928061-7a85-4854-b616-a9d1665badc1",
                "control-id": "GC.9.1",
                "description": "Implementation for GC.9.1 based on BSI ISMS.1.A13",
                "statements": [
                  {
                    "statement-id": "isms.1.a13-m1",
                    "uuid": "61758429-5fb1-47ca-af66-bc9a68665cb9",
                    "description": "Wichtige Dokumente wie das Sicherheitskonzept existieren, sind aber veraltet und nicht zentral auffindbar. Viele Entscheidungen werden mündlich getroffen und nicht dokumentiert."
                  },
                  {
                    "statement-id": "isms.1.a13-m2",
                    "uuid": "eba4d49b-ec93-4f15-af15-6b670ee8932c",
                    "description": "Die wesentlichen Dokumente des Sicherheitsprozesses werden erstellt und an einem zentralen Ort abgelegt. Es fehlt jedoch ein geregelter Prozess für die Erstellung, Freigabe, Versionierung und Archivierung der Dokumente."
                  },
                  {
                    "statement-id": "isms.1.a13-m3",
                    "uuid": "98432260-d114-4d9a-869f-433d86524fbd",
                    "description": "Der Ablauf des Sicherheitsprozesses SOLLTE dokumentiert werden. Wichtige Entscheidungen und Arbeitsergebnisse (Sicherheitskonzept, Richtlinien, Untersuchungsergebnisse) SOLLTEN ausreichend dokumentiert werden. Es SOLLTE eine geregelte Vorgehensweise für die Erstellung und Archivierung von Dokumentationen geben. Regelungen SOLLTEN existieren, um Aktualität und Vertraulichkeit zu wahren. Die jeweils aktuelle Version SOLLTE kurzfristig zugänglich sein und alle Vorgängerversionen SOLLTEN zentral archiviert werden."
                  },
                  {
                    "statement-id": "isms.1.a13-m4",
                    "uuid": "6bd1779b-9783-4abe-9c1f-aa2ef958c921",
                    "description": "Ein Dokumentenmanagementsystem (DMS) wird zur Verwaltung aller Sicherheitsdokumente eingesetzt. Das DMS erzwingt den definierten Lebenszyklus der Dokumente, einschließlich Versionierung, Zugriffskontrolle und automatisierter Review-Workflows."
                  },
                  {
                    "statement-id": "isms.1.a13-m5",
                    "uuid": "3251c072-eb49-4be2-9688-4798631e401b",
                    "description": "Die Sicherheitsdokumentation ist in eine zentrale Wissensdatenbank oder ein GRC-Tool integriert. Die Beziehungen zwischen Dokumenten (z.B. zwischen einer Richtlinie, einem Konzept und einer zugehörigen Prozedur) sind explizit abgebildet. Dies ermöglicht eine automatisierte Auswirkungsanalyse bei Änderungen."
                  }
                ]
              },
              {
                "uuid": "e0a6cb77-25b5-48e6-8b46-35aba4bb2415",
                "control-id": "GEB.1.1",
                "description": "Implementation for GEB.1.1 based on BSI inf-5-a1",
                "statements": [
                  {
                    "statement-id": "inf-5-a1-m1",
                    "uuid": "187c954a-cd20-4cb0-8150-4069d96a7f78",
                    "description": "Es existieren erste, unvollständige Planungsskizzen zur Raumabsicherung. Diese berücksichtigen jedoch nur einzelne, offensichtliche Gefährdungen wie unbefugten Zutritt, lassen aber wesentliche Aspekte wie Umwelteinflüsse oder gesetzliche Vorschriften außer Acht."
                  },
                  {
                    "statement-id": "inf-5-a1-m2",
                    "uuid": "de2b5f7f-db2b-4afb-9bc9-5aaafca24fad",
                    "description": "Eine grundlegende Planung der Raumabsicherung wurde durchgeführt und dokumentiert. Sie deckt die wichtigsten Gefährdungen wie Einbruch und Feuer ab und berücksichtigt grundlegende gesetzliche Anforderungen. Eine detaillierte Risikoanalyse für spezifische Bedrohungen fehlt jedoch noch."
                  },
                  {
                    "statement-id": "inf-5-a1-m3",
                    "uuid": "ec1b0605-269c-4ea0-bc35-000454e0af75",
                    "description": "Für einen Raum für technische Infrastruktur MÜSSEN angemessene technische und organisatorische Vorgaben definiert und umgesetzt werden. Dabei MUSS das für den Raum zu erreichende Schutzniveau berücksichtigt werden. Bei der Planung MÜSSEN sowohl gesetzliche Regelungen und Vorschriften als auch potenzielle Gefährdungen durch Umwelteinflüsse, Einbruch und Sabotage beachtet werden."
                  },
                  {
                    "statement-id": "inf-5-a1-m4",
                    "uuid": "e3bc9d8c-1e4a-4501-a1ab-2873021f1968",
                    "description": "Die Planung der Raumabsicherung wird regelmäßig, mindestens jährlich sowie anlassbezogen, überprüft und aktualisiert. Die Planung berücksichtigt auch weniger offensichtliche Bedrohungsszenarien und wird durch eine formale Risiko- und Bedrohungsanalyse gestützt. Die Ergebnisse werden revisionssicher dokumentiert."
                  },
                  {
                    "statement-id": "inf-5-a1-m5",
                    "uuid": "d7087ae7-7c88-47d7-a462-3b66f7c042e6",
                    "description": "Der Planungsprozess für die Raumabsicherung ist vollständig in das übergreifende ISMS und Risikomanagement der Organisation integriert. Die Planung wird durch regelmäßige, praktische Übungen und Simulationen (z.B. Einbruchsversuche, Brandschutzübungen) validiert. Die daraus gewonnenen Erkenntnisse fließen kontinuierlich in die Verbesserung der Planung und der umgesetzten Maßnahmen ein."
                  }
                ]
              },
              {
                "uuid": "c78279d4-c936-40b1-8ae5-5ea473c2f517",
                "control-id": "KONF.1.1",
                "description": "Implementation for KONF.1.1 based on BSI OPS.1.1.7.A1",
                "statements": [
                  {
                    "statement-id": "ops.1.1.7.a1-m1",
                    "uuid": "3cd330c9-a263-4303-92e1-ea9fdd73d849",
                    "description": "Anforderungen an das Systemmanagement sind nur sporadisch oder für einzelne, nicht kritische Systeme grob skizziert. Weder Sicherheitsaspekte noch Schnittstellendefinitionen für die Kompatibilität werden systematisch berücksichtigt."
                  },
                  {
                    "statement-id": "ops.1.1.7.a1-m2",
                    "uuid": "cf65404c-2d16-4e19-a294-6077b1995161",
                    "description": "Die grundlegenden funktionalen Anforderungen an die Systemmanagement-Infrastruktur und -Prozesse sind dokumentiert. Sicherheitsaspekte und Schnittstellen werden zwar erwähnt, aber nicht detailliert spezifiziert."
                  },
                  {
                    "statement-id": "ops.1.1.7.a1-m3",
                    "uuid": "020431c9-5a6d-4a67-ac23-76a3bff420ac",
                    "description": "Anforderungen an die Systemmanagement-Infrastruktur und -Prozesse MÜSSEN spezifiziert werden. Dabei MÜSSEN alle wesentlichen Elemente für das Systemmanagement berücksichtigt werden. Auch MÜSSEN die Sicherheitsaspekte für das Systemmanagement von Beginn an beachtet werden. Zudem MÜSSEN die Schnittstellen der zu verwaltenden IT-Systeme dokumentiert werden, z. B. um die Kompatibilität von Systemmanagement-Lösung und zu verwaltendem System zu gewährleisten."
                  },
                  {
                    "statement-id": "ops.1.1.7.a1-m4",
                    "uuid": "c6b15ba9-71e0-4675-ac9b-bb9e0f29f035",
                    "description": "Die Anforderungsspezifikation wird formal versioniert und einem dokumentierten Review-Prozess unterzogen, an dem sowohl technische als auch Fachabteilungen beteiligt sind. Die Kompatibilitätsanforderungen werden durch spezifische Testfälle untermauert."
                  },
                  {
                    "statement-id": "ops.1.1.7.a1-m5",
                    "uuid": "09ae5896-1335-49ff-ad9f-f16d3baac41e",
                    "description": "Die Anforderungsspezifikation ist in einem dedizierten Requirements-Management-Tool hinterlegt und wird als 'lebendes Dokument' kontinuierlich gepflegt. Anforderungen sind direkt mit Architekturmodellen, Risikobewertungen und automatisierten Testplänen verknüpft. Änderungen werden über einen formalen Change-Management-Prozess gesteuert."
                  }
                ]
              },
              {
                "uuid": "5bc8d458-b761-45fb-858e-2be41cbb59e8",
                "control-id": "KONF.1.3",
                "description": "Implementation for KONF.1.3 based on BSI OPS.1.1.3.A8",
                "statements": [
                  {
                    "statement-id": "ops.1.1.3-a8-m1",
                    "uuid": "f74817b0-e465-44c7-a9e5-1fada634ac6d",
                    "description": "Es werden verschiedene Skripte und Werkzeuge ad hoc zur Verteilung von Patches und Änderungen verwendet. Eine Sicherheitsprüfung oder einheitliche Konfiguration dieser Werkzeuge findet nicht statt."
                  },
                  {
                    "statement-id": "ops.1.1.3-a8-m2",
                    "uuid": "1a5d2f6f-3ad4-45c3-9854-810f3745d261",
                    "description": "Ein zentrales Werkzeug für das Patch-Management wird eingesetzt. Es gibt jedoch keine formalen Anforderungen an die Auswahl oder eine spezifische Richtlinie für dessen sichere Konfiguration und Nutzung."
                  },
                  {
                    "statement-id": "ops.1.1.3-a8-m3",
                    "uuid": "5dc385f7-672d-4a2a-ab90-6b20289a0d6f",
                    "description": "Es SOLLTEN Anforderungen und Rahmenbedingungen definiert werden, nach denen Werkzeuge für das Patch- und Änderungsmanagement ausgewählt werden. Außerdem SOLLTE eine spezifische Sicherheitsrichtlinie für die eingesetzten Werkzeuge erstellt werden, die deren Härtung und sichere Nutzung beschreibt."
                  },
                  {
                    "statement-id": "ops.1.1.3-a8-m4",
                    "uuid": "e4972f48-bc09-4f4f-8776-b5f11d825d6d",
                    "description": "Die Konfiguration der eingesetzten Werkzeuge wird regelmäßig auf Einhaltung der Sicherheitsrichtlinie überprüft (Compliance-Scan). Der Zugriff auf die Werkzeuge wird streng nach dem Prinzip der geringsten Rechte (Least Privilege) und über Rollenkonzepte gesteuert."
                  },
                  {
                    "statement-id": "ops.1.1.3-a8-m5",
                    "uuid": "7e4b09c1-56eb-4731-9ade-23fb22eb2d7e",
                    "description": "Die Werkzeuge für das Patch- und Änderungsmanagement sowie deren Infrastruktur sind selbst in den vollständigen Sicherheitsmanagementprozess eingebunden. Dies umfasst, dass sie selbst regelmäßig gepatcht werden und ihre Integrität kontinuierlich überwacht wird. Alle administrativen Zugriffe und Aktionen in den Werkzeugen werden an ein zentrales SIEM-System zur Überwachung und Anomalieerkennung weitergeleitet."
                  }
                ]
              },
              {
                "uuid": "49ba1d72-9144-4e84-9719-e49bedfb50a4",
                "control-id": "KONF.1.5",
                "description": "Implementation for KONF.1.5 based on BSI ORP.6.A15",
                "statements": [
                  {
                    "statement-id": "ORP.6.A15_L3",
                    "uuid": "34280862-3ad9-4266-b230-1199c291cbad",
                    "description": "Langlebige Anmeldeinformationen (Secrets), die für die Kommunikation von Dienst zu Dienst benötigt werden, werden sicher in einem zentralen Secrets-Management-Tool (z. B. HashiCorp Vault, Azure Key Vault) gespeichert und nicht im Code oder in Konfigurationsdateien."
                  },
                  {
                    "statement-id": "ORP.6.A15_L5",
                    "uuid": "c17ac4b4-2300-4209-8c56-6d44ba5a143d",
                    "description": "Die Authentifizierung zwischen Diensten (z. B. zwischen einem CI/CD-Runner und einem Cloud-Dienst) SOLLTE über kurzlebige, zertifikatsbasierte Identitäten (Workload Identity Federation) anstelle von langlebigen Schlüsseln abgesichert werden."
                  }
                ]
              },
              {
                "uuid": "b4ba8c5a-dbfd-4a28-aff6-38f3f4602559",
                "control-id": "NOT.1.1",
                "description": "Implementation for NOT.1.1 based on BSI ORP.4.A20",
                "statements": [
                  {
                    "statement-id": "ORP.4.A20-m3",
                    "uuid": "80d45a03-21a2-4688-a897-c8ba5d086019",
                    "description": "Es SOLLTE geprüft werden, inwieweit ein ausgefallenes IAM-System sicherheitskritisch ist. Es SOLLTEN Vorkehrungen getroffen werden, um bei einem Ausfall arbeitsfähig zu bleiben. Insbesondere SOLLTE das im Notfallkonzept vorgesehene Berechtigungskonzept (z.B. mit Notfall-Konten) weiterhin anwendbar sein."
                  },
                  {
                    "statement-id": "ORP.4.A20-m4",
                    "uuid": "51499917-b50e-4e3b-ba63-34777b9502d6",
                    "description": "Das IAM-System ist redundant ausgelegt, um eine hohe Verfügbarkeit zu gewährleisten. Der Wiederanlaufplan wird regelmäßig getestet. Die Nutzung von Notfallkonten wird technisch überwacht und löst automatisch eine Alarmierung aus."
                  },
                  {
                    "statement-id": "ORP.4.A20-m5",
                    "uuid": "00a470f2-8f70-41d4-ac0c-58b4c0b80153",
                    "description": "Das IAM-System ist als geo-redundanter, fehlertoleranter Dienst mit automatischem Failover konzipiert. Die Wiederanlaufzeit (RTO) ist nahe Null. Selbst bei einem Totalausfall des primären Rechenzentrums ist die Authentifizierung ohne spürbare Unterbrechung für die Benutzer weiterhin möglich."
                  }
                ]
              },
              {
                "uuid": "e9d0e479-fe68-4f3c-aa4d-1fd55759389a",
                "control-id": "NOT.2.1",
                "description": "Implementation for NOT.2.1 based on BSI DER.2.3.A1",
                "statements": [
                  {
                    "statement-id": "der.2.3-a1-m1",
                    "uuid": "aead71dd-6a57-487a-8cc0-96fec5e6c7aa",
                    "description": "Nach der Entdeckung eines schwerwiegenden Vorfalls wird informell eine kleine Gruppe von IT-Mitarbeitern zusammengestellt, um die Reaktion zu koordinieren. Dieser Gruppe fehlen jedoch ein formelles Mandat und übergeordnete Weisungsbefugnisse. Entscheidungen werden ad hoc und reaktiv getroffen, meist nur für die unmittelbar betroffenen Systeme."
                  },
                  {
                    "statement-id": "der.2.3-a1-m2",
                    "uuid": "1e7a76ba-13ea-4d2b-8e2a-0bfc12547269",
                    "description": "Es wird ein Team benannt, das für die Koordination der Bereinigung verantwortlich ist. Die Zuständigkeiten sind zwar grundsätzlich geklärt, die Weisungsbefugnisse sind jedoch auf die IT-Abteilung beschränkt. Ein grundlegender Plan für die Bereinigung wird erstellt, aber nicht formal mit allen relevanten Stakeholdern (z.B. Geschäftsführung, Fachbereiche) abgestimmt."
                  },
                  {
                    "statement-id": "der.2.3-a1-m3",
                    "uuid": "d3e70ac2-5bdc-494f-888b-e4075937c172",
                    "description": "Um einen APT-Vorfall zu bereinigen, MUSS ein Leitungsgremium eingerichtet werden, das alle notwendigen Aktivitäten plant, koordiniert und überwacht. Dem Gremium MÜSSEN alle für die Aufgaben erforderlichen Weisungsbefugnisse übertragen werden. Wurden schon spezialisierte Forensikdienstleistende hinzugezogen, SOLLTEN diese auch bei der Bereinigung des Vorfalls miteinbezogen werden. Ist die IT zu stark kompromittiert, SOLLTE geprüft werden, ob ein Krisenstab eingerichtet werden soll. In diesem Fall MUSS das Leitungsgremium die Bereinigungsmaßnahmen überwachen und dem Krisenstab berichten."
                  },
                  {
                    "statement-id": "der.2.3-a1-m4",
                    "uuid": "02c636ec-4cfb-4aff-a12b-99a01473cc9a",
                    "description": "Das Leitungsgremium arbeitet auf Basis eines vordefinierten und regelmäßig geübten Incident-Response-Plans. Rollen, Verantwortlichkeiten und Eskalationspfade sind klar dokumentiert und allen Mitgliedern bekannt. Das Gremium umfasst standardmäßig Vertreter aus IT, Sicherheit, Recht, Personal und Kommunikation. Die Zusammenarbeit mit externen Dienstleistern und Behörden ist vertraglich und prozessual geregelt."
                  },
                  {
                    "statement-id": "der.2.3-a1-m5",
                    "uuid": "159ff03c-ad3d-4540-84b6-5404a9aa0a87",
                    "description": "Ein permanentes, hochtrainiertes Krisenreaktionsteam (Crisis Response Team, CRT), das das Leitungsgremium darstellt, ist etabliert. Dieses Team verfügt über vorab genehmigte Notfallbudgets und weitreichende exekutive Befugnisse, um ohne Verzögerung handeln zu können. Die Effektivität des Teams und der Prozesse wird kontinuierlich durch komplexe Simulationen (z. B. Red-Team-Übungen) und die Analyse vergangener Vorfälle gemessen und verbessert."
                  }
                ]
              },
              {
                "uuid": "ed42a91e-7014-404b-a3f2-7219eb76f40a",
                "control-id": "NOT.3.1",
                "description": "Implementation for NOT.3.1 based on BSI OPS.1.1.2.A27",
                "statements": [
                  {
                    "statement-id": "OPS.1.1.2.A27-m3",
                    "uuid": "eb658e33-473f-4eda-acf4-4e16e6a9c655",
                    "description": "Für den Ausfall eines zentralen Administrationswerkzeugs (z.B. vCenter) gibt es eine dokumentierte Notfallanleitung, die beschreibt, wie auf einzelne Komponenten direkt zugegriffen werden kann."
                  },
                  {
                    "statement-id": "OPS.1.1.2.A27-m4",
                    "uuid": "0e4c945e-c54d-43dd-b1f8-1a794b250f55",
                    "description": "Für zentrale IT-Administrationswerkzeuge SOLLTEN Alternativen zur Verfügung stehen, mit denen im Bedarfsfall administriert werden kann. Hierzu SOLLTEN Sprungsysteme mit Zugriff auf entsprechende Administrationsnetze zur Verfügung stehen. Falls solche Alternativen nicht zur Verfügung stehen, SOLLTE zur IT-Administration der Zugang und der direkte Zugriff auf die zu administrierende IT möglich sein."
                  },
                  {
                    "statement-id": "OPS.1.1.2.A27-m5",
                    "uuid": "f2c21a37-858d-47f0-8e8e-9814b7d54084",
                    "description": "Zentrale Administrationswerkzeuge sind hochverfügbar über mehrere Standorte oder Verfügbarkeitszonen hinweg konzipiert. Das Failover zwischen den Instanzen erfolgt automatisch und wird permanent überwacht. Der 'Break-Glass'-Prozess ist ebenfalls automatisiert und löst bei Aktivierung spezielle Alarme und einen hochpriorisierten Überwachungsprozess aus."
                  }
                ]
              },
              {
                "uuid": "f807f757-48a5-4f55-b2b6-6a7df0dbef5b",
                "control-id": "NOT.3.4",
                "description": "Implementation for NOT.3.4 based on BSI DER.4.A10",
                "statements": [
                  {
                    "statement-id": "DER.4.A10-m3",
                    "uuid": "a47c8c77-eb78-44e9-b669-5b1b78f4e7b1",
                    "description": "Alle wesentlichen Sofortmaßnahmen und Notfallpläne MÜSSEN in angemessener Weise regelmäßig und anlassbezogen getestet und geübt werden. Der zeitliche Rahmen und die fachliche Abdeckung aller Übungen MÜSSEN übergreifend in einem Übungsplan dokumentiert werden. Im Notfallmanagement MÜSSEN ausreichend Ressourcen für die Planung, Konzeption, Durchführung und Auswertung der Tests und Übungen bereitgestellt werden."
                  },
                  {
                    "statement-id": "DER.4.A10-m4",
                    "uuid": "9d0a3f9a-fee3-4451-853b-fdf0d021ce14",
                    "description": "Der Übungsplan SOLLTE eine Vielfalt an Übungsarten (z.B. Planbesprechung, technischer Test, Simulationsübung) und Szenarien abdecken, die in ihrer Komplexität progressiv ansteigen. Die Ergebnisse der Übungen SOLLTEN dokumentiert und ein Prozess zur Nachverfolgung der Verbesserungspotenziale (Lessons Learned) etabliert werden."
                  },
                  {
                    "statement-id": "DER.4.A10-m5",
                    "uuid": "54f28c03-2d1a-4f6a-a36e-7544ea2d438c",
                    "description": "Eine mehrjährige Übungsstrategie ist etabliert, die in Vollübungen mündet, an denen auch externe Partner (z.B. wichtige Dienstleister, Behörden) beteiligt sind. Die Testergebnisse fließen direkt in die BCMS-Strategie und die Ressourcenplanung ein. Technische Tests werden, wo möglich, automatisiert."
                  }
                ]
              },
              {
                "uuid": "5031a861-eda1-4ea1-a1f3-3abcf2476ca1",
                "control-id": "NOT.3.5",
                "description": "Implementation for NOT.3.5 based on BSI DER.2.3.A8",
                "statements": [
                  {
                    "statement-id": "der.2.3-a8-m3",
                    "uuid": "c7ff4f3e-d386-49b5-9d6c-9b6bf9c09d13",
                    "description": "Es SOLLTEN sichere Kommunikationskanäle für das Leitungsgremium und die mit der Bereinigung beauftragten Mitarbeitenden etabliert werden. Diese Kanäle MÜSSEN unabhängig vom potenziell kompromittierten Unternehmensnetz sein. Wird auf Kommunikationsdienste Dritter zurückgegriffen, SOLLTE auch hier darauf geachtet werden, dass ein sicherer Kommunikationskanal ausgewählt wird."
                  },
                  {
                    "statement-id": "der.2.3-a8-m4",
                    "uuid": "bf502800-0b8b-4d13-898d-3a36fab26d49",
                    "description": "Für das Krisenteam werden vorab beschaffte und vorbereitete Notfall-Geräte (Laptops, Smartphones) mit gehärteten Images bereitgehalten. Diese Geräte sind für die Nutzung mit einem vordefinierten, sicheren und unabhängigen Kommunikationskanal konfiguriert. Der Prozess zur Aktivierung dieser Notfallkommunikation ist dokumentiert und wird regelmäßig geübt."
                  },
                  {
                    "statement-id": "der.2.3-a8-m5",
                    "uuid": "67ba74f3-cf96-4e59-8ed4-1e78e3432150",
                    "description": "Die Organisation betreibt eine permanent verfügbare, physisch und logisch vollständig getrennte Notfall-Infrastruktur ('dark network') für das Krisenmanagement. Diese Infrastruktur umfasst dedizierte Server, Netzwerkkomponenten, Arbeitsplätze und Kommunikationssysteme. Der Zugriff erfordert eine starke Zwei-Faktor-Authentisierung mit Hardware-Token. Die Funktionsfähigkeit dieser Infrastruktur wird kontinuierlich überwacht und regelmäßig getestet."
                  }
                ]
              },
              {
                "uuid": "392c8268-a122-47eb-b96c-c144bd76a01d",
                "control-id": "NOT.3.6",
                "description": "Implementation for NOT.3.6 based on BSI OPS.1.1.1.A25",
                "statements": [
                  {
                    "statement-id": "ops.1.1.1-a25-m5",
                    "uuid": "4bba50d0-46e6-4fb4-b9c5-f132d54f9005",
                    "description": "Für die Betriebsmittel SOLLTE sichergestellt werden, dass diese auch bei äußeren Störungen genutzt werden können. Insbesondere SOLLTE eine ausgefallende Internet-Anbindung nicht zu einer Störung der Betriebsmittel führen. Die Betriebsmittel SOLLTEN so konfiguriert und verortet werden, dass die Abhängigkeiten zwischen den verschiedenen Betriebsmitteln minimiert wird. Es SOLLTE verhindert werden, dass der Ausfall eines Betriebsmittels zu einer betriebsverhindernden Störung eines anderen Betriebsmittels führt."
                  }
                ]
              },
              {
                "uuid": "a53da479-7fbb-4d15-b684-247a6901187c",
                "control-id": "NOT.4.1",
                "description": "Implementation for NOT.4.1 based on BSI CON.3.A1",
                "statements": [
                  {
                    "statement-id": "con.3.a1-m1",
                    "uuid": "c32e2049-5c7c-465a-a7dc-f90989d47eaa",
                    "description": "Einflussfaktoren für die Datensicherung werden nur sporadisch und ausschließlich für die als absolut kritisch eingestuften Systeme erhoben. Die Erhebung erfolgt informell, beispielsweise durch mündliche Absprachen, und wird nicht dokumentiert."
                  },
                  {
                    "statement-id": "con.3.a1-m2",
                    "uuid": "75462fe3-e35e-4b7f-b342-b00bb25901d5",
                    "description": "Die Erhebung der Einflussfaktoren erfolgt für alle IT-Systeme, konzentriert sich jedoch primär auf technische Aspekte wie Speichervolumen und Änderungsraten. Die Anforderungen der Fachverantwortlichen werden zwar eingeholt, aber nicht systematisch erfasst oder priorisiert."
                  },
                  {
                    "statement-id": "con.3.a1-m3",
                    "uuid": "0dfff4b4-d892-4447-9d71-b559ecfd9633",
                    "description": "Der IT-Betrieb MUSS für jedes IT-System und jede Anwendung die Rahmenbedingungen für die Datensicherung erheben. Dazu MÜSSEN die Fachverantwortlichen ihre Anforderungen definieren. Mindestens folgende Punkte MÜSSEN abgestimmt werden: zu sichernde Daten, Speichervolumen, Änderungsvolumen, Änderungszeitpunkte, Verfügbarkeitsanforderungen, Vertraulichkeitsanforderungen, Integritätsbedarf, rechtliche Anforderungen, Anforderungen an das Löschen und Vernichten sowie Zuständigkeiten. Die Einflussfaktoren MÜSSEN nachvollziehbar dokumentiert werden."
                  },
                  {
                    "statement-id": "con.3.a1-m4",
                    "uuid": "8fd5f0fe-5fb5-4e28-9d8b-5c0b7acf229d",
                    "description": "Der Prozess zur Erhebung der Einflussfaktoren ist formalisiert und in das IT-Service-Management integriert. Es gibt einen festen, regelmäßigen Überprüfungszyklus (z. B. jährlich), um die Anforderungen für alle Systeme zu aktualisieren, auch wenn keine Änderungen gemeldet wurden. Die Ergebnisse sind in einer zentralen Datenbank (z. B. CMDB) gespeichert."
                  },
                  {
                    "statement-id": "con.3.a1-m5",
                    "uuid": "fa27856c-bf9f-4b9c-8521-cebf0ae89d5b",
                    "description": "Die Erhebung und Aktualisierung der Einflussfaktoren ist weitgehend automatisiert. Das System korreliert Daten aus der Business Impact Analyse (BIA), dem Risikomanagement-Tool, der CMDB und rechtlichen Datenbanken, um die Schutzbedarfs- und Verfügbarkeitsanforderungen dynamisch zu ermitteln und anzupassen. Änderungen in Geschäftsprozessen lösen automatisch eine Neubewertung aus."
                  }
                ]
              },
              {
                "uuid": "eb7f5b96-381e-4db8-b2c8-325c4ad8c6bf",
                "control-id": "NOT.4.6",
                "description": "Implementation for NOT.4.6 based on BSI CON.1.A2",
                "statements": [
                  {
                    "statement-id": "con.1.a2-m1",
                    "uuid": "fe25e5d5-dd86-4ae8-9f2d-b79ec1e1f2e1",
                    "description": "Kryptografische Schlüssel werden sporadisch gesichert, jedoch oft ohne ausreichenden Schutz vor unbefugtem Zugriff. Teilweise werden die Schlüssel unverschlüsselt auf demselben Datenträger oder im selben Backup-Set wie die zugehörigen verschlüsselten Daten gespeichert."
                  },
                  {
                    "statement-id": "con.1.a2-m2",
                    "uuid": "2373409f-141c-4b77-8470-0c3c570c50f9",
                    "description": "Es gibt eine grundlegende Vorgehensweise, langlebige kryptografische Schlüssel getrennt von den Daten zu sichern, z.B. auf einem anderen Server oder einem externen Medium. Dieser Prozess ist jedoch manuell, nicht für alle Systeme standardisiert oder vollständig dokumentiert."
                  },
                  {
                    "statement-id": "con.1.a2-m3",
                    "uuid": "272b5c1b-a8ba-421a-96c5-fc5b12a18c0e",
                    "description": "In Datensicherungen MÜSSEN kryptografische Schlüssel vom IT-Betrieb derart gespeichert oder aufbewahrt werden, dass Unbefugte nicht darauf zugreifen können. Langlebige kryptografische Schlüssel MÜSSEN offline, außerhalb der eingesetzten IT-Systeme, aufbewahrt werden. Der IT-Betrieb MUSS sicherstellen, dass auf verschlüsselt gespeicherte Informationen auch nach längeren Zeiträumen noch zugegriffen werden kann. Diese Prozesse sind im Kryptokonzept dokumentiert."
                  },
                  {
                    "statement-id": "con.1.a2-m4",
                    "uuid": "9a869052-61bb-47c3-893f-296df0889cc0",
                    "description": "Bei einer Langzeitspeicherung verschlüsselter Informationen SOLLTE regelmäßig geprüft werden, ob die verwendeten kryptografischen Algorithmen und die Schlüssellängen noch für die jeweiligen Informationen geeignet sind. Verwendete Hard- oder Software mit kryptografischen Funktionen SOLLTE für die Dauer der Archivierung ebenfalls archiviert werden. Wiederherstellungstests von archivierten Daten und Schlüsseln werden periodisch durchgeführt."
                  },
                  {
                    "statement-id": "con.1.a2-m5",
                    "uuid": "ed59d9e2-56f6-4043-80d6-e866d6f199f4",
                    "description": "Die Sicherung und Archivierung von Schlüsseln erfolgt ausschließlich über dedizierte, hochverfügbare Hardware-Sicherheitsmodule (HSM) oder ein zentrales Key Management System (KMS). Der gesamte Prozess der Überprüfung von Algorithmen, der Archivierung und der periodischen Wiederherstellungstests ist automatisiert und wird manipulationssicher protokolliert. Daten in Langzeitarchiven werden bei Bedarf proaktiv auf neuere, stärkere Algorithmen umverschlüsselt."
                  }
                ]
              },
              {
                "uuid": "811bcdd7-9bea-4d3f-bce3-1d7e4cfef2ff",
                "control-id": "NOT.4.8",
                "description": "Implementation for NOT.4.8 based on BSI CON.3.A13",
                "statements": [
                  {
                    "statement-id": "con.3.a13-m3",
                    "uuid": "ae8b5250-f706-4125-bbe1-3bc71ece202d",
                    "description": "Um die Vertraulichkeit der gesicherten Daten zu gewährleisten, SOLLTE der IT-Betrieb alle Datensicherungen verschlüsseln. Es SOLLTE sichergestellt werden, dass sich die verschlüsselten Daten auch nach längerer Zeit wieder einspielen lassen. Verwendete kryptografische Schlüssel SOLLTEN mit einer getrennten Datensicherung geschützt werden."
                  },
                  {
                    "statement-id": "con.3.a13-m4",
                    "uuid": "36473a07-05c7-4e7e-909d-d5392572aa08",
                    "description": "Ein dediziertes Key Management System (KMS) oder ein Hardware Security Module (HSM) wird zur Verwaltung des Lebenszyklus der Backup-Verschlüsselungsschlüssel verwendet. Richtlinien zur Schlüsselrotation werden durchgesetzt. Die Stärke der kryptografischen Algorithmen und Schlüssellängen folgt den aktuellen Empfehlungen (z.B. BSI TR-02102)."
                  },
                  {
                    "statement-id": "con.3.a13-m5",
                    "uuid": "09884431-bd18-4ebf-a753-2b2dea4cdc31",
                    "description": "Der gesamte Backup-Prozess ist kryptografisch Ende-zu-Ende gesichert. Die Daten werden bereits auf dem Client vor der Übertragung verschlüsselt (client-side encryption) und bleiben während des Transports und der Speicherung auf dem Backup-Medium verschlüsselt. Die Schlüsselverwaltung wird von einem hochverfügbaren, auditierten HSM-Cluster übernommen. Regelmäßige 'Krypto-Agilitäts'-Übungen werden durchgeführt, um die Fähigkeit zur Migration auf neue kryptografische Algorithmen zu testen."
                  }
                ]
              },
              {
                "uuid": "082ecbac-014f-42fc-acc1-0568cf77d736",
                "control-id": "NOT.4.9",
                "description": "Implementation for NOT.4.9 based on BSI OPS.1.2.2.A18",
                "statements": [
                  {
                    "statement-id": "ops.1.2.2-a18-m1",
                    "uuid": "6c045bb7-f7cf-4c48-9b59-06ce7433a790",
                    "description": "Es werden ungeeignete Speichermedien aus dem Consumer-Bereich (z.B. einfache USB-Festplatten, Consumer-SSDs) ohne Berücksichtigung von Langlebigkeit, Zuverlässigkeit oder Datenintegrität für die Archivierung verwendet."
                  },
                  {
                    "statement-id": "ops.1.2.2-a18-m2",
                    "uuid": "61a18eb8-64d2-466c-bc66-1978da82da55",
                    "description": "Es werden Speichermedien aus dem Enterprise-Segment verwendet (z.B. Server-Festplatten). Die Auswahl ist jedoch nicht spezifisch auf die Anforderungen des Archivs (z.B. Zugriffsfrequenz, Datenvolumen, Langzeitstabilität) zugeschnitten."
                  },
                  {
                    "statement-id": "ops.1.2.2-a18-m3",
                    "uuid": "90e39738-1851-4c06-a0a9-e3f9207423df",
                    "description": "Für die Archivierung SOLLTEN geeignete Medien ausgewählt und benutzt werden. Dabei SOLLTEN Aspekte wie das zu archivierende Datenvolumen, die mittleren Zugriffszeiten und die mittleren gleichzeitigen Zugriffe auf das Archivsystem berücksichtigt werden. Ebenfalls SOLLTEN die Archivmedien die Anforderungen an eine Langzeitarchivierung hinsichtlich Revisionssicherheit und Lebensdauer erfüllen."
                  },
                  {
                    "statement-id": "ops.1.2.2-a18-m4",
                    "uuid": "c84a21f5-ce4a-4550-8f9d-583c64840ba7",
                    "description": "Es wird ein mehrstufiges Speicherkonzept (Tiered Storage) verwendet, das unterschiedliche Medientypen (z.B. SSDs, HDDs, Bänder, Cloud-Speicher) kombiniert, um den Anforderungen verschiedener Datenklassen an Leistung, Kosten und Langlebigkeit optimal gerecht zu werden. Die Medien sind explizit für die Langzeitarchivierung zertifiziert."
                  },
                  {
                    "statement-id": "ops.1.2.2-a18-m5",
                    "uuid": "b5f3d3a1-6540-4e75-8a0d-ef40f979ca37",
                    "description": "Die Auswahl der Speichermedien basiert auf einer formalen Risikoanalyse und einer Total Cost of Ownership (TCO) Betrachtung. Für Daten mit höchsten Integritätsanforderungen werden grundsätzlich nicht wiederbeschreibbare Medien (WORM - Write Once, Read Many) eingesetzt, um Manipulationen auf Medienebene auszuschließen."
                  }
                ]
              },
              {
                "uuid": "e16e2fdf-34ce-4219-adf7-ed042b676124",
                "control-id": "PERF.1.1",
                "description": "Implementation for PERF.1.1 based on BSI ORP.5.A8",
                "statements": [
                  {
                    "statement-id": "ORP.5.A8-m1",
                    "uuid": "f4ee0609-0254-4cbb-b5d3-119334637d09",
                    "description": "Eine Überprüfung des Compliance Managements findet nicht statt. Erst wenn externe Prüfer (z.B. Wirtschaftsprüfer, Aufsichtsbehörden) Feststellungen treffen, wird reaktiv gehandelt."
                  },
                  {
                    "statement-id": "ORP.5.A8-m2",
                    "uuid": "60b3ca98-49f3-4ada-bacb-7751ac789261",
                    "description": "Das Compliance Management wird in unregelmäßigen Abständen informell überprüft. Die Überprüfungen sind nicht systematisch, der Umfang ist nicht definiert und die Ergebnisse werden nicht formal dokumentiert."
                  },
                  {
                    "statement-id": "ORP.5.A8-m3",
                    "uuid": "4c5d6346-f38e-4280-b80d-f4f64e316903",
                    "description": "Es SOLLTE ein Verfahren etabliert sein, wie das Compliance Management und die sich daraus ergebenden Anforderungen und Maßnahmen regelmäßig auf ihre Effizienz und Effektivität überprüft werden (siehe auch DER.3.1 Audits und Revisionen). Es SOLLTE regelmäßig geprüft werden, ob die Organisationsstruktur und die Prozesse des Compliance Managements angemessen sind."
                  },
                  {
                    "statement-id": "ORP.5.A8-m4",
                    "uuid": "d4457e8c-da9f-42dc-acbd-9f3be68a2abb",
                    "description": "Die Überprüfung des Compliance Managements erfolgt durch regelmäßige, formale interne Audits, die von einer unabhängigen Stelle (z.B. Interne Revision) durchgeführt werden. Zusätzlich wird ein Self-Assessment-Prozess etabliert, bei dem die Fachbereiche ihre eigene Compliance regelmäßig bewerten. Die Ergebnisse aus allen Überprüfungen werden konsolidiert und für einen formalen Management-Review aufbereitet."
                  },
                  {
                    "statement-id": "ORP.5.A8-m5",
                    "uuid": "19ef8f27-e7a3-4d4f-a07d-6238e0bafb2a",
                    "description": "Das Compliance Management System wird kontinuierlich überwacht (Continuous Auditing). Schlüsselkontrollen werden automatisiert getestet und die Ergebnisse in Echtzeit in einem Dashboard dargestellt. Zusätzlich wird das CMS regelmäßig von externen, spezialisierten Prüfern zertifiziert (z.B. nach IDW PS 980). Die Ergebnisse fließen direkt in einen Prozess der kontinuierlichen Verbesserung ein, der durch KPIs gemessen wird."
                  }
                ]
              },
              {
                "uuid": "8da51c6d-e033-4b40-88dd-5a7e02a1a9fb",
                "control-id": "PERF.2.1",
                "description": "Implementation for PERF.2.1 based on BSI CON.8.A18",
                "statements": [
                  {
                    "statement-id": "CON.8.A18-m3",
                    "uuid": "ef033a96-1652-4b0f-8c3d-0bf39d4b359c",
                    "description": "Die Entwicklungsumgebung und die Testumgebung werden bei wesentlichen Änderungen oder bei konkretem Verdacht auf Sicherheitsprobleme einem Sicherheitsaudit unterzogen."
                  },
                  {
                    "statement-id": "CON.8.A18-m4",
                    "uuid": "80b919cd-5579-411c-b0fd-8d26d46d2e72",
                    "description": "Es SOLLTEN regelmäßige Sicherheitsaudits der Software-Entwicklungsumgebung und der Software-Testumgebung durchgeführt werden. Dies geschieht in festgelegten Intervallen, z.B. jährlich."
                  },
                  {
                    "statement-id": "CON.8.A18-m5",
                    "uuid": "7fc6fae5-1910-4b93-b4de-b0025b7bde2c",
                    "description": "Die regelmäßigen Sicherheitsaudits werden durch kontinuierliche, automatisierte Compliance-Prüfungen ergänzt. Zusätzlich werden periodisch Penetrationstests der Entwicklungsinfrastruktur von unabhängigen Dritten durchgeführt, um unentdeckte Schwachstellen und Angriffsvektoren aufzudecken."
                  }
                ]
              },
              {
                "uuid": "2738b0ab-97f3-44bd-b4b5-b7f6f67c5924",
                "control-id": "PERF.2.2",
                "description": "Implementation for PERF.2.2 based on BSI DER.3.1.A2",
                "statements": [
                  {
                    "statement-id": "der.3.1.a2-m1",
                    "uuid": "16ef5819-ce52-46d1-a046-aab68343d5ef",
                    "description": "Audits werden mit minimaler Vorbereitung durchgeführt. Prüfgegenstand und -ziele werden oft erst zu Beginn des Audits mündlich mitgeteilt. Betroffenes Personal wird kurzfristig und informell informiert."
                  },
                  {
                    "statement-id": "der.3.1.a2-m2",
                    "uuid": "f59a8568-d0fd-4a05-83b7-6a0bbe23f4d9",
                    "description": "Vor einem Audit wird der Prüfgegenstand grob festgelegt und dem betroffenen Bereich mitgeteilt. Eine formale Festlegung von detaillierten Prüfzielen fehlt jedoch meist. Das Personal wird informiert, eine Benachrichtigung der Personalvertretung erfolgt aber nicht standardmäßig."
                  },
                  {
                    "statement-id": "der.3.1.a2-m3",
                    "uuid": "755bcc01-d070-4ae6-a5cb-abffa9f748c5",
                    "description": "Vor einem Audit oder einer Revision MUSS die Institution den Prüfgegenstand und die Prüfungsziele festlegen. Das betroffene Personal MUSS unterrichtet werden. Abhängig vom Untersuchungsgegenstand MUSS die Personalvertretung über das geplante Audit oder die geplante Revision informiert werden."
                  },
                  {
                    "statement-id": "der.3.1.a2-m4",
                    "uuid": "ece8be76-801a-4ed3-8f9e-970684722dcc",
                    "description": "Der Prozess zur Auditvorbereitung ist in einer Richtlinie formalisiert. Die Prüfziele werden risikobasiert aus dem Auditprogramm abgeleitet. Die Kommunikation an das betroffene Personal und die Personalvertretung erfolgt über standardisierte Vorlagen und mit angemessenen Fristen, die ebenfalls in der Richtlinie definiert sind."
                  },
                  {
                    "statement-id": "der.3.1.a2-m5",
                    "uuid": "4dc8beba-068c-429b-a3c5-9a90eb3b2663",
                    "description": "Die Auditvorbereitung ist ein vollständig digitalisierter und weitgehend automatisierter Prozess. Anhand des ausgewählten Prüfgegenstands werden relevante Dokumente und Ansprechpartner automatisch aus einem CMDB- oder GRC-System zusammengestellt. Die Personalvertretung wird über ein dediziertes Portal informiert und kann dort direkt den geplanten Umfang einsehen und kommentieren."
                  }
                ]
              },
              {
                "uuid": "c5ecc45e-280d-48f9-90da-05ed39865754",
                "control-id": "PERF.2.3",
                "description": "Implementation for PERF.2.3 based on BSI DER.3.2.A1",
                "statements": [
                  {
                    "statement-id": "DER.3.2.A1-m1",
                    "uuid": "3f16faf2-39c2-4034-a593-3d2281427bfe",
                    "description": "Eine Person wurde informell als Ansprechpartner für IS-Revisionen benannt, aber die Verantwortlichkeiten sind weder offiziell dokumentiert noch werden sie konsequent wahrgenommen. Die Planung von Revisionen erfolgt ad hoc und reaktiv."
                  },
                  {
                    "statement-id": "DER.3.2.A1-m2",
                    "uuid": "d287c6e7-9668-4ac7-886e-efad9227a9cf",
                    "description": "Eine verantwortliche Person für die IS-Revision ist offiziell benannt und im Organigramm oder einer Rollenbeschreibung verankert. Die grundlegenden Aufgaben wie Planung und Initiierung sind festgelegt, die Nachverfolgung der Ergebnisse ist jedoch noch nicht systematisch."
                  },
                  {
                    "statement-id": "DER.3.2.A1-m3",
                    "uuid": "1245c3ad-bb57-4d4b-b7f5-46456f6640fc",
                    "description": "Die Institution MUSS eine verantwortliche Person für die IS-Revision benennen. Diese MUSS die IS-Revisionen planen, initiieren und die Ergebnisse nachverfolgen."
                  },
                  {
                    "statement-id": "DER.3.2.A1-m4",
                    "uuid": "afbe2ed3-b423-40c5-95d2-46c4c89ec97f",
                    "description": "Die Rolle des Verantwortlichen für IS-Revision ist in die relevanten Organisationsprozesse (z. B. Change Management) integriert. Die Person erhält regelmäßige Schulungen und verfügt über ein zugewiesenes Budget. Die Nachverfolgung von Feststellungen erfolgt systematisch in einem Ticketsystem."
                  },
                  {
                    "statement-id": "DER.3.2.A1-m5",
                    "uuid": "58ac39d3-56ef-4394-9383-0bf3915d8e4d",
                    "description": "Die Rolle des Verantwortlichen für IS-Revision wird durch ein Team und/oder spezialisierte GRC-Tools (Governance, Risk, Compliance) unterstützt. Die Effektivität des Revisionsprozesses selbst wird anhand von KPIs gemessen, bewertet und kontinuierlich verbessert. Die Planung und das Tracking sind weitgehend automatisiert."
                  }
                ]
              },
              {
                "uuid": "afa80d48-401c-492d-99f6-3193db4b8476",
                "control-id": "PERF.2.4",
                "description": "Implementation for PERF.2.4 based on BSI DER.3.1.A3",
                "statements": [
                  {
                    "statement-id": "der.3.1.a3-m1",
                    "uuid": "5c026247-b744-4a91-9650-5d910dbbd2de",
                    "description": "Audits werden unsystematisch durchgeführt, oft als reine Befragung ohne Dokumentenprüfung oder technische Tests. Die Ergebnisse werden mündlich mitgeteilt und nur selten schriftlich festgehalten."
                  },
                  {
                    "statement-id": "der.3.1.a3-m2",
                    "uuid": "b6623949-f1a8-4a4f-b490-4a5794853db5",
                    "description": "Bei einem Audit wird grundlegend geprüft, ob Anforderungen erfüllt sind, meist durch eine Kombination aus Dokumentenprüfung und Interviews. Es wird darauf geachtet, nicht aktiv in Systeme einzugreifen. Die Ergebnisse werden in einem einfachen Bericht zusammengefasst."
                  },
                  {
                    "statement-id": "der.3.1.a3-m3",
                    "uuid": "9d6d5656-b91c-47c2-b13c-65ce3108703c",
                    "description": "Bei einem Audit MUSS das Auditteam prüfen, ob die Anforderungen aus Richtlinien, Normen, Standards und anderen relevanten Vorgaben erfüllt sind. Das Auditteam MUSS eine Dokumentenprüfung sowie eine Vor-Ort-Prüfung durchführen und dabei sicherstellen, niemals selbst aktiv in Systeme einzugreifen. Sämtliche Ergebnisse MÜSSEN schriftlich dokumentiert und in einem Auditbericht zusammengefasst werden, der zeitnah der zuständigen Stelle übermittelt wird."
                  },
                  {
                    "statement-id": "der.3.1.a3-m4",
                    "uuid": "051222dc-a6b7-4949-9224-472ecfb1389b",
                    "description": "Die Auditdurchführung folgt einem detaillierten, risikobasierten Auditplan. Die Prüfungsmethoden umfassen neben Dokumentenprüfung und Interviews auch technische Verifikationen im „Nur-Lese“-Modus und Systembegehungen. Die Ergebnisse werden systematisch bewertet und mit einer Kritikalität versehen. Der Auditbericht enthält konkrete Handlungsempfehlungen."
                  },
                  {
                    "statement-id": "der.3.1.a3-m5",
                    "uuid": "89570d2e-9201-460f-abea-9e322dae0ecd",
                    "description": "Die Auditdurchführung wird durch Continuous-Auditing-Techniken unterstützt, bei denen Kontrollen automatisiert und kontinuierlich überwacht werden. Die Vor-Ort-Prüfung konzentriert sich auf komplexe Sachverhalte und die Überprüfung der Wirksamkeit der automatisierten Kontrollen. Der Auditbericht wird dynamisch in einem GRC-Tool generiert und ermöglicht eine interaktive Analyse der Ergebnisse."
                  }
                ]
              },
              {
                "uuid": "f9848519-4219-4849-974e-29b46ec17b28",
                "control-id": "PERF.2.5",
                "description": "Implementation for PERF.2.5 based on BSI DER.3.2.A20",
                "statements": [
                  {
                    "statement-id": "DER.3.2.A20-m3",
                    "uuid": "53d47e58-e21d-4d17-8fb0-39830989a643",
                    "description": "Nach der Vor-Ort-Prüfung SOLLTEN die erhobenen Informationen weiter durch das IS-Revisionsteam konsolidiert und ausgewertet werden. Nachdem die eventuell nachgeforderten Dokumente, Dokumentationen und zusätzlichen Informationen ausgewertet wurden, SOLLTEN die geprüften Anforderungen endgültig bewertet werden."
                  }
                ]
              },
              {
                "uuid": "e7dc30e8-5c61-47eb-8b8b-66b4ceecad73",
                "control-id": "PERF.3.11",
                "description": "Implementation for PERF.3.11 based on BSI ISMS.1.A12",
                "statements": [
                  {
                    "statement-id": "isms.1.a12-m1",
                    "uuid": "307d9171-25b9-491f-b0e8-ffa7366bef52",
                    "description": "Das Management wird nur mündlich und unregelmäßig über den Stand der Informationssicherheit informiert, meist nur dann, wenn ein Vorfall eingetreten ist."
                  },
                  {
                    "statement-id": "isms.1.a12-m2",
                    "uuid": "b812f31b-7a32-4535-aeec-3d6614f20148",
                    "description": "Das Management erhält Berichte, diese sind jedoch sehr technisch, listen lediglich operative Details auf und enthalten keine Management-taugliche Zusammenfassung, Risikobewertung oder klare Handlungsempfehlungen."
                  },
                  {
                    "statement-id": "isms.1.a12-m3",
                    "uuid": "411f936f-ce5d-4793-8917-2a0e8bb62619",
                    "description": "Die Institutionsleitung SOLLTE sich regelmäßig über den Stand der Informationssicherheit informieren. Dazu SOLLTEN Management-Berichte geschrieben werden, welche die wesentlichen relevanten Informationen (aktuelle Gefährdungslage, Wirksamkeit und Effizienz des Sicherheitsprozesses, Probleme, Erfolge, Verbesserungsmöglichkeiten) enthalten. Die Berichte SOLLTEN klar priorisierte Maßnahmenvorschläge mit realistischen Abschätzungen zum Umsetzungsaufwand enthalten. Die Management-Berichte und die darauf basierenden Management-Entscheidungen SOLLTEN revisionssicher archiviert werden."
                  },
                  {
                    "statement-id": "isms.1.a12-m4",
                    "uuid": "74ee92a6-fdb7-4b6c-8499-9d0ca888853c",
                    "description": "Die Management-Berichte enthalten aussagekräftige Key Performance Indicators (KPIs) und Key Risk Indicators (KRIs), die im Zeitverlauf dargestellt werden, um Trends zu erkennen. Die Berichte enthalten eine prägnante Management-Zusammenfassung (Executive Summary), die technische Risiken in Geschäftsauswirkungen übersetzt."
                  },
                  {
                    "statement-id": "isms.1.a12-m5",
                    "uuid": "2ca53997-e93c-4817-bd11-0a23cc6544c8",
                    "description": "Das Berichtswesen ist durch ein Management-Dashboard weitgehend automatisiert und bietet der Leitung eine nahezu in Echtzeit aktualisierte Sicht auf die Sicherheitslage. Die Berichte enthalten Benchmarking-Daten, die einen Vergleich mit Branchenkollegen oder anerkannten Standards ermöglichen."
                  }
                ]
              },
              {
                "uuid": "3891e8fb-7cef-472b-b465-06471920fd3c",
                "control-id": "PERS.2.1",
                "description": "Implementation for PERS.2.1 based on BSI ORP.2.A14",
                "statements": [
                  {
                    "statement-id": "orp.2.a14-m1",
                    "uuid": "e413298f-279e-44f4-b47b-2a8c91f4ca49",
                    "description": "Aufgaben und Zuständigkeiten sind nur vage definiert. Mitarbeitende sind sich ihrer spezifischen Verantwortung für die Informationssicherheit nicht bewusst. Regelungen werden nur mündlich und unvollständig kommuniziert."
                  },
                  {
                    "statement-id": "orp.2.a14-m2",
                    "uuid": "e5ff8ed5-b7d5-43d7-8173-61eac99e764d",
                    "description": "Aufgaben und Zuständigkeiten sind in grundlegender Form in Stellenbeschreibungen dokumentiert. Die Mitarbeitenden werden dazu angehalten, interne Regelungen einzuhalten, aber die spezifischen Regelungen und der rechtliche Rahmen sind ihnen nicht immer im Detail bekannt."
                  },
                  {
                    "statement-id": "orp.2.a14-m3",
                    "uuid": "26494a66-364c-45a0-b0c7-928b3150c086",
                    "description": "Alle Mitarbeitenden MÜSSEN dazu verpflichtet werden, geltende Gesetze, Vorschriften und interne Regelungen einzuhalten. Den Mitarbeitenden MUSS der rechtliche Rahmen ihrer Tätigkeit bekannt sein. Die Aufgaben und Zuständigkeiten von Mitarbeitenden MÜSSEN in geeigneter Weise dokumentiert sein. Den Mitarbeitenden MUSS bewusst gemacht werden, die Informationssicherheit der Institution auch außerhalb der Arbeitszeit und des Betriebsgeländes zu schützen."
                  },
                  {
                    "statement-id": "orp.2.a14-m4",
                    "uuid": "fed53b62-7526-4ce6-97f6-28c63cd0814c",
                    "description": "Aufgaben und Zuständigkeiten, insbesondere solche mit Sicherheitsbezug, werden regelmäßig überprüft und bei Bedarf aktualisiert (z.B. jährlich oder bei organisatorischen Änderungen). Allen Mitarbeitenden wird explizit mitgeteilt, dass während der Arbeit erhaltene Informationen ausschließlich zum internen Gebrauch bestimmt sind. Es werden gezielte Sensibilisierungsmaßnahmen durchgeführt, um das Sicherheitsbewusstsein für Tätigkeiten außerhalb des Betriebsgeländes (z.B. im Homeoffice, auf Reisen) zu stärken."
                  },
                  {
                    "statement-id": "orp.2.a14-m5",
                    "uuid": "1c452486-5562-47e8-8637-19e00ae08b13",
                    "description": "Rollen, Aufgaben und Zuständigkeiten sind in einem zentralen Governance, Risk & Compliance (GRC) Tool oder einem HR-System hinterlegt und direkt mit den zugewiesenen Berechtigungen im IAM-System verknüpft (Role-Based Access Control). Jede Änderung einer Rolle löst automatisch eine Überprüfung der Berechtigungen und der notwendigen Schulungen aus. Die Einhaltung der Pflichten wird durch technische Kontrollen und regelmäßige, automatisierte Überprüfungen überwacht."
                  }
                ]
              },
              {
                "uuid": "7f0cb0d5-625d-499f-b883-d1172932f75e",
                "control-id": "PERS.2.2",
                "description": "Implementation for PERS.2.2 based on BSI OPS.1.1.2.A21",
                "statements": [
                  {
                    "statement-id": "OPS.1.1.2.A21-m1",
                    "uuid": "5b7542b2-dc0c-460c-b903-28808a8d5fd4",
                    "description": "Es gibt keine formal definierten Administrationsrollen. Berechtigungen werden ad-hoc und direkt an Benutzerkonten vergeben, oft nach dem Prinzip 'gib ihm mal Admin-Rechte, dann geht's'."
                  },
                  {
                    "statement-id": "OPS.1.1.2.A21-m2",
                    "uuid": "49ac36dd-e754-4506-b41a-8033f5db33d7",
                    "description": "Es gibt einige grob definierte Administrationsrollen (z. B. 'Netzwerk-Admin', 'Server-Admin'). Diese Rollen sind jedoch sehr weitreichend und folgen nicht konsequent dem Minimalprinzip."
                  },
                  {
                    "statement-id": "OPS.1.1.2.A21-m3",
                    "uuid": "da9f581a-3f15-4532-a611-c3311a792c00",
                    "description": "Es MÜSSEN Rollen definiert werden, die ausschließlich zur IT-Administration vergeben werden. Administrationsrollen MÜSSEN aufgrund des tatsächlichen Bedarfs im Aufgabenbereich der IT-Administration nachvollziehbar vergeben werden. Alle notwendigen IT-Administrationstätigkeiten MÜSSEN durch Berechtigungen in den Administrationsrollen nach dem Minimalprinzip abgedeckt sein. Die IT-Administration unterschiedlicher Ebenen der IT-Komponenten, z. B. die Trennung von Betriebssystem- und Anwendungsadministration, MUSS bei der Konzeption der Administrationsrollen berücksichtigt werden."
                  },
                  {
                    "statement-id": "OPS.1.1.2.A21-m4",
                    "uuid": "cc3b0d6d-e5eb-4b76-9ffe-5d189e887620",
                    "description": "Das Rollenkonzept und die zugewiesenen Rollen werden regelmäßig, mindestens einmal jährlich, überprüft (Re-Zertifizierung). Es gibt einen formalen Prozess für die Beantragung, Genehmigung und den Entzug von Rollen, der protokolliert wird."
                  },
                  {
                    "statement-id": "OPS.1.1.2.A21-m5",
                    "uuid": "a6ef464f-94cb-4708-a2bd-44130f913618",
                    "description": "Die Vergabe von administrativen Rollen erfolgt Just-in-Time (JIT) und ist an einen genehmigten Change- oder Incident-Request gebunden. Die Berechtigungen werden nur für die Dauer der Aufgabe gewährt und danach automatisch wieder entzogen. Wo möglich, wird auf Attribute Based Access Control (ABAC) gesetzt."
                  }
                ]
              },
              {
                "uuid": "e69893da-cb29-48b0-97fa-af25315a9b86",
                "control-id": "PERS.2.3",
                "description": "Implementation for PERS.2.3 based on BSI ORP.1.A4",
                "statements": [
                  {
                    "statement-id": "ORP.1.A4-m1",
                    "uuid": "fece7c75-7476-48f8-9b02-fa636638ad0e",
                    "description": "Das Prinzip der Funktionstrennung ist nur in gesetzlich oder regulatorisch explizit geforderten Bereichen, wie der Finanzbuchhaltung (Vier-Augen-Prinzip bei Zahlungen), ansatzweise umgesetzt. In der IT-Administration und -Entwicklung wird das Prinzip nicht systematisch beachtet."
                  },
                  {
                    "statement-id": "ORP.1.A4-m2",
                    "uuid": "213c57b6-680f-4038-b440-ae470acc96de",
                    "description": "Eine grundsätzliche Trennung zwischen Entwicklungs-, Test- und Betriebsteams bzw. -rollen existiert. Allerdings werden Kontrollfunktionen, wie die Freigabe von Änderungen (Changes) oder die Prüfung von Protokolldaten, oft von denselben Personen wahrgenommen, die die operative Tätigkeit ausführen. Stellvertreterregelungen hebeln die Funktionstrennung oft faktisch aus."
                  },
                  {
                    "statement-id": "ORP.1.A4-m3",
                    "uuid": "725f697d-21e5-41b2-a6cb-721036901176",
                    "description": "Die Aufgaben und die hierfür erforderlichen Rollen und Funktionen MÜSSEN so strukturiert sein, dass unvereinbare Aufgaben wie operative und kontrollierende Funktionen auf verschiedene Personen verteilt werden. Für unvereinbare Funktionen MUSS eine Funktionstrennung festgelegt und dokumentiert sein. Auch Vertreter MÜSSEN der Funktionstrennung unterliegen."
                  },
                  {
                    "statement-id": "ORP.1.A4-m4",
                    "uuid": "43668d35-b3f6-482e-a3f2-3676f41ff28f",
                    "description": "Das Konzept zur Funktionstrennung (SoD-Matrix) ist formalisiert und wird bei der Vergabe von Berechtigungen systematisch durch einen definierten Prozess unterstützt. Die Einhaltung der Funktionstrennung wird regelmäßig, mindestens halbjährlich, durch eine manuelle oder teilautomatisierte Analyse der zugewiesenen Berechtigungen überprüft und das Ergebnis wird protokolliert."
                  },
                  {
                    "statement-id": "ORP.1.A4-m5",
                    "uuid": "a1d90143-1e18-492a-b9fd-f8cdd8f18449",
                    "description": "Die Funktionstrennung wird durch technische Systeme (z.B. ein IAM- oder GRC-Tool) präventiv erzwungen. Anträge auf Berechtigungen, die gegen die digital hinterlegte SoD-Matrix verstoßen, werden automatisch blockiert oder einem eskalierten Genehmigungsprozess zugeführt. Regelmäßige, vollautomatisierte Audits prüfen kontinuierlich den Bestand an Berechtigungen auf SoD-Konflikte und melden diese in einem Dashboard."
                  }
                ]
              },
              {
                "uuid": "cfc3e277-c259-4834-b6be-64f8727acb40",
                "control-id": "PERS.3.5",
                "description": "Implementation for PERS.3.5 based on BSI OPS.1.1.6.A7",
                "statements": [
                  {
                    "statement-id": "OPS.1.1.6.A7-m3",
                    "uuid": "8bffff09-d9f5-4c8b-b9ce-975501a58cd5",
                    "description": "Bei der Auswahl der Software-Testenden SOLLTEN gesonderte Auswahlkriterien berücksichtigt werden. Die Software-Testenden SOLLTEN die erforderliche berufliche Qualifikation haben. Wird Individualsoftware auf Quellcode-Ebene überprüft, dann SOLLTEN die Testenden über ausreichendes Fachwissen über die zu testenden Programmiersprache und der Entwicklungsumgebung verfügen. Der Quellcode SOLLTE NICHT ausschließlich von Testenden überprüft werden, die auch an der Erstellung des Quellcodes beteiligt waren."
                  }
                ]
              },
              {
                "uuid": "9d921cdc-b205-443d-bd23-c384f16b0cb1",
                "control-id": "PERS.3.6",
                "description": "Implementation for PERS.3.6 based on BSI ORP.2.A7",
                "statements": [
                  {
                    "statement-id": "orp.2.a7-m1",
                    "uuid": "e223bf9a-829a-43f6-ad1d-864c9fe1f5eb",
                    "description": "Die Vertrauenswürdigkeit von Bewerbern wird nicht systematisch geprüft. Angaben im Lebenslauf werden in der Regel ohne Überprüfung akzeptiert. Eine Prüfung findet höchstens bei begründetem Misstrauen in Einzelfällen statt."
                  },
                  {
                    "statement-id": "orp.2.a7-m2",
                    "uuid": "b2360ad5-8d78-4d20-a51b-6adcedbaac00",
                    "description": "Bewerbungsunterlagen wie Zeugnisse und Zertifikate werden auf Vollständigkeit und offensichtliche Ungereimtheiten geprüft. Eine tiefergehende Verifizierung des Lebenslaufs findet nicht standardmäßig statt."
                  },
                  {
                    "statement-id": "orp.2.a7-m3",
                    "uuid": "1b51b94d-dde2-4c9f-a58c-5889877f7c4b",
                    "description": "Neue Mitarbeitende SOLLTEN auf ihre Vertrauenswürdigkeit hin überprüft werden, bevor sie eingestellt werden. Soweit möglich, SOLLTEN alle an der Personalauswahl Beteiligten kontrollieren, ob die Angaben der Bewerbenden, die relevant für die Einschätzung ihrer Vertrauenswürdigkeit sind, glaubhaft sind. Insbesondere SOLLTE sorgfältig geprüft werden, ob der vorgelegte Lebenslauf korrekt, plausibel und vollständig ist."
                  },
                  {
                    "statement-id": "orp.2.a7-m4",
                    "uuid": "2ccde81c-99b2-42ad-a817-f737594928d8",
                    "description": "Der Prozess zur Überprüfung der Vertrauenswürdigkeit ist risikobasiert. Für Positionen mit erhöhtem Schutzbedarf oder weitreichenden Berechtigungen werden intensivere Prüfungen durchgeführt. Auffällig erscheinende Angaben im Lebenslauf SOLLTEN systematisch überprüft werden, z.B. durch gezielte Nachfragen bei früheren Arbeitgebern oder Bildungseinrichtungen."
                  },
                  {
                    "statement-id": "orp.2.a7-m5",
                    "uuid": "64352ec6-e4d9-4a81-9cf7-b524fce755b1",
                    "description": "Für Positionen mit sehr hohem Risiko wird die Überprüfung der Vertrauenswürdigkeit (Background Screening) standardmäßig von einem spezialisierten, externen Dienstleister durchgeführt, soweit rechtlich zulässig. Die Ergebnisse werden dokumentiert und fließen nachweislich in die Einstellungsentscheidung ein. Der Prozess wird regelmäßig auf seine Wirksamkeit und rechtliche Konformität überprüft."
                  }
                ]
              },
              {
                "uuid": "5fc37941-e30d-41e1-8a54-135376481df2",
                "control-id": "PERS.5.3",
                "description": "Implementation for PERS.5.3 based on BSI ORP.2.A13",
                "statements": [
                  {
                    "statement-id": "orp.2.a13-m1",
                    "uuid": "6fb7f15c-b7bc-4ed8-83d3-d810a25782fa",
                    "description": "Eine Sicherheitsüberprüfung wird nur in absoluten Ausnahmefällen in Erwägung gezogen. Es gibt keinen etablierten Prozess und keine klaren Kriterien, wann eine solche Überprüfung erforderlich ist."
                  },
                  {
                    "statement-id": "orp.2.a13-m2",
                    "uuid": "20d5778c-577f-4bf7-81c4-a840f60717d2",
                    "description": "Die Notwendigkeit von Sicherheitsüberprüfungen für den Umgang mit Verschlusssachen (VS) oder für Tätigkeiten in Hochsicherheitsbereichen ist bekannt. Es werden erste, informelle Prüfungen durchgeführt, die jedoch nicht dem Standard des Sicherheitsüberprüfungsgesetzes (SÜG) entsprechen."
                  },
                  {
                    "statement-id": "orp.2.a13-m3",
                    "uuid": "6faf1ac8-f898-4f0d-9d56-5590c937c41c",
                    "description": "Im Hochsicherheitsbereich SOLLTE eine zusätzliche Sicherheitsüberprüfung zusätzlich zur grundlegenden Überprüfung der Vertrauenswürdigkeit von Mitarbeitenden durchgeführt werden. Es ist definiert, für welche Tätigkeiten oder Informationen eine solche Überprüfung erforderlich ist."
                  },
                  {
                    "statement-id": "orp.2.a13-m4",
                    "uuid": "9abf2631-8825-4489-88d5-b81b1acb1e40",
                    "description": "Arbeiten Mitarbeitende mit nach dem Geheimschutz klassifizierten Verschlusssachen, SOLLTEN sich die entsprechenden Mitarbeitenden einer Sicherheitsüberprüfung nach dem Sicherheitsüberprüfungsgesetz (SÜG) unterziehen. Diesbezüglich SOLLTE der oder die Informationssicherheitsbeauftragte den Geheimschutzbeauftragten bzw. Sicherheitsbevollmächtigten der Institution einbeziehen."
                  },
                  {
                    "statement-id": "orp.2.a13-m5",
                    "uuid": "5ff5dfad-6893-4ac4-8670-2a2daadfbcfc",
                    "description": "Der gesamte Lebenszyklus der Sicherheitsüberprüfungen (Erstüberprüfung, Aktualisierung, Wiederholungsüberprüfung) wird in einem zentralen System verwaltet. Die Ergebnisse der Überprüfung sind direkt mit dem Identity und Access Management verknüpft, sodass Zugriffe auf VS-klassifizierte Informationen nur mit gültiger Überprüfung möglich sind. Es gibt einen definierten Prozess für den Fall, dass eine Sicherheitsüberprüfung negativ ausfällt oder nicht verlängert wird."
                  }
                ]
              },
              {
                "uuid": "8e95d3c2-3ca9-4859-953f-45d795a45fe4",
                "control-id": "REA.1.1",
                "description": "Implementation for REA.1.1 based on BSI DER.2.1.A1",
                "statements": [
                  {
                    "statement-id": "der.2.1-a1-m1",
                    "uuid": "4c6f04fc-2796-4796-85a6-376cab8c6b52",
                    "description": "Nur sehr grundlegende und offensichtliche Sicherheitsvorfälle, wie z.B. eine Ransomware-Infektion, werden als solche erkannt. Eine formale, schriftliche Definition existiert nicht. Die Abgrenzung zu alltäglichen IT-Störungen erfolgt willkürlich."
                  },
                  {
                    "statement-id": "der.2.1-a1-m2",
                    "uuid": "d1e75dcc-d27d-40ab-92d6-b9296b346d40",
                    "description": "Eine grundlegende, schriftliche Definition eines Sicherheitsvorfalls ist vorhanden und dem IT-Team bekannt. Sie grenzt Vorfälle von Störungen ab, berücksichtigt jedoch keine Schutzbedarfs-Abstufungen."
                  },
                  {
                    "statement-id": "der.2.1-a1-m3",
                    "uuid": "087f4461-4094-4f0c-b971-77e3e57f63b6",
                    "description": "In einer Institution MUSS klar definiert sein, was ein Sicherheitsvorfall ist. Ein Sicherheitsvorfall MUSS so weit wie möglich von Störungen im Tagesbetrieb abgegrenzt sein. Alle an der Behandlung von Sicherheitsvorfällen beteiligten Mitarbeitenden MÜSSEN die Definition eines Sicherheitsvorfalls kennen."
                  },
                  {
                    "statement-id": "der.2.1-a1-m4",
                    "uuid": "4b2a2d04-9f66-43c8-9300-6174e78cdcfb",
                    "description": "Die Definition und die Eintrittsschwellen für Sicherheitsvorfälle richten sich nach dem Schutzbedarf der betroffenen Geschäftsprozesse, IT-Systeme bzw. Anwendungen. Die Definition wird regelmäßig überprüft und bei Bedarf angepasst."
                  },
                  {
                    "statement-id": "der.2.1-a1-m5",
                    "uuid": "fd6edd26-3375-48f7-a4de-84d66ab67eea",
                    "description": "Die Definition von Sicherheitsvorfällen ist dynamisch und wird kontinuierlich auf Basis von Threat-Intelligence-Feeds, Ergebnissen aus Red-Team-Übungen und vergangenen Vorfällen weiterentwickelt. Die Definition ist direkt in automatisierte Erkennungs- und Reaktionsmechanismen (SOAR) integriert, um eine kontextbezogene und schnelle Reaktion zu ermöglichen."
                  }
                ]
              },
              {
                "uuid": "8767633a-8a17-4b40-b31f-68930ba6bfba",
                "control-id": "REA.1.3",
                "description": "Implementation for REA.1.3 based on BSI DER.2.2.A15",
                "statements": [
                  {
                    "statement-id": "der.2.2.a15-m3",
                    "uuid": "d14f9e45-37a5-40e7-a0e3-e0c8f88adfa5",
                    "description": "Die Mitarbeiter werden geschult (wie in A6 beschrieben), aber das erlernte Wissen wird nicht praktisch geübt. Forensische Sicherungen werden nur im Ernstfall durchgeführt."
                  },
                  {
                    "statement-id": "der.2.2.a15-m4",
                    "uuid": "b9f7515d-5574-4fd1-b069-d0fa69faed9d",
                    "description": "Alle an forensischen Analysen beteiligten Mitarbeitenden SOLLTEN regelmäßig, mindestens einmal pro Jahr, in Form von Übungen trainieren, wie Beweise bei einem IT-Sicherheitsvorfall zu sichern sind. Die Übungen umfassen das Sichern von Beweismitteln auf Testsystemen."
                  },
                  {
                    "statement-id": "der.2.2.a15-m5",
                    "uuid": "802510ca-e882-4197-832d-3e705d611df0",
                    "description": "Die Übungen zur Beweissicherung sind in komplexe, realitätsnahe Szenarien wie Red/Blue-Team-Übungen oder Purple-Teaming-Aktivitäten integriert. Die Übungen testen nicht nur die technischen Fähigkeiten, sondern auch die Zusammenarbeit mit anderen Teams (Krisenstab, IT-Betrieb) und externen Dienstleistern unter Zeitdruck. Die Erkenntnisse fließen direkt in die Verbesserung der Prozesse und Werkzeuge ein."
                  }
                ]
              },
              {
                "uuid": "39c17ef7-195f-4806-8b5b-04279730b761",
                "control-id": "REA.2.2",
                "description": "Implementation for REA.2.2 based on BSI DER.1.A17",
                "statements": [
                  {
                    "statement-id": "der.1.a17-m2",
                    "uuid": "d891fa62-ae32-4612-9374-aa972ae1956b",
                    "description": "Die Detektionssysteme können Alarme generieren und Benachrichtigungen versenden. Alle darauf folgenden Reaktionen, wie das Blockieren einer IP-Adresse, müssen jedoch manuell von einem Administrator durchgeführt werden."
                  },
                  {
                    "statement-id": "der.1.a17-m3",
                    "uuid": "f171b732-7932-4ec4-9c6a-be3ff5382f2f",
                    "description": "Bei einem sicherheitsrelevanten Ereignis SOLLTEN die eingesetzten Detektionssysteme das Ereignis automatisch melden und mit geeigneten Schutzmaßnahmen reagieren. Hierbei SOLLTEN Verfahren eingesetzt werden, die automatisch mögliche Angriffe, Missbrauchsversuche oder Sicherheitsverletzungen erkennen. Es SOLLTE möglich sein, automatisch in den Datenstrom einzugreifen, um einen möglichen Sicherheitsvorfall zu unterbinden."
                  },
                  {
                    "statement-id": "der.1.a17-m4",
                    "uuid": "b1ac3e46-1b2e-43b1-8ffb-98acf23fe108",
                    "description": "Eine SOAR-Plattform (Security Orchestration, Automation, and Response) wird eingesetzt, um vordefinierte, aber komplexere Reaktions-Playbooks auszuführen. Diese können Aktionen über mehrere verschiedene Sicherheitstools hinweg koordinieren, wie z.B. die Isolierung eines Endpunkts vom Netzwerk und die Deaktivierung des Benutzerkontos."
                  },
                  {
                    "statement-id": "der.1.a17-m5",
                    "uuid": "0c654b6a-1c87-4bb8-8f7e-3fcfa6e80449",
                    "description": "Die automatische Reaktion ist dynamisch und kontextsensitiv. KI-gestützte Systeme entscheiden auf Basis einer Risikoanalyse in Echtzeit über die bestmögliche Reaktion. Dabei werden die Art des Angriffs, die Kritikalität des betroffenen Systems und die potenziellen Auswirkungen der Gegenmaßnahme auf den Geschäftsbetrieb berücksichtigt, um eine verhältnismäßige Reaktion sicherzustellen."
                  }
                ]
              },
              {
                "uuid": "759c0d82-7802-4366-8425-1542d467c954",
                "control-id": "REA.2.3",
                "description": "Implementation for REA.2.3 based on BSI DER.2.2.A11",
                "statements": [
                  {
                    "statement-id": "der.2.2.a11-m1",
                    "uuid": "19fda7e6-9b02-4b0b-9478-0cde7c44fab1",
                    "description": "Die Beweissicherung wird gar nicht oder nur in Form von informellen Notizen dokumentiert. Eine lückenlose Beweismittelkette (Chain of Custody) kann nicht nachgewiesen werden."
                  },
                  {
                    "statement-id": "der.2.2.a11-m2",
                    "uuid": "638936ab-f080-4eb4-879c-428b331d7d99",
                    "description": "Es wird ein einfaches Protokoll über die Sicherung geführt, das jedoch oft unvollständig ist. Wichtige Informationen wie die verwendeten Werkzeuge oder genaue Zeitpunkte fehlen teilweise."
                  },
                  {
                    "statement-id": "der.2.2.a11-m3",
                    "uuid": "ec4c0a82-45c1-4eb0-9704-f7d62860e773",
                    "description": "Wenn Beweise forensisch gesichert werden, SOLLTEN alle durchgeführten Schritte dokumentiert werden. Die Dokumentation SOLLTE lückenlos nachweisen, wie mit den gesicherten Originalbeweismitteln umgegangen wurde. Auch SOLLTE dokumentiert werden, welche Methoden eingesetzt wurden und warum sich die Verantwortlichen dafür entschieden haben."
                  },
                  {
                    "statement-id": "der.2.2.a11-m4",
                    "uuid": "c59d9edc-8d78-4398-b431-cb9c75986c77",
                    "description": "Die Dokumentation der Beweissicherung wird durch Fotos ergänzt. Es werden Fotos vom Zustand des Systems vor der Sicherung, von den verwendeten Anschlüssen und Werkzeugen sowie vom versiegelten Beweismittel gemacht. Die Dokumentation wird von einem zweiten Mitarbeiter gegengelesen und abgezeichnet."
                  },
                  {
                    "statement-id": "der.2.2.a11-m5",
                    "uuid": "4bfab0f0-04b8-427b-be22-2bb4ca2f69a4",
                    "description": "Die Dokumentation erfolgt digital und automatisiert über ein forensisches Fallmanagement- oder Chain-of-Custody-Tool. Jeder Zugriff und jede Handlung in Bezug auf ein Beweismittel wird automatisch mit Benutzer und Zeitstempel protokolliert. Die finalen Berichte werden digital signiert und revisionssicher archiviert."
                  }
                ]
              },
              {
                "uuid": "00f6e3ed-9015-436f-a7ed-06d956827bb8",
                "control-id": "REA.2.4",
                "description": "Implementation for REA.2.4 based on BSI DER.2.2.A9",
                "statements": [
                  {
                    "statement-id": "der.2.2.a9-m1",
                    "uuid": "4f7d38bc-2304-45bd-8c6a-b4bf505cd92c",
                    "description": "Sekundäre Daten wie Logdaten werden nur mit Standardeinstellungen und kurzen Aufbewahrungsfristen vorgehalten. Eine bewusste Entscheidung, welche Daten für Forensik relevant sein könnten, findet nicht statt."
                  },
                  {
                    "statement-id": "der.2.2.a9-m2",
                    "uuid": "0c46d49e-e0f0-4d84-a0c7-a6ccf0218538",
                    "description": "Logdaten von zentralen Systemen (z.B. Firewalls, Domain Controller) werden gesammelt, aber es gibt kein übergreifendes Konzept, welche Datenquellen für forensische Zwecke relevant sind. Die Aufbewahrungsfristen werden pauschal festgelegt, ohne Berücksichtigung rechtlicher Anforderungen."
                  },
                  {
                    "statement-id": "der.2.2.a9-m3",
                    "uuid": "ffd1c8b4-5d72-46a3-a10c-e937fc8e4e05",
                    "description": "Es SOLLTE festgelegt werden, welche sekundären Daten (z. B. Logdaten oder Verkehrsmitschnitte) auf welche Weise und wie lange im Rahmen der rechtlichen Rahmenbedingungen für mögliche forensische Beweissicherungsmaßnahmen vorgehalten werden."
                  },
                  {
                    "statement-id": "der.2.2.a9-m4",
                    "uuid": "7a7415aa-20ed-426a-a710-0356d16c9d6d",
                    "description": "Das Logging-Konzept wird um detaillierte Konfigurationsvorgaben für die wichtigsten Systemtypen erweitert, um sicherzustellen, dass forensisch wertvolle Ereignisse (z.B. Prozess-Erstellung, PowerShell-Befehle, Registry-Änderungen) auch tatsächlich protokolliert werden. Die Integrität der Logdaten wird durch Weiterleitung an ein zentrales, schreibgeschütztes SIEM-System sichergestellt."
                  },
                  {
                    "statement-id": "der.2.2.a9-m5",
                    "uuid": "1054afad-7114-4e53-a279-df6cb624b7f9",
                    "description": "Die Auswahl und Aufbewahrung forensisch relevanter Daten wird dynamisch an die Bedrohungslage angepasst. Zusätzlich zum zentralen Logging werden auf kritischen Endpunkten EDR-Systeme (Endpoint Detection and Response) eingesetzt, die eine tiefgehende, kontinuierliche Aufzeichnung von Systemaktivitäten ermöglichen und eine historische Analyse ('Threat Hunting') auch ohne vorherige Log-Konfiguration erlauben."
                  }
                ]
              },
              {
                "uuid": "b792666d-7dcc-4be8-94fd-1c6d0362cdd2",
                "control-id": "REA.2.5",
                "description": "Implementation for REA.2.5 based on BSI DER.2.2.A5",
                "statements": [
                  {
                    "statement-id": "der.2.2.a5-m1",
                    "uuid": "db89c50e-6317-45ef-96c7-4d68040d0335",
                    "description": "Es gibt keinen Leitfaden für die Beweissicherung. Die Durchführung erfolgt ad hoc und basiert auf dem individuellen Kenntnisstand der beteiligten Personen."
                  },
                  {
                    "statement-id": "der.2.2.a5-m2",
                    "uuid": "2468ea86-c5ca-4932-847d-6607da8433f5",
                    "description": "Es existiert eine grundlegende Beschreibung der Vorgehensweise zur Beweissicherung, beispielsweise für die Erstellung eines Festplatten-Images. Spezifische Werkzeuge, rechtliche Aspekte oder Dokumentationspflichten sind jedoch nicht detailliert beschrieben."
                  },
                  {
                    "statement-id": "der.2.2.a5-m3",
                    "uuid": "6a0649db-f80c-4172-aa3f-298160dfefc1",
                    "description": "Es SOLLTE ein Leitfaden erstellt werden, in dem beschrieben wird, wie Beweise gesichert werden sollen. Darin SOLLTEN Vorgehensweisen, technische Werkzeuge, rechtliche Rahmenbedingungen und Dokumentationsvorgaben aufgeführt werden."
                  },
                  {
                    "statement-id": "der.2.2.a5-m4",
                    "uuid": "9307a95e-1529-41cd-96e9-a3dc10a14644",
                    "description": "Der Leitfaden wird um spezifische, detaillierte Anleitungen (Standard Operating Procedures - SOPs) für die Sicherung verschiedener Systemtypen (z.B. Windows, Linux, macOS, mobile Geräte, Cloud-Umgebungen) und Datenquellen (RAM, Festplatten, Logs, Netzwerkverkehr) erweitert. Die SOPs werden regelmäßig überprüft und aktualisiert."
                  },
                  {
                    "statement-id": "der.2.2.a5-m5",
                    "uuid": "cc1c91dc-3e8f-4adc-9cb0-6c31d4adfddd",
                    "description": "Die im Leitfaden beschriebenen Vorgehensweisen sind weitestgehend automatisiert. Skripte und forensische Werkzeuge sind auf einem dedizierten Forensik-System vorkonfiguriert, um eine schnelle, konsistente und fehlerfreie Beweissicherung zu gewährleisten. Die Auswahl des richtigen Verfahrens wird durch ein Expertensystem oder ein SOAR-Playbook unterstützt."
                  }
                ]
              },
              {
                "uuid": "7b6dd1ed-b6f4-4de6-9820-e0e64395f55f",
                "control-id": "REA.2.6",
                "description": "Implementation for REA.2.6 based on BSI DER.2.1.A5",
                "statements": [
                  {
                    "statement-id": "der.2.1-a5-m1",
                    "uuid": "be7e5252-698c-4c8b-bd23-d5402cccb40e",
                    "description": "Die Behebung erfolgt reaktiv und konzentriert sich auf die schnellstmögliche Wiederherstellung des Betriebs, oft ohne die eigentliche Ursache zu finden oder zu beseitigen. Die Maßnahmen sind nicht dokumentiert."
                  },
                  {
                    "statement-id": "der.2.1-a5-m2",
                    "uuid": "fa22dad4-93e2-4dee-9483-572d01347997",
                    "description": "Für häufig auftretende, einfache Sicherheitsvorfälle (z.B. Virenfund) existieren Standardanweisungen zur Behebung. Bei komplexeren Vorfällen erfolgt die Behebung ad-hoc. Eine Liste mit Kontaktdaten von externen Experten ist vorhanden."
                  },
                  {
                    "statement-id": "der.2.1-a5-m3",
                    "uuid": "0970a1ff-3c53-4a66-baa1-820c152e44fd",
                    "description": "Damit ein Sicherheitsvorfall erfolgreich behoben werden kann, MÜSSEN die Zuständigen zunächst das Problem eingrenzen und die Ursache finden. Danach MÜSSEN die erforderlichen Maßnahmen ausgewählt werden, um das Problem zu beheben. Die Leitung des IT-Betriebs MUSS eine Freigabe erteilen, bevor die Maßnahmen umgesetzt werden. Anschließend MUSS die Ursache beseitigt und ein sicherer Zustand hergestellt werden. Eine aktuelle Liste von internen und externen Sicherheitsfachleuten MUSS vorhanden sein und es MÜSSEN sichere Kommunikationsverfahren etabliert werden."
                  },
                  {
                    "statement-id": "der.2.1-a5-m4",
                    "uuid": "6a1a103a-f1a2-41fe-a57c-86e807daa8e0",
                    "description": "Für verschiedene Kategorien von Sicherheitsvorfällen existieren detaillierte Behebungspläne (Playbooks). Die Wirksamkeit der Behebungsmaßnahmen wird vor Abschluss des Vorfalls systematisch verifiziert. Es bestehen Rahmenverträge mit externen Sicherheitsdienstleistern."
                  },
                  {
                    "statement-id": "der.2.1-a5-m5",
                    "uuid": "0c4e0b3f-0f45-4dc0-9272-3b0fdc53f6dc",
                    "description": "Viele Behebungsmaßnahmen sind durch den Einsatz einer SOAR-Plattform automatisiert. Die Ursachenanalyse wird durch fortschrittliche Analysemethoden und maschinelles Lernen unterstützt. Im Anschluss an die Behebung eines Vorfalls wird proaktiv nach ähnlichen Schwachstellen in der gesamten Infrastruktur gesucht (Threat Hunting), um zukünftige Vorfälle zu verhindern."
                  }
                ]
              },
              {
                "uuid": "0b8d560d-63f7-401e-a76d-d3082e53e135",
                "control-id": "SENS.1.1",
                "description": "Implementation for SENS.1.1 based on BSI ISMS.1.A8",
                "statements": [
                  {
                    "statement-id": "isms.1.a8-m1",
                    "uuid": "c1467d45-c9f2-426a-b531-8706f0a747dc",
                    "description": "Die Mitarbeitenden werden bei der Einstellung einmalig über die wichtigsten Sicherheitsregeln (z.B. Passwortrichtlinie) informiert. Danach finden keine weiteren Sensibilisierungs- oder Schulungsmaßnahmen statt."
                  },
                  {
                    "statement-id": "isms.1.a8-m2",
                    "uuid": "45007285-18ba-40d0-94de-850b62ac39d0",
                    "description": "Es finden jährliche, allgemeine Sicherheitsschulungen für alle Mitarbeitenden statt. Diese sind jedoch nicht auf spezifische Rollen, Aufgaben oder aktuelle Bedrohungen zugeschnitten."
                  },
                  {
                    "statement-id": "isms.1.a8-m3",
                    "uuid": "720fc991-ca64-40c0-892d-2499789037b6",
                    "description": "Alle Mitarbeitenden MÜSSEN in den Sicherheitsprozess integriert sein. Hierfür MÜSSEN sie über Hintergründe und die für sie relevanten Gefährdungen informiert sein. Sie MÜSSEN Sicherheitsmaßnahmen kennen und umsetzen, die ihren Arbeitsplatz betreffen. Bei der Einführung von Sicherheitsrichtlinien und Sicherheitswerkzeugen MÜSSEN die Mitarbeitenden ausreichend informiert sein, wie diese anzuwenden sind. Die Mitarbeitenden MÜSSEN darüber aufgeklärt werden, welche Konsequenzen eine Verletzung der Sicherheitsvorgaben haben kann."
                  },
                  {
                    "statement-id": "isms.1.a8-m4",
                    "uuid": "2bc47460-1a39-48eb-8f84-fc8e3231929b",
                    "description": "Alle Mitarbeitenden SOLLTEN in die Lage versetzt werden, Sicherheit aktiv mitzugestalten. Daher SOLLTEN die Mitarbeitenden frühzeitig beteiligt werden, wenn Sicherheitsmaßnahmen zu planen oder organisatorische Regelungen zu gestalten sind. Das Awareness-Programm ist zielgruppenspezifisch und behandelt aktuelle Bedrohungen."
                  },
                  {
                    "statement-id": "isms.1.a8-m5",
                    "uuid": "104f0e35-9529-4645-8d8c-28f2d7e85651",
                    "description": "Ein kontinuierliches Programm zur Förderung einer positiven Sicherheitskultur ist etabliert. Dieses Programm nutzt Gamification, regelmäßige Phishing-Simulationen mit direktem Feedback und belohnt proaktives Sicherheitsverhalten. Die Wirksamkeit des Programms wird durch Metriken gemessen und kontinuierlich verbessert."
                  }
                ]
              },
              {
                "uuid": "07801cf2-26ed-49c4-aba2-c1fc28ede573",
                "control-id": "SENS.1.2",
                "description": "Implementation for SENS.1.2 based on BSI ORP.3.A8",
                "statements": [
                  {
                    "statement-id": "orp.3-a8-m1",
                    "uuid": "1aaf532c-265e-416f-8ffc-c6b4f8023eec",
                    "description": "Der Erfolg von Schulungsmaßnahmen wird ausschließlich anhand quantitativer Teilnahmezahlen gemessen. Es wird nicht überprüft, ob die Inhalte verstanden wurden oder zu einer Verhaltensänderung führen."
                  },
                  {
                    "statement-id": "orp.3-a8-m2",
                    "uuid": "617bbda7-061f-4225-a54a-b64706ced959",
                    "description": "Am Ende von E-Learning-Modulen werden einfache Verständnistests (Quiz) durchgeführt, um den unmittelbaren Wissenserwerb zu überprüfen. Die Ergebnisse werden gesammelt, aber nicht systematisch ausgewertet, um das Programm zu verbessern."
                  },
                  {
                    "statement-id": "orp.3-a8-m3",
                    "uuid": "5fc86a14-da42-48a1-9f36-0c6ff7355d77",
                    "description": "Die Lernerfolge SOLLTEN zielgruppenbezogen gemessen und ausgewertet werden, um festzustellen, inwieweit die beschriebenen Ziele erreicht sind. Die Messungen SOLLTEN sowohl quantitative (Teilnahme) als auch qualitative (Verständnis, Verhaltensänderung) Aspekte berücksichtigen. Die Ergebnisse SOLLTEN bei der Verbesserung des Schulungsangebots einfließen."
                  },
                  {
                    "statement-id": "orp.3-a8-m4",
                    "uuid": "b9f1d3c1-8f1f-4105-bfd5-2c8e7e57819f",
                    "description": "Zur Messung des Lernerfolgs und der Verhaltensänderung werden fortgeschrittene Methoden wie Phishing-Simulationen eingesetzt. Die Ergebnisse (z.B. Klickrate, Melderate) werden systematisch erfasst und analysiert. Auch andere Datenquellen, wie Helpdesk-Anfragen oder Audit-Feststellungen, werden zur Bewertung der Programmwirksamkeit herangezogen."
                  },
                  {
                    "statement-id": "orp.3-a8-m5",
                    "uuid": "1c4c2900-2d61-469b-9443-1cb78cd4b6a3",
                    "description": "Es ist ein umfassendes Metrik-Framework implementiert, das die Wirksamkeit des Sensibilisierungsprogramms kontinuierlich misst und mit realen Sicherheitsvorfällen korreliert. Die Analyse der Daten erfolgt teilweise automatisiert, um Risikogruppen zu identifizieren und den Feedback-Loop zur Programmverbesserung zu beschleunigen. A/B-Tests werden eingesetzt, um die Wirksamkeit verschiedener Kampagnen zu optimieren."
                  }
                ]
              },
              {
                "uuid": "40fea14c-052c-4cf3-acf7-8992855e9542",
                "control-id": "STM.8.1",
                "description": "Implementation for STM.8.1 based on BSI CON.8.A21",
                "statements": [
                  {
                    "statement-id": "CON.8.A21-m1",
                    "uuid": "7513999b-1293-4e2a-9632-a838c255b8ff",
                    "description": "Bedrohungen werden nicht systematisch analysiert. Sicherheitsmaßnahmen werden reaktiv implementiert, nachdem eine Schwachstelle ausgenutzt wurde oder ein Sicherheitsproblem bekannt wird."
                  },
                  {
                    "statement-id": "CON.8.A21-m2",
                    "uuid": "02a8325d-14d2-466f-abe3-59f72ccf8e1f",
                    "description": "Für neue, größere Projekte wird eine informelle Risikoanalyse in Form eines Brainstormings durchgeführt. Die Ergebnisse werden in einer einfachen Liste festgehalten, aber nicht systematisch bewertet oder nachverfolgt."
                  },
                  {
                    "statement-id": "CON.8.A21-m3",
                    "uuid": "8f6b3cdb-6836-45ae-9543-878b974dc1a4",
                    "description": "In der Entwurfsphase der Software-Entwicklung SOLLTE eine Bedrohungsmodellierung durchgeführt werden. Hierzu SOLLTEN auf Basis des Sicherheitsprofils, des Anforderungskatalogs und der geplanten Einsatzumgebung bzw. Einsatzszenarios potentielle Bedrohungen identifiziert werden. Die Bedrohungen SOLLTEN hinsichtlich ihrer Eintrittswahrscheinlichkeit und Auswirkung bewertet werden."
                  },
                  {
                    "statement-id": "CON.8.A21-m4",
                    "uuid": "99de1fbd-b160-46d0-9313-09f6bf573db6",
                    "description": "Die Bedrohungsmodellierung ist ein fester, wiederholbarer Prozess für alle neuen Features oder wesentlichen Änderungen, nicht nur für neue Projekte. Die Ergebnisse der Modellierung werden in einem Werkzeug erfasst und verwaltet, das die Nachverfolgung von Bedrohungen und Gegenmaßnahmen erleichtert."
                  },
                  {
                    "statement-id": "CON.8.A21-m5",
                    "uuid": "59f6e4cf-1c07-46a8-9697-5860dd3d6f19",
                    "description": "Die Bedrohungsmodellierung wird teilweise automatisiert, indem Architekturdiagramme (z.B. aus 'Infrastructure as Code'-Beschreibungen) automatisch analysiert und mit bekannten Bedrohungsmustern abgeglichen werden. Die Ergebnisse der Bedrohungsmodellierung werden genutzt, um automatisch Testfälle für die Sicherheitstests (z.B. für Penetrationstests) zu generieren."
                  }
                ]
              },
              {
                "uuid": "9cc62d49-7423-47f1-8161-ae031d92417b",
                "control-id": "STM.8.2",
                "description": "Implementation for STM.8.2 based on BSI ISMS.1.A17",
                "statements": [
                  {
                    "statement-id": "isms.1.a17-m1",
                    "uuid": "5500916d-de7b-4529-ab1d-ec5b4ef91cd1",
                    "description": "Das Thema Cyber-Versicherung wurde intern diskutiert, es wurden jedoch keine konkreten Schritte unternommen, um Angebote einzuholen oder eine Police abzuschließen."
                  },
                  {
                    "statement-id": "isms.1.a17-m2",
                    "uuid": "962e73c1-6a55-4f91-b86e-8087ce61328b",
                    "description": "Eine allgemeine Betriebshaftpflichtversicherung ist vorhanden. Es ist jedoch unklar oder nicht geprüft worden, inwieweit diese Versicherung auch Schäden durch Cyber-Vorfälle abdeckt. Eine dedizierte Cyber-Versicherung existiert nicht."
                  },
                  {
                    "statement-id": "isms.1.a17-m3",
                    "uuid": "99c2d4b0-6c03-453f-a7b5-b5cda6777070",
                    "description": "Es SOLLTE geprüft werden, ob für Restrisiken Versicherungen abgeschlossen werden können. Es SOLLTE regelmäßig überprüft werden, ob die bestehenden Versicherungen der aktuellen Lage entsprechen. Dieser Prozess wird dokumentiert."
                  },
                  {
                    "statement-id": "isms.1.a17-m4",
                    "uuid": "7d73a0ee-78a7-4c96-9d66-cc529c76a705",
                    "description": "Eine dedizierte Cyber-Versicherung wurde abgeschlossen. Die Deckungssummen, Ausschlüsse und insbesondere die Obliegenheiten (Anforderungen an das Sicherheitsniveau der Institution) der Police wurden vor Abschluss sorgfältig von Sicherheits- und Rechtsexperten geprüft."
                  },
                  {
                    "statement-id": "isms.1.a17-m5",
                    "uuid": "1f78a7ef-7df1-4404-8b08-55d218200e37",
                    "description": "Die Cyber-Versicherung ist ein integraler Bestandteil des Notfallmanagements. Der Prozess zur Meldung eines Schadens an den Versicherer ist im Incident-Response-Plan detailliert beschrieben und wurde getestet. Es findet ein kontinuierlicher Dialog mit dem Versicherer statt, um sicherzustellen, dass das Sicherheitsniveau den Anforderungen entspricht und um potenziell die Prämien zu optimieren."
                  }
                ]
              },
              {
                "uuid": "95524f38-424a-4302-a46b-b187ff285bc1",
                "control-id": "TEST.1.1",
                "description": "Implementation for TEST.1.1 based on BSI ORP.1.A13",
                "statements": [
                  {
                    "statement-id": "ORP.1.A13-m1",
                    "uuid": "74b2d8ca-24a4-42bb-95e0-29033dcdae21",
                    "description": "Der Umzug wird primär logistisch geplant (z.B. Beauftragung einer Spedition, Kartons bestellen). Spezifische Risiken der Informationssicherheit, wie der Schutz von Datenträgern während des Transports oder die Zutrittskontrolle an den alten und neuen Standorten während der Umzugsphase, werden nicht systematisch berücksichtigt."
                  },
                  {
                    "statement-id": "ORP.1.A13-m2",
                    "uuid": "ccf94706-f05b-490f-96c4-e17af485c09c",
                    "description": "Eine grundlegende Checkliste für den IT-Umzug existiert. Sie deckt hauptsächlich technische Aspekte wie die Sicherung von Konfigurationen und Daten vor dem Abbau ab. Die physische Sicherheit während des Transports wird nur am Rande behandelt. Eine Vollständigkeitsprüfung nach dem Umzug erfolgt nur oberflächlich durch Sichtprüfung."
                  },
                  {
                    "statement-id": "ORP.1.A13-m3",
                    "uuid": "fc7bdc4c-91a4-4447-ba90-4faa87cb7de3",
                    "description": "Vor einem Umzug SOLLTEN frühzeitig Sicherheitsrichtlinien erarbeitet bzw. aktualisiert werden. Alle Mitarbeitenden SOLLTEN über die vor, während und nach dem Umzug relevanten Sicherheitsmaßnahmen informiert werden. Nach dem Umzug SOLLTE überprüft werden, ob das transportierte Umzugsgut vollständig und unbeschädigt bzw. unverändert angekommen ist."
                  },
                  {
                    "statement-id": "ORP.1.A13-m4",
                    "uuid": "54eb55ec-05e3-409d-9c27-287b5713ce8a",
                    "description": "Ein detaillierter Umzugs- und Sicherheitsplan wird erstellt, der spezifische Schutzmaßnahmen für unterschiedliche Asset-Klassen definiert (z.B. versiegelte und plombierte Transportbehälter für Server, nur verschlüsselte Laptops im Transport). Externe Umzugsfirmen werden vertraglich zur Einhaltung der Sicherheitsrichtlinien verpflichtet und deren Personal wird einer Zuverlässigkeitsüberprüfung unterzogen. Der Umzug wird von internem Sicherheitspersonal begleitet."
                  },
                  {
                    "statement-id": "ORP.1.A13-m5",
                    "uuid": "590a58a8-d2ae-4ad2-9bab-e5e542a3e09b",
                    "description": "Der gesamte Umzug kritischer Assets wird lückenlos durch Sicherheitspersonal und technische Mittel überwacht. Die Transportfahrzeuge und kritische Behälter werden mit GPS-Trackern ausgestattet, deren Position in Echtzeit verfolgt wird. Am neuen Standort wird eine vollständige Neu-Inventarisierung und eine technische Funktions- und Integritätsprüfung aller IT-Systeme durchgeführt, bevor diese wieder in den Produktivbetrieb gehen. Der Umzug wird durch ein unabhängiges externes Audit begleitet."
                  }
                ]
              },
              {
                "uuid": "ab8ff4e3-f172-4461-a832-983970cda9bb",
                "control-id": "TEST.2.1",
                "description": "Implementation for TEST.2.1 based on BSI CON.8.A10",
                "statements": [
                  {
                    "statement-id": "CON.8.A10-m1",
                    "uuid": "b5e27490-4a5f-49f3-add5-56ee7e0917aa",
                    "description": "Quellcode wird lokal auf den Rechnern der Entwickler oder in geteilten Netzwerkordnern gespeichert. Eine systematische Versionsverwaltung findet nicht statt. Änderungen werden durch das manuelle Kopieren von Dateien und das Umbenennen von Ordnern (z.B. `projekt_final_final2.zip`) verwaltet."
                  },
                  {
                    "statement-id": "CON.8.A10-m2",
                    "uuid": "d056e620-820c-4c09-af5b-32d01fae3bd8",
                    "description": "Ein Versionsverwaltungssystem (z.B. Git, SVN) wird zur Speicherung des Quellcodes verwendet. Es gibt jedoch keine klaren Regeln für die Nutzung, wie z.B. Branching-Strategien oder Commit-Nachrichten. Der Zugriff auf das Repository ist nicht oder nur unzureichend geregelt."
                  },
                  {
                    "statement-id": "CON.8.A10-m3",
                    "uuid": "392f6533-8e63-418b-ab57-512de38458f8",
                    "description": "Der Quellcode des Entwicklungsprojekts MUSS über eine geeignete Versionsverwaltung verwaltet werden. Die Institution MUSS den Zugriff auf die Versionsverwaltung regeln und festlegen, wann Änderungen am Quellcode durch die Entwickelnden als eigene Version in der Versionsverwaltung gespeichert werden sollen. Es MUSS sichergestellt sein, dass durch die Versionsverwaltung alle Änderungen am Quellcode nachvollzogen und rückgängig gemacht werden können. Die Versionsverwaltung MUSS in dem Datensicherungskonzept berücksichtigt werden. Die Versionsverwaltung DARF NICHT ohne Datensicherung erfolgen."
                  },
                  {
                    "statement-id": "CON.8.A10-m4",
                    "uuid": "ad5699f7-bca0-45fe-bd61-d95709e768ff",
                    "description": "Änderungen am Haupt-Branch (Produktiv-Branch) sind geschützt und können nur über Pull- oder Merge-Requests mit verpflichtendem Review (Vier-Augen-Prinzip) durchgeführt werden. Wichtige Branches sind vor versehentlichem Löschen oder 'force-pushes' geschützt."
                  },
                  {
                    "statement-id": "CON.8.A10-m5",
                    "uuid": "f726aa99-bc20-44aa-aea8-9ef4025a3922",
                    "description": "Der Review-Prozess für Pull-Requests wird durch automatisierte Prüfungen (Status-Checks) angereichert. Ein Merge ist erst möglich, wenn alle Status-Checks erfolgreich sind, z.B. der Build fehlerfrei durchläuft, alle Tests erfolgreich sind, die Testabdeckung einem Mindestmaß entspricht und ein Sicherheitsscan keine kritischen Befunde liefert. Commits müssen digital signiert sein, um die Urheberschaft zweifelsfrei nachzuweisen."
                  }
                ]
              },
              {
                "uuid": "848955d8-a6b1-43cd-9aeb-d098f4485b86",
                "control-id": "TEST.3.1",
                "description": "Implementation for TEST.3.1 based on BSI CON.1.A11",
                "statements": [
                  {
                    "statement-id": "con.1.a11-m1",
                    "uuid": "2a02ffa7-2363-43af-9bb8-ed0dc5b80696",
                    "description": "Kryptografische Hardware wird ohne spezifische Funktionstests ihrer kryptografischen Fähigkeiten in Betrieb genommen. Es wird davon ausgegangen, dass die Hardware 'out of the box' wie vom Hersteller beworben funktioniert."
                  },
                  {
                    "statement-id": "con.1.a11-m2",
                    "uuid": "9d8905cc-8412-484f-a696-fce54e158176",
                    "description": "Vor der produktiven Inbetriebnahme werden grundlegende Funktionstests manuell durchgeführt, um die Kernfunktionalität sicherzustellen (z.B. kann ein Schlüssel erzeugt, ein Text ver- und wieder entschlüsselt werden). Es existiert jedoch kein formaler, dokumentierter Testplan."
                  },
                  {
                    "statement-id": "con.1.a11-m3",
                    "uuid": "3b2340ba-b20f-43a4-87e3-fff906d7066d",
                    "description": "Im Kryptokonzept SOLLTEN Testverfahren für Hardware mit kryptografischen Funktionen festgelegt werden. Bevor Hardware mit kryptografischen Funktionen eingesetzt wird, sollte anhand dieser definierten Verfahren getestet werden, ob die kryptografischen Funktionen korrekt funktionieren. Die erfolgreiche Durchführung der Tests wird dokumentiert."
                  },
                  {
                    "statement-id": "con.1.a11-m4",
                    "uuid": "84eac921-9abb-4aab-9835-377a57bb670f",
                    "description": "Wenn ein IT-System, das Krypto-Hardware nutzt, geändert wird (z.B. durch ein Treiber- oder Firmware-Update), SOLLTE erneut getestet werden, ob die eingesetzte kryptografische Hardware noch ordnungsgemäß funktioniert (Regressionstest). Die Konfiguration der kryptografischen Hardware SOLLTE regelmäßig auf Konformität mit den Vorgaben überprüft werden."
                  },
                  {
                    "statement-id": "con.1.a11-m5",
                    "uuid": "7a7ea762-82e6-4d19-b37d-f47ea09dd1cf",
                    "description": "Automatisierte Testsuiten werden eingesetzt, um die Krypto-Hardware umfassend zu validieren. Dies umfasst nicht nur Funktionstests, sondern auch Performancetests unter Last und grundlegende Prüfungen auf Anfälligkeiten gegen Side-Channel-Angriffe. Die von der Hardware bereitgestellten Selbsttests (Power-on Self-Tests) sind aktiviert und ihre Ergebnisse werden zentral überwacht und protokolliert."
                  }
                ]
              },
              {
                "uuid": "095cfc63-07ea-4aff-b3e1-933e397f2476",
                "control-id": "TEST.4.1",
                "description": "Implementation for TEST.4.1 based on BSI OPS.1.1.6.A4",
                "statements": [
                  {
                    "statement-id": "OPS.1.1.6.A4-m1",
                    "uuid": "1fe73f1e-b3da-4bef-8fe6-cfd1106e9781",
                    "description": "Die Freigabe der Software erfolgt informell durch eine mündliche Absprache oder eine kurze E-Mail, oft direkt durch die Entwicklungsabteilung. Eine Einbeziehung der Fachseite findet nicht statt."
                  },
                  {
                    "statement-id": "OPS.1.1.6.A4-m2",
                    "uuid": "4e0a431e-eb8d-464b-a889-fb7c383212c4",
                    "description": "Es gibt einen einfachen Freigabeprozess, bei dem die fachlich zuständige Stelle die Software nach einer kurzen Demonstration abnimmt. Die Freigabe wird per E-Mail dokumentiert."
                  },
                  {
                    "statement-id": "OPS.1.1.6.A4-m3",
                    "uuid": "5bc94b3d-7af8-4989-a7dc-2f3f8ecf2f9c",
                    "description": "Die fachlich zuständige Organisationseinheit MUSS die Software freigeben, sobald die Software-Tests erfolgreich durchgeführt wurden. Die Freigabe MUSS in Form einer Freigabeerklärung dokumentiert werden. Die freigebende Organisationseinheit MUSS überprüfen, ob die Software gemäß den Anforderungen getestet wurde, die Ergebnisse mit den Erwartungen übereinstimmen und rechtliche sowie organisatorische Vorgaben eingehalten wurden."
                  },
                  {
                    "statement-id": "OPS.1.1.6.A4-m4",
                    "uuid": "d6343601-ed64-4bef-98c7-f7706d26d5cb",
                    "description": "Der Freigabeprozess wird durch ein Workflow-System unterstützt. Die Freigabe erfolgt mehrstufig und bezieht neben der Fachseite auch den IT-Betrieb und den Informationssicherheitsbeauftragten (ISB) mit ein. Es gibt definierte Kriterien für die Freigabe, einschließlich einer maximal zulässigen Anzahl offener Fehler bestimmter Prioritätsstufen."
                  },
                  {
                    "statement-id": "OPS.1.1.6.A4-m5",
                    "uuid": "f052544e-8a53-4acc-a23b-c3ebd6f8c70a",
                    "description": "Der Freigabeprozess ist Teil eines automatisierten Governance-Prozesses (Policy-as-Code). Die Einhaltung der Freigabekriterien (z.B. erfolgreiche Sicherheitsscans, bestandene Tests, keine kritischen Fehler) wird automatisch überprüft. Nur wenn alle Kriterien erfüllt sind, wird die Software automatisch für das Deployment in die Produktion freigegeben. Manuelle Freigaben sind nur in dokumentierten Ausnahmefällen möglich."
                  }
                ]
              },
              {
                "uuid": "e371dea9-23ed-48ec-8416-c936729171d6",
                "control-id": "TEST.5.3",
                "description": "Implementation for TEST.5.3 based on BSI OPS.1.1.3.A14",
                "statements": [
                  {
                    "statement-id": "ops.1.1.3-a14-m3",
                    "uuid": "053adfac-61af-4a27-bbc5-dbad540ff3d8",
                    "description": "Im Änderungsmanagementprozess SOLLTE durch geeignete Mechanismen sichergestellt werden, dass auch zeitweise oder längerfristig nicht erreichbare Geräte (z.B. Laptops von Außendienstmitarbeitern) die Patches und Änderungen erhalten, sobald sie wieder mit dem Netzwerk verbunden sind."
                  },
                  {
                    "statement-id": "ops.1.1.3-a14-m4",
                    "uuid": "da4087bb-a546-440a-8f82-90b55581c201",
                    "description": "Es werden aktive Maßnahmen ergriffen, um die Synchronisierung sicherzustellen. Die Compliance-Berichte des Management-Tools werden regelmäßig ausgewertet, um Geräte zu identifizieren, die seit längerer Zeit keine Updates erhalten haben. Für diese Geräte wird ein Prozess zur Nachverfolgung angestoßen."
                  },
                  {
                    "statement-id": "ops.1.1.3-a14-m5",
                    "uuid": "50bd1790-e38c-4a3b-bfc8-30c2f6405127",
                    "description": "Es werden technische Lösungen eingesetzt, die eine Synchronisierung auch ohne direkte Verbindung zum internen LAN oder VPN ermöglichen. Geräte, die einen definierten Patch-Level unterschreiten, wird der Zugriff auf Unternehmensressourcen automatisch verweigert, bis sie den erforderlichen Stand erreicht haben."
                  }
                ]
              },
              {
                "uuid": "10f6f42c-5504-43f7-aeda-f03f8e262c17",
                "control-id": "TEST.5.5",
                "description": "Implementation for TEST.5.5 based on BSI OPS.1.1.2.A24",
                "statements": [
                  {
                    "statement-id": "OPS.1.1.2.A24-m3",
                    "uuid": "62a83bbf-ece4-4409-b23b-bff1071f6735",
                    "description": "Administratoren sind angewiesen, die von ihnen durchgeführten Änderungen auf korrekte Funktion zu überprüfen. Diese Überprüfung erfolgt durch den Administrator selbst und wird nicht gesondert dokumentiert."
                  },
                  {
                    "statement-id": "OPS.1.1.2.A24-m4",
                    "uuid": "94563fee-c6c6-4e44-9f32-577a2849bb46",
                    "description": "Bevor eine IT-Administrationstätigkeit durchgeführt wird, SOLLTE geprüft werden, ob der Anlass und die Art der Tätigkeit im Kontext der zugrundeliegenden Aufgabe plausibel sind. Nachdem eine IT-Administrationstätigkeit an einer Komponente durchgeführt wurde, SOLLTE geprüft werden, ob die Konfiguration und der Status der Komponente dem gewünschten Zielzustand entspricht. Falls eine zusätzliche Qualitätssicherung der ausgeführten Administrationsaufgabe notwendig ist, SOLLTE diese nicht durch dieselbe Person durchgeführt werden, die die entsprechenden Tätigkeiten durchgeführt hat. Für IT-Administrationstätigkeiten mit potenziell weitreichenden Folgen SOLLTE geprüft werden, ob diese Tätigkeiten die Verfügbarkeit der IT-Administration selbst einschränken könnten. In diesem Fall SOLLTEN entsprechende Vorkehrungen getroffen werden, um einen Rollback der IT-Administrationstätigkeiten zu ermöglichen."
                  },
                  {
                    "statement-id": "OPS.1.1.2.A24-m5",
                    "uuid": "49673fad-8a8d-44c3-b497-7bd90c31c2c5",
                    "description": "Die Prüfung von administrativen Tätigkeiten ist automatisiert. Nach jeder Konfigurationsänderung durch ein Automatisierungswerkzeug wird automatisch eine Reihe von Tests (Test Suite) ausgeführt, die den Zustand und die Funktionalität des Systems verifizieren. Bei Abweichungen vom Soll-Zustand wird die Änderung automatisch zurückgerollt und ein Alarm ausgelöst."
                  }
                ]
              },
              {
                "uuid": "48f6b0b1-29c7-4ad3-98df-860fbaadd3db",
                "control-id": "UMS.5.1",
                "description": "Implementation for UMS.5.1 based on BSI DER.3.2.A19",
                "statements": [
                  {
                    "statement-id": "DER.3.2.A19-m3",
                    "uuid": "9d900718-9c9e-4112-bb5d-d7639a2271fb",
                    "description": "Das IS-Revisionsteam SOLLTE prüfen, ob die verbleibenden Restrisiken für den Informationsverbund angemessen und tragbar sind und ob sie verbindlich durch die Institutionsleitung getragen werden. Das IS-Revisionsteam SOLLTE stichprobenartig verifizieren, ob bzw. inwieweit die gewählten Risikobehandlungsoptionen umgesetzt sind."
                  }
                ]
              },
              {
                "uuid": "be282b5a-5278-406a-8576-fb52427b03c3",
                "control-id": "UMS.5.3",
                "description": "Implementation for UMS.5.3 based on BSI ORP.5.A5",
                "statements": [
                  {
                    "statement-id": "ORP.5.A5-m1",
                    "uuid": "9ff63728-9ff9-402a-9ada-655937064f27",
                    "description": "Ausnahmen von Regelungen werden informell und meist mündlich gewährt. Es gibt keine Dokumentation, keine Risikoabschätzung und keine Befristung."
                  },
                  {
                    "statement-id": "ORP.5.A5-m2",
                    "uuid": "18ebca8f-8930-4261-9802-40960eb39d09",
                    "description": "Ausnahmegenehmigungen werden schriftlich (z.B. per E-Mail) beantragt und genehmigt. Es gibt jedoch keinen standardisierten Prozess, keine formale Risikoabschätzung und keine zentrale Erfassung der Ausnahmen."
                  },
                  {
                    "statement-id": "ORP.5.A5-m3",
                    "uuid": "e40cd54b-419c-49c5-8e7e-8ed84e5b26da",
                    "description": "Ist es in Einzelfällen erforderlich, von getroffenen Regelungen abzuweichen, SOLLTE die Ausnahme begründet und durch eine autorisierte Stelle nach einer Risikoabschätzung genehmigt werden. Es SOLLTE ein Genehmigungsverfahren für Ausnahmegenehmigungen geben. Es SOLLTE eine Übersicht über alle erteilten Ausnahmegenehmigungen erstellt und gepflegt werden. Ein entsprechendes Verfahren für die Dokumentation und ein Überprüfungsprozess SOLLTE etabliert werden. Alle Ausnahmegenehmigungen SOLLTEN befristet sein."
                  },
                  {
                    "statement-id": "ORP.5.A5-m4",
                    "uuid": "996bddfc-1f17-4774-9565-bb6bfc9da23e",
                    "description": "Der Prozess für Ausnahmegenehmigungen ist in das IT-Service-Management-System (z.B. als eigener Ticket-Typ) integriert. Anträge werden über ein standardisiertes Formular gestellt, das die Eingabe einer Risikoabschätzung und möglicher kompensierender Maßnahmen erzwingt. Die zentrale Liste wird regelmäßig (z.B. quartalsweise) vom Management oder einem Sicherheitsgremium überprüft."
                  },
                  {
                    "statement-id": "ORP.5.A5-m5",
                    "uuid": "63e97a93-ae3f-4e9b-b751-75fad1b43ae1",
                    "description": "Der gesamte Lebenszyklus von Ausnahmegenehmigungen wird in einem GRC-Tool verwaltet. Das System verknüpft die Ausnahme direkt mit dem Risiko im Risikoregister und passt die Risikobewertung entsprechend an. Die Wirksamkeit von kompensierenden Maßnahmen wird aktiv überwacht. Ein Dashboard bietet jederzeit einen aktuellen Überblick über alle Ausnahmen und das damit verbundene Gesamtrisiko."
                  }
                ]
              },
              {
                "uuid": "56bc6c83-de13-4b3c-90a0-e99520bdd498",
                "control-id": "VRB.2.1",
                "description": "Implementation for VRB.2.1 based on BSI ISMS.1.A11",
                "statements": [
                  {
                    "statement-id": "isms.1.a11-m1",
                    "uuid": "882a22a6-8ecb-4f7a-95f3-44b0b396487c",
                    "description": "Überprüfungen der Informationssicherheit finden nur reaktiv statt, beispielsweise nach einem schwerwiegenden Sicherheitsvorfall. Es gibt keinen Plan für regelmäßige Prüfungen."
                  },
                  {
                    "statement-id": "isms.1.a11-m2",
                    "uuid": "76e154ab-6a1f-4318-a2c2-4ec9118eaed2",
                    "description": "Es gibt einen Plan für jährliche Überprüfungen. Diese Prüfungen sind jedoch oberflächlich und werden von Personen durchgeführt, die für die geprüften Bereiche selbst verantwortlich sind (mangelnde Unabhängigkeit)."
                  },
                  {
                    "statement-id": "isms.1.a11-m3",
                    "uuid": "8c18ea70-ad21-4920-8640-ee6347697303",
                    "description": "Der Sicherheitsprozess, die Sicherheitskonzepte, die Leitlinie und die Organisationsstruktur SOLLTEN regelmäßig auf Wirksamkeit und Angemessenheit überprüft und aktualisiert werden. Es SOLLTEN regelmäßig Sicherheitsrevisionen durchgeführt werden, wobei geregelt sein SOLLTE, welche Bereiche wann und von wem zu überprüfen sind. Überprüfungen SOLLTEN regelmäßig (mindestens jährlich) sowie anlassbezogen von qualifizierten und unabhängigen Personen durchgeführt werden. Die Ergebnisse SOLLTEN nachvollziehbar dokumentiert und darauf aufbauend Mängel beseitigt und Korrekturmaßnahmen ergriffen werden."
                  },
                  {
                    "statement-id": "isms.1.a11-m4",
                    "uuid": "e8225d1a-d777-4c0a-8aaa-17c54f2a051f",
                    "description": "Der Revisionsprozess wird durch einen mehrjährigen, risikobasierten Auditplan gesteuert. Festgestellte Mängel werden in einem zentralen System zur Nachverfolgung (Finding-Management-System) erfasst. Bei schwerwiegenden Mängeln wird eine Ursachenanalyse (Root Cause Analysis) durchgeführt, um systemische Schwächen zu identifizieren und zu beheben."
                  },
                  {
                    "statement-id": "isms.1.a11-m5",
                    "uuid": "a8d830e1-2f5c-48be-989e-7f402d8f38e8",
                    "description": "Der Revisionsprozess wird durch automatisierte Werkzeuge zur kontinuierlichen Konformitätsprüfung und Schwachstellenanalyse unterstützt (Continuous Auditing). Die Ergebnisse der Audits und die gewonnenen Metriken fließen direkt in den Risikomanagementprozess zurück, um die Sicherheitsstrategie und die Kontrollen dynamisch anzupassen."
                  }
                ]
              },
              {
                "uuid": "ca038252-85f1-4c7d-be8e-40c6b9d55a19",
                "control-id": "VRB.3.1",
                "description": "Implementation for VRB.3.1 based on BSI DER.3.2.A22",
                "statements": [
                  {
                    "statement-id": "DER.3.2.A22-m3",
                    "uuid": "d9cec1f3-e114-4929-9754-af97949c87e0",
                    "description": "Die im IS-Revisionsbericht festgestellten Abweichungen SOLLTEN in einer angemessenen Zeit durch die Institution korrigiert werden. Die durchzuführenden Korrekturmaßnahmen SOLLTEN mit Zuständigkeiten, Umsetzungstermin und dem jeweiligen Status dokumentiert sein. Die Umsetzung SOLLTE kontinuierlich nachverfolgt und der Umsetzungsstatus fortgeschrieben werden."
                  },
                  {
                    "statement-id": "DER.3.2.A22-m4",
                    "uuid": "83d6d5cb-5e01-475c-9c01-ad1a5cc3e9a5",
                    "description": "Die Maßnahmenverfolgung wird durch ein zentrales Ticket- oder Task-Management-System unterstützt. Die Wirksamkeit der umgesetzten Maßnahmen wird vor dem Schließen der Maßnahme durch eine unabhängige Stelle (z.B. den ISB) überprüft. Grundsätzlich SOLLTE geprüft werden, ob ergänzende IS-Revisionen notwendig sind und die Grob- und Detailplanung zur IS-Revision angepasst werden."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}