{
  "component-definition": {
    "uuid": "d2932565-7474-4fe3-81a5-1c64b8e6cbd0",
    "metadata": {
      "title": "NET.2.1 WLANs - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:45:30.978538+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "cc6bd218-1b89-4936-899d-1578449bd1e9",
        "type": "interconnection",
        "title": "NET.2.1 WLANs",
        "description": "This component represents the implementation of all controls for Baustein NET.2.1.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Über Wireless LANs (WLANs) können drahtlose lokale Netze aufgebaut oder bestehende drahtgebundene Netze erweitert werden. Bis heute basieren fast alle am Markt verfügbaren WLAN-Komponenten auf dem Standard IEEE 802.11 und seinen Ergänzungen. Eine besondere Rolle nimmt dabei das Firmenkonsortium „Wi-Fi Alliance“ ein, das basierend auf dem Standard IEEE 802.11 mit „Wi-Fi“ einen Industriestandard geschaffen hat. Dabei bestätigt die Wi-Fi Alliance mit dem Wi-Fi-Gütesiegel, dass ein Gerät gewisse Interoperabilitäts- und Konformitätstests bestanden hat.<BR>Innerhalb von Institutionen können WLANs eingesetzt werden, um flexibel mit mobilen Geräten zu arbeiten und diesen den Zugang zum Netz der Institution zu ermöglichen. Hierfür werden innerhalb der Institution Netzzugänge über so genannten Access Points aufgebaut. Aufgrund der meist einfachen und schnellen Installation werden WLANs auch dazu eingesetzt, um temporär Netze einzurichten, beispielsweise auf Messen oder kleineren Veranstaltungen. Darüber hinaus können an öffentlichen Plätzen, wie Flughäfen oder Bahnhöfen, Netzzugänge über so genannte Hotspots angeboten werden. Dadurch werden den mobilen Benutzenden Verbindungen in das Internet oder ihr Institutionsnetz ermöglicht. Die Kommunikation findet dann generell zwischen einem zentralen Zugangspunkt, dem Access Point, und der WLAN-Komponente des Endgeräts statt."
          },
          {
            "name": "Zielsetzung",
            "value": "In diesem Baustein wird systematisch aufgezeigt, wie WLANs sicher in einer Institution aufgebaut und betrieben werden können."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein NET.2.1 WLAN-Betrieb ist auf alle Kommunikationsnetze anzuwenden, die gemäß der Standard-Reihe IEEE 802.11 und deren Erweiterungen aufgebaut und betrieben werden.<BR>Der Baustein enthält grundsätzliche Anforderungen, die beachtet und erfüllt werden müssen, wenn WLANs in Institutionen aufgebaut und betrieben werden. Anforderungen für eine sichere Nutzung von WLANs sind jedoch nicht Gegenstand dieses Bausteins. Die sichere Nutzung von WLANs wird im Baustein NET.2.2 WLAN-Nutzung behandelt.<BR>WLANs können entsprechend den Bedürfnissen der betreibenden Institution und der Hardware-Ausstattung, die zur Verfügung steht, in zwei verschiedenen Modi betrieben werden. Im Ad-hoc-Modus kommunizieren zwei oder mehr WLAN-Clients direkt miteinander. WLANs im Ad-hoc-Modus können sich selbstständig, also ohne feste Infrastruktur, aufbauen und konfigurieren. Somit können sie eine vollvermaschte parallele Netz-Infrastruktur etablieren. Dadurch ist der Ad-hoc-Modus in einer zu schützenden Umgebung ungeeignet und wird deshalb im Folgenden nicht weiter betrachtet. In den meisten Fällen werden WLANs im Infrastruktur-Modus betrieben, d. h. die Kommunikation der WLAN-Clients und die Verbindung in kabelgebundene LAN-Segmente erfolgt über Access Points.<BR>Werden für die Authentisierung am WLAN entsprechende Dienste (z. B. RADIUS) eingesetzt, so müssen die entsprechenden IT-Systeme, auf denen die Dienste betrieben werden, gesondert abgesichert werden. Hierfür können die Bausteine der Schicht SYS.1, wie zum Beispiel SYS.1.1 Allgemeiner Server, herangezogen werden.<BR>Wird ein WLAN betrieben, sollte dieses grundsätzlich mit berücksichtigt werden, wenn die Bausteine NET.1.1 Netzarchitektur und -design, NET.1.2 Netzmanagement und DER.2.1 Behandlung von Sicherheitsvorfällen umgesetzt werden."
          },
          {
            "name": "Ausfall oder Störung eines Funknetzes",
            "value": "In Funknetzen werden Informationen mittels elektromagnetischer Funkwellen übertragen. Strahlen andere elektromagnetische Quellen im selben Frequenzspektrum Energie ab, können diese die drahtlose Kommunikation stören und im Extremfall den Betrieb des WLANs verhindern. Dies kann durch andere Funksysteme und Geräte, wie beispielsweise Bluetooth, Mikrowellenherde oder andere WLAN-Netze hervorgerufen werden. Darüber hinaus sind auch Denial-of-Service-Angriffe möglich. Werden beispielsweise bestimmte Steuer- und Managementsignale wiederholt gesendet, kann dies dazu führen, dass das Funknetz nicht mehr verfügbar ist."
          },
          {
            "name": "Fehlende oder unzureichende Planung des WLAN-Einsatzes",
            "value": "Fehler in der Planung stellen sich oft als besonders schwerwiegend heraus, weil dadurch leicht flächendeckende Sicherheitslücken geschaffen werden können. Wird der Einsatz von WLANs nicht oder nur unzureichend geplant, kann sich eine Vielzahl von Problemen ergeben, beispielsweise:<BR><BR>• Vertrauliche Daten könnten mitgelesen werden, etwa wenn WLAN-Standards eingesetzt werden, die nicht mehr dem Stand der Technik entsprechen (z. B. WEP zur Verschlüsselung).<BR>• Die Übertragungskapazität könnte unzureichend sein. Dadurch können bandbreitenintensive Anwendungen nicht mit der erforderlichen Dienstgüte genutzt werden.<BR>• Die Abdeckung des WLANs könnte nicht ausreichend sein, sodass an bestimmten Orten kein Netz verfügbar ist."
          },
          {
            "name": "Fehlende oder unzureichende Regelungen zum WLAN-Einsatz",
            "value": "Bei einer WLAN-Infrastruktur, die nicht zentral administriert wird, sind die Access Points in der Standard-Einstellung meist ohne oder nur mit unzureichenden Sicherheitsmechanismen vorkonfiguriert. Schließen Mitarbeitende beispielsweise aufgrund fehlender Regelungen einen ungenehmigten bzw. ungesicherten Access Point an ein internes Netz der Institution an, kann dies zu schwerwiegenden Problemen führen. Denn sie untergraben damit praktisch sämtliche innerhalb des LANs ergriffenen Sicherheitsmaßnahmen, wie z. B. die Firewall zum Schutz gegen unberechtigte externe Zugriffe."
          },
          {
            "name": "Ungeeignete Auswahl von Authentisierungsverfahren",
            "value": "Wenn Authentisierungsverfahren und -mechanismen fehlen oder unzureichend sind, können Sicherheitslücken entstehen. Beispielsweise wird im Standard IEEE 802.1X (Port Based Network Access Control) das Extensible Authentication Protocol (EAP) definiert. In einigen der beschriebenen EAP-Methoden sind aber Schwachstellen enthalten. So ist EAP-MD5 etwa anfällig gegenüber Man-in-the-Middle- und Wörterbuchangriffen. Wird EAP-MD5 eingesetzt, können Passwörter erraten werden. Außerdem kann die Kommunikation abgehört werden."
          },
          {
            "name": "Fehlerhafte Konfiguration der WLAN-Infrastruktur",
            "value": "Access Points und andere WLAN-Komponenten (z. B. WLAN Controller) bieten eine Vielzahl von Konfigurationseinstellungen, die insbesondere auch Sicherheitsfunktionen betreffen. Werden diese falsch konfiguriert, ist entweder keine Kommunikation über einen Access Point möglich oder die Kommunikation erfolgt ungeschützt bzw. mit einem zu geringen Schutzniveau."
          },
          {
            "name": "Unzureichende oder fehlende WLAN-Sicherheitsmechanismen",
            "value": "Im Auslieferungszustand sind WLAN-Komponenten häufig so konfiguriert, dass keine oder nur wenige Sicherheitsmechanismen aktiviert sind. Einige der Mechanismen sind darüber hinaus unzureichend und bieten somit keinen ausreichenden Schutz. Auch heute werden noch diverse WLAN-Komponenten eingesetzt, die lediglich unzureichende Sicherheitsmechanismen wie z. B. WEP unterstützen. Teilweise können diese Geräte nicht einmal auf stärkere Sicherheitsmechanismen aufgerüstet werden. Werden solche Geräte eingesetzt, können Angreifende leicht die gesamte Kommunikation abhören und damit vertrauliche Informationen einsehen."
          },
          {
            "name": "Abhören der WLAN-Kommunikation",
            "value": "Da es sich bei Funk um ein Medium handelt, das sich mehrere Benutzende teilen können („Shared Medium“), können die über WLANs übertragenen Daten problemlos mitgehört und aufgezeichnet werden. Wenn die Daten nicht oder nur unzureichend verschlüsselt werden, können die übertragenen Nutzdaten leicht eingesehen werden. Zudem überschreiten Funknetze bzw. die ausgesendeten Funkwellen häufig die Grenzen der selbst genutzten Räumlichkeiten. So werden Daten auch noch in Bereiche ausgestrahlt, die nicht von den Benutzenden oder einer Institution kontrolliert und gesichert werden können."
          },
          {
            "name": "Vortäuschung eines gültigen Access Points (Rogue Access Point)",
            "value": "Angreifende können sich als Teil der WLAN-Infrastruktur ausgeben, indem sie einen eigenen Access Point mit einem geeignet gewählten Namen (SSID) in der Nähe eines WLAN-Clients installiert. Dieser vorgetäuschte Access Point wird als „Rogue Access Point“ bezeichnet. Bietet dieser dem WLAN-Client eine stärkere Sendeleistung als der echte Access Point, wird der Client diesen als Basisstation nutzen, falls diese sich nicht gegenseitig authentisieren. Zusätzlich könnte auch der echte Access Point durch einen Denial-of-Service-Angriff ausgeschaltet werden. Die Benutzenden melden sich an einem Netz an, das nur vorgibt, das Zielnetz zu sein. Dadurch ist es Angreifenden möglich, die Kommunikation abzuhören. Auch durch Poisoning- oder Spoofing-Methoden können Angreifende eine falsche Identität vortäuschen bzw. den Netzverkehr zu ihren IT-Systemen umlenken. So können sie die Kommunikation belauschen und kontrollieren. Besonders in öffentlichen Funknetzen (sogenannten Hotspots) ist ein Rogue Access Point ein beliebtes Angriffsmittel."
          },
          {
            "name": "Ungeschützter LAN-Zugang am Access Point",
            "value": "Sind Access Points sichtbar und ohne physischen Schutz montiert, können sich Angreifende zwischen die Access Points und die Switch-Infrastruktur schalten, um den gesamten Netzverkehr abzuhören. Selbst wenn die drahtlose Kommunikation mit WPA2 verschlüsselt wird, stellt dies eine Gefährdung dar, weil diese Methoden nur die Luftschnittstelle absichern, die Ethernet-Anbindung aber nicht weiter berücksichtigen."
          },
          {
            "name": "Hardware-Schäden",
            "value": "Hardware-Schäden können dazu führen, dass der Funkverkehr gestört wird. Im schlimmsten Fall kann das WLAN sogar komplett ausfallen. Dies betrifft insbesondere WLAN-Geräte, die außerhalb von geschützten Räumen angebracht werden, z. B. um offene Plätze abzudecken. Sie sind zusätzlichen Gefährdungen ausgesetzt, wie beispielsweise vorsätzlichen Beschädigungen durch Angreifende oder umweltbedingten Schäden durch Witterung oder Blitzeinschlag."
          },
          {
            "name": "Diebstahl eines Access Points",
            "value": "Werden WLAN Access Points ungesichert in öffentlichen Bereichen installiert, können sie gestohlen werden. Dadurch lässt sich beispielsweise ein Shared-Secret Key für die Authentisierung am RADIUS-Server oder der verwendete Schlüssel (beispielsweise für WPA2-Personal) auslesen. Mit diesen Informationen kann dann unberechtigt auf das WLAN zugegriffen werden."
          }
        ],
        "control-implementations": [
          {
            "uuid": "945094d8-96c4-4771-9789-50d99df3be28",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/wlans_profile.json",
            "description": "Implementation for all controls in Baustein NET.2.1",
            "implemented-requirements": [
              {
                "uuid": "c860d61f-a103-4746-b588-e3b82fc5ecfc",
                "control-id": "ARCH.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.2.1.A6-m1",
                    "uuid": "d2b5200b-41eb-401c-a1df-49d8efde666f",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "WLAN-Clients befinden sich im selben Netzwerksegment wie die kabelgebundenen Clients, ohne jegliche Trennung."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Access Point wird einfach an einen beliebigen LAN-Port angeschlossen und fungiert als Bridge. Dadurch können sich drahtlose Geräte uneingeschränkt mit allen anderen Geräten im LAN verbinden, was Sicherheitszonen-Konzepte untergräbt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Verbinden Sie sich mit dem WLAN und notieren Sie Ihre IP-Adresse und Subnetzmaske. Vergleichen Sie diese mit der IP-Konfiguration eines kabelgebundenen Clients im selben Bereich. Führen Sie einen Netzwerkscan (z.B. mit `nmap`) aus dem WLAN durch, um zu sehen, welche anderen Geräte im LAN erreichbar sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A6-m2",
                    "uuid": "2acadd0d-f3cc-4812-9a83-7142f1328468",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt ein separates Gast-WLAN, das vom internen Netz getrennt ist. Das Mitarbeiter-WLAN ist jedoch weiterhin direkt mit dem vertrauenswürdigen LAN gekoppelt."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine grundlegende Trennung für unsichere Gäste ist implementiert, typischerweise über eine simple VLAN-Trennung und eine Firewall-Regel, die den Zugriff auf das Internet beschränkt. Das interne WLAN für Mitarbeiter wird jedoch als genauso vertrauenswürdig wie das kabelgebundene Netz angesehen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Konfiguration des Gast-WLANs und verifizieren Sie dessen Trennung. Führen Sie dann die gleiche Analyse wie in Level 1 für das Mitarbeiter-WLAN durch, um zu bestätigen, dass es nicht vom internen LAN getrennt ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A6-m3",
                    "uuid": "c1e7b73a-b96f-47bf-b67b-faebf9858b3b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS sichergestellt sein, dass mittels der WLAN-Kommunikation keine Sicherheitszonen gekoppelt werden und hierdurch etablierte Schutzmaßnahmen umgangen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Jedes WLAN (z.B. Gast, Mitarbeiter, IoT) wird in ein eigenes, dediziertes Netzsegment (typischerweise ein VLAN) platziert. Der Datenverkehr zwischen diesen WLAN-Segmenten und anderen Netz Zonen (z.B. dem Server-LAN oder dem Client-LAN) MUSS über eine Firewall oder einen Paketfilter geleitet werden, der nach dem Need-to-know-Prinzip konfiguriert ist."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Fordern Sie den Netzplan und die VLAN-Konfiguration an. Überprüfen Sie die Konfiguration der Access Points, Switches und der Firewall. Stellen Sie sicher, dass für jede SSID ein separates VLAN konfiguriert ist und der Datenverkehr zwischen den Zonen die Firewall passiert. Prüfen Sie die Firewall-Regeln, die den Verkehr aus den WLAN-Zonen regeln."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A6-m4",
                    "uuid": "938159c2-5160-4d4d-a39b-177b87b89df0",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Kopplung von Sicherheitszonen wird durch eine dedizierte WLAN-DMZ-Architektur verhindert. Der gesamte WLAN-Verkehr wird an einem zentralen Punkt terminiert und durch eine Firewall mit anwendungsspezifischen Regeln kontrolliert, bevor er in andere Netzzonen gelangt."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle Access Points leiten den Datenverkehr getunnelt an einen zentralen WLAN-Controller, der in einer eigenen, stark abgesicherten Netzwerkzone (DMZ) platziert ist. Erst von dort wird der Verkehr gezielt und nach strenger Prüfung in andere Netzbereiche weitergeleitet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Analysieren Sie die Netzwerkarchitektur-Dokumentation. Überprüfen Sie die Konfiguration des WLAN-Controllers und der Tunnel zwischen APs und Controller. Prüfen Sie das Regelwerk der Firewall, die die WLAN-DMZ schützt. Dieses sollte detaillierter sein als in Stufe 3 (z.B. Layer-7-Filterung)."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A6-m5",
                    "uuid": "cd42ede5-6b5b-4d6e-bc75-67bb04e88130",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Zero-Trust-Architektur wird umgesetzt, bei der jeder Client im WLAN standardmäßig isoliert ist (Client Isolation). Die Kommunikation mit anderen Geräten wird dynamisch auf Basis der Identität des Benutzers und des Gerätezustands durch eine NAC-Lösung (Network Access Control) gesteuert und erzwungen."
                      },
                      {
                        "name": "guidance",
                        "value": "Selbst Geräte innerhalb derselben SSID können nicht direkt miteinander kommunizieren (Client- oder Port-Isolation). Der Zugriff auf Ressourcen im LAN oder Internet wird pro Sitzung und pro Ziel von einer zentralen Policy-Engine genehmigt. Kompromittierte oder nicht konforme Geräte werden automatisch in ein Quarantäne-Netzwerk verschoben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Konfiguration der Access Points auf aktivierte 'Client Isolation'. Prüfen Sie die Policies in der NAC-Lösung. Verbinden Sie zwei Geräte mit derselben SSID und versuchen Sie, eine direkte Verbindung (z.B. Ping) herzustellen; dies sollte fehlschlagen. Simulieren Sie ein nicht konformes Gerät (z.B. durch Deaktivieren der Firewall) und prüfen Sie, ob der Netzwerkzugriff wie erwartet eingeschränkt oder blockiert wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "421265b8-1924-4f2e-b259-2954e54e83c9",
                "control-id": "ARCH.2.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.2.1.A9-m1",
                    "uuid": "f6846165-517a-4176-abbf-28e1e31f5287",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "WLANs werden ohne jegliche Absicherung direkt an das LAN angebunden. Der Access Point agiert als simple Bridge."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt keine logische oder physische Trennung zwischen dem drahtlosen und dem kabelgebundenen Netzwerk. Ein im WLAN kompromittierter Client hat vollen Zugriff auf das LAN, als wäre er per Kabel verbunden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Netzwerkkonfiguration eines WLAN-Clients und vergleichen Sie diese mit einem LAN-Client. Führen Sie von einem WLAN-Client aus einen Ping oder Portscan auf kritische Server im LAN durch. Erfolg bei diesen Tests deutet auf fehlende Trennung hin."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A9-m2",
                    "uuid": "87427405-2276-49d0-b3f1-1f5c34c08ff4",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundsätzliche Trennung des WLAN vom LAN wird durch die Platzierung der WLAN-Clients in einem eigenen VLAN erreicht. Es gibt jedoch keine Firewall oder Paketfilter zwischen den Netzen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Netze sind auf Layer 2 getrennt, aber auf Layer 3 über einen Router ohne Filterregeln miteinander verbunden. Dies verhindert Broadcast-Stürme, bietet aber keine wirksame Sicherheitskontrolle gegen gezielte Angriffe."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die VLAN-Konfiguration auf den Switches. Überprüfen Sie anschließend die Konfiguration des Routers, der zwischen dem WLAN-VLAN und dem LAN-VLAN vermittelt. Stellen Sie sicher, dass dort keine Access Control Lists (ACLs) oder Firewall-Regeln aktiv sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A9-m3",
                    "uuid": "04268d4b-f1d9-498c-b9e7-25763cde6e88",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Übergang zwischen WLANs und LAN MUSS durch einen Paketfilter oder eine Firewall abgesichert werden. Die Anbindung erfolgt unter Berücksichtigung der Entscheidung über das Distribution System (gemäß NET.2.1.A7)."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist eine verbindliche Regel, dass der gesamte Datenverkehr, der vom WLAN in das LAN (und umgekehrt) fließt, eine Kontrollinstanz (Firewall, Paketfilter) passieren muss. Die dort hinterlegten Regeln erlauben nur die explizit benötigte Kommunikation."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Fordern Sie die Netzwerkarchitekturdokumentation an. Überprüfen Sie das Regelwerk der Firewall oder der Router-ACLs, die den Verkehr zwischen WLAN- und LAN-Zonen kontrollieren. Die Regeln sollten dem Prinzip der minimalen Rechtevergabe folgen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A9-m4",
                    "uuid": "f3fefeef-cd04-4109-9a98-02a0e3fec782",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Übergang zwischen WLAN und LAN wird durch eine Next-Generation Firewall (NGFW) mit Stateful Inspection und Intrusion Prevention (IPS) abgesichert. Die Regeln sind anwendungsspezifisch (Layer 7)."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Absicherung beschränkt sich nicht auf Ports und IP-Adressen. Die NGFW analysiert den Datenverkehr auf Anwendungsebene und kann z.B. nur bestimmte Funktionen von HTTP erlauben. Ein integriertes IPS erkennt und blockiert bekannte Angriffsmuster im Datenstrom."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie das Regelwerk der NGFW und stellen Sie sicher, dass es anwendungsspezifische Kontrollen enthält. Prüfen Sie die Konfiguration und die Logs des IPS-Moduls auf erkannte und blockierte Angriffe, die aus dem WLAN stammen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A9-m5",
                    "uuid": "d32185ca-553f-41af-8b5b-4f8ba92dd453",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Übergang wird durch eine Zero-Trust-Architektur gesichert. Jeder Zugriffsversuch aus dem WLAN wird pro Sitzung authentifiziert und autorisiert, unabhängig vom Gerät oder Benutzer. Der gesamte Verkehr wird auf Malware und Bedrohungen untersucht."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt keine implizit vertrauenswürdigen WLANs mehr. Eine Network Access Control (NAC) Lösung in Kombination mit einer NGFW und Malware-Analyse (Sandboxing) prüft jede Anfrage. Der Zugriff wird dynamisch auf Basis von Identität, Gerätezustand und Risikobewertung gewährt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Richtlinien der NAC- und Zero-Trust-Lösung. Analysieren Sie die Integrationspunkte zwischen NAC, Firewall und Malware-Schutz. Überprüfen Sie die Protokolle, um die dynamische Durchsetzung der Richtlinien nachzuvollziehen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "f415d577-f332-4e62-bb70-e34f0570d147",
                "control-id": "ARCH.2.2.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.2.1.A12-m1",
                    "uuid": "981169be-2c9a-456d-8429-7ea29b58b32e",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Jeder Access Point wird einzeln und manuell über seine eigene Weboberfläche oder Kommandozeile konfiguriert und verwaltet."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt kein zentrales Werkzeug. Änderungen an der Konfiguration (z.B. ein neues Passwort) müssen auf jedem Gerät separat durchgeführt werden. Dies ist fehleranfällig und bei größeren Installationen nicht praktikabel."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Befragen Sie die Administratoren, wie sie eine Konfigurationsänderung auf alle Access Points anwenden. Beobachten Sie den Prozess. Das Fehlen einer zentralen Konsole oder eines Controllers ist ein klares Indiz."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A12-m2",
                    "uuid": "7128545f-ffb5-4315-a8f1-0fa3ba4decf0",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein einfaches, zentrales Management-Tool wird eingesetzt, das primär der Überwachung des Betriebszustands (online/offline) und der Verteilung von Firmware-Updates dient."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine zentrale Übersicht, aber die Konfigurationsmöglichkeiten sind begrenzt. Komplexe Änderungen müssen eventuell immer noch manuell pro Gerät vorgenommen werden. Die Lösung erfüllt grundlegende Monitoring-Aufgaben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Lassen Sie sich die Managementlösung zeigen. Prüfen Sie den Funktionsumfang. Kann eine sicherheitsrelevante Einstellung, wie die Verschlüsselungsart, für alle APs zentral und gleichzeitig geändert werden, oder dient das Tool nur der Übersicht?"
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A12-m3",
                    "uuid": "6b355f9b-8228-4516-b96b-5e297261b1d9",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine zentrale Managementlösung MUSS eingesetzt werden. Der Leistungsumfang der eingesetzten Lösung MUSS im Einklang mit den Anforderungen der WLAN-Strategie sein, insbesondere was die zentrale Konfiguration von Sicherheitsmerkmalen betrifft."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Einsatz einer zentralen WLAN-Managementlösung (WLAN-Controller, Cloud-Management) ist verpflichtend. Die Lösung muss es ermöglichen, alle sicherheitsrelevanten Einstellungen (SSIDs, Verschlüsselung, Authentisierung, Passwörter etc.) zentral zu definieren und auf alle oder Gruppen von Access Points auszurollen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie, ob eine zentrale Managementlösung im Einsatz ist. Fordern Sie die WLAN-Strategie an und gleichen Sie die dort definierten Anforderungen mit den Fähigkeiten der Managementlösung ab. Lassen Sie sich zeigen, wie eine zentrale Konfigurationsänderung durchgeführt wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A12-m4",
                    "uuid": "9c9ce020-8a2f-4545-b3cf-b142656e81cd",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die eingesetzte Managementlösung bietet erweiterte Funktionen wie die Erstellung von Heatmaps zur Visualisierung der Funkausleuchtung, die Überwachung der Konfigurationsintegrität und detaillierte Reporting-Funktionen über Clients und Nutzung."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Managementlösung ist mehr als nur ein Konfigurationswerkzeug. Sie ist ein zentrales Instrument zur Analyse und Optimierung des WLANs. Sie hilft, die Einhaltung von Sicherheitsrichtlinien zu überwachen und liefert die Datenbasis für Kapazitätsplanung und Fehlersuche."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Lassen Sie sich die erweiterten Funktionen der Managementlösung demonstrieren. Prüfen Sie beispielhaft einen Report zur Client-Auslastung oder eine Konformitätsprüfung. Vergleichen Sie eine generierte Heatmap mit der tatsächlichen Abdeckung vor Ort."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A12-m5",
                    "uuid": "37c66358-2332-4503-b907-a0da82721173",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die WLAN-Management-Lösung ist über APIs vollständig in das IT-Ökosystem (z.B. SIEM, NAC, CMDB) integriert. Konfigurationsänderungen und operative Aufgaben sind weitgehend automatisiert (z.B. durch SOAR-Playbooks)."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Managementlösung agiert nicht isoliert. Erkennt das SIEM einen Angriff von einem WLAN-Client, kann es über die API der Managementlösung diesen Client automatisch sperren. Neue APs, die in der CMDB erfasst werden, werden automatisch in der Managementlösung provisioniert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Konfiguration der API-Schnittstellen der Managementlösung. Fordern Sie Beispiele für Automatisierungs-Workflows oder Skripte an, die diese APIs nutzen. Verfolgen Sie einen automatisierten Prozess, z.B. die Reaktion auf einen Sicherheitsalarm, durch die Protokolle der verschiedenen integrierten Systeme."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "240bfe53-68f2-4281-8fcc-f3893713152b",
                "control-id": "ARCH.2.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Audit",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "PERF",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.2.1.A14-m1",
                    "uuid": "be92cdc8-cde0-4c3b-a422-69fad8ebb438",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Audits der WLAN-Komponenten finden nicht statt. Die Konfiguration wird nach der Ersteinrichtung nicht mehr überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Einmal konfiguriert, wird davon ausgegangen, dass der Zustand unverändert bleibt. Es gibt keine Kontrollmechanismen, um Konfigurationsänderungen oder Manipulationsversuche zu erkennen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Fragen Sie nach Audit-Protokollen oder Berichten zur Überprüfung der WLAN-Komponenten. Wenn keine existieren, ist dieser Reifegrad anzunehmen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A14-m2",
                    "uuid": "5ce4bb19-242b-44b9-a7ee-c136e4c990a8",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei größeren Änderungen oder Problemen wird die Konfiguration einzelner WLAN-Komponenten manuell und anlassbezogen überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt kein regelmäßiges Audit, aber wenn beispielsweise eine neue SSID ausgerollt wird, schaut sich ein Administrator die Konfiguration der betroffenen APs noch einmal an. Physikalische Inspektionen finden nicht statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Befragen Sie die Administratoren, ob und wann sie Konfigurationen überprüfen. Suchen Sie nach Belegen für solche anlassbezogenen Prüfungen in Change-Tickets oder Projekt-Dokumentationen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A14-m3",
                    "uuid": "f6b7043b-41b1-4b02-a419-5d20a2357421",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei allen Komponenten der WLAN-Infrastruktur MUSS regelmäßig überprüft werden, ob alle festgelegten Sicherheitsmaßnahmen umgesetzt und die Komponenten korrekt konfiguriert sind. Die Auditergebnisse MÜSSEN nachvollziehbar dokumentiert und mit dem Soll-Zustand abgeglichen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist ein Audit-Plan etabliert, der regelmäßige (z.B. jährliche) Überprüfungen der Konfiguration aller WLAN-Komponenten (APs, Controller, etc.) vorschreibt. Die Prüfung erfolgt anhand einer Checkliste, die sich aus der Sicherheitsrichtlinie ableitet. Die Ergebnisse werden protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Fordern Sie den Audit-Plan und die verwendeten Checklisten für WLAN-Komponenten an. Prüfen Sie die Audit-Berichte der letzten Periode. Vergleichen Sie die festgestellten Konfigurationen mit den Soll-Vorgaben."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A14-m4",
                    "uuid": "b5234e87-455e-47e8-8869-aab8e82c6279",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die regelmäßigen Audits umfassen auch stichprobenartige physikalische Überprüfungen von öffentlich aufgestellten Access Points auf Manipulations- oder Öffnungsversuche. Abweichungen vom Soll-Zustand werden systematisch untersucht und nachverfolgt."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Audit beschränkt sich nicht auf die Software-Konfiguration. Insbesondere bei APs in frei zugänglichen Bereichen wird auch der physische Zustand kontrolliert. Festgestellte Mängel (sowohl Konfigurationsfehler als auch physische Schäden) werden in einem Mängel-Tracking-System erfasst und deren Behebung wird überwacht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Audit-Berichte auf Einträge zu physikalischen Inspektionen. Lassen Sie sich das Protokoll einer solchen Begehung zeigen. Fordern Sie Auszüge aus dem Mängel-Tracking-System an, um den Prozess der Mängelbehebung nachzuvollziehen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A14-m5",
                    "uuid": "71e50d22-b294-4fe0-80df-ac2b341b42aa",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Konfiguration aller WLAN-Komponenten wird kontinuierlich und automatisiert durch ein Compliance-Management-Tool überwacht. Physische Manipulationen an Access Points werden durch integrierte Sensoren (z.B. Gehäusekontakt) erkannt und lösen einen sofortigen Alarm aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Anstatt periodischer Audits prüft ein System permanent die Konfiguration aller Geräte gegen eine goldene Referenzkonfiguration. Jede Abweichung wird in Echtzeit gemeldet. Moderne APs können physische Eingriffe erkennen und melden dies an das zentrale Management, was eine sofortige Reaktion ermöglicht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Lassen Sie sich die Compliance-Profile und -Berichte im zentralen Management-Tool zeigen. Lösen Sie eine Test-Abweichung aus (z.B. Aktivierung eines unsicheren Protokolls) und prüfen Sie, ob der Alarm wie erwartet generiert wird. Überprüfen Sie die Alarmierungskonfiguration für physische Manipulationsversuche und testen Sie diese, falls möglich."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "7d4bd4af-6cba-494c-9de1-eab32b3d1a7f",
                "control-id": "ARCH.3.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.2.1.A4-m1",
                    "uuid": "43943171-2279-4677-bdf0-8a5ad69e0fc4",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Access Points werden dort aufgestellt, wo sie benötigt werden, ohne besondere Berücksichtigung von Diebstahlschutz oder gezielter Signalausbreitung."
                      },
                      {
                        "name": "guidance",
                        "value": "Die primäre Anforderung ist die Funktion. Ein Access Point wird beispielsweise einfach auf einen Schrank gestellt oder an eine leicht zugängliche Wand geschraubt. Physikalische Sicherheit und die Minimierung der Abstrahlung nach außen spielen keine Rolle."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Führen Sie eine Ortsbegehung durch und identifizieren Sie die Standorte der Access Points. Prüfen Sie, ob diese leicht entwendet oder manipuliert werden können (z.B. in unverschlossenen öffentlichen Bereichen, in geringer Höhe montiert)."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A4-m2",
                    "uuid": "6c9d642c-f7fc-4609-b53f-d94de0295240",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Access Points werden an Decken oder Wänden montiert, um eine bessere Abdeckung zu erzielen. Ein grundlegender Schutz vor zufälliger Beschädigung ist gegeben, aber es gibt keinen systematischen Diebstahlschutz oder Maßnahmen zur Begrenzung der Funkwellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Montage ist professioneller als in Stufe 1, zielt aber hauptsächlich auf eine gute Sendeleistung ab. Spezielle Sicherheitsgehäuse oder eine durchdachte Positionierung zur Signal-Eindämmung fehlen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Montage der Access Points. Sind sie fest installiert? Bewerten Sie, ob die Standorte eine ungewollte starke Abstrahlung in nicht zu versorgende Bereiche (z.B. nach außen, auf die Straße) begünstigen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A4-m3",
                    "uuid": "31ec95ac-e19a-4651-9637-0eb643ce8e73",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Access Points MÜSSEN zugriffs- und diebstahlsicher montiert werden. Wenn sie aufgestellt werden, MÜSSEN die erforderlichen Bereiche ausreichend abgedeckt werden. Darüber hinaus MUSS darauf geachtet werden, dass sich die Funkwellen in Bereichen, die nicht durch das WLAN versorgt werden sollen, möglichst nicht ausbreiten. Außeninstallationen MÜSSEN vor Witterungseinflüssen und elektrischen Entladungen geeignet geschützt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Positionierung von Access Points folgt einem Plan, der sowohl die gewünschte Abdeckung als auch die physikalische Sicherheit berücksichtigt. In öffentlichen Bereichen werden die APs in Sicherheitsgehäusen oder außerhalb der Reichweite montiert. Die Sendeleistung wird so eingestellt, dass das Signal primär auf den gewünschten Bereich beschränkt bleibt. APs im Außenbereich werden in wetterfesten Gehäusen mit Blitzschutz installiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Fordern Sie den Ausleuchtungs- und Montageplan für das WLAN an. Führen Sie stichprobenartige Begehungen durch und vergleichen Sie die tatsächliche Montage mit dem Plan. Überprüfen Sie, ob APs in öffentlichen Bereichen gesichert sind. Messen Sie die Signalstärke an der Grundstücksgrenze (Signal Bleeding) mit einem WLAN-Analysetool. Prüfen Sie die Schutzart (IP-Rating) und den Blitzschutz bei Außeninstallationen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A4-m4",
                    "uuid": "909e7b58-c273-4b53-abc2-2e8a6e414c80",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Planung der AP-Aufstellung erfolgt auf Basis einer professionellen Funkausleuchtung (Site Survey) mit spezieller Software. Die Sendeleistung der Access Points wird aktiv so gesteuert, dass eine optimale Abdeckung bei minimaler Abstrahlung nach außen erreicht wird."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor der Installation wird eine Simulation oder eine Vor-Ort-Messung durchgeführt, um die idealen Standorte und Konfigurationen für die APs zu bestimmen. Dies berücksichtigt Baumaterialien und Störquellen. Die Ergebnisse werden genutzt, um die Sendeleistung pro AP individuell zu justieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Lassen Sie sich die Berichte der durchgeführten Funkausleuchtung (Site Survey) zeigen. Vergleichen Sie die empfohlenen Standorte und Einstellungen mit der realen Implementierung. Automatisierte Prüfung: Über das zentrale WLAN-Management-System kann die aktuell konfigurierte Sendeleistung (`tx-power`) jedes APs ausgelesen und mit den Soll-Werten aus dem Site Survey verglichen werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A4-m5",
                    "uuid": "05a7cda2-5cd4-4461-af40-1d909bbf8e8c",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Positionierung und Sendeleistung der Access Points wird kontinuierlich und automatisiert durch das WLAN-Management-System optimiert. Das System reagiert dynamisch auf Veränderungen in der Umgebung (z.B. neue Hindernisse, erhöhte Client-Dichte) und passt die Funkparameter an, um Abdeckung und Sicherheit permanent zu gewährleisten."
                      },
                      {
                        "name": "guidance",
                        "value": "Moderne WLAN-Systeme (z.B. mit RRM - Radio Resource Management) analysieren permanent die Funkumgebung. Sie passen Sendeleistungen und Kanalzuweisungen automatisch an, um Interferenzen zu vermeiden und die Abdeckung zu optimieren. Das System kann auch \"Löcher\" in der Abdeckung erkennen, die durch einen ausgefallenen AP entstehen, und die Leistung der umliegenden APs erhöhen, um die Lücke zu schließen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Konfiguration des WLAN-Management-Systems, um sicherzustellen, dass Funktionen zur automatischen Funkoptimierung (RRM/ARM) aktiviert sind. Analysieren Sie die Protokolle des Systems, um Nachweise für durchgeführte automatische Anpassungen zu finden. Beobachten Sie das Systemverhalten, indem Sie einen AP testweise deaktivieren und prüfen, ob die benachbarten APs ihre Sendeleistung wie erwartet anpassen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "0927fbce-6e21-4cb0-9d6d-f757f9ad3a18",
                "control-id": "ARCH.3.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.2.1.A5-m1",
                    "uuid": "8f68a218-4709-4811-bd14-bea337e94286",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Access Points werden im Auslieferungszustand mit voreingestellten SSIDs und Passwörtern in Betrieb genommen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Geräte werden ausgepackt, angeschlossen und ohne jegliche Konfigurationsänderung verwendet. Dies stellt ein erhebliches Sicherheitsrisiko dar, da Standardpasswörter allgemein bekannt sind."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Suchen Sie nach WLANs mit Hersteller-Standard-SSIDs (z.B. \"default\", \"linksys\", \"FRITZ!Box 7590\"). Versuchen Sie, sich an den Administrations-Schnittstellen der Access Points mit bekannten Standard-Anmeldedaten anzumelden (z.B. admin/admin)."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A5-m2",
                    "uuid": "0ad03286-522a-44ef-b8f5-c6862c80526d",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Voreingestellte SSIDs und WLAN-Passwörter (PSK) werden geändert. Das administrative Zugangspasswort des Access Points bleibt jedoch auf dem Standardwert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die grundlegendsten Änderungen für den WLAN-Betrieb werden vorgenommen. Die Absicherung des administrativen Zugangs zum Gerät selbst wird jedoch übersehen. Unsichere Administrationsprotokolle wie Telnet oder HTTP sind möglicherweise noch aktiv."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie, ob die SSIDs individualisiert sind. Versuchen Sie weiterhin, sich mit Standard-Passwörtern an der Management-Oberfläche der APs anzumelden. Überprüfen Sie mit einem Portscanner (z.B. `nmap`), ob unsichere Management-Ports wie Telnet (23) oder HTTP (80) auf den AP-IP-Adressen offen sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A5-m3",
                    "uuid": "082f3f46-abaa-4497-a415-8d30357a5ae7",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Access Points DÜRFEN NICHT in der Konfiguration des Auslieferungszustandes verwendet werden. Voreingestellte SSIDs (Service Set Identifiers), Zugangskennwörter oder kryptografische Schlüssel MÜSSEN vor dem produktiven Einsatz geändert werden. Außerdem MÜSSEN unsichere Administrationszugänge abgeschaltet werden. Access Points DÜRFEN NUR über eine geeignet verschlüsselte Verbindung administriert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine verbindliche Checkliste oder ein Konfigurations-Template für die Inbetriebnahme von Access Points. Dieses schreibt vor, dass alle Standard-Credentials (Admin-Passwort, PSK) und die SSID geändert werden müssen. Zudem müssen unsichere Dienste wie Telnet oder HTTP deaktiviert und durch sichere Alternativen wie SSH und HTTPS ersetzt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Fordern Sie die Konfigurations-Checkliste für neue Access Points an. Überprüfen Sie stichprobenartig die Konfiguration einiger APs daraufhin, ob alle Standard-Einstellungen geändert wurden. Führen Sie einen Portscan auf die APs durch, um sicherzustellen, dass nur verschlüsselte Administrationsprotokolle (z.B. SSH Port 22, HTTPS Port 443) aktiv sind. Automatisierte Prüfung: Ein Skript kann eine Liste von AP-IPs mit `nmap -p 23,80 <AP-IP>` scannen und alle Hosts melden, bei denen diese Ports offen sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A5-m4",
                    "uuid": "e1634c33-8c55-42aa-ae04-2c5432b8f97d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine zentrale Managementlösung wird verwendet, um eine einheitliche und sichere Basiskonfiguration auf alle Access Points auszurollen. Jede Abweichung von dieser Konfiguration wird erkannt und gemeldet."
                      },
                      {
                        "name": "guidance",
                        "value": "Anstatt jeden AP manuell zu konfigurieren, wird ein WLAN-Controller oder eine Cloud-Management-Plattform genutzt. Dort wird ein sicheres Konfigurationsprofil definiert und zentral auf alle Geräte angewendet. Das System überwacht die Einhaltung dieses Profils."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Konfigurations-Templates im zentralen WLAN-Management-System. Stellen Sie sicher, dass diese den Sicherheitsvorgaben entsprechen. Suchen Sie nach Alarmierungsregeln, die bei Konfigurationsabweichungen auslösen. Ändern Sie testweise eine Einstellung an einem AP manuell (sofern möglich) und prüfen Sie, ob eine Warnung generiert oder die Änderung automatisch zurückgesetzt wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A5-m5",
                    "uuid": "58658e2a-5871-45b9-9d08-cb1daa6ed765",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die sichere Basiskonfiguration wird als 'Configuration as Code' verwaltet und automatisiert über eine CI/CD-Pipeline auf die Access Points ausgerollt. Jede Konfigurationsänderung erfordert einen Review- und Genehmigungsprozess im Code-Repository. Die Integrität der AP-Firmware wird regelmäßig überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Die AP-Konfigurationen werden in einer Versionskontrolle (z.B. Git) als Code (z.B. Ansible-Playbooks, Terraform-Skripte) gespeichert. Änderungen sind nachvollziehbar und müssen genehmigt werden. Automatisierte Pipelines testen und verteilen die Konfiguration. Zusätzlich werden die Hashes der laufenden Firmware auf den APs mit den Hersteller-Sollwerten verglichen, um Manipulationen zu erkennen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie das Git-Repository mit den Konfigurations-Skripten. Analysieren Sie den Genehmigungsprozess (z.B. Pull Requests). Überprüfen Sie die CI/CD-Pipeline-Protokolle. Fordern Sie die Ergebnisse der Firmware-Integritäts-Checks an oder führen Sie eine solche Prüfung durch, falls die Management-Lösung dies unterstützt (z.B. per API-Call oder CLI-Befehl am Controller)."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "1e5886f3-c2f1-409a-a0ca-a500f84e068b",
                "control-id": "ARCH.3.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Treatment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.2.1.A3-m1",
                    "uuid": "0ab5226f-069f-496d-bade-ed748dd444b0",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die WLAN-Kommunikation ist teilweise verschlüsselt, aber es werden unsichere Verfahren wie WEP oder WPA (TKIP) für einzelne Netze, z.B. aus Kompatibilitätsgründen, noch toleriert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt kein durchgängiges Konzept für die WLAN-Verschlüsselung. Die Sicherheit ist heterogen, und für ältere Geräte werden bewusst unsichere Protokolle beibehalten. Pre-Shared Keys sind oft einfach und werden nicht geändert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Führen Sie einen WLAN-Scan durch (z.B. mit `inSSIDer` oder `airodump-ng`), um Netze mit unsicherer Verschlüsselung (WEP, WPA) zu identifizieren. Befragen Sie die Administratoren nach den Gründen für deren Verwendung."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A3-m2",
                    "uuid": "acf4b7dc-beea-4364-b2bb-02da254cb03f",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "WPA2 wird als Standard für die Verschlüsselung verwendet, jedoch wird bei WPA2-PSK die Komplexität der Schlüssel nicht systematisch durchgesetzt oder überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle WLANs sind mindestens mit WPA2 geschützt. Die verwendeten Pre-Shared Keys (PSKs) sind jedoch oft kurz, leicht zu erraten oder seit langer Zeit unverändert im Einsatz."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Konfiguration aller SSIDs auf den Access Points. Verifizieren Sie, dass WPA2 oder besser als Verschlüsselungsmethode eingestellt ist. Fordern Sie die verwendeten PSKs an und bewerten Sie deren Komplexität manuell oder mit einem Passwort-Stärke-Tool."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A3-m3",
                    "uuid": "8f377704-6328-4d66-a92f-91729f30c4c5",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Kommunikation über die Luftschnittstelle MUSS komplett kryptografisch abgesichert werden. Kryptografische Verfahren, die unsicherer als WPA2 sind, DÜRFEN NICHT mehr eingesetzt werden. Wird WPA2 mit Pre-Shared Keys (WPA2-PSK) verwendet, dann MUSS ein komplexer Schlüssel mit einer Mindestlänge von 20 Zeichen verwendet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist eine verbindliche Regel etabliert, dass jede WLAN-Übertragung mindestens mit WPA2 verschlüsselt sein muss. Ältere, unsichere Protokolle sind verboten. Bei der Nutzung von gemeinsam genutzten Schlüsseln (PSK) wird eine strenge Komplexitätsrichtlinie (mindestens 20 Zeichen, Mix aus Zeichenarten) durchgesetzt und dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Konfiguration aller Access Points und stellen Sie sicher, dass kein Protokoll schwächer als WPA2 aktiv ist. Lassen Sie sich die für WPA2-PSK genutzten Schlüssel vorlegen und verifizieren Sie deren Länge und Komplexität. Automatisierte Prüfung: Ein Konfigurations-Audit-Skript kann die AP-Konfigurationen parsen und auf Einhaltung der Krypto-Vorgaben prüfen. `grep -E 'wpa_passphrase' /etc/hostapd/hostapd.conf | awk '{print $NF}' | tr -d '\"' | awk 'length < 20'` könnte eine einfache Prüfung sein."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A3-m4",
                    "uuid": "bf5c1c1c-2ede-4f21-8c0f-32af26a35374",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für Unternehmensnetze wird standardmäßig WPA2/WPA3-Enterprise mit individueller Authentisierung über einen RADIUS-Server eingesetzt. PSKs werden nur noch für dedizierte Netze (z.B. Gäste, IoT) verwendet und dort regelmäßig und nach einem definierten Prozess rotiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Anstatt eines gemeinsamen Schlüssels für alle, authentisieren sich Benutzer und Geräte mit individuellen Anmeldedaten (z.B. Benutzername/Passwort oder Zertifikat) gegen einen zentralen Server. Dies erhöht die Sicherheit und Nachvollziehbarkeit. Die Handhabung von PSKs für Spezialnetze ist in einem Richtliniendokument geregelt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Konfiguration der Unternehmens-SSIDs auf den Einsatz von WPA2/WPA3-Enterprise (802.1X). Prüfen Sie die Konfiguration des RADIUS-Servers. Fordern Sie die Richtlinie und die Nachweise (z.B. Tickets, Log-Auszüge) für die Rotation der PSKs in Gast- und IoT-Netzen an."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A3-m5",
                    "uuid": "32590b63-4d1c-44f4-aad0-34973847ce75",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für alle Unternehmens-Clients wird WPA3-Enterprise mit EAP-TLS (zertifikatbasierte Authentisierung) verpflichtend eingesetzt. Die Zertifikate werden automatisiert über eine MDM/PKI-Lösung ausgerollt und verwaltet. PSKs für Gastnetze werden dynamisch und pro-Sitzung generiert oder täglich automatisiert rotiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die sicherste Authentisierungsmethode wird durchgesetzt, bei der sich Client und Netzwerk gegenseitig über Zertifikate authentifizieren, was Man-in-the-Middle-Angriffe erschwert. Der gesamte Lebenszyklus der Zertifikate und Schlüssel ist automatisiert. Gastzugänge sind hochgradig dynamisch und kurzlebig."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie die Konfiguration der MDM-Lösung für das automatische Ausrollen von Client-Zertifikaten. Verifizieren Sie die EAP-TLS-Konfiguration am RADIUS-Server und an den Access Points. Überprüfen Sie die Lösung für die dynamische PSK-Generierung (z.B. über ein Captive Portal oder eine Management-API). Automatisierte Prüfung: Ein SIEM-Dashboard überwacht die Authentisierungs-Logs des RADIUS-Servers und alarmiert bei fehlgeschlagenen EAP-TLS-Versuchen oder Fallbacks auf schwächere Methoden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "4a773749-6138-413c-a19c-35f945d69979",
                "control-id": "ARCH.5.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.2.1.A16-m1",
                    "uuid": "25c07d8f-ceca-4394-8157-897da2fb1d8b",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es findet keine zusätzliche Absicherung des Übergangs vom WLAN zum LAN statt."
                      },
                      {
                        "name": "guidance",
                        "value": "WLAN und LAN werden als eine einzige, vertrauenswürdige Zone betrachtet. Es gibt keine Kontrollinstanz zwischen den beiden Netzwerkteilen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Wie bei NET.2.1.A9 Level 1: Führen Sie einen Netzwerkscan aus dem WLAN durch. Die direkte Erreichbarkeit von kritischen Systemen im LAN ohne eine zwischengeschaltete Firewall belegt diesen Zustand."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A16-m2",
                    "uuid": "ac37c19f-9b0f-4708-8925-3b73a46be6d8",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Übergang vom WLAN zum LAN ist durch einen einfachen Paketfilter (Router ACL) abgesichert, der auf Basis von IP-Adressen und Ports filtert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine grundlegende Filterung, die beispielsweise den direkten Zugriff vom WLAN auf das Management-Netz unterbindet. Die Filterung ist zustandslos und bietet keinen Schutz vor komplexeren Angriffen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Access Control Lists (ACLs) auf dem Router, der das WLAN- und LAN-Segment verbindet. Analysieren Sie, ob die Regeln eine sinnvolle, aber grundlegende Trennung bewirken."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A16-m3",
                    "uuid": "81ee2192-b903-4ae0-a4b8-1ed10fbf44b7",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Übergang zwischen WLANs und LAN wird standardmäßig durch eine Stateful Firewall abgesichert, die den gesamten Verkehr kontrolliert."
                      },
                      {
                        "name": "guidance",
                        "value": "Dies entspricht der Basisanforderung einer sicheren Netzwerkanbindung. Eine zustandsbehaftete Firewall überwacht alle Verbindungen und lässt nur erlaubten Verkehr passieren. Dies ist eine robuste Standardmaßnahme."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Netzwerkarchitektur und die Konfiguration der Firewall. Stellen Sie sicher, dass der gesamte Verkehr zwischen WLAN und LAN diese Firewall passieren muss und dass die Regeln dem Need-to-know-Prinzip folgen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A16-m4",
                    "uuid": "5cff1fed-4400-4acb-b264-3ae6519486ec",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wird eine WLAN-Infrastruktur an ein LAN angebunden, wird der Übergang zwischen WLANs und LAN entsprechend des höheren Schutzbedarfs zusätzlich abgesichert, beispielsweise durch eine Next-Generation Firewall (NGFW) mit Intrusion Prevention System (IPS)."
                      },
                      {
                        "name": "guidance",
                        "value": "Da das WLAN als potenziell unsicherer gilt, werden hier strengere Maßstäbe angelegt als bei der Segmentierung interner LANs. Die Firewall am WLAN-Übergang führt eine Tiefenprüfung der Pakete (Deep Packet Inspection) durch, analysiert den Verkehr auf Anwendungsebene (Layer 7) und sucht aktiv nach bekannten Angriffsmustern (IPS)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Lassen Sie sich die Konfiguration der Firewall am WLAN-Übergang zeigen. Überprüfen Sie, ob Funktionen wie Application Control und IPS aktiv sind und mit aktuellen Signaturen arbeiten. Analysieren Sie die Protokolle des IPS auf Alarme, die aus dem WLAN stammen."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A16-m5",
                    "uuid": "feea61be-af0e-4e45-8ac7-816f4eef5df4",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Übergang wird durch eine mehrstufige Sicherheitsarchitektur geschützt, die eine NGFW/IPS, eine Web Application Firewall (WAF) für den Zugriff auf Webanwendungen und eine Malware-Analyse-Lösung (Sandboxing) für Dateiübertragungen umfasst."
                      },
                      {
                        "name": "guidance",
                        "value": "Für den höchstmöglichen Schutz wird eine verteidigte Architektur (Defense in Depth) implementiert. Jeder Verkehrstyp wird durch ein spezialisiertes Sicherheitssystem geprüft. Dies schützt nicht nur vor Netzwerkangriffen, sondern auch vor Angriffen auf Anwendungsebene und vor Zero-Day-Malware, die über das WLAN ins Unternehmen gelangen könnte."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Analysieren Sie das detaillierte Architekturdiagramm für den WLAN-LAN-Übergang. Prüfen Sie die Konfiguration und die Protokolle der einzelnen Komponenten (NGFW, WAF, Sandbox). Verfolgen Sie den Datenpfad für verschiedene Anwendungsfälle (z.B. Web-Zugriff, Dateidownload) durch die gesamte Sicherheitskette."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "d8ce9aa3-2125-454a-b7bd-d95fd26d37f6",
                "control-id": "ASST.2.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Audit",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "TEST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.2.1.A13-m1",
                    "uuid": "057c03f4-8b17-4996-9949-de228f5e9641",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Sicherheitsüberprüfungen von WLANs finden nicht statt, oder nur reaktiv, wenn ein Problem auftritt."
                      },
                      {
                        "name": "guidance",
                        "value": "Das WLAN wird betrieben nach dem Motto 'never touch a running system'. Solange es keine Beschwerden von Benutzern gibt, wird der Zustand des WLANs nicht aktiv überprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Fragen Sie nach Berichten oder Protokollen von durchgeführten WLAN-Sicherheitschecks. Wenn keine vorgelegt werden können, ist dieser Reifegrad erreicht."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A13-m2",
                    "uuid": "175c17bb-7bd7-4960-86f5-3df323caf0e3",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Gelegentlich werden manuelle Suchen nach unbefugten Access Points durchgeführt, zum Beispiel durch eine Begehung mit einem Laptop und einer WLAN-Scanner-Software."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt ein Bewusstsein für die Gefahr von Rogue APs. In unregelmäßigen Abständen sucht ein Administrator aktiv nach fremden WLANs in den Räumlichkeiten. Andere Sicherheitsaspekte werden nicht geprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Befragen Sie die Administratoren, wie und wie oft sie nach Rogue APs suchen. Lassen Sie sich die Ergebnisse der letzten Suche zeigen, auch wenn diese nur informell sind (z.B. ein Screenshot)."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A13-m3",
                    "uuid": "27e4f685-204d-4c71-9e21-23e637852b29",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "WLANS MÜSSEN regelmäßig daraufhin überprüft werden, ob eventuell Sicherheitslücken existieren. Zusätzlich MUSS regelmäßig nach unbefugt installierten Access Points innerhalb der bereitgestellten WLANs gesucht werden. Die Ergebnisse von Sicherheitschecks MÜSSEN nachvollziehbar dokumentiert und mit dem Soll-Zustand abgeglichen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist ein fester Prozess etabliert, um in regelmäßigen Abständen (z.B. quartalsweise) das WLAN auf Sicherheitsmängel zu prüfen. Dies umfasst mindestens die Suche nach Rogue APs und eine Überprüfung der Konfigurationen auf Einhaltung der Sicherheitsrichtlinie. Jede Prüfung wird protokolliert und Abweichungen werden erfasst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Fordern Sie den Plan für die regelmäßigen WLAN-Sicherheitschecks an. Prüfen Sie die Berichte der letzten durchgeführten Checks. Vergleichen Sie die dokumentierten Ergebnisse mit dem Soll-Zustand aus der WLAN-Sicherheitsrichtlinie."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A13-m4",
                    "uuid": "b812ce5c-0ea4-47fa-b9c2-af33378b0f2a",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die regelmäßigen Sicherheitschecks umfassen auch die Messung von Performance und Abdeckung. Abweichungen vom Soll-Zustand werden systematisch untersucht und über einen Mängelbehebungsprozess nachverfolgt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Checks gehen über reine Sicherheitsaspekte hinaus und bewerten auch die Qualität des Dienstes. Es wird nicht nur festgestellt, DASS eine Abweichung existiert, sondern es wird auch die Ursache analysiert und die Behebung des Mangels bis zum Abschluss verfolgt und dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Prüfen Sie in den Berichten der Sicherheitschecks, ob auch Performance- und Abdeckungsmessungen enthalten sind. Fordern Sie Nachweise für die Untersuchung und Behebung von festgestellten Abweichungen an (z.B. Einträge in einem Ticket-System)."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A13-m5",
                    "uuid": "6f949110-ef60-4f83-b1c3-3ad529632eee",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Sicherheitschecks sind weitgehend automatisiert. Ein Wireless Intrusion Detection/Prevention System (WIDS/WIPS) sucht kontinuierlich nach Rogue APs und anderen Anomalien. Regelmäßige, automatisierte Penetrationstests prüfen die Widerstandsfähigkeit des WLANs gegen Angriffe."
                      },
                      {
                        "name": "guidance",
                        "value": "Anstatt manueller, periodischer Prüfungen, überwacht ein dediziertes System das Funknetz in Echtzeit. Dieses System erkennt nicht nur Rogue APs, sondern auch eine Vielzahl von Angriffstechniken. Die Ergebnisse werden in einem zentralen Dashboard visualisiert. Ergänzend dazu wird die Sicherheit proaktiv durch simulierte Angriffe getestet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Lassen Sie sich das Dashboard des WIDS/WIPS zeigen und analysieren Sie die erkannten Ereignisse und Alarme. Fordern Sie die Berichte der letzten automatisierten Penetrationstests für das WLAN an. Prüfen Sie, wie auf die Ergebnisse dieser Tests und die Alarme des WIDS/WIPS reagiert wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "86e08767-b20a-49b7-bcb7-107dd0404388",
                "control-id": "DET.4.10",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "NET.2.1.A18-m1",
                    "uuid": "c02f62ca-9ba8-49e7-a18e-a1a4d9dd91db",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden keine spezialisierten Systeme zur Erkennung oder Verhinderung von Angriffen im WLAN eingesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Überwachung der WLAN-Sicherheit beschränkt sich auf die Analyse von Logdateien des Controllers oder der Access Points, falls überhaupt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Fragen Sie die Administratoren, wie sie Angriffe wie einen 'Evil Twin' oder eine Deauthentifizierungs-Attacke erkennen würden. Das Fehlen eines dedizierten Werkzeugs oder Prozesses deutet auf diesen Reifegrad hin."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A18-m2",
                    "uuid": "f18b71bf-1623-4479-8e88-b955ee70bd03",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die eingesetzte WLAN-Management-Lösung verfügt über eine einfache Funktion zur Erkennung von unautorisierten Access Points (Rogue AP Detection), die auf passiven Scans basiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die eigenen Access Points scannen nebenbei die Umgebung und melden, wenn sie andere WLANs auf den Kanälen hören. Dies bietet eine grundlegende, aber oft langsame und unzuverlässige Erkennung von Rogue APs."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Konfiguration der WLAN-Management-Lösung. Suchen Sie nach der Funktion 'Rogue AP Detection' und prüfen Sie deren Konfiguration und die Liste der erkannten Geräte. Bewerten Sie, wie die Administratoren auf solche Meldungen reagieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A18-m3",
                    "uuid": "730f6596-b924-4a7a-84d0-e6bf46d5247b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird ein Wireless Intrusion Detection System (WIDS) eingesetzt. Dieses System ist in der Lage, eine Reihe von bekannten WLAN-Angriffen und Anomalien zu erkennen und Administratoren darüber zu alarmieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein dediziertes System oder eine erweiterte Funktion der Management-Lösung überwacht aktiv den Funkraum. Es erkennt nicht nur Rogue APs, sondern auch Angriffsmuster wie 'Evil Twins', Ad-hoc-Netzwerke von Clients oder DoS-Angriffe. Die Erkennungen lösen Alarme aus, die manuell von Administratoren bearbeitet werden müssen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Lassen Sie sich die Konsole des WIDS zeigen. Überprüfen Sie die Liste der aktivierten Signaturen oder Erkennungsregeln. Analysieren Sie die generierten Alarme der letzten Wochen und fragen Sie nach, wie diese bearbeitet wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A18-m4",
                    "uuid": "fc21c9d1-f1bb-4b93-8555-dc95e53fe38c",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird ein Wireless Intrusion Prevention System (WIPS) eingesetzt. Dieses System kann auf erkannte Bedrohungen nicht nur alarmieren, sondern auch aktiv und automatisiert Gegenmaßnahmen einleiten."
                      },
                      {
                        "name": "guidance",
                        "value": "Das System geht einen Schritt über die reine Erkennung (Detection) hinaus. Erkennt das WIPS beispielsweise einen 'Evil Twin', kann es gezielte Deauthentifizierungs-Pakete an die Clients senden, die sich mit diesem verbinden, um sie zu schützen. Alternativ kann es über die Switch-Infrastruktur den Netzwerkport lokalisieren und abschalten, an dem der Rogue AP angeschlossen ist."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Überprüfen Sie die Konfiguration des WIPS. Stellen Sie sicher, dass die Präventionsfunktionen (automatische Gegenmaßnahmen) für bestimmte Angriffstypen aktiviert sind. Fordern Sie Protokolle an, die automatisch durchgeführte Abwehrmaßnahmen belegen. Testen Sie dies in einer kontrollierten Umgebung, indem Sie einen Test-Angriff starten."
                      }
                    ]
                  },
                  {
                    "statement-id": "NET.2.1.A18-m5",
                    "uuid": "a6792944-0bb1-4097-b320-c47747bd2397",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das WIPS ist vollständig in eine SIEM/SOAR-Plattform integriert. Die von ihm erkannten Ereignisse werden mit anderen Sicherheitsinformationen korreliert, und die Reaktionen werden durch automatisierte Playbooks orchestriert, die den gesamten Incident-Response-Prozess abdecken."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein WIPS-Alarm ist nicht nur ein isoliertes Ereignis. Er wird an das SIEM gesendet und dort z.B. mit den Authentisierungs-Logs vom RADIUS-Server und den Endpoint-Security-Alarmen korreliert. Ein komplexer Angriff kann so erkannt werden. Ein SOAR-Playbook könnte dann automatisiert den Client im NAC sperren, ein Ticket im Helpdesk erstellen und den Benutzer per E-Mail informieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Analysieren Sie die Regeln und Dashboards im SIEM, die WIPS-Daten verarbeiten. Überprüfen Sie die SOAR-Playbooks für WLAN-spezifische Sicherheitsvorfälle. Verfolgen Sie einen Test-Alarm vom WIPS durch die gesamte Kette von SIEM-Korrelation bis zur Ausführung des SOAR-Playbooks und der Ticketerstellung."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}