{
  "component-definition": {
    "uuid": "30a19b95-d39b-4053-acc1-3afecf0b06c9",
    "metadata": {
      "title": "NET.4.2 TK-Anwendungen - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:45:31.397791+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "7de358bb-1734-4489-af8a-286848004a10",
        "type": "interconnection",
        "title": "NET.4.2 TK-Anwendungen",
        "description": "This component represents the implementation of all controls for Baustein NET.4.2.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Voice over IP (VoIP) bezeichnet das Telefonieren über Datennetze, insbesondere über das Internet. Um Signalisierungsinformationen zu übertragen, beispielsweise bei einem Anruf, werden spezielle Signalisierungsprotokolle eingesetzt. Die eigentlichen Nutzdaten wie Sprache oder Video werden mit Hilfe eines Medientransportprotokolls übermittelt. Beide Protokolle werden jeweils benötigt, um eine Multimediaverbindung aufzubauen und aufrechtzuerhalten. Bei einigen Verfahren wird nur ein Protokoll sowohl für die Signalisierung als auch für den Medientransport benötigt."
          },
          {
            "name": "Zielsetzung",
            "value": "Dieser Baustein betrachtet die Sicherheitsaspekte der Endgeräte und Vermittlungseinheiten (Middleware) von VoIP. Die hier beschriebenen Komponenten gleichen hinsichtlich ihrer Funktionalität den im Baustein NET.4.1 TK-Anlagen beschriebenen Telekommunikationsanlagen."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein NET.4.2 VoIP ist auf alle Kommunikationsnetze anzuwenden, in denen VoIP eingesetzt wird. Da VoIP über Datennetze betrieben wird, sind zusätzlich zu diesem Baustein die Anforderungen der Bausteine NET.1.1 Netzarchitektur- und Design oder NET.3.2 Firewall geeignet mit zu berücksichtigen.<BR><BR>In diesem Baustein werden die Sicherheitsaspekte von VoIP-Komponenten und der Sprachübertragung über VoIP betrachtet. Tauschen leitungsvermittelnde TK-Anlagen Informationen untereinander über ein Datennetz aus, ist dieser Baustein ebenfalls anzuwenden.<BR><BR>Die spezifischen Gefährdungen und Anforderungen von klassischen TK-Anlagen sowie Hybrid-Anlagen werden in dem Baustein NET.4.1 TK-Anlagen betrachtet.<BR><BR>Oft wird VoIP-Software nicht auf eigens dafür vorgesehene Hardware betrieben, sondern auf Standard-IT. Werden Softphones auf Clients installiert, sollten die Anforderungen des Bausteins SYS.2.1 Allgemeiner Client sowie der betriebssystemspezifischen Bausteine berücksichtigt werden. Wird Software für VoIP auf Servern betrieben, sollten neben den Anforderungen der betriebssystemspezifischen Bausteine die Anforderungen des Bausteins SYS.1.1 Allgemeiner Server erfüllt werden."
          },
          {
            "name": "Fehlerhafte Konfiguration der VoIP-Middleware",
            "value": "Eine VoIP-basierte Telefonanlage kann in ähnlicher Weise von Fehlkonfigurationen betroffen sein wie eine leitungsvermittelnde Telefonlösung. So könnten beispielsweise Telefonbenutzenden falsche Telefonnummern zugeordnet werden oder die gesamte Telefoninfrastruktur könnte ausfallen. Auch tendenziell unkritische Fehler, wie ein falsch geschriebener Name im Telefonbuch, können nicht ausgeschlossen werden.<BR><BR>Wird mittels VoIP kommuniziert, sind in der Regel mehrere IT-Systeme beteiligt. Wird SIP als Initialisierungsprotokoll eingesetzt, werden meist Systeme wie Registrare, SIP-Proxy-Server und Location-Server für die Kommunikation benötigt. Ändert sich die VoIP-Infrastruktur, müssen alle IT-Systeme angepasst werden. Dadurch können leicht Konfigurationsfehler entstehen. Auch wenn sich alle Dienste auf einem Server befinden, müssen diese häufig einzeln konfiguriert werden. Wird nur ein System fehlerhaft geändert, kann die gesamte Telefoninfrastruktur möglicherweise nicht mehr genutzt werden."
          },
          {
            "name": "Fehlerhafte Konfiguration der VoIP-Komponenten",
            "value": "Unabhängig davon, ob es sich bei VoIP-Komponenten um dedizierte Hardware („Appliances“) oder softwarebasierte Systeme handelt, ist die Konfiguration entscheidend für die fehlerfreie Funktion des Systems. Neben den Einstellungen zur Signalisierung, die bei der Planung festgelegt wurden, spielt das Übertragungsverfahren für die Medienströme eine wichtige Rolle. Durch ein Kompressionsverfahren kann die Größe der Datenpakete mit den Sprachinformationen verkleinert werden.<BR><BR>Durch die fehlerhafte Konfiguration des Übertragungsverfahrens können Probleme bei der Übertragung auftreten. Wird ein ungeeignetes Verfahren eingesetzt und werden Sprachinformationen zu stark komprimiert, verschlechtert sich oft die Sprachqualität. Wird hingegen ein Verfahren gewählt, das eine zu geringe Kompression vornimmt, wird der Nachrichtenstrom nicht ausreichend vermindert und das Datennetz kann überlastet werden."
          },
          {
            "name": "Abhören von Telefongesprächen",
            "value": "Wenn Telefongespräche oder Daten unverschlüsselt übertragen werden, könnten Angreifende grundsätzlich Informationen mithören oder mitlesen. So könnten sie beispielsweise die Telefonkabel direkt anzapfen oder an einer zwischen den Gesprächsteilnehmern vermittelnden TK-Anlage lauschen. Bei VoIP können Telefongespräche und Datenübertragungen sogar einfacher als bei klassischen TK-Anlagen abgehört werden. Alle Sprachinformationen werden innerhalb eines Medienstroms, beispielsweise mit dem Realtime Transport Protocol (RTP), übertragen. Durch Techniken wie Spoofing und Sniffing stehen bei VoIP den Angreifenden auch alle Möglichkeiten von Angriffen in Datennetzen zur Verfügung.<BR><BR>Bei vielen TK-Anlagen können Anrufende den Empfangenden Nachrichten hinterlassen, wenn diese zum Zeitpunkt des Anrufs telefonisch nicht erreichbar sind. Einige Anrufbeantworter, vor allem bei VoIP-Anlagen, verschicken diese Informationen als Audio-Datei in einer E-Mail. Der Inhalt dieser E-Mail könnte direkt von einem Angreifenden abgefangen und angehört werden."
          },
          {
            "name": "Missbrauch frei zugänglicher Telefonanschlüsse",
            "value": "Oft werden Telefone betrieben, die keinen Benutzenden persönlich zugeordnet sind. Einige dieser Telefone, wie zum Beispiel solche in Druckerräumen, sind nur einem eingeschränkten Personenkreis zugänglich. Andererseits sind Telefone häufig in Bereichen zu finden, die für Besuchende frei zugänglich sind. Dazu zählen beispielsweise Parkhäuser oder Bereiche vor Zugangskontrollsystemen. Besitzen diese Telefone ein elektronisches Telefonbuch, in dem interne Telefonnummern gespeichert sind, könnten diese Nummern ungewollt nach außen gelangen.<BR><BR>Beim Einsatz von VoIP-Telefonen in frei zugänglichen Bereichen können weitere Aspekte relevant sein. Denn sie haben einen hohen Software-Anteil und werden häufig in Datennetzen betrieben, die auch für andere IT-Anwendungen genutzt werden. Angreifende könnten deshalb durch den direkten Zugriff auf Geräteinformationen versuchen, Schwachstellen in der VoIP-Software auszunutzen oder selbst schädliche Software zu installieren.<BR><BR>VoIP-Telefone müssen an ein Datennetz angeschlossen sein. Angreifende könnten an diesen Netzanschluss ein mobiles IT-System anschließen und so unter Umständen auf das von außen durch eine Firewall geschützte interne Netz zugreifen. Diesen Zugang können sie möglicherweise für Angriffe auf die Vertraulichkeit, Integrität und Verfügbarkeit ausnutzen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "9238f4b9-97bf-4cd8-8988-c88a0a8caeb6",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/tk-anwendungen_profile.json",
            "description": "Implementation for all controls in Baustein NET.4.2",
            "implemented-requirements": [
              {
                "uuid": "3c2e62ac-2fb0-4a03-86f6-afea88b54f9a",
                "control-id": "ASST.7.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Improvement",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ASST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "net.4.2.a12-m1",
                    "uuid": "e5fbbae8-e75a-4b17-b2e1-fa4d61cd58ad",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ausgemusterte VoIP-Geräte werden einfach vom Netz genommen und ohne Löschung der Konfiguration oder Daten gelagert oder entsorgt. Beschriftungen, die auf die Institution oder den Benutzer hinweisen, werden nicht entfernt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt keinen Prozess für die Außerbetriebnahme. Geräte werden im Lager gestapelt oder direkt dem Elektroschrott zugeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer inspiziert das Lager für ausgemusterte IT-Geräte und prüft stichprobenartig VoIP-Telefone, ob diese noch Konfigurationsdaten (z.B. SIP-Credentials, Telefonbücher) enthalten oder Beschriftungen aufweisen."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a12-m2",
                    "uuid": "e6074886-bbf5-4582-887c-df9573e67d3c",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Auf allen VoIP-Komponenten wird vor der Entsorgung oder Weitergabe ein 'Factory Reset' (Zurücksetzen auf Werkseinstellungen) durchgeführt. Dies erfolgt nach einer einfachen Checkliste."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein einfacher Prozess wird etabliert: 'Vor der Entsorgung Knopf X für 10 Sekunden drücken'. Die Durchführung wird nicht gesondert dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bittet um die Vorführung des 'Factory Reset'-Prozesses. Es wird geprüft, ob eine entsprechende Anweisung für das Personal existiert. An einem ausgemusterten Gerät wird geprüft, ob die Konfiguration tatsächlich gelöscht wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a12-m3",
                    "uuid": "6d83756b-17ac-430a-90ef-38efc9db186a",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wenn VoIP-Komponenten außer Betrieb genommen oder ersetzt werden, SOLLTEN alle sicherheitsrelevanten Informationen (z.B. Konfiguration, Telefonbücher, Anruflisten, Zugangsdaten) von den Geräten gelöscht werden. Vertrauliche Informationen SOLLTEN auch von zugehörigen Backup-Medien gelöscht werden. Alle Beschriftungen SOLLTEN vor der Entsorgung entfernt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein dokumentierter Prozess für die Außerbetriebnahme von VoIP-Komponenten wird etabliert. Dieser Prozess schreibt das sichere Löschen der Konfiguration (z.B. durch Factory Reset und ggf. Überschreiben), das Entfernen von Beschriftungen und die Löschung des Geräts aus der zentralen Verwaltung und den Backups vor."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert den Prozess zur Außerbetriebnahme an und lässt ihn sich demonstrieren. Es wird geprüft, ob die Durchführung der Löschung protokolliert wird. Es wird kontrolliert, ob die entsprechenden Einträge in der VoIP-Anlage und im Backup-System entfernt wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a12-m4",
                    "uuid": "997aeff3-7d92-426e-9430-108f1b71ccdd",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Nach dem Löschvorgang SOLLTE überprüft und dokumentiert werden, ob die Daten auch tatsächlich erfolgreich und unwiederbringlich entfernt wurden. Es SOLLTE frühzeitig mit Herstellenden oder Service-Unternehmen geklärt werden, welche Maßnahmen zur Löschung sicherheitsrelevanter Informationen mit den Vertrags- und Garantiebedingungen vereinbar sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Löschprozess wird durch einen Vier-Augen-Prinzip verifiziert. Die erfolgreiche Löschung wird in einem Übergabeprotokoll bestätigt. Bei gemieteten Geräten werden die Anforderungen an die Datenlöschung bei Vertragsende bereits im Vertrag festgelegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Protokolle zur Außerbetriebnahme und prüft, ob die Verifizierung der Löschung dokumentiert ist. Bei Mietverträgen wird geprüft, ob diese Klauseln zur Datensicherheit bei Vertragsende enthalten."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a12-m5",
                    "uuid": "ff927eff-aa68-4387-acd3-d81f9bcafdf6",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Prozess zur Außerbetriebnahme ist vollständig auditiert und nachvollziehbar. Für Geräte, die sensible Daten enthalten, wird eine kryptografische Löschung (Crypto Erase) oder die physische Zerstörung der Speichermedien angewendet. Für jedes entsorgte Gerät wird von einem zertifizierten Dienstleister ein Vernichtungszertifikat eingeholt. Alle zugehörigen Konten, Konfigurationen und Firewall-Regeln werden automatisiert aus den Verwaltungssystemen entfernt (De-Provisioning)."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein zertifizierter Entsorgungsfachbetrieb wird mit der Datenvernichtung beauftragt. Der Außerbetriebnahmeprozess ist in ein automatisiertes Skript oder einen Workflow im IT-Service-Management-Tool integriert, das sicherstellt, dass alle digitalen Spuren des Geräts entfernt werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert eine Stichprobe von Vernichtungszertifikaten an. Der automatisierte De-Provisioning-Prozess wird analysiert und getestet. Es wird geprüft, ob nach der Ausführung des Prozesses noch Referenzen auf das ausgemusterte Gerät in Konfigurationen oder Datenbanken existieren."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "9dcd5df6-85ba-4dc5-9b42-574ef6735815",
                "control-id": "BES.2.1.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BES",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "net.4.2.a9-m1",
                    "uuid": "aaa2f6c7-8b89-42a9-a0cb-36b804b90905",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "VoIP-Komponenten werden hauptsächlich nach Preis, Markenbekanntheit oder Empfehlung ausgewählt. Es gibt keine formale Anforderungsliste, die als Grundlage für die Auswahl dient."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Beschaffung erfolgt oft reaktiv, wenn eine alte Anlage ausfällt, und orientiert sich an dem, was der bevorzugte Lieferant gerade anbietet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer bittet um die Dokumentation des Auswahlprozesses für die aktuellen VoIP-Komponenten. Fehlt diese oder besteht sie nur aus Angeboten, ist dies ein Indikator für diese Reifegradstufe."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a9-m2",
                    "uuid": "64e42f42-2ec0-4110-b12c-b6771fc7e243",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Vor der Beschaffung wird eine grundlegende Liste mit funktionalen Anforderungen erstellt. Produkte am Markt werden anhand dieser Liste und der Herstellerangaben verglichen. Sicherheitsmerkmale spielen eine untergeordnete Rolle."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine einfache Feature-Tabelle wird in einer Tabellenkalkulation erstellt, um die Angebote verschiedener Hersteller zu vergleichen. Die Entscheidung basiert auf der Erfüllung der meisten funktionalen Anforderungen zum besten Preis."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Anforderungsliste und die Vergleichsdokumentation an. Es wird bewertet, ob die Auswahl auf einem dokumentierten Vergleich basierte, auch wenn Sicherheitsaspekte nicht im Fokus standen."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a9-m3",
                    "uuid": "b7966384-d029-41c5-9174-2c7e02af8b35",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bevor VoIP-Komponenten beschafft werden, SOLLTE eine formale Anforderungsliste erstellt werden. Anhand dieser Anforderungsliste SOLLTEN die am Markt erhältlichen Produkte bewertet und die Auswahlentscheidung dokumentiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein formaler Anforderungskatalog wird erstellt, der funktionale und nicht-funktionale Anforderungen (z.B. Skalierbarkeit) umfasst. Ein standardisierter Prozess zur Marktanalyse und Produktbewertung wird durchgeführt. Die finale Entscheidung wird schriftlich begründet und archiviert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert den Anforderungskatalog und die Dokumentation des Bewertungsprozesses und der Auswahlentscheidung an. Es wird geprüft, ob ein systematischer und nachvollziehbarer Prozess stattgefunden hat."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a9-m4",
                    "uuid": "e676454d-ac3c-4438-bed8-72cba9340968",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anforderungsliste SOLLTE explizit alle Merkmale zur Erreichung des angestrebten Sicherheitsniveaus umfassen. Dies beinhaltet z.B. die Unterstützung spezifischer Verschlüsselungsprotokolle oder Härtungsmaßnahmen. Es SOLLTE ein formaler Prozess geregelt werden, wie die Produkte gemäß der Anforderungsliste bewertet werden, einschließlich der Gewichtung von Sicherheitsmerkmalen."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Anforderungskatalog enthält ein dediziertes Kapitel zu Sicherheitsanforderungen (z.B. 'Muss TLS 1.2+ unterstützen', 'Muss SRTP unterstützen', 'Muss rollenbasiertes Admin-Konzept haben'). Bei der Bewertung wird den Sicherheitsmerkmalen ein hohes Gewicht beigemessen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den Anforderungskatalog auf die Existenz und Angemessenheit der Sicherheitsanforderungen. Es wird geprüft, ob die Bewertungsmatrix die Sicherheitskriterien angemessen gewichtet und ob die finale Produktauswahl mit diesen Kriterien konsistent ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a9-m5",
                    "uuid": "722fe15e-d5bf-4d24-bbd9-b93f6f68a807",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Auswahlprozess umfasst eine verpflichtende Proof-of-Concept (PoC)-Phase, in der die favorisierten Produkte in einer Testumgebung gegen die definierten Sicherheitsanforderungen validiert werden. Die Sicherheitsreputation des Herstellers, sein Software Development Lifecycle und seine Patch-Politik (z.B. Reaktionszeit auf Schwachstellen) sind entscheidende Kriterien bei der Auswahl."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Top-2-Kandidaten aus der Papier-Evaluierung werden in einem Labor-Setup installiert. Ein Testplan wird abgearbeitet, der gezielt die Sicherheitsfunktionen unter die Lupe nimmt. Gleichzeitig wird eine Recherche zur Sicherheitshistorie des Herstellers durchgeführt und dessen Umgang mit gemeldeten Schwachstellen bewertet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die PoC-Testpläne und -Ergebnisberichte an. Es wird die Dokumentation zur Bewertung des Herstellers und seiner Sicherheitsprozesse geprüft. Es wird verifiziert, dass die endgültige Entscheidung nachweislich auf den Ergebnissen des PoC und der Herstellerbewertung basiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "4eb4e34f-0a9c-4d61-aa95-726301dddbd7",
                "control-id": "DEV.2.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Initiation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ISGA",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "net.4.2.a1-m1",
                    "uuid": "2fb99c46-931f-45a6-804c-60cfe7770c38",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Entscheidung für den VoIP-Einsatz wird ad hoc und projektbezogen getroffen, ohne eine übergreifende Planung oder Strategie. Es werden nur die unmittelbarsten funktionalen Anforderungen berücksichtigt, ohne eine formale Auswahl von Protokollen oder eine Bewertung der Netzwerkkapazitäten."
                      },
                      {
                        "name": "guidance",
                        "value": "In dieser Phase wird VoIP oft für eine kleine Pilotgruppe oder eine neue Niederlassung eingeführt. Die Konfiguration basiert meist auf den Standardeinstellungen des Anbieters. Eine Dokumentation der Entscheidung oder Konfiguration fehlt weitgehend."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, ob es überhaupt schriftliche Planungsdokumente zum VoIP-Einsatz gibt. Durch Befragung der IT-Verantwortlichen wird ermittelt, ob die Auswahl der VoIP-Lösung auf einer systematischen Entscheidung beruhte oder eine Ad-hoc-Entscheidung war."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a1-m2",
                    "uuid": "3a322625-eef5-452d-94bd-fbaafd7316dc",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert ein grundlegender Plan, in dem entschieden wird, ob eine vollständige oder teilweise Migration zu VoIP erfolgen soll. Die grundlegenden Signalisierungs- und Transportprotokolle werden ausgewählt, jedoch ohne eine tiefgehende Analyse von Sicherheitsaspekten oder der genauen Netzwerkauslastung."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein einfaches Planungsdokument wird erstellt. Die Auswahl der Protokolle (z.B. SIP) erfolgt auf Basis der Herstellerempfehlungen. Eine grundlegende Abschätzung des Bandbreitenbedarfs wird vorgenommen, aber keine detaillierte Kapazitätsplanung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das Planungsdokument an und prüft, ob die grundlegenden Entscheidungen (partiell/vollständig, Protokollauswahl) dokumentiert sind. Es wird geprüft, ob eine grundlegende Abschätzung der Netzwerkanforderungen stattgefunden hat."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a1-m3",
                    "uuid": "24cfb5ac-e5e5-42f1-914a-ce72876a9880",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Bedingungen, unter denen VoIP eingesetzt werden soll, MÜSSEN festgelegt werden. Es MUSS unter anderem entschieden werden, ob vollständig oder partiell auf VoIP umgestiegen werden soll. Geeignete Signalisierungs- und Medientransportprotokolle MÜSSEN vor dem Einsatz ausgewählt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein formales Planungsdokument erstellt, das die Migrationsstrategie, die Auswahl und Begründung der Protokolle (z. B. SIP für Signalisierung, RTP für Medien) und die grundlegenden Rahmenbedingungen festlegt. Diese Planung wird vom zuständigen Gremium verabschiedet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert anhand des Planungsdokuments, dass die im Control geforderten Festlegungen getroffen wurden. Es wird geprüft, ob die Auswahl der Protokolle dokumentiert und nachvollziehbar ist. Es wird kontrolliert, ob die Entscheidung über eine vollständige oder partielle Umstellung formal getroffen wurde."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a1-m4",
                    "uuid": "e0c6e4d9-5698-4e5c-8c0b-58e673a78939",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zur Basisplanung SOLLTEN besondere Anforderungen an die Verfügbarkeit von VoIP sowie an die Vertraulichkeit und Integrität der Telefonate und Signalisierungsinformationen vorab ermittelt und dokumentiert werden. Es SOLLTE entschieden werden, ob und wie die VoIP-Infrastruktur an öffentliche (Daten-)Netze angebunden wird. Die Kapazitäten und das Design von vorhandenen Datennetzen SOLLTEN bei der Planung detailliert berücksichtigt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Planung umfasst eine Anforderungsanalyse bezüglich Schutzbedarf (Verfügbarkeit, Vertraulichkeit, Integrität). Die Anbindung an externe Netze wird konzeptionell geplant, z.B. durch den Einsatz eines Session Border Controllers (SBC). Eine Kapazitätsplanung des Netzwerks wird durchgeführt, um Engpässe zu vermeiden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert, ob die Planungsdokumente eine explizite Analyse der Schutzbedarfsanforderungen enthalten. Es wird geprüft, ob ein Konzept für die Anbindung an öffentliche Netze existiert. Die Existenz und Angemessenheit der Netzwerkkapazitätsplanung wird verifiziert."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a1-m5",
                    "uuid": "005551a7-7127-4975-88ce-60bc55b2f60e",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die VoIP-Planung ist vollständig in die übergreifende IT-Sicherheitsstrategie und das ISMS integriert. Sie beinhaltet eine detaillierte Risikoanalyse für die spezifische VoIP-Implementierung. Die Kapazitätsplanung wird durch Lasttests validiert. Der Plan ist ein lebendes Dokument, das regelmäßig, mindestens jährlich sowie bei signifikanten Änderungen der Bedrohungslage, überprüft und angepasst wird."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine formale Risikoanalyse nach z. B. BSI-Standard 200-3 wird für die VoIP-Infrastruktur durchgeführt. Vor dem Rollout werden Lasttests im Netzwerk durchgeführt, um die Ergebnisse der Kapazitätsplanung zu verifizieren. Ein Prozess zur regelmäßigen Überprüfung und Aktualisierung des VoIP-Konzepts wird etabliert und im ISMS verankert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz und die Ergebnisse der spezifischen VoIP-Risikoanalyse und der Lasttests. Es wird geprüft, ob der Planungsprozess einen dokumentierten Revisionszyklus vorsieht und ob in der Vergangenheit Aktualisierungen stattgefunden haben. Die Integration in das ISMS wird durch Prüfung der entsprechenden Dokumente und Prozesse nachgewiesen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e2d08ebd-d499-4997-b291-5803a8a0e48a",
                "control-id": "KONF.10.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "net.4.2.a8-m1",
                    "uuid": "d62d44f1-c705-4419-a648-759aaf62ed6e",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Verschlüsselung ist nur dort aktiv, wo sie eine Standardeinstellung der verwendeten Clients oder der Middleware ist. Es gibt keine klare Richtlinie oder einheitliche Konfiguration zur Verschlüsselung von VoIP-Verkehr. Oft wird bei Kompatibilitätsproblemen auf unverschlüsselte Kommunikation zurückgefallen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Verschlüsselungsoptionen in den Endgeräten und der Telefonanlage werden in der Standardeinstellung belassen. Wenn ein Endgerät keine Verschlüsselung unterstützt, findet die Kommunikation unverschlüsselt statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer zeichnet mit einem Netzwerk-Sniffer (z.B. Wireshark) den Verkehr einer Stichprobe von Anrufen auf und prüft, ob die Signalisierung (SIP) und der Medienstrom (RTP) unverschlüsselt übertragen werden. In Wireshark kann nach `sip` und `rtp` gefiltert werden, um dies zu überprüfen."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a8-m2",
                    "uuid": "e45629f4-dbe8-4ac1-b3e4-2dbbaa1b9b7a",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert eine Richtlinie, die vorschreibt, dass jeglicher VoIP-Verkehr, der die vertrauenswürdige Netzwerkgrenze verlässt, verschlüsselt werden muss. Dies wird durch einen Session Border Controller (SBC) oder ein VPN-Gateway umgesetzt. Die interne Kommunikation im LAN erfolgt jedoch weiterhin unverschlüsselt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der SBC am Netzwerkperimeter wird so konfiguriert, dass er für alle externen Verbindungen TLS für SIP und SRTP für die Mediendaten erzwingt. Interne Clients kommunizieren unverschlüsselt mit der Telefonanlage."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration des SBC oder VPN-Gateways auf die Erzwingung von Verschlüsselung für externe Verbindungen. Zusätzlich wird der interne Netzwerkverkehr mitgeschnitten, um zu bestätigen, dass dieser unverschlüsselt ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a8-m3",
                    "uuid": "ec318bb2-f6e1-49a0-8e67-d69f1da2f922",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE entschieden und dokumentiert werden, ob und welche Sprach- und Signalisierungsinformationen verschlüsselt werden sollen. Generell SOLLTEN alle VoIP-Datenpakete, die das gesicherte LAN verlassen, durch geeignete Sicherheitsmechanismen (z.B. TLS für Signalisierung und SRTP für Mediendaten) geschützt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine formale Entscheidung über den Umfang der Verschlüsselung getroffen und dokumentiert. Als Mindeststandard wird festgelegt, dass die gesamte Kommunikation, die über unsichere Netze (wie das Internet) läuft, verschlüsselt wird. Dies wird technisch über einen SBC oder die Telefonanlage selbst konfiguriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert das Dokument an, das die Entscheidung über den Verschlüsselungsumfang festhält. Die Konfiguration der relevanten Systeme (SBC, PBX) wird geprüft, um sicherzustellen, dass die Verschlüsselung für externe Kommunikation wie definiert aktiv ist. Ein Netzwerk-Mitschnitt an der Netzwerkgrenze verifiziert dies."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a8-m4",
                    "uuid": "2a86e903-5c30-4463-8e92-1c373d561e90",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zur Verschlüsselung des externen Verkehrs wird auch die interne VoIP-Kommunikation (sowohl Signalisierung via TLS als auch Mediendaten via SRTP) standardmäßig verschlüsselt, um auch vor internen Angreifern zu schützen. Die Benutzenden SOLLTEN über die Nutzung und die Grenzen der VoIP-Verschlüsselung (z.B. End-to-End vs. Transport) informiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Telefonanlage und alle Endgeräte werden so konfiguriert, dass sie standardmäßig Verschlüsselung für alle Anrufe anfordern und verwenden. Die Information der Benutzer erfolgt über das Intranet oder im Rahmen von Security-Awareness-Schulungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer schneidet den Verkehr im internen LAN mit und verifiziert, dass auch Anrufe zwischen zwei internen Teilnehmern verschlüsselt sind (SIP over TLS, SRTP). Es wird geprüft, ob es Informationsmaterial für Benutzer zur VoIP-Verschlüsselung gibt."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a8-m5",
                    "uuid": "3d19d9e0-31fa-4a5f-b24c-9f40a405012b",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wo immer technisch möglich, wird eine Ende-zu-Ende-Verschlüsselung (E2EE) für VoIP-Gespräche durchgesetzt. Es werden ausschließlich starke, zentral verwaltete kryptografische Parameter verwendet. Das System ist so konfiguriert, dass unverschlüsselte Verbindungen strikt abgelehnt werden (Encrypt-or-Drop-Policy). Das Management der Zertifikate für TLS ist automatisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Protokolle wie ZRTP oder eine PKI-basierte Lösung für E2EE implementiert. Die Telefonanlage wird so konfiguriert, dass sie nur sichere Krypto-Suiten akzeptiert und Anrufe ablehnt, wenn keine sichere SRTP-Verbindung ausgehandelt werden kann. Ein ACME-Client oder ein internes Zertifikatsmanagementsystem wird für die automatische Ausstellung und Erneuerung von TLS-Zertifikaten verwendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration der Telefonanlage und der Endgeräte auf die Erzwingung von E2EE und die Konfiguration der 'Encrypt-or-Drop'-Policy. Es wird geprüft, ob ein Anrufversuch mit einem Client, der nur unverschlüsseltes RTP unterstützt, fehlschlägt. Der Prozess zur automatisierten Zertifikatsverwaltung wird auditiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "5966c749-f98b-431f-8250-689613844c22",
                "control-id": "KONF.10.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "net.4.2.a5-m1",
                    "uuid": "ef83c427-14c1-4b15-ac29-2922ab6f05ad",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die VoIP-Middleware wird mit den Standardeinstellungen des Herstellers betrieben. Nur die für die Grundfunktion absolut notwendigen Parameter und die Administrator-Passwörter werden geändert. Viele nicht benötigte Dienste laufen weiter."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Installation erfolgt nach dem 'Next-Next-Finish'-Prinzip. Es findet keine systematische Härtung statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die laufende Konfiguration der VoIP-Middleware mit den bekannten Standardeinstellungen des Herstellers. Ein Portscan des Servers zeigt, welche Dienste aktiv sind, und kann mit einer Liste der notwendigen Dienste verglichen werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a5-m2",
                    "uuid": "038bae13-14e8-4004-a2fd-d4f067fccab8",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Härtung der VoIP-Middleware wird durchgeführt. Alle Standardpasswörter werden geändert und eine Checkliste wird verwendet, um häufige, nicht benötigte Dienste (z. B. unverschlüsselte Administrationsschnittstellen) zu deaktivieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine interne Checkliste für die Basiskonfiguration wird erstellt und bei jeder Installation angewendet. Diese Checkliste basiert auf allgemeinen Best Practices und Herstellerempfehlungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Konfigurations-Checkliste an und überprüft stichprobenartig, ob die Punkte in der produktiven Umgebung umgesetzt sind. Es wird geprüft, ob alle Standard-Accounts deaktiviert oder deren Passwörter geändert wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a5-m3",
                    "uuid": "fe5eed4e-9b07-4072-9b66-66cae42b99c8",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die VoIP-Komponenten (Middleware) MÜSSEN so konfiguriert sein, dass sie den Schutzbedarf angemessen erfüllen. Die Default-Konfigurationen der VoIP-Middleware MÜSSEN vor der produktiven Inbetriebnahme angepasst werden. Alle nicht benötigten Dienste der VoIP-Middleware MÜSSEN deaktiviert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine formale, dokumentierte Sicherheitskonfiguration für die VoIP-Middleware erstellt. Diese basiert auf einer Analyse der benötigten Funktionen und dem definierten Schutzbedarf. Ein Standardprozess zur Härtung wird etabliert, der die Deaktivierung aller nicht essenziellen Dienste und die Konfiguration von Sicherheitsfeatures umfasst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die laufende Konfiguration der VoIP-Middleware mit der dokumentierten Sicherheitskonfiguration. Mittels eines Portscans und der Überprüfung der Prozessliste (`ps aux` oder `netstat -tulpen`) wird verifiziert, dass keine nicht benötigten Dienste aktiv sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a5-m4",
                    "uuid": "17e825dd-bfee-4479-9212-5d987cc1abf0",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Installations- und Konfigurationsschritte SOLLTEN so dokumentiert werden, dass die Installation und Konfiguration durch sachkundige Dritte anhand der Dokumentation nachvollzogen und wiederholt werden können. Die Konfigurationsdokumentation wird versioniert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden detaillierte Installations- und Konfigurationsanleitungen ('Runbooks') erstellt. Diese Anleitungen werden in einem zentralen Wissensmanagementsystem (z. B. Wiki) versioniert und gepflegt. Änderungen an der Konfiguration folgen einem Change-Management-Prozess."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Installations- und Konfigurationsdokumentation an und prüft diese auf Vollständigkeit, Verständlichkeit und Aktualität. Es wird geprüft, ob ein Change-Management-Prozess für Konfigurationsänderungen existiert und eingehalten wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a5-m5",
                    "uuid": "06772779-45e6-424f-93ee-6f77238d9a8e",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Konfiguration der VoIP-Middleware wird mittels Infrastructure as Code (IaC) verwaltet, z.B. mit Ansible, Puppet oder SaltStack. Alle Konfigurationsänderungen werden in einem Versionskontrollsystem (z.B. Git) nachverfolgt, automatisch in einer Staging-Umgebung getestet und dann auf die Produktionssysteme ausgerollt. Die Systemintegrität und Konfigurationstreue werden kontinuierlich überwacht, und Abweichungen führen zu automatisierten Korrekturen oder Alarmen."
                      },
                      {
                        "name": "guidance",
                        "value": "Ansible-Playbooks oder äquivalente Skripte werden entwickelt, um die VoIP-Middleware vollständig automatisiert zu installieren und zu konfigurieren. Ein CI/CD-Pipeline wird für das Testen und Ausrollen von Konfigurationsänderungen genutzt. Tools wie AIDE oder Wazuh werden zur Überwachung der Konfigurationsdateien auf dem Server eingesetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das IaC-Repository und die CI/CD-Pipeline. Es werden die Protokolle der automatisierten Tests und der Konfigurationsüberwachungstools eingesehen. Ein Test könnte darin bestehen, eine Konfigurationsdatei manuell zu ändern und zu überprüfen, ob das System die Änderung erkennt und korrigiert oder alarmiert: `sudo echo '# Injected comment' >> /etc/asterisk/sip.conf; sleep 60; sudo cat /etc/asterisk/sip.conf | grep '# Injected comment'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "e1cab3ac-a134-4ee9-9b8f-241d4edb5889",
                "control-id": "KONF.10.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "net.4.2.a3-m1",
                    "uuid": "9a40baf4-424e-49f0-9f7c-ce9a91dd50df",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Nur einige wenige, offensichtlich nicht benötigte Funktionen werden auf einigen VoIP-Endgeräten deaktiviert. Es gibt keine standardisierte Konfiguration oder ein einheitliches Vorgehen zur Härtung der Endgeräte."
                      },
                      {
                        "name": "guidance",
                        "value": "Typischerweise werden nur Web-Interfaces an Endgeräten deaktiviert, wenn diese Probleme verursachen. Die Konfiguration erfolgt manuell und uneinheitlich pro Gerät."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer wählt eine Stichprobe von VoIP-Endgeräten aus und vergleicht deren Konfigurationen. Es wird auf signifikante Inkonsistenzen und auf aktive, aber bekanntermaßen unsichere oder unnötige Dienste (z. B. Telnet, HTTP) geachtet."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a3-m2",
                    "uuid": "9dbafa75-4afe-42b8-ac3d-ac17849b01d7",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für alle VoIP-Endgeräte wird eine grundlegende Härtung nach einer einfachen Checkliste durchgeführt. Dies beinhaltet das Ändern von Standard-Passwörtern und das Deaktivieren bekannter, nicht benötigter Dienste. Der Zugriff auf die Konfiguration ist durch ein geändertes Passwort geschützt."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine einfache Härtungsanleitung wird erstellt und bei der Inbetriebnahme jedes Geräts abgearbeitet. Das Standard-Administrationspasswort wird durch ein einheitliches, aber nicht-triviales Passwort ersetzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Härtungs-Checkliste an. Anhand einer Stichprobe von Geräten wird geprüft, ob Standardpasswörter geändert wurden und ob die in der Checkliste genannten Dienste deaktiviert sind. Dies kann durch einen Portscan der Geräte oder durch Einsicht in die Konfiguration erfolgen."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a3-m3",
                    "uuid": "d52c48d7-2037-4498-b2f2-bc2140d81120",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Nicht benötigte Funktionen der Endgeräte MÜSSEN deaktiviert werden. Die Konfigurationseinstellungen DÜRFEN NICHT unberechtigt geändert werden können, beispielsweise durch einen Passwortschutz."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine verbindliche Basis-Konfiguration für jeden Typ von VoIP-Endgerät definiert und dokumentiert. Diese Konfiguration deaktiviert alle nicht explizit für den Betrieb benötigten Funktionen (z.B. Webserver, Bluetooth, WLAN, wenn nicht genutzt). Der Zugriff auf das Konfigurationsmenü wird durch ein individuelles oder rollenbasiertes, sicheres Passwort geschützt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer vergleicht die Konfiguration einer Stichprobe von Endgeräten mit der dokumentierten Basis-Konfiguration. Es wird geprüft, ob nicht benötigte Dienste deaktiviert sind und ob der Konfigurationszugriff wirksam passwortgeschützt ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a3-m4",
                    "uuid": "ba103523-b533-42d2-ac44-8555de5dd85e",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle Sicherheitsfunktionen der Endgeräte, wie z.B. die Verschlüsselungsoptionen, SOLLTEN vor dem produktiven Einsatz getestet werden. Die eingesetzten Sicherheitsmechanismen und die verwendeten Parameter SOLLTEN dokumentiert werden als Teil der verbindlichen Basiskonfiguration."
                      },
                      {
                        "name": "guidance",
                        "value": "Die definierten Sicherheitskonfigurationen werden in einer Testumgebung auf ihre Funktion und Kompatibilität überprüft, bevor sie ausgerollt werden. Die Konfiguration, einschließlich der Parameter für Verschlüsselung und Authentisierung, wird versioniert und zentral dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Testdokumentation und die detaillierte Konfigurationsdokumentation an. Es wird verifiziert, dass die Sicherheitsfunktionen vor dem Einsatz getestet wurden und dass die produktive Konfiguration der dokumentierten und getesteten Version entspricht."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a3-m5",
                    "uuid": "661543f1-2a04-4528-89b5-0291ac38bc87",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Konfiguration der VoIP-Endgeräte wird über einen zentralen Provisionierungsserver automatisiert ausgerollt und verwaltet. Die Integrität der Konfiguration auf den Endgeräten wird regelmäßig und automatisiert überwacht. Jede unautorisierte Konfigurationsänderung löst einen Alarm aus. Alle administrativen Zugriffe und Änderungen werden zentral protokolliert und ausgewertet."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Provisionierungsserver (z. B. via TFTP/HTTPS) wird verwendet, um allen Endgeräten eine signierte Konfigurationsdatei zuzuweisen. Tools zum Konfigurationsmanagement oder Skripte werden eingesetzt, um regelmäßig die laufende Konfiguration der Geräte mit dem Soll-Zustand abzugleichen. Die Ergebnisse werden an ein zentrales SIEM-System zur Überwachung und Alarmierung gesendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des Provisionierungsservers und den Prozess des automatisierten Rollouts. Es werden die Logs der Integritätsüberwachung und des SIEM-Systems eingesehen, um die Wirksamkeit der Überwachung und Alarmierung zu verifizieren. Ein automatisierter Test könnte eine Konfigurationsdatei auf einem Endgerät verändern und prüfen, ob ein Alarm ausgelöst wird: `sudo sed -i 's/secure_mode=on/secure_mode=off/g' /etc/voip_phone/config.cfg && journalctl -f | grep 'ConfigDriftDetected'`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "97a9b35c-ad3c-49c7-a1b0-5d9fa2be2b91",
                "control-id": "KONF.11.8.2.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "net.4.2.a4-m1",
                    "uuid": "67e9a854-c0b3-4eb9-8916-cb99419a4c8c",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt keine klare Richtlinie, wie externe Teilnehmer auf die VoIP-Infrastruktur zugreifen. Der Zugriff wird fallweise und oft mit sehr weitreichenden Firewall-Regeln (z.B. ANY-ANY zum VoIP-Server) gewährt, um Funktionsprobleme zu vermeiden."
                      },
                      {
                        "name": "guidance",
                        "value": "Firewall-Regeln werden oft reaktiv erstellt, wenn ein externer Benutzer keine Verbindung herstellen kann. Dies führt häufig zu übermäßig permissiven Regeln."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Firewall-Regeln, die den Verkehr zur VoIP-Infrastruktur regeln. Es wird nach übermäßig weitreichenden Regeln (z.B. any/any) oder Regeln ohne explizite Quell- oder Zielbeschränkung gesucht."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a4-m2",
                    "uuid": "221a24aa-681c-42de-a8e3-ecb41e5cfcff",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist eine grundlegende Richtlinie für den externen Zugriff definiert. Der direkte Zugriff aus unsicheren Netzen auf interne VoIP-Komponenten wird durch grundlegende Netzwerksegmentierung und Firewall-Regeln unterbunden, die nur die notwendigen Ports (z.B. UDP/5060) freigeben."
                      },
                      {
                        "name": "guidance",
                        "value": "Die VoIP-Anlage befindet sich in einer eigenen DMZ oder einem geschützten VLAN. Die Firewall-Regeln erlauben explizit nur SIP- und RTP-Verkehr von bekannten externen IP-Adressen oder Gateways."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft den Netzwerkplan und die Firewall-Konfiguration, um sicherzustellen, dass die VoIP-Komponenten segmentiert sind und die Zugriffsregeln auf die notwendigen Protokolle und Ports beschränkt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a4-m3",
                    "uuid": "c60ecfc7-be0f-47e0-8954-78ca1d3d67d6",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es MUSS entschieden und dokumentiert werden, wie externe Gesprächspartner und -partnerinnen auf die VoIP-Architektur zugreifen können. Es MUSS durch technische Maßnahmen, wie z.B. eine Firewall, verhindert werden, dass IT-Systeme aus unsicheren Netzen direkte, unkontrollierte Datenverbindungen zu internen VoIP-Komponenten aufbauen können."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine formale Zugriffsrichtlinie für externe VoIP-Kommunikation wird erstellt. Die VoIP-Infrastruktur wird in einer DMZ platziert. Die Firewall-Regeln sind restriktiv konfiguriert (Default-Deny) und erlauben nur den notwendigen Verkehr zu definierten VoIP-Komponenten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fordert die Zugriffsrichtlinie an und vergleicht sie mit der implementierten Firewall-Konfiguration. Es wird geprüft, ob die Regeln den direkten Zugriff auf interne VoIP-Clients oder -Server wirksam verhindern und nur den Verkehr zum definierten Gateway (z. B. in der DMZ) erlauben."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a4-m4",
                    "uuid": "31ecd8fd-0d7a-41d9-88ba-07f5f7851fbf",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wenn alle ein- und ausgehenden Verbindungen über ein zentrales IT-System abgewickelt werden, SOLLTE sichergestellt werden, dass alle Signalisierungs- und Sprachinformationen zwischen dem öffentlichen und dem privaten Datennetz nur über dieses autorisierte IT-System ausgetauscht werden. Dieses System ist typischerweise ein Session Border Controller (SBC)."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Session Border Controller (SBC) wird als zentraler, autorisierter Übergangspunkt zwischen dem internen und externen Netz implementiert. Alle Firewall-Regeln erzwingen, dass der gesamte VoIP-Verkehr durch den SBC geleitet wird. Direkte Verbindungen von extern zu internen VoIP-Komponenten sind verboten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Netzwerktopologie und die Firewall-Regeln, um sicherzustellen, dass der SBC der einzige erlaubte Kommunikationspfad für VoIP-Verkehr über die Netzwerkgrenze ist. Die Konfiguration des SBC wird auf korrekte Funktion (z.B. Topology Hiding) geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a4-m5",
                    "uuid": "baeaf22b-9856-4bd5-8bdb-09c040f684e6",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird ein hochverfügbarer Cluster von Session Border Controllern (SBCs) eingesetzt. Der gesamte VoIP-Verkehr wird auf der Anwendungsebene tiefgehend inspiziert (Deep Packet Inspection), um Angriffe wie SIP-Fuzzing oder SQL-Injection in SIP-Headern zu erkennen und zu blockieren. Die SBCs nutzen aktuelle Threat-Intelligence-Feeds und Geo-IP-Filterung, um bekannte bösartige Akteure proaktiv abzuwehren."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein redundantes Paar von SBCs wird im Failover-Modus betrieben. Die Intrusion-Prevention-System (IPS)-Funktionen des SBC für VoIP werden aktiviert und mit benutzerdefinierten Regeln sowie Hersteller-Updates gepflegt. Die SBCs sind mit einem SIEM-System zur zentralen Protokollierung und Korrelation von Sicherheitsereignissen verbunden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration des SBC-Clusters auf Hochverfügbarkeit und die Aktivierung der DPI/IPS-Funktionen. Die Anbindung an Threat-Intelligence-Feeds und das SIEM wird verifiziert. Testweise können bekannte Angriffsmuster (z.B. von `sipp` mit manipulierten Headern) gegen die Infrastruktur gefahren werden, um die Reaktion des SBC zu beobachten: `sudo sipp -sf custom_attack.xml -d 10000 -s service <SBC_IP>`."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "57e3cb36-006e-49ed-9d3a-502ef217d213",
                "control-id": "KONF.14.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "net.4.2.a14-m2",
                    "uuid": "aedd1fa3-aa72-41b3-ac02-9cf4a824d3d9",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Signalisierung wird konsistent mittels TLS zwischen den Endgeräten und dem VoIP-Server geschützt. Es werden jedoch Standard-Kryptographieeinstellungen verwendet und nur die Server-Identität wird durch ein Zertifikat geprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "SIP over TLS wird auf der Telefonanlage und den Clients aktiviert. Die Telefonanlage verwendet ein gültiges TLS-Zertifikat (z.B. von Let's Encrypt)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer zeichnet den Signalisierungsverkehr auf und verifiziert mit Wireshark, dass dieser über TLS (Standardport 5061) läuft. Das Serverzertifikat wird auf Gültigkeit und Vertrauenswürdigkeit geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a14-m3",
                    "uuid": "738eb48c-9ae8-4551-ad99-7dc3f49b1e9d",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Integrität und Vertraulichkeit der Signalisierungsinformationen SOLLTE durch geeignete kryptografische Verfahren, wie z.B. Transport Layer Security (TLS), gewährleistet werden. Nicht nur die Nutzdaten in der Signalisierung, sondern auch die Authentisierungsdaten SOLLTEN durchgängig verschlüsselt übertragen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine Richtlinie etabliert, die die Nutzung von SIP over TLS für die gesamte Signalisierung vorschreibt. Die Konfiguration stellt sicher, dass auch Authentifizierungsmethoden wie SIP Digest innerhalb des TLS-Tunnels stattfinden und somit geschützt sind."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration von Server und Clients, um die Erzwingung von SIP over TLS zu verifizieren. Ein Netzwerk-Mitschnitt bestätigt, dass keine Signalisierungsdaten unverschlüsselt übertragen werden. Es wird geprüft, ob Authentisierungsversuche innerhalb der TLS-Session stattfinden."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a14-m4",
                    "uuid": "c0d70e7c-4dae-4ded-9d2d-b8822a6a9350",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Zugriff auf das VoIP-Gateway SOLLTE durch die Validierung von VoIP-Adressen (z.B. SIP-URI) und Identitäten (z.B. H.323-ID) so weit wie möglich eingeschränkt werden. Es SOLLTEN zusätzlich Ende-zu-Ende-Sicherheitsmechanismen für die Signalisierung (z.B. durch S/MIME in SIP-Nachrichten) in Betracht gezogen werden. Es SOLLTE dokumentiert werden, wie die Signalisierung geschützt wird."
                      },
                      {
                        "name": "guidance",
                        "value": "Der VoIP-Server wird so konfiguriert, dass er nur Anrufe von registrierten und autorisierten SIP-URIs annimmt. Die Möglichkeit, Ende-zu-Ende-verschlüsselte Signalisierung zu nutzen, wird evaluiert und falls möglich für besonders schützenswerte Kommunikation aktiviert. Die gesamte Konfiguration des Schutzes der Signalisierung wird detailliert dokumentiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des VoIP-Servers, um die Mechanismen zur Zugriffsbeschränkung zu verifizieren. Es wird geprüft, ob Anrufversuche von nicht autorisierten Adressen abgewiesen werden. Die Dokumentation zum Schutz der Signalisierung wird auf Vollständigkeit und Korrektheit geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a14-m5",
                    "uuid": "cd447987-a20c-493a-934e-e1d41f359a77",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die TLS-Verbindungen wird Mutual TLS (mTLS) erzwungen, bei dem sich sowohl der Client als auch der Server mit einem gültigen, vertrauenswürdigen Zertifikat authentisieren müssen. Es werden ausschließlich starke und moderne Chiffriersuiten zugelassen. Die Gültigkeit der Zertifikate wird aktiv mittels OCSP Stapling oder CRLs überprüft. Alle Aspekte des Schutzes sind dokumentiert und werden regelmäßig auditiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine interne Public Key Infrastructure (PKI) wird zur Ausstellung von Client-Zertifikaten für alle VoIP-Endgeräte verwendet. Der VoIP-Server ist so konfiguriert, dass er nur Verbindungen von Clients mit einem gültigen Zertifikat von dieser PKI akzeptiert. Die Konfiguration des TLS-Protokolls wird gehärtet, um veraltete Protokollversionen (z.B. SSLv3, TLS 1.0/1.1) und schwache Chiffren zu deaktivieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die PKI- und Server-Konfiguration auf die Erzwingung von mTLS. Ein Test mit einem Client ohne gültiges Zertifikat muss fehlschlagen. Die Konfiguration der erlaubten Chiffriersuiten wird mit Tools wie `testssl.sh` oder `sslyze` überprüft: `testssl.sh <voip_server_ip>:<tls_port>`. Die Konfiguration der OCSP/CRL-Prüfung wird verifiziert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "7a81bba3-e4e5-46b8-bd1a-9904b076907f",
                "control-id": "KONF.14.1.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "net.4.2.a15-m2",
                    "uuid": "c802d04b-542e-472e-8290-0f85ad05f8c7",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "SRTP wird für alle Anrufe als bevorzugte Methode aktiviert. Wenn ein Endpunkt SRTP nicht unterstützt, wird jedoch ein ungesicherter Fallback auf RTP erlaubt, um die Kompatibilität zu gewährleisten. Es werden Standardmechanismen zum Schlüsselaustausch verwendet."
                      },
                      {
                        "name": "guidance",
                        "value": "In der Konfiguration der Telefonanlage wird SRTP als 'optional' oder 'preferred' eingestellt. Der Schlüsselaustausch erfolgt oft über SDES, bei dem die Schlüssel in den unverschlüsselten oder nur transportverschlüsselten SIP/SDP-Nachrichten übertragen werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer führt einen Testanruf mit einem Client durch, der explizit kein SRTP unterstützt, und überprüft mit einem Netzwerk-Sniffer, ob der Anruf zustande kommt und der Medienstrom als unverschlüsseltes RTP übertragen wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a15-m3",
                    "uuid": "7ae60efc-fd07-4a19-a5ca-0d043980976c",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Mediendaten (Sprache, Video), die über das Real-Time Transport Protocol (RTP) übertragen werden, SOLLTEN in geeigneter Weise geschützt werden. Die Nutzdaten SOLLTEN durch den Einsatz von Secure Real-Time Transport Protocol (SRTP) geschützt werden. Der zugehörige Kontrollkanal SOLLTE mittels Secure Real-Time Control Protocol (SRTCP) geschützt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine Richtlinie etabliert, die den Einsatz von SRTP/SRTCP für alle Mediendatenströme vorschreibt. Die VoIP-Komponenten werden so konfiguriert, dass sie SRTP/SRTCP für alle Anrufe verwenden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert mit einem Netzwerk-Sniffer (z.B. Wireshark) eine Stichprobe von Anrufen. Es wird überprüft, ob die Mediendaten als SRTP und nicht als RTP übertragen werden. Wireshark kann SRTP-Pakete erkennen und als solche kennzeichnen."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a15-m4",
                    "uuid": "64935752-d938-4379-8a09-e23bf5d296b3",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Einsatz von SRTP wird erzwungen ('Encrypt-or-Drop'), sodass keine Anrufe mit unverschlüsseltem RTP zustande kommen können. Es werden sichere Schlüsselaustauschmechanismen wie DTLS-SRTP verwendet. Die sicherheitsrelevanten Optionen der SRTP-Implementierung, wie die ausgewählten Krypto-Profile, SOLLTEN dokumentiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die VoIP-Anlage und die Clients werden so konfiguriert, dass SRTP zwingend erforderlich ist ('mandatory'). Als Schlüsselaustauschmethode wird DTLS-SRTP konfiguriert, da dies sicherer als SDES ist. Die gewählten SRTP-Profile (z.B. AES_CM_128_HMAC_SHA1_80) werden in der Konfigurationsdokumentation festgehalten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer führt einen Testanruf mit einem Client durch, der explizit kein SRTP unterstützt; der Anruf muss fehlschlagen. Die Konfiguration des Schlüsselaustauschmechanismus wird überprüft. Die Dokumentation der Krypto-Profile wird mit der tatsächlichen Konfiguration verglichen."
                      }
                    ]
                  },
                  {
                    "statement-id": "net.4.2.a15-m5",
                    "uuid": "7032c3eb-3783-40c9-abeb-c1501e46650a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es wird eine Ende-zu-Ende-Verschlüsselung der Mediendaten unter Verwendung von fortgeschrittenen Schlüsselaustauschmechanismen wie ZRTP oder PERC durchgesetzt. Das System ist so konfiguriert, dass nur die stärksten verfügbaren Krypto-Profile für SRTP verwendet werden. Es werden regelmäßige, automatisierte Überprüfungen durchgeführt, um sicherzustellen, dass kein Fallback auf unsicheres RTP stattfindet."
                      },
                      {
                        "name": "guidance",
                        "value": "Clients und Server werden für die Verwendung von ZRTP konfiguriert, das einen opportunistischen, von der SIP-Infrastruktur unabhängigen Schlüsselaustausch ermöglicht. Die Konfiguration erlaubt nur Krypto-Profile mit AES-256. Ein Überwachungsskript prüft regelmäßig die Systemkonfiguration und aktive Anrufe auf die Verwendung von unverschlüsseltem RTP und alarmiert bei Verstößen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Konfiguration und Funktion von ZRTP, indem er die Short Authentication String (SAS) zwischen zwei Endpunkten vergleicht. Die Konfiguration der erlaubten Krypto-Profile wird analysiert. Die Protokolle des Überwachungsskripts werden eingesehen, um dessen Wirksamkeit zu bewerten."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}