{
  "component-definition": {
    "uuid": "81547fb7-8360-4e50-b03a-3127b1a08fa0",
    "metadata": {
      "title": "INF.8 Räume - Benutzerdefiniert",
      "last-modified": "2025-11-13T21:19:04.375043+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "dd7738b0-1b33-464e-86cb-2ba7d6b66c3f",
        "type": "physical",
        "title": "INF.8 Räume",
        "description": "This component represents the implementation of all controls for Baustein INF.8.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Telearbeitende, freie Mitarbeitende oder Selbstständige arbeiten typischerweise von häuslichen Arbeitsplätzen aus. Im Gegensatz zum Arbeitsplatz im Büro nutzen diese Mitarbeitenden einen Arbeitsplatz in der eigenen Immobilie. Dabei muss ermöglicht werden, dass die berufliche Umgebung hinreichend von der privaten getrennt ist. Wenn Mitarbeitende häusliche Arbeitsplätze dauerhaft benutzen, müssen zudem diverse rechtliche Anforderungen erfüllt sein, beispielsweise müssen die Arbeitsplätze arbeitsmedizinischen und ergonomischen Bestimmungen entsprechen.<BR>Bei einem häuslichen Arbeitsplatz kann nicht die gleiche infrastrukturelle Sicherheit vorausgesetzt werden, wie sie in den Büroräumen einer Institution anzutreffen ist. So ist z. B. der Arbeitsplatz oft auch für Besuch oder Familienangehörige zugänglich. Deshalb müssen Maßnahmen ergriffen werden, mit denen sich ein Sicherheitsniveau erreichen lässt, das mit einem Büroraum vergleichbar ist."
          },
          {
            "name": "Zielsetzung",
            "value": "In diesem Baustein wird aufgezeigt, wie sich die Infrastruktur eines häuslichen Arbeitsplatzes sicher aufbauen und betreiben lässt. Kernziel des Bausteins ist der Schutz der Informationen der Institution am häuslichen Arbeitsplatz."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein INF.8 Häuslicher Arbeitsplatz ist für alle Räume anzuwenden, die als Telearbeitsplatz genutzt werden.<BR>Der Baustein enthält grundsätzliche Anforderungen, die zu beachten und zu erfüllen sind, um den Gefährdungen für einen häuslichen Arbeitsplatz entgegenwirken zu können. Dabei werden jedoch nur spezifische Anforderungen an die Infrastruktur für einen ortsfesten Arbeitsplatz mit Zugang durch Dritte definiert. Sicherheitsanforderungen für die eingesetzten IT-Systeme, z. B. Clients und Multifunktionsgeräte und insbesondere für die technischen Anteile der Telearbeit, z. B. Kommunikationsverbindungen, sind dagegen nicht Gegenstand des vorliegenden Bausteins. Sie werden im Baustein OPS.1.2.4 Telearbeit bzw. in den jeweiligen systemspezifischen Bausteinen beschrieben."
          },
          {
            "name": "2.1. Fehlende oder unzureichende Regelungen für den häuslichen Arbeitsplatz",
            "value": "Da ein häuslicher Arbeitsplatz außerhalb der Institution liegt, sind die Mitarbeitenden dort weitgehend auf sich allein gestellt. Dadurch können durch fehlende oder unzureichende Regelungen für das häusliche Arbeitsplatzumfeld IT-Probleme mit höheren Ausfallzeiten entstehen. Wenn IT-Probleme nicht per Fernadministration geklärt werden können, muss beispielsweise eine Person vom IT-Betrieb aus der Institution erst zum häuslichen Arbeitsplatz fahren, um dort die Probleme zu beseitigen. Wenn der Umgang mit internen und vertraulichen Informationen am häuslichen Arbeitsplatz nicht nachvollziehbar geregelt ist, könnten Mitarbeitende solche Informationen falsch aufbewahren. Wenn nicht verhindert werden kann, dass Informationen ausgespäht oder modifiziert werden, kann die Vertraulichkeit und Integrität der Informationen gefährdet sein."
          },
          {
            "name": "2.2. Unbefugter Zutritt zu schutzbedürftigen Räumen des häuslichen Arbeitsplatzes",
            "value": "Räume eines häuslichen Arbeitsplatzes, in denen schutzbedürftige Informationen aufbewahrt und weiterverarbeitet werden oder in denen schutzbedürftige Geräte aufbewahrt oder betrieben werden, werden dadurch zu schutzbedürftigen Räumen. Wenn unbefugte Personen diese Räume unbeaufsichtigt betreten können, ist die Vertraulichkeit, Integrität und Verfügbarkeit dieser Daten und Informationen erheblich gefährdet.<BR>Beispiele:<BR>• Ein Heimarbeitsplatz befindet sich zwar in einem separaten Arbeitszimmer, ist aber nicht konsequent abgeschlossen. Als kleine Kinder kurz unbeaufsichtigt waren, spielten sie in dem nicht verschlossenen Arbeitszimmer. Dabei wurden wichtige Dokumente als Malgrundlage verwendet.<BR>• Als eine Person am häuslichen Arbeitsplatz in eine Projektarbeit vertieft war, traf überraschend Besuch ein. Während die Person in der Küche Kaffee kochte, wollte der Besuch am nicht gesperrten Client schnell etwas im Internet recherchieren und hat diesen dabei versehentlich mit Schadsoftware infiziert."
          },
          {
            "name": "2.3. Beeinträchtigung der IT-Nutzung durch ungünstige Arbeitsbedingungen am häuslichen Arbeitsplatz",
            "value": "Ein nicht nach ergonomischen Gesichtspunkten eingerichteter häuslicher Arbeitsplatz oder ein ungünstiges Arbeitsumfeld können dazu führen, dass dort nicht ungestört gearbeitet werden kann. Auch die verwendete IT kann möglicherweise nicht oder nicht optimal benutzt werden. Ungünstig auswirken können sich etwa Lärm, Störungen durch Familienmitglieder sowie eine schlechte Beleuchtung oder Belüftung. Dadurch werden Arbeitsabläufe und Potenziale der Mitarbeitenden eingeschränkt. Es könnten sich bei der Arbeit auch Fehler einschleichen. Außerdem kann der Schutz der Integrität von Daten vermindert werden."
          },
          {
            "name": "2.4. Ungesicherter Akten- und Datenträgertransport",
            "value": "Wenn Dokumente, Datenträger oder Akten zwischen der Institution und dem häuslichen Arbeitsplatz transportiert werden, können diese Daten und Informationen verlorengehen. Auch könnten sie von unbefugten Dritten entwendet, gelesen oder manipuliert werden. Der Akten- und Datenträgertransport kann auf verschiedene Arten unzureichend gesichert sein:<BR>• Werden Unikate transportiert und fehlt ein entsprechendes Backup, können Ziele und Aufgaben nicht wie geplant erreicht werden, wenn das Unikat verlorengeht.<BR>• Fallen unverschlüsselte Datenträger in falsche Hände, kann das zu einem schwerwiegenden Verlust der Vertraulichkeit führen.<BR>• Wenn unterwegs kein ausreichender Zugriffsschutz vorhanden ist, können Akten oder Datenträger unbemerkt kopiert oder manipuliert werden."
          },
          {
            "name": "2.5. Ungeeignete Entsorgung der Datenträger und Dokumente",
            "value": "Ist es am häuslichen Arbeitsplatz nicht möglich, Datenträger und Dokumente in geeigneter Weise zu entsorgen, könnten sie einfach in den Hausmüll geworfen werden. Hieraus können jedoch wertvolle Informationen gewonnen werden, die sich gezielt für Erpressungsversuche oder zur Wirtschaftsspionage missbrauchen lassen. Die Folgen reichen vom Wissensverlust bis zur Existenzgefährdung der Institution, z. B. wenn dadurch wichtige Aufträge nicht zustande kommen oder geschäftliche Partnerschaften scheitern."
          },
          {
            "name": "2.6. Manipulation oder Zerstörung von IT, Zubehör, Informationen und Software am häuslichen Arbeitsplatz",
            "value": "IT-Geräte, Zubehör, Informationen und Software, die am häuslichen Arbeitsplatz benutzt werden, können unter Umständen einfacher manipuliert oder zerstört werden als in der Institution. Der häusliche Arbeitsplatz ist oft für Angehörige und Besuch der Familie zugänglich. Auch sind hier die zentralen Schutzmaßnahmen der Institution nicht vorhanden, zum Beispiel Pfortendienste. Wenn IT-Geräte, Zubehör, Informationen oder Software manipuliert oder zerstört werden, sind Mitarbeitende am häuslichen Arbeitsplatz oft nur noch eingeschränkt arbeitsfähig. Des Weiteren müssen womöglich zerstörte IT-Komponenten, Informationen und Softwarelösungen ersetzt werden, was sowohl finanzielle als auch zeitliche Ressourcen erfordert."
          },
          {
            "name": "2.7. Erhöhte Diebstahlgefahr am häuslichen Arbeitsplatz",
            "value": "Der häusliche Arbeitsplatz ist meistens nicht so gut abgesichert wie der Arbeitsplatz in einem Unternehmen oder in einer Behörde. Durch aufwendige Vorkehrungen wie z. B. Sicherheitstüren oder einem Pfortendienst ist dort die Gefahr, dass jemand unbefugt in das Gebäude eindringt, weitaus geringer als bei einem Privathaus. Bei einem Einbruch werden meistens vorrangig Gegenstände gestohlen, die schnell und einfach verkauft werden können. Dabei kann auch dienstliche IT gestohlen werden. Die auf den entwendeten dienstlichen IT-Systemen vorhandenen Informationen besitzen aber oft einen höheren Wert als die IT-Systeme selbst. Dritte könnten versuchen, durch Erpressung oder Weitergabe der Daten an Konkurrenzunternehmen einen höheren Gewinn als durch den Verkauf der Hardware zu erzielen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "7de21b24-2c66-4372-a83c-3633cb287eb0",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/rume_profile.json",
            "description": "Implementation for all controls in Baustein INF.8",
            "implemented-requirements": [
              {
                "uuid": "5c42d126-31aa-481c-a8e7-968de4c184e6",
                "control-id": "ASST.7.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ASST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.8.A5-m2",
                    "uuid": "65bcc268-be2f-4404-bba1-a15ab18d3e8b",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Mitarbeitende werden angewiesen, vertrauliche Dokumente nicht im Hausmüll zu entsorgen, sondern gesammelt zur Vernichtung in der Institution mitzubringen. Es werden jedoch keine speziellen Behälter oder Fristen dafür vorgegeben."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Verantwortung für die sichere Zwischenlagerung und den Transport der zu vernichtenden Dokumente liegt vollständig beim Mitarbeitenden. Dies kann zu einer unsicheren Ansammlung von vertraulichem Material im Homeoffice führen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer fragt den Mitarbeitenden nach dem Prozess zur Entsorgung und stellt fest, dass dieser zwar bekannt ist, aber keine unterstützenden Mittel oder Kontrollen existieren."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A5-m3",
                    "uuid": "25f080ae-1101-42d4-ae4d-17747f52e4a2",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Vertrauliche Informationen SOLLTEN sicher entsorgt werden. In einer speziellen Sicherheitsrichtlinie SOLLTE daher geregelt werden, wie schutzbedürftiges Material zu beseitigen ist. Es SOLLTEN die dafür benötigten Entsorgungsmöglichkeiten verfügbar sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Richtlinie zur Datenvernichtung wird erstellt. Den Mitarbeitenden wird entweder ein Aktenvernichter, der einer angemessenen Schutzklasse (z.B. P-4 nach DIN 66399) entspricht, zur Verfügung gestellt, oder es werden versiegelbare Sammelbehälter ausgegeben, die regelmäßig in der Institution gegen leere getauscht werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Richtlinie zur Datenvernichtung. Er verifiziert die Bereitstellung der Aktenvernichter oder Sammelbehälter. Durch Befragung und Einsicht in die Beschaffungsunterlagen wird die Schutzklasse der Aktenvernichter überprüft. Ein automatisiertes System könnte den Bestand und die Zuweisung der Geräte an die Mitarbeitenden verwalten."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A5-m4",
                    "uuid": "b8d79433-e993-4b96-9c82-aee66d6e16f2",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Entsorgungsanforderungen sind nach der Schutzbedürftigkeit der Informationen differenziert. Für Informationen mit hohem Schutzbedarf ist die Nutzung eines Aktenvernichters mit höherer Schutzklasse (z.B. P-5) oder die zwingende Rückführung in versiegelten Behältern vorgeschrieben. Die Vernichtung wird dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Richtlinie enthält eine Matrix, die je nach Datenklassifikation die erforderliche Partikelgröße (Schutzklasse) des Aktenvernichters festlegt. Mitarbeitende, die mit hochvertraulichen Daten arbeiten, erhalten entsprechende Geräte. Die Rückgabe von versiegelten Behältern wird protokolliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die differenzierte Richtlinie. Er prüft die Spezifikationen der eingesetzten Aktenvernichter und gleicht sie mit den Anforderungen ab. Die Protokolle über die Rückgabe von Sammelbehältern werden auf Vollständigkeit geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A5-m5",
                    "uuid": "d7562324-9e56-477d-9b4f-81324e5d2d11",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein zertifizierter externer Dienstleister wird beauftragt, versiegelte Sicherheitsbehälter mit vertraulichen Materialien regelmäßig direkt bei den Mitarbeitenden zu Hause abzuholen und nachweislich zu vernichten. Die private Anschaffung und Nutzung von Aktenvernichtern ist untersagt, um eine gleichbleibend hohe Qualität der Vernichtung sicherzustellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Es besteht ein Vertrag mit einem nach DIN 66399 zertifizierten Entsorgungsfachbetrieb. Der Dienstleister stellt die Sicherheitsbehälter und übernimmt die gesamte Logistik. Die Mitarbeitenden erhalten für jede Abholung ein Vernichtungszertifikat."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet den Vertrag und die Zertifizierungen des Entsorgungsdienstleisters. Er prüft stichprobenartig die Vernichtungszertifikate auf Vollständigkeit und Korrektheit. Die Zufriedenheit der Mitarbeitenden mit dem Prozess wird über Umfragen ermittelt."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "142fc247-d7e3-4a13-8923-5b129c3f2672",
                "control-id": "GEB.3.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.8.A3-m1",
                    "uuid": "feaa915a-e0a0-4b32-b37b-cf96fc9b80ab",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Mitarbeitende werden mündlich daran erinnert, die Wohnungstür abzuschließen, aber es gibt keine formellen Anweisungen zum Schutz des spezifischen Arbeitsbereichs vor unbefugtem Zutritt durch Dritte (z. B. Familienangehörige, Besucher)."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Schutz beschränkt sich auf die allgemeinen, vom Mitarbeitenden privat ohnehin getroffenen Maßnahmen. Es wird nicht berücksichtigt, dass im häuslichen Umfeld auch nicht- böswillige Dritte (z. B. Kinder) unbeaufsichtigt auf dienstliche Geräte oder Unterlagen zugreifen könnten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch Befragung fest, dass keine spezifischen Regeln für den Zutrittsschutz des Arbeitsplatzes existieren oder kommuniziert wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A3-m2",
                    "uuid": "bde0673d-2e29-4830-b67e-c47d722fca3d",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt eine schriftliche Regelung, dass der Arbeitsplatz beim Verlassen zu sichern ist (z. B. Computer sperren). Maßnahmen zum physischen Schutz des Raumes oder der Wohnung (Türen, Fenster) werden erwähnt, aber nicht weiter spezifiziert oder überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Telearbeitsvereinbarung enthält einen Passus, der den Mitarbeitenden allgemein zum Schutz des Arbeitsplatzes verpflichtet. Es werden keine konkreten Anforderungen an die Schließtechnik von Türen oder Fenstern gestellt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Telearbeitsvereinbarung. Er fragt den Mitarbeitenden, wie er den Arbeitsplatz sichert, und stellt fest, dass die Maßnahmen auf einem grundlegenden Niveau basieren (z. B. Standard-Haustürschloss)."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A3-m3",
                    "uuid": "f11946e6-f73c-4ae3-9ceb-dc3c1f7b785c",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Den Mitarbeitenden MUSS mitgeteilt werden, welche Regelungen und Maßnahmen zum Einbruchs- und Zutrittsschutz zu beachten sind. So MUSS darauf hingewiesen werden, Fenster zu schließen und Türen abzuschließen, wenn der häusliche Arbeitsplatz nicht besetzt ist. Es MUSS sichergestellt werden, dass unbefugte Personen zu keiner Zeit den häuslichen Arbeitsplatz betreten und auf dienstliche IT und Unterlagen zugreifen können."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine detaillierte Richtlinie wird erstellt und den Mitarbeitenden nachweislich zur Kenntnis gegeben. Diese Richtlinie fordert, dass der Arbeitsplatz, wenn er sich nicht in einem separaten, abschließbaren Raum befindet, beim Verlassen so gesichert wird, dass Dritte (auch Familienmitglieder) nicht auf IT und Unterlagen zugreifen können (z.B. durch Wegschließen der Geräte). Diese Maßnahmen MÜSSEN in sinnvollen zeitlichen Abständen überprüft werden, mindestens aber, wenn sich die häuslichen Verhältnisse ändern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Richtlinie zum Zutrittsschutz und den Nachweis der Kenntnisnahme durch die Mitarbeitenden. Er führt eine Befragung oder eine Selbstauskunft durch, in der der Mitarbeitende die Umsetzung der Maßnahmen bestätigt. Änderungen der häuslichen Verhältnisse (z.B. Umzug) werden als Trigger für eine erneute Überprüfung nachgehalten."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A3-m4",
                    "uuid": "956ed31e-e743-4fbd-8cf3-5fb6f15ef223",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es ist zwingend vorgeschrieben, dass der häusliche Arbeitsplatz in einem separaten, abschließbaren Raum eingerichtet wird. Die Qualität der Schlösser an Türen und Fenstern des Raumes oder der Wohnung muss einem definierten Mindeststandard (z.B. RC2-Klassifizierung) entsprechen. Die Anwesenheit betriebsfremder Personen im Arbeitsraum während der Arbeitszeit ist untersagt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Telearbeitsvereinbarung schreibt einen separaten Raum vor und fordert einen Nachweis über die Qualität des Einbruchschutzes (z.B. durch eine Herstellerbescheinigung oder eine Handwerkerrechnung). Die Mitarbeitenden werden explizit angewiesen, keine Besucher im Arbeitszimmer zu empfangen, während sie arbeiten."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich Nachweise für den separaten Raum (z.B. Grundriss, Fotos) und den Einbruchschutz vorlegen. Die Einhaltung der Regelung zum Verbot fremder Personen wird im Rahmen von Mitarbeitergesprächen thematisiert und stichprobenartig überprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A3-m5",
                    "uuid": "6a6e2644-b05a-4d86-8525-5cb46a1a8d71",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Arbeitsraum ist mit einer an eine zentrale Leitstelle angeschlossenen Einbruchmeldeanlage und/oder einer Videoüberwachung ausgestattet, die bei Abwesenheit des Mitarbeitenden aktiv ist. Der Zutritt zum Raum wird über ein biometrisches oder Smart-Lock-System mit zentraler Protokollierung gesteuert. Die physische Sicherheit des Arbeitsplatzes wird regelmäßig durch einen externen Sicherheitsdienstleister auditiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Institution beauftragt die Installation und Wartung der Einbruchmeldeanlage und des Zutrittskontrollsystems. Die Protokolle des Zutrittssystems werden automatisiert auf Anomalien analysiert. Es besteht ein Vertrag mit einem Sicherheitsdienstleister für regelmäßige, auch unangekündigte, physische Überprüfungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Auditberichte des externen Sicherheitsdienstleisters. Er prüft die Konfiguration und die Alarmierungsprotokolle der Einbruchmeldeanlage sowie die Zutrittsprotokolle des Schließsystems. Ein automatisierter Test könnte die Log-Daten des Zutrittssystems auf Konformität mit den Arbeitszeitmodellen prüfen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "d9f2365c-fd16-4407-9645-f6f0b5545734",
                "control-id": "GEB.5.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.8.A4-m2",
                    "uuid": "876ddfd3-4f06-41d1-b4a0-0edcd20b6878",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution gibt Empfehlungen für eine ergonomische Einrichtung, überlässt die Umsetzung aber vollständig dem Mitarbeitenden. Grundlegende Sicherheitsaspekte wie Einbruchschutz werden nicht systematisch behandelt."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Merkblatt mit ergonomischen Tipps wird zur Verfügung gestellt. Es gibt keine finanzielle Unterstützung oder Bereitstellung von Büromöbeln. Der Mitarbeitende nutzt seine private Einrichtung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass das Merkblatt verteilt wurde. Eine weitere Prüfung der tatsächlichen Einrichtung findet nicht statt."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A4-m3",
                    "uuid": "971ff582-90c9-47f3-a030-1bfc1d6b38ea",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der häusliche Arbeitsplatz SOLLTE durch eine geeignete Raumaufteilung von den privaten Bereichen der Wohnung getrennt sein. Der häusliche Arbeitsplatz SOLLTE mit Büromöbeln eingerichtet sein, die ergonomischen Anforderungen entsprechen. Ebenso SOLLTE der häusliche Arbeitsplatz durch geeignete technische Sicherungsmaßnahmen vor Einbrüchen geschützt werden. Die Schutzmaßnahmen SOLLTEN an die örtlichen Gegebenheiten und den vorliegenden Schutzbedarf angepasst sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Institution bietet einen Katalog an ergonomischen Büromöbeln (Stuhl, Schreibtisch) an, aus dem die Mitarbeitenden wählen können, oder stellt ein Budget dafür zur Verfügung. Es wird eine Richtlinie erstellt, die Mindestanforderungen an die räumliche Trennung und den grundlegenden Einbruchschutz (z.B. abschließbare Fenster und Türen) definiert. Die Umsetzung wird durch eine Selbstauskunft des Mitarbeitenden bestätigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Richtlinie zur Einrichtung des Arbeitsplatzes. Er verifiziert die Prozesse zur Bereitstellung von Möbeln oder Budgets. Die Selbstauskünfte der Mitarbeitenden werden stichprobenartig auf Plausibilität geprüft, z.B. durch Anforderung von Fotos des Arbeitsplatzes."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A4-m4",
                    "uuid": "f29bbd49-a375-4628-85d1-43f4cbced0bb",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine formale Gefährdungsbeurteilung für den häuslichen Arbeitsplatz wird durchgeführt, die Ergonomie, Beleuchtung, Lärm und psychische Belastungsfaktoren umfasst. Basierend auf der Beurteilung werden spezifische, verbindliche Maßnahmen umgesetzt. Die Anforderungen an den Einbruchschutz sind klar definiert (z.B. Widerstandsklasse RC2 für Fenster/Türen im Erdgeschoss)."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Gefährdungsbeurteilung wird von einer Fachkraft für Arbeitssicherheit (oder einer entsprechend geschulten Person) anhand einer standardisierten Checkliste, ggf. per Video, durchgeführt. Notwendige Ausstattungsgegenstände, wie spezielle Beleuchtung oder verbesserte Schlösser, werden von der Institution beschafft und finanziert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die dokumentierten Gefährdungsbeurteilungen und die daraus abgeleiteten Maßnahmenpläne. Er überprüft stichprobenartig, ob die definierten Maßnahmen (z.B. Nachweis über RC2-Fenster) umgesetzt wurden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A4-m5",
                    "uuid": "ced64ac7-02fc-43bc-ba42-184b4436a622",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der häusliche Arbeitsplatz wird vor der Inbetriebnahme von einem externen, zertifizierten Auditor für Arbeitssicherheit und Gebäudesicherheit abgenommen. Alle Einrichtungsgegenstände und Sicherheitsinstallationen werden von der Institution bereitgestellt, professionell installiert und regelmäßig gewartet, um einen durchgehend hohen Standard zu gewährleisten."
                      },
                      {
                        "name": "guidance",
                        "value": "Es besteht ein Rahmenvertrag mit einem Dienstleister, der die komplette Einrichtung, Abnahme und Wartung von häuslichen Arbeitsplätzen übernimmt. Dies schließt auch die Installation von Einbruchmeldeanlagen oder speziellen Schallschutzmaßnahmen ein, falls erforderlich."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Abnahmeprotokolle und Zertifikate des externen Auditors. Er überprüft die Wartungsverträge und -nachweise. Die Wirksamkeit der Maßnahmen wird durch regelmäßige, auch unangekündigte, Vor-Ort-Audits verifiziert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "db2348a0-6bb9-4847-8a2f-4cf7439f894c",
                "control-id": "GEB.5.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Risk Treatment",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ASST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.8.A6-m3",
                    "uuid": "d3af6bc4-45a2-49ee-a499-48c27907e2d7",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Wenn Informationen mit erhöhtem Schutzbedarf bearbeitet werden, SOLLTE überlegt werden, von einem häuslichen Arbeitsplatz ganz abzusehen. Anderenfalls SOLLTE der häusliche Arbeitsplatz durch erweiterte, hochwertige technische Sicherungsmaßnahmen geschützt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird ein formaler Prozess zur Risikobewertung und Genehmigung für die Verarbeitung von Daten mit erhöhtem Schutzbedarf im Homeoffice etabliert. Die Genehmigung ist an die Umsetzung definierter zusätzlicher Sicherheitsmaßnahmen geknüpft, wie z.B. die Nutzung eines dedizierten, abschließbaren Raumes und eines Wertschutzschrankes."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft den Genehmigungsprozess und die durchgeführten Risikobewertungen. Er verifiziert, dass für genehmigte Fälle die definierten zusätzlichen Schutzmaßnahmen umgesetzt wurden, z.B. durch Einsicht in Nachweise oder Fotos."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A6-m4",
                    "uuid": "d39864b7-c544-4178-81fb-b6a0efa97647",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Verarbeitung von Informationen mit erhöhtem Schutzbedarf am häuslichen Arbeitsplatz ist nur nach einer dokumentierten, positiven Sicherheitsüberprüfung des Arbeitsplatzes gestattet. Die vorgeschriebenen, erweiterten Sicherheitsmaßnahmen umfassen zwingend eine Einbruchmeldeanlage, zertifizierten Einbruchschutz für Türen und Fenster (z.B. RC3) und die Nutzung von Blickschutzfolien auf allen Monitoren."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Sicherheitsüberprüfung wird durch den Informationssicherheitsbeauftragten (ISB) oder eine von ihm beauftragte Fachkraft durchgeführt und dokumentiert. Die Institution finanziert und organisiert die Installation der erforderlichen Sicherheitstechnik. Die korrekte Anwendung der Blickschutzfolien wird überprüft."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Protokolle der Sicherheitsüberprüfungen. Er prüft die Nachweise über die Installation der Einbruchmeldeanlage und der zertifizierten Bauteile. Die Anbringung und Wirksamkeit der Blickschutzfolien wird bei einer Vor-Ort-Begehung oder per Videoüberprüfung verifiziert."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A6-m5",
                    "uuid": "34b3a820-a912-406a-bd8a-070f215415ac",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Verarbeitung von Informationen mit sehr hohem Schutzbedarf am häuslichen Arbeitsplatz ist grundsätzlich verboten. Ausnahmen erfordern eine Genehmigung auf Geschäftsführungsebene und sind nur möglich, wenn der häusliche Arbeitsplatz durch einen externen Auditor als physischer Sicherheitsbereich (vergleichbar mit einem Serverraum) zertifiziert wurde. Dies umfasst Maßnahmen wie biometrische Zutrittskontrolle, Videoüberwachung und ggf. Abhörschutz."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Richtlinie verbietet die Verarbeitung explizit und definiert einen strengen, mehrstufigen Ausnahmegenehmigungsprozess. Für genehmigte Ausnahmen wird ein externer Sicherheitsdienstleister mit der Konzeption, Umsetzung und Zertifizierung der erforderlichen Hochsicherheitsmaßnahmen beauftragt. Dies kann auch die Einrichtung einer dedizierten, überwachten Netzwerkverbindung umfassen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer kontrolliert die Einhaltung des grundsätzlichen Verbots. Er prüft die Ausnahmegenehmigungen auf Einhaltung des definierten Prozesses. Die Zertifikate und Auditberichte des externen Sicherheitsauditors für die hochgerüsteten Arbeitsplätze werden eingesehen und bewertet."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "bafe88cf-ff08-40b1-94de-e53adfd12daf",
                "control-id": "GEB.9.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ASST",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "INF.8.A1-m1",
                    "uuid": "6571e081-f42b-4839-8509-fdb61289e2b1",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Nur vereinzelt werden dienstliche Unterlagen und Datenträger am häuslichen Arbeitsplatz diebstahlsicher aufbewahrt, beispielsweise in einer Schublade ohne Schloss. Eine durchgängige Regelung oder deren Umsetzung fehlt."
                      },
                      {
                        "name": "guidance",
                        "value": "In dieser Stufe wird das Risiko des Diebstahls oder unbefugten Zugriffs auf Unterlagen zwar erkannt, aber nur sporadisch und inkonsistent adressiert. Es werden keine abschließbaren Behältnisse bereitgestellt oder deren Nutzung vorgeschrieben."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch eine Befragung des Mitarbeitenden und eine Inaugenscheinnahme des Arbeitsplatzes fest, dass keine systematischen Vorkehrungen zur sicheren Aufbewahrung von Unterlagen getroffen wurden und diese teilweise offen zugänglich sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A1-m2",
                    "uuid": "2cbcec41-3f43-431e-8396-9d65cc314051",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Abschließbare Behältnisse stehen am häuslichen Arbeitsplatz zur Verfügung. Es gibt eine grundlegende Anweisung, sensible Unterlagen zu sichern, aber die Einhaltung einer konsequenten „Clean-Desk-Policy“ wird nicht überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Institution stellt einfache abschließbare Rollcontainer oder Schränke zur Verfügung. Die Verantwortung für die konsequente Nutzung und die Einhaltung einer Clean-Desk-Policy liegt vollständig beim Mitarbeitenden, ohne dass es Kontrollmechanismen gibt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass abschließbare Behältnisse vorhanden sind. Durch eine Befragung wird ermittelt, ob der Mitarbeitende die Anweisung kennt, diese zu nutzen. Eine stichprobenartige Prüfung kann zeigen, dass die Umsetzung nicht immer konsequent erfolgt."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A1-m3",
                    "uuid": "0e14e341-c0f5-47c5-abff-02324ef49988",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Dienstliche Unterlagen und Datenträger MÜSSEN am häuslichen Arbeitsplatz so aufbewahrt werden, dass keine unbefugten Personen darauf zugreifen können. Daher MÜSSEN ausreichend verschließbare Behältnisse (z. B. abschließbare Rollcontainer oder Schränke) vorhanden sein. Alle Mitarbeitenden MÜSSEN ihre Arbeitsplätze aufgeräumt hinterlassen und sicherstellen, dass keine vertraulichen Informationen frei zugänglich sind (Clean-Desk-Policy)."
                      },
                      {
                        "name": "guidance",
                        "value": "Es wird eine formale Richtlinie zur sicheren Aufbewahrung und zur Clean-Desk-Policy für den häuslichen Arbeitsplatz erstellt und an alle betreffenden Mitarbeitenden kommuniziert. Die Institution stellt sicher, dass die bereitgestellten Behältnisse eine angemessene Verschlussqualität aufweisen. Die Einhaltung der Richtlinie wird als Teil der Telearbeitsvereinbarung festgelegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Existenz und Kommunikation der Aufbewahrungs- und Clean-Desk-Richtlinie. Er verifiziert durch Einsicht in die Telearbeitsvereinbarung und Befragung des Mitarbeitenden, dass die Anforderungen bekannt sind. Eine stichprobenartige, angekündigte Video-Inspektion des Arbeitsplatzes am Ende des Arbeitstages kann zur Überprüfung der Umsetzung dienen."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A1-m4",
                    "uuid": "8309f791-febc-4dac-b69d-9b86f6d8eed6",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Einhaltung der Clean-Desk-Policy wird regelmäßig durch dokumentierte Selbstauskünfte der Mitarbeitenden überprüft. Die bereitgestellten abschließbaren Behältnisse entsprechen einer definierten Sicherheitsklasse. Der Zugriff auf Unterlagen mit hohem Schutzbedarf ist durch separate, besonders gesicherte Behältnisse geregelt."
                      },
                      {
                        "name": "guidance",
                        "value": "Mitarbeitende füllen quartalsweise eine Checkliste zur Einhaltung der Sicherheitsvorgaben am häuslichen Arbeitsplatz aus. Für die Aufbewahrung werden Schränke mit zertifizierten Sicherheitsschlössern beschafft. Dokumente werden klassifiziert und je nach Schutzbedarf unterschiedlichen Aufbewahrungsanforderungen zugeordnet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die ausgefüllten Selbstauskunfts-Checklisten. Er überprüft die Spezifikationen der eingesetzten Schließsysteme und vergleicht diese mit den internen Anforderungen. Zudem wird geprüft, ob die Klassifizierung von Dokumenten und die entsprechenden Aufbewahrungsregeln konsistent umgesetzt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "INF.8.A1-m5",
                    "uuid": "7856fa07-3db1-4b61-b9cd-f53ab273f88c",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für die Aufbewahrung von dienstlichen Unterlagen und Datenträgern werden ausschließlich zertifizierte Wertschutzschränke (Tresore) eingesetzt. Der Arbeitsraum selbst ist zutrittsgesichert, beispielsweise durch ein Smart-Lock-System mit Protokollierung. Alle ausgedruckten vertraulichen Dokumente werden automatisch mit einem digitalen Wasserzeichen versehen, um ihre Herkunft nachverfolgen zu können."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Institution beschafft und installiert Wertschutzschränke gemäß EN 1143-1 am häuslichen Arbeitsplatz. Das Zutrittskontrollsystem für den Arbeitsraum ist an ein zentrales Monitoring gekoppelt. Die Druckinfrastruktur ist so konfiguriert, dass unsichtbare Wasserzeichen (z.B. Benutzerkennung, Zeitstempel) auf alle Ausdrucke aufgebracht werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Zertifikate der Wertschutzschränke. Er prüft die Protokolldaten des Zutrittskontrollsystems auf unautorisierte Zugriffsversuche. Stichprobenartig werden ausgedruckte Dokumente auf das Vorhandensein und die Korrektheit des digitalen Wasserzeichens untersucht. Ein automatisierter Test könnte die Druck-Logs auf die erfolgreiche Anwendung der Wasserzeichen-Policy prüfen."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}