{
  "component-definition": {
    "uuid": "40929453-1569-4718-a274-1d48fef479a1",
    "metadata": {
      "title": "INF.12 Räume für technische Infrastruktur - Benutzerdefiniert",
      "last-modified": "2025-11-13T21:19:03.918470+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "27dfc37a-5dd3-41c8-8f11-74ccc2ddc6fd",
        "type": "physical",
        "title": "INF.12 Räume für technische Infrastruktur",
        "description": "This component represents the implementation of all controls for Baustein INF.12.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Die ordnungsgemäße und normgerechte Ausführung der Verkabelung ist Grundlage für einen sicheren IT-Betrieb. Dabei muss grundsätzlich zwischen der elektrotechnischen Verkabelung und der IT-Verkabelung unterschieden werden.<BR>Die elektrotechnische Verkabelung von IT-Systemen und anderen Geräten umfasst alle Kabel und Verteilungen im Gebäude vom Einspeisepunkt des Verteilungsnetzbetreibers (VNB) bis zu den Anschlüssen der Endgeräte.<BR>Die IT-Verkabelung in einer Institution umfasst alle Kommunikationskabel und passiven Komponenten wie Rangier- bzw. Spleißverteiler oder Patchfelder. Sie bildet also die physikalische Grundlage der internen Kommunikationsnetze. Die IT-Verkabelung reicht von den Übergabepunkten aus einem Fremdnetz bis zu den Anschlusspunkten der Netzteilnehmenden. Übergabepunkte sind z. B. der Anschluss eines Telekommunikationsunternehmens oder die DSL-Anbindung eines Internet-Providers.<BR>Trotz dieser Unterscheidung sind die grundlegenden Anforderungen an beide Arten der Verkabelung identisch. Daher sollte die Verkabelung innerhalb einer Institution immer auch als Ganzes betrachtet werden."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es, die gesamte elektrotechnische Verkabelung und IT-Verkabelung vor Ausfall, Manipulation und Störung zu schützen."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein INF.12 Verkabelung ist einmal auf die Verkabelung in Gebäuden und Räumen anzuwenden, zusätzlich zum Baustein INF.1 Allgemeines Gebäude. Die Anforderungen des Bausteins sind immer sowohl auf die IT- als auch auf die elektronische Verkabelung anzuwenden."
          },
          {
            "name": "2.1. Kabelbrand",
            "value": "Kabelbrände können einen Informationsverbund erheblich schädigen. Ein Kabelbrand verursacht z. B. Kurzschlüsse oder unterbricht Leiter. Infolgedessen fallen auch Schutzeinrichtungen aus. Zudem können bei Kabelbränden, abhängig von den Materialien der Isolierungen, aggressive Gase entstehen."
          },
          {
            "name": "2.2. Unzureichende Dimensionierung der Verkabelung",
            "value": "Werden Arbeitsplätze, Serverräume oder Rechenzentren geplant, dann werden diese Pläne häufig ausschließlich am aktuellen Bedarf ausgerichtet. Jedoch verlangen zukünftige neue Anforderungen oft auch nach weiteren Kapazitäten des Stromnetzes und der Datenkabel. Dies kann z. B. notwendig werden, sobald zusätzliche Server eingesetzt werden oder sich technische Standards ändern. Die Verkabelung kann aber nur in dem Umfang erweitert werden, den die bereits vorhandenen und verlegten Kabel und Kabeltrassen zulassen."
          },
          {
            "name": "2.3. Unzureichende Dokumentation der Verkabelung",
            "value": "Wenn die genaue Lage von Kabeln nicht bekannt ist, weil sie unzureichend dokumentiert wurde, dann können diese Kabel bei Bauarbeiten außerhalb oder innerhalb eines Gebäudes beschädigt werden. Eine unzureichende Dokumentation erschwert es auch, Kabel zu prüfen und zu reparieren.<BR>Darüber hinaus kann nicht davon ausgegangen werden, dass alle Kabel in den Installationszonen nach aktuell gültigen Normen installiert sind."
          },
          {
            "name": "2.4. Unzureichend geschützte Verteiler",
            "value": "Gelegentlich sind Verteilungen des Stromversorgungs- oder Datennetzes unverschlossen in Bereichen installiert, die allgemein zugänglich sind. Unbefugte Personen können solche Verteiler öffnen, manipulieren und so Ausfälle in der Strom- oder Datenversorgung herbeizuführen."
          },
          {
            "name": "2.5. Leitungsbeschädigungen",
            "value": "Je ungeschützter ein Kabel verlegt ist, desto größer ist die Gefahr, dass es absichtlich oder unabsichtlich beschädigt wird. Beschädigungen verursachen nicht nur direkte Ausfälle von Verbindungen, sondern können auch später zu Störungen führen. Eine beschädigte Isolierung beeinträchtigt unter Umständen erst mit großer zeitlicher Verzögerung die funktionellen Eigenschaften eines Kabels."
          },
          {
            "name": "2.6. Spannungsschwankungen, Überspannung, Unterspannung",
            "value": "Schwankungen der Versorgungsspannung können in allen Bereichen der Netze entstehen. Extrem kurze und kleine Ereignisse wirken sich kaum oder gar nicht auf IT-Systeme aus. Größere Schwankungen führen jedoch zu Funktionsstörungen. Die angeschlossenen Systeme können beschädigt werden bis hin zu Totalausfällen. Auch zerstörerische Überspannungen können auftreten."
          },
          {
            "name": "2.7. Verwendung qualitativ unzureichender Steckdosenleisten",
            "value": "Oft reichen die fest installierten Steckdosen für die zu betreibenden Geräte nicht aus. Um dies auszugleichen, werden häufig Steckdosenleisten verwendet. Sind diese Steckdosenleisten jedoch qualitativ unzureichend, dann können sie zur Zündquelle und damit zu einer großen Brandgefahr werden.<BR>In vielen Fällen werden mehrere Steckdosenleisten hintereinander geschaltet, um Steckplätze für alle Geräte bereitzustellen. Bei einer solchen Reihenschaltung besteht die Gefahr der Überlastung. Die Folge kann ein unvollständiger Kurzschluss mit hoher Brandgefahr sein."
          },
          {
            "name": "2.8. Unzulässige Kabelverbindungen",
            "value": "In manchen Fällen werden zwischen IT-Systemen oder anderen technischen Komponenten Kabelverbindungen hergestellt, die nicht vorgesehen und unzulässig sind. Dies kann Sicherheitsprobleme oder Betriebsstörungen verursachen.<BR>So ermöglichen solche Kabelverbindungen unter Umständen, dass unerlaubt auf Datennetze, IT-Systeme, Informationen oder Anwendungen zugegriffen werden kann. Durch unzulässige Kabelverbindungen können Informationen auch zu falschen Empfangenden übertragen werden. Zudem kann die Verbindung gestört werden."
          },
          {
            "name": "2.9. Leitungsbeeinträchtigungen",
            "value": "Die elektrische Signalübertragung in Kommunikationskabeln kann durch elektrische und magnetische Felder negativ beeinflusst werden. Eine spezielle Form dieser Leitungsbeeinträchtigung ist Übersprechen. Dabei werden Ströme und Spannungen von benachbarten Leitungen als Störsignale auf das Kommunikationskabel übertragen."
          },
          {
            "name": "2.10. Abhören und Manipulation von Kabeln",
            "value": "Abhörangriffe auf Datenkabel sind eine Gefahr für die Informationssicherheit, die nicht vernachlässigt werden sollte. Grundsätzlich gibt es keine abhörsicheren Kabel. Die Kabel unterscheiden sich in ihrer Qualität lediglich hinsichtlich des Aufwands, der zum Abhören der Leitung betrieben werden muss. Ob ein Kabel tatsächlich abgehört wird, ist nur mit hohem messtechnischem Aufwand feststellbar.<BR>Daneben stellen bewusste Manipulationen von Kabeln bis hin zu ihrer Zerstörung eine Gefahr für die Institution dar. Fehlfunktionen von Kabeln können in manipulativer Absicht bewusst herbeigeführt werden. Solche Manipulationen verfolgen oftmals das Ziel, den IT-Betrieb zu stören oder die Institution zu schädigen."
          }
        ],
        "control-implementations": [
          {
            "uuid": "d19900a9-0e1d-4659-b367-39c6b4c0cfc7",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/rume_fr_technische_infrastruktur_profile.json",
            "description": "Implementation for all controls in Baustein INF.12",
            "implemented-requirements": [
              {
                "uuid": "36d73f39-fadb-4018-af68-cf19fda2dff6",
                "control-id": "GEB.1.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DOCS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a10-m1",
                    "uuid": "318aac1a-95ce-4c00-bb70-be169b69b94e",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Dokumentation der Verkabelung existiert nicht oder ist stark veraltet und unvollständig. Kabel und Anschlüsse sind nicht oder inkonsistent gekennzeichnet."
                      },
                      {
                        "name": "guidance",
                        "value": "Um herauszufinden, welcher Switch-Port zu welcher Dose im Büro gehört, muss ein Techniker mit einem Kabelsuchgerät die Leitung 'durchklingeln'. Pläne existieren nicht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, dass keine verwertbare Verkabelungsdokumentation vorhanden ist. Eine Sichtprüfung in einem Verteiler zeigt ein chaotisches Bild ohne lesbare oder nachvollziehbare Kennzeichnungen an den Kabeln und Patchfeldern."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a10-m2",
                    "uuid": "7d2a979c-1196-4923-9f60-d7aa53fb4563",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es existiert eine grundlegende Dokumentation, meist in Form von Excel-Listen und einfachen Plänen. Die Kennzeichnung der Anschlüsse ist vorhanden, aber nicht immer systematisch oder aktuell. Änderungen werden nur unregelmäßig nachgepflegt."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine Excel-Tabelle, die jedem Port auf dem Patchfeld eine Raumnummer und eine Dosennummer zuordnet. Die Patchkabel zwischen Switch und Patchfeld sind jedoch nicht dokumentiert. Wenn neue Anschlüsse hinzukommen, wird die Liste manchmal, aber nicht immer, aktualisiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die vorhandenen Dokumentationsunterlagen. Bei einer stichprobenartigen Überprüfung im Verteiler wird festgestellt, dass die Kennzeichnungen auf den Patchfeldern mit der Dokumentation übereinstimmen, aber die Dokumentation seit über einem Jahr nicht mehr aktualisiert wurde und neuere Änderungen fehlen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a10-m3",
                    "uuid": "9915da9d-e4e1-4a84-a52b-9c1ab5f124dd",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine Institution SOLLTE sicherstellen, dass sie für ihre Verkabelung sowohl über eine interne (detaillierte) als auch eine externe (neutrale Beschriftung der Anschlüsse) Dokumentation verfügt. Die interne Dokumentation MUSS alle Aufzeichnungen zur Installation und zum Betrieb enthalten. Jede Veränderung im Netz SOLLTE dokumentiert werden, wobei die Stammdokumentation spätestens 4 Wochen nach Abschluss der Arbeiten aktualisiert sein MUSS. Die Dokumentation SOLLTE regelmäßig überprüft und aktualisiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Verkabelung wird in einem CAFM- oder DCIM-System dokumentiert. Dies umfasst Trassenpläne, Kabelpläne und Patchlisten (Ende-zu-Ende-Verbindung). Jedes Kabel und jeder Port ist nach einem einheitlichen Schema eindeutig gekennzeichnet. Änderungen werden zunächst in einer Arbeitsversion dokumentiert und nach Abschluss der Arbeiten innerhalb der 4-Wochen-Frist in die Stammdokumentation überführt. Jährlich wird eine Überprüfung der Dokumentation auf Aktualität durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Verkabelungsdokumentation im Verwaltungssystem. Es wird geprüft, ob der Detaillierungsgrad ausreichend ist und ob ein Prozess zur Aktualisierung definiert und gelebt wird. Anhand von Änderungsanträgen der letzten Monate wird kontrolliert, ob die 4-Wochen-Frist zur Aktualisierung eingehalten wurde. Stichproben vor Ort verifizieren die Korrektheit der Kennzeichnung und der Dokumentation."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a10-m4",
                    "uuid": "e1a7e90c-9d55-462f-8655-818df01af004",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Verkabelungsdokumentation ist mit anderen Verwaltungssystemen, wie dem Netzwerk-Monitoring oder dem Asset-Management, verknüpft. Die Konsistenz der Daten zwischen den Systemen wird regelmäßig automatisiert geprüft. Die Kennzeichnung der Kabel erfolgt mit langlebigen, maschinenlesbaren Etiketten (z.B. Barcodes)."
                      },
                      {
                        "name": "guidance",
                        "value": "Im DCIM-System ist nicht nur das Kabel dokumentiert, sondern auch, welcher Switch (aus dem Asset Management) an welchem Port angeschlossen ist und welche MAC-Adresse (aus dem Netzwerk-Monitoring) an der zugehörigen Dose aktiv ist. Ein nächtlicher Abgleich prüft diese Verknüpfungen und meldet Inkonsistenzen. Alle Kabel und Ports sind mit Barcodes versehen, die bei Änderungen mit einem mobilen Gerät gescannt werden können."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Schnittstellen zwischen den Managementsystemen und die Konfiguration der Konsistenzprüfungen. Die Protokolle dieser Prüfungen werden eingesehen. Bei einer Begehung wird die Funktionalität der Barcode-gestützten Erfassung stichprobenartig getestet."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a10-m5",
                    "uuid": "3c6f91c5-5419-4d61-ba65-e75c6db03ee3",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Dokumentation und Kennzeichnung ist vollständig automatisiert durch ein Automated Infrastructure Management (AIM) System. Jede physische Änderung an der Verkabelung wird von Sensoren am Patchfeld in Echtzeit erfasst und die Dokumentation wird sofort und ohne manuelles Eingreifen aktualisiert. Unautorisierte Änderungen lösen einen Alarm aus."
                      },
                      {
                        "name": "guidance",
                        "value": "Intelligente Patchfelder mit RFID- oder Kontakt-Sensoren registrieren das Stecken und Ziehen jedes Patchkabels. Das AIM-System aktualisiert die Verbindungsdatenbank in Echtzeit. Wenn ein Techniker ein Kabel umsteckt, ohne einen entsprechenden Arbeitsauftrag im System zu haben, wird eine Sicherheitsmeldung an den IT-Betrieb generiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Konfiguration des AIM-Systems, insbesondere die Alarmierungsregeln. Die Revisionssicherheit der automatisch erstellten Protokolle wird bewertet. Durch eine Test-Änderung (Ziehen und Stecken eines Kabels) wird die Echtzeit-Aktualisierung der Dokumentation und die Auslösung eines Alarms live verifiziert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "2d19d129-1637-4cfb-a267-fa9f290a08ac",
                "control-id": "GEB.10.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a4-m1",
                    "uuid": "29219305-970b-4f04-afcd-13cb20ec99c8",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Stromversorgung wird ohne besondere Berücksichtigung der elektromagnetischen Verträglichkeit (EMV) installiert. Die Netzform (z.B. TN-C oder TN-S) ist nicht durchgängig bekannt oder dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Bei Renovierungen werden neue Steckdosen einfach an die vorhandene, oft veraltete Elektroinstallation angeschlossen, ohne zu prüfen, ob ein durchgängiger Schutzleiter vorhanden ist."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt fest, dass keine Dokumentation über den Aufbau des Stromverteilnetzes vorliegt. Messungen an Steckdosen zeigen inkonsistente oder fehlende Schutzleiterverbindungen, was auf ein unsicheres TN-C- oder gemischtes Netz hindeutet."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a4-m2",
                    "uuid": "28a9fe27-2e2b-40bc-b8f2-74a4fac8d3e4",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In Neubauten oder bei größeren Sanierungen wird ein TN-S-System als Standard für die Stromversorgung umgesetzt. Eine detaillierte EMV-Planung, wie die Einhaltung von Trennungsabständen oder Maßnahmen gegen Einstrahlungen, erfolgt jedoch nicht systematisch."
                      },
                      {
                        "name": "guidance",
                        "value": "Der beauftragte Elektriker wird angewiesen, die Installation als TN-S-System auszuführen. Die Kabel werden jedoch oft direkt neben Datenkabeln verlegt, ohne die normativ geforderten Trennungsabstände zu berücksichtigen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert anhand der Elektropläne, dass ein TN-S-System geplant wurde. Bei einer Begehung wird stichprobenartig geprüft, ob die Trennungsabstände zwischen Strom- und Datenleitungen eingehalten werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a4-m3",
                    "uuid": "edeeb355-e2a1-4773-8511-9146f703a6b9",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Stromversorgung MUSS EMV-tauglich sein. Dafür MUSS das Stromverteilnetz als TN-S-System aufgebaut sein. Bei Aufbau und Betrieb MÜSSEN die in den entsprechenden Normen empfohlenen Trennungsabstände soweit wie möglich eingehalten werden. Grundlegende Vorkehrungen gegen Einstrahlungen von außen, Abstrahlung durch die Stromleitung sowie zur Erkennung von Ausgleichsströmen MÜSSEN getroffen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die gesamte Elektroplanung orientiert sich an der EMV-Normenreihe (z.B. DIN EN 61000). Dies beinhaltet die konsequente Umsetzung eines TN-S-Netzes ab dem Hausanschluss, die Einhaltung von Trennungsabständen oder die Verwendung von Trennstegen und geschirmten Stromkabeln in kritischen Bereichen. Ein zentraler Potenzialausgleich wird fachgerecht installiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Elektroplanungsunterlagen und prüft diese auf Konformität mit den EMV-Anforderungen. Es wird verifiziert, dass ein TN-S-System dokumentiert und umgesetzt ist. Messungen des Schutzleitersystems und des Potenzialausgleichs werden durchgeführt, um die korrekte Installation zu bestätigen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a4-m4",
                    "uuid": "7513d9e5-caea-4195-adda-2efe43dae817",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zum EMV-gerechten Aufbau werden an kritischen Stellen, wie in Serverräumen oder bei empfindlichen Geräten, Netzfilter und/oder spezielle EMV-geschirmte Verteiler eingesetzt, um Störungen weiter zu reduzieren. Es finden regelmäßige Messungen statt, um die Einhaltung der EMV-Parameter im Betrieb zu überwachen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Stromversorgung des Rechenzentrums wird über spezielle EMV-Filter geführt. Die Stromverteiler im Rack sind metallisch gekapselt. Jährlich wird eine Messung der Netzqualität und der Ausgleichsströme durch eine Fachfirma durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Dokumentation und die Spezifikationen der eingesetzten Netzfilter und Sonderverteiler. Die Protokolle der regelmäßigen EMV-Messungen werden eingesehen und auf Anomalien oder Trends geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a4-m5",
                    "uuid": "443062d7-4372-4307-8660-3af2dbfcf23c",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Stromversorgung ist Teil eines umfassenden EMV-Schutzkonzeptes, das alle Infrastrukturbereiche (Blitzschutz, Erdung, Verkabelung) integriert. Die Netzqualität und potenzielle Störgrößen werden durch ein permanentes Monitoringsystem in Echtzeit überwacht. Bei Abweichungen werden automatisch Alarme ausgelöst."
                      },
                      {
                        "name": "guidance",
                        "value": "An den zentralen Einspeisepunkten der Stromversorgung sind Power Quality Analyzer (PQA) installiert, die permanent Spannung, Strom, Frequenz und Oberschwingungen messen. Die Daten werden in einem zentralen Managementsystem gesammelt und ausgewertet. Bei kritischen Abweichungen wird der IT-Betrieb automatisch benachrichtigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert das EMV-Gesamtkonzept auf seine Stimmigkeit und Vollständigkeit. Die Konfiguration des PQA-Monitoringsystems wird geprüft, inklusive der definierten Schwellenwerte und der Alarmierungskette. Es wird verifiziert, dass die Live-Daten korrekt erfasst werden und dass auf Alarme angemessen reagiert wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "d170a34f-cad2-4bda-817c-4143ddc7f4c8",
                "control-id": "GEB.10.1.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "BES",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a5-m1",
                    "uuid": "b86072ad-552e-4acc-aa9d-1a8654cbd6c6",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Planung der Verkabelung orientiert sich ausschließlich am unmittelbaren, aktuellen Bedarf. Zukünftige Entwicklungen oder Schutzziele wie Vertraulichkeit werden nicht berücksichtigt."
                      },
                      {
                        "name": "guidance",
                        "value": "Für ein neues Büro für 10 Mitarbeiter werden genau 10 Netzwerkanschlüsse bestellt. Die Möglichkeit, dass in Zukunft mehr Anschlüsse oder höhere Bandbreiten benötigt werden, wird ignoriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch Interviews fest, dass keine strategische Planung für die Verkabelung existiert. Projektdokumentationen bestätigen, dass die Dimensionierung immer nur den Status quo abbildet."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a5-m2",
                    "uuid": "c68eae5b-7793-4838-9f81-a1321f8d2da8",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei der Planung der Verkabelung wird eine pauschale Reserve für zukünftiges Wachstum eingeplant. Die grundlegenden Schutzziele Verfügbarkeit und Integrität werden implizit durch die Verwendung von Standardkomponenten adressiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Regel lautet: 'Immer doppelt so viele Anschlüsse installieren, wie aktuell benötigt'. Eine detailliertere Analyse, z.B. über zukünftige Technologien (WLAN, VoIP) oder Sicherheitsanforderungen, findet nicht statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz und Anwendung der pauschalen Planungsregeln. Es wird bewertet, ob dieser Ansatz ausreicht, um den mittelfristigen Bedarf zu decken, und ob grundlegende Schutzziele zumindest implizit erfüllt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a5-m3",
                    "uuid": "ea04a396-51a3-4ab5-8f35-d1856979c0b7",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Grundsätzlich SOLLTEN die Anforderungen analysiert werden, die Einfluss auf eine zukunftssichere, bedarfsgerechte und wirtschaftliche Ausführung der Verkabelung haben. In dieser Anforderungsanalyse SOLLTE zunächst die kurzfristige Nutzung abgeschätzt werden. Darauf aufbauend SOLLTE die längerfristige Entwicklung abgeschätzt werden. Darüber hinaus MÜSSEN die Schutzziele der Verfügbarkeit, Integrität und Vertraulichkeit bei der Anforderungsanalyse mit betrachtet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor größeren Verkabelungsprojekten wird ein Workshop mit Vertretern der IT, der Haustechnik und der Nutzer durchgeführt. In einem Dokument werden der aktuelle Bedarf, der prognostizierte Bedarf für die nächsten 5-7 Jahre (z.B. durch neue Technologien wie Wi-Fi 7, IoT) und die spezifischen Schutzanforderungen (z.B. Notwendigkeit von geschirmten Kabeln in Entwicklungsabteilungen) festgehalten. Dieses Dokument ist die Grundlage für die Detailplanung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Dokumentation der Anforderungsanalyse. Es wird geprüft, ob sowohl kurz- als auch längerfristige Aspekte berücksichtigt wurden und ob die Schutzziele Verfügbarkeit, Integrität und Vertraulichkeit adressiert wurden. Die Nachvollziehbarkeit der Bedarfsprognose wird bewertet."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a5-m4",
                    "uuid": "4033f393-8478-4cd3-910b-a38faa90ff36",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anforderungsanalyse ist ein formalisierter und wiederkehrender Prozess. Sie basiert auf strukturierten Kapazitätsprognosen und einer detaillierten Risikoanalyse. Die Ergebnisse fließen nicht nur in die technische Planung, sondern auch in die Budgetplanung und die strategische IT-Ausrichtung ein."
                      },
                      {
                        "name": "guidance",
                        "value": "Jährlich wird im Rahmen der IT-Strategieplanung auch die Verkabelungsinfrastruktur bewertet. Trendanalysen (z.B. Zunahme des Datenverkehrs, Anzahl der Endgeräte) werden genutzt, um den zukünftigen Bedarf zu modellieren. Eine Risikoanalyse bewertet Bedrohungen wie physische Manipulation oder Abhören und leitet daraus konkrete Anforderungen an die Verkabelung ab (z.B. Notwendigkeit von Leitungswegesicherung)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass der Prozess der Anforderungsanalyse fest in den IT-Planungsprozessen verankert ist. Die Qualität der Kapazitätsprognosen und der Risikoanalyse wird bewertet. Es wird geprüft, ob die Ergebnisse der Analyse nachweislich in konkrete Planungs- und Budgetentscheidungen eingeflossen sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a5-m5",
                    "uuid": "8c72cde7-b728-4159-bf36-df20e90a71bb",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Anforderungsanalyse wird durch ein automatisiertes System unterstützt, das kontinuierlich Nutzungs- und Leistungsdaten der Netzwerkinfrastruktur sammelt. Mithilfe von KI-gestützten Prognosemodellen wird der zukünftige Bedarf dynamisch vorhergesagt und es werden proaktiv Vorschläge für notwendige Erweiterungen oder Modernisierungen generiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Netzwerk-Monitoring-System, gekoppelt mit einem DCIM-Tool, erfasst permanent Port-Belegung, Bandbreitennutzung und das Wachstum der angebundenen Geräte. Das System meldet, wenn die Kapazität einer Trasse voraussichtlich in 6 Monaten 80% erreichen wird und erstellt automatisch ein Ticket mit einem Vorschlag für eine Erweiterung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration und die Wirksamkeit des automatisierten Analyse- und Prognosesystems. Die Genauigkeit der Vorhersagemodelle wird anhand historischer Daten überprüft. Es wird kontrolliert, ob die vom System generierten Vorschläge zeitnah und angemessen bearbeitet werden."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "40f081d8-cb07-4c2c-955a-30c8b5e935b0",
                "control-id": "GEB.10.1.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a14-m3",
                    "uuid": "b6bc9798-132e-49d9-84f1-760e109284fe",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE geprüft werden, ob anstelle einer einzügigen Stromversorgung eine zweizügige sogenannte A-B-Versorgung geschaffen werden soll, die wichtige IT-Komponenten und andere Verbraucher versorgt. Die grundsätzliche Planung einer solchen Versorgung wird erstellt, jedoch ohne permanente Überwachung der Funktionsfähigkeit."
                      },
                      {
                        "name": "guidance",
                        "value": "Für den Serverraum wird eine A-B-Versorgung geplant. Dies bedeutet, dass zwei komplett getrennte Stromversorgungswege von der Hauptverteilung bis zu den Racks aufgebaut werden. Jeder Weg wird durch eine eigene USV abgesichert. Die Racks werden mit zwei getrennten PDUs (Power Distribution Units) ausgestattet, eine für den A-Weg und eine für den B-Weg. Server mit redundanten Netzteilen werden an beide PDUs angeschlossen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Planungsunterlagen der Elektroinstallation für den Serverraum. Es wird verifiziert, dass zwei unabhängige Versorgungswege (A und B) von der Einspeisung bis zu den PDUs in den Racks geplant und dokumentiert sind. Eine Sichtprüfung bestätigt die getrennte Kabelführung und die doppelte Ausstattung mit USVs und PDUs."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a14-m4",
                    "uuid": "db0dcb2c-44f0-4cb0-adc7-215e169f0404",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine zweizügige A-B-Versorgung ist für alle wichtigen IT-Komponenten implementiert. Die Funktionsfähigkeit beider Stromversorgungswege wird permanent durch geeignete technische Einrichtungen überwacht. Die Überwachung umfasst die USV-Systeme und die PDUs."
                      },
                      {
                        "name": "guidance",
                        "value": "Die implementierte A-B-Versorgung wird durch ein Monitoringsystem überwacht. Die USV-Anlagen und die intelligenten PDUs sind an das Netzwerk angebunden und melden ihren Status (Last, verbleibende Autonomiezeit, Fehler) an eine zentrale Überwachungskonsole. Bei Ausfall eines Versorgungsweges oder einer Komponente wird automatisch ein Alarm ausgelöst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Implementierung der A-B-Versorgung durch eine Begehung. Es wird die Konfiguration des Überwachungssystems geprüft. Durch einen simulierten Ausfall (z.B. Abschalten eines Sicherungsautomaten des A-Wegs) wird getestet, ob die Überwachung korrekt funktioniert, die Verbraucher weiterversorgt werden und der Alarm ausgelöst wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a14-m5",
                    "uuid": "e435be1f-eb21-44af-8a6a-8fb765624e10",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die A-B-Versorgung ist durchgängig redundant bis zu den einzelnen Komponenten aufgebaut und wird durch zwei physisch getrennte und aus unterschiedlichen Quellen gespeiste Netzeinspeisungen realisiert. Die Umschaltung im Fehlerfall erfolgt vollautomatisch und wird regelmäßig getestet. Die Lastverteilung zwischen A- und B-Weg wird aktiv gemanagt, um eine gleichmäßige Auslastung sicherzustellen."
                      },
                      {
                        "name": "guidance",
                        "value": "Das Gebäude verfügt über zwei unabhängige Hausanschlüsse, die von unterschiedlichen Umspannwerken versorgt werden. Jeder Versorgungsweg (A und B) wird von einem dieser Anschlüsse, einer separaten Netzersatzanlage und einer eigenen USV-Farm gespeist. Die PDUs in den Racks messen permanent die Last und das Managementsystem kann bei Ungleichgewicht Empfehlungen zur Umverteilung von Verbrauchern geben. Monatlich werden automatisierte Failover-Tests durchgeführt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Verträge mit dem Energieversorger und die Planungsunterlagen, um die Unabhängigkeit der beiden Einspeisungen zu verifizieren. Die Konfiguration des Lastmanagements und der automatisierten Failover-Tests wird geprüft. Die Protokolle der Tests werden eingesehen und auf erfolgreiche und unterbrechungsfreie Umschaltungen kontrolliert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "a59081ca-7bd0-4d9b-bd11-a74679f3d9af",
                "control-id": "GEB.10.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Audit",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "PERF",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a12-m1",
                    "uuid": "61a8c5bb-05c4-4b2e-bac5-4bc8abbc8bba",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Prüfungen elektrischer Anlagen und Betriebsmittel finden nicht oder nur auf explizite Anforderung nach einem Vorfall statt. Es gibt keinen präventiven Prüfprozess."
                      },
                      {
                        "name": "guidance",
                        "value": "Elektrische Geräte werden so lange betrieben, bis sie ausfallen. Eine regelmäßige Prüfung nach DGUV Vorschrift 3 findet nicht statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer findet keine Prüfprotokolle oder Prüfplaketten an elektrischen Anlagen und Geräten. Interviews bestätigen, dass kein regelmäßiger Prüfzyklus etabliert ist."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a12-m2",
                    "uuid": "384e0edf-82d6-4819-8a5f-615a51f48900",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ortsveränderliche elektrische Betriebsmittel (z.B. Monitore, Netzteile) werden in unregelmäßigen Abständen geprüft. Ortsfeste Anlagen wie die Elektroverteilung werden selten oder gar nicht geprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle paar Jahre wird ein Dienstleister beauftragt, die elektrischen Geräte an den Arbeitsplätzen zu prüfen. Die fest installierte Elektroinfrastruktur in den Wänden und Verteilern wird dabei jedoch ausgelassen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer findet Prüfplaketten an vielen Endgeräten, kann aber keine Prüfprotokolle für die Elektroverteilungen oder festen Installationen einsehen. Die Prüffristen für die Endgeräte sind teilweise überschritten."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a12-m3",
                    "uuid": "60a6a5bb-0671-4eb0-82cc-c7858bb17f33",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Alle elektrischen Anlagen und Betriebsmittel SOLLTEN gemäß DGUV Vorschrift 3 regelmäßig geprüft werden. Alle Unregelmäßigkeiten MÜSSEN unverzüglich dokumentiert und den zuständigen Organisationseinheiten gemeldet werden. Diese MÜSSEN die Mängel so zeitnah beheben, dass eine Gefährdung von Personen ausgeschlossen werden kann. Die Verfügbarkeit MUSS hierbei im erforderlichen Maß sichergestellt sein."
                      },
                      {
                        "name": "guidance",
                        "value": "Es ist eine verantwortliche Elektrofachkraft benannt. Es existiert ein Prüfkonzept mit definierten Prüffristen für alle ortsfesten und ortsveränderlichen elektrischen Anlagen und Betriebsmittel. Die Prüfungen werden von qualifiziertem Personal durchgeführt und in einem Prüfprotokoll dokumentiert. Festgestellte Mängel werden in einer Mängelliste erfasst und deren Behebung wird nachverfolgt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Prüfkonzept und die Gefährdungsbeurteilung, auf der die Prüffristen basieren. Es werden die Prüfprotokolle der letzten Prüfzyklen eingesehen. Stichprobenartig wird die Existenz von Prüfplaketten kontrolliert. Die Mängelliste wird auf offene, kritische Punkte und auf die Geschwindigkeit der Mängelbehebung geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a12-m4",
                    "uuid": "cfdd052c-4647-4389-9e0c-e782b32a55a3",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Verwaltung der Prüfungen, Fristen und Protokolle erfolgt über eine spezialisierte Softwarelösung. Diese erinnert automatisch an anstehende Prüfungen und eskaliert überfällige Prüfungen. Mängel werden direkt in der Software erfasst und als Workflows an die zuständigen Techniker zur Behebung weitergeleitet."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Software für die Instandhaltungsplanung (z.B. CAFM-Modul) verwaltet alle elektrischen Assets und deren Prüffristen. Der Prüfer erfasst die Prüfergebnisse vor Ort auf einem mobilen Gerät direkt in der Software und druckt die Prüfplakette aus. Ein festgestellter Mangel erzeugt automatisch ein Ticket im Ticketsystem der Haustechnik."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert den in der Software abgebildeten Prüf- und Mängelbehebungsprozess. Es wird die Konfiguration der Erinnerungs- und Eskalationsmechanismen geprüft. Anhand der Systemdaten wird die Einhaltung der Prüffristen und die durchschnittliche Zeit zur Mängelbehebung (Mean Time to Repair) ausgewertet."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a12-m5",
                    "uuid": "e62f2a30-21aa-4a29-8b82-4bf4d867b1ac",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Kritische elektrische Anlagen werden permanent durch Monitoringsysteme überwacht (z.B. Isolationsüberwachung, Differenzstrom-Monitoring). Dies ermöglicht die Erkennung von schleichenden Fehlern, lange bevor sie zu einer Gefahr oder einem Ausfall führen, und reduziert die Notwendigkeit von Prüfungen, die eine Abschaltung erfordern."
                      },
                      {
                        "name": "guidance",
                        "value": "In den Stromverteilungen des Rechenzentrums sind Differenzstrom-Überwachungsgeräte (RCMs) installiert, die permanent Fehlerströme messen. Eine langsame Verschlechterung der Isolation eines Geräts wird so frühzeitig erkannt. Die Messwerte werden zentral protokolliert und analysiert. Bei Überschreitung von Vorwarn-Schwellenwerten wird die Instandhaltung informiert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Konzeption und die Installationsdokumentation des permanenten Monitoringsystems. Die Konfiguration der Schwellenwerte und Alarme wird geprüft. Anhand der aufgezeichneten Messdaten wird die Wirksamkeit des Systems zur Früherkennung von Fehlern bewertet."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "0b16bae5-95ef-479d-89ce-756d7f653cc7",
                "control-id": "GEB.10.4",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a7-m1",
                    "uuid": "bb7325a9-339d-4319-afea-0271fbd539a4",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein Überspannungsschutz ist nur punktuell, z.B. in Form von Steckdosenleisten mit integriertem Schutz für einzelne, als wichtig erachtete Geräte, vorhanden. Ein systematisches Konzept fehlt."
                      },
                      {
                        "name": "guidance",
                        "value": "Für den Hauptserver wurde eine teure USV mit Überspannungsschutz angeschafft. Die normalen Büroarbeitsplätze und die Netzwerk-Switches sind jedoch ungeschützt an der normalen Stromversorgung angeschlossen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt bei einer Begehung fest, dass ein durchgängiges Überspannungsschutzkonzept fehlt. Der Schutz beschränkt sich auf wenige Insellösungen. Es gibt keine Dokumentation, die den Schutzbedarf und die umgesetzten Maßnahmen beschreibt."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a7-m2",
                    "uuid": "8552e129-6dc6-4612-9780-73875d1bdee2",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Am Gebäudeeintritt ist ein Grobschutz (Typ 1) für die Stromversorgung installiert. Ein weiterführendes, koordiniertes Schutzkonzept für Mittel- und Feinschutz (Typ 2, Typ 3) fehlt jedoch oder ist nur lückenhaft umgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Energieversorger hat bei der Installation des Hausanschlusses einen Kombi-Ableiter Typ 1+2 gesetzt. In den Unterverteilungen und an den Endgeräten gibt es jedoch keine weiteren Schutzstufen, wodurch die Schutzwirkung des Grobschutzes nicht voll wirksam wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz des Überspannungsschutzes am Gebäudeeintritt durch Einsicht in die Dokumentation der Elektroinstallation und durch Sichtprüfung. Es wird festgestellt, dass die nachfolgenden Schutzstufen in den Unterverteilungen und an den Endgeräten fehlen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a7-m3",
                    "uuid": "ef85a536-7c52-4d85-b18a-92810ac4cc82",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Jedes elektrisch leitende Netz SOLLTE gegen Überspannungen geschützt werden. Hierfür MUSS ein entsprechendes Überspannungsschutzkonzept erstellt werden, das den gültigen Normen entspricht. Das Konzept MUSS alle relevanten Netze (Strom, Daten, Telekommunikation) umfassen. Netzersatzanlagen (NEA) und unterbrechungsfreie Stromversorgungen (USV) MÜSSEN in das Konzept aufgenommen werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es liegt ein ganzheitliches Überspannungsschutzkonzept vor, das von einer Elektrofachkraft erstellt wurde. Es sieht ein mehrstufiges Schutzsystem (Typ 1, Typ 2, Typ 3) für die Stromversorgung vor. Zusätzlich sind Überspannungsschutzableiter für ankommende Telekommunikations- und Datenleitungen installiert. Die Schutzgeräte sind aufeinander abgestimmt (koordiniert)."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das dokumentierte Überspannungsschutzkonzept und prüft es auf Vollständigkeit und Konformität mit den relevanten Normen (z.B. DIN VDE 0100-443 und -534). Bei einer Begehung wird stichprobenartig die korrekte Installation der Schutzgeräte in der Hauptverteilung, den Unterverteilungen und in der Nähe der Endgeräte verifiziert."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a7-m4",
                    "uuid": "84d1997a-0e7c-49b7-8581-5b937c68e277",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Das Überspannungsschutzkonzept wird regelmäßig, z.B. alle 2 Jahre, auf seine Aktualität und Wirksamkeit überprüft und bei Bedarf angepasst. Die Funktionsfähigkeit der installierten Überspannungsschutzgeräte (SPDs) wird regelmäßig durch Messungen oder durch Geräte mit Statusanzeige kontrolliert."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Überspannungsschutzgeräte mit Fernsignalisierung eingesetzt. Der Status aller Geräte wird zentral in der Gebäudeleittechnik erfasst und überwacht. Fällt ein Schutzgerät aus, wird automatisch ein Wartungsticket erstellt. Zusätzlich findet alle 2 Jahre eine Überprüfung des Gesamtkonzepts durch einen externen Spezialisten statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Protokolle der regelmäßigen Überprüfungen des Schutzkonzepts. Es wird die Funktionsweise der Fernsignalisierung verifiziert, z.B. durch Einsicht in die Gebäudeleittechnik oder durch Prüfung der Logfiles. Es wird geprüft, ob auf Ausfälle von Schutzgeräten zeitnah reagiert wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a7-m5",
                    "uuid": "c18d3fa5-c294-43af-b3e1-a7b1deddf34f",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Ein intelligentes Überspannungsschutzsystem überwacht kontinuierlich den Zustand der Schutzgeräte und misst gleichzeitig auftretende Überspannungsereignisse. Die gesammelten Daten werden analysiert, um das Schutzkonzept dynamisch zu optimieren und potenzielle Schwachstellen proaktiv zu identifizieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Moderne, vernetzte Überspannungsschutzgeräte (SPDs) melden nicht nur ihren eigenen Zustand, sondern auch die Anzahl und Stärke der abgeleiteten Überspannungen. Diese Daten werden in einer zentralen Datenbank gesammelt und korreliert, um z.B. festzustellen, ob bestimmte Gebäudeteile oder Anlagen besonders häufig betroffen sind. Daraus werden gezielte Verbesserungsmaßnahmen abgeleitet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des intelligenten Schutzsystems und die gesammelten Daten. Es wird bewertet, ob die Analyse der Daten zu nachweisbaren Verbesserungen des Schutzkonzeptes geführt hat. Die Vollständigkeit und Integrität der erfassten Ereignisdaten wird geprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "4bf50d66-0823-4aa6-8fed-41cc50966aae",
                "control-id": "GEB.10.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "REAL",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a3-m1",
                    "uuid": "9b4b47df-e0c1-42e4-b1f7-4fa448f1eedf",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Installation der Verkabelung wird ohne formale Abnahme oder Überprüfung durch eine fachkundige Person durchgeführt. Die Qualität der Arbeit hängt allein vom ausführenden Dienstleister ab. Normen werden nicht explizit eingefordert oder überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein Elektriker wird beauftragt, neue Dosen zu setzen. Nach Abschluss der Arbeit wird die Rechnung bezahlt, ohne dass die Verbindungen gemessen oder die Installation auf Einhaltung der Biegeradien oder Zugkräfte geprüft wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer findet bei einer Sichtprüfung offensichtliche Installationsmängel wie geknickte Kabel, zu eng gezogene Kabelbinder oder nicht fachgerecht angeschlossene Dosen. Es liegen keine Messprotokolle vor, die die Funktionsfähigkeit der Verkabelung belegen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a3-m2",
                    "uuid": "f0d1b06d-7cc1-4283-b8a6-61518e320846",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Installationsarbeiten werden von als fachkundig angesehenen Dienstleistern durchgeführt. Es wird eine grundlegende Funktionsprüfung nach der Installation vorgenommen (z.B. Link-Test), aber eine detaillierte Überprüfung aller normativen Vorgaben oder eine formale Abnahme findet nicht statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Nach der Installation neuer Netzwerkanschlüsse wird vom Installateur ein einfaches Übergabeprotokoll mit den Ergebnissen eines einfachen Verbindungstests übergeben. Eine Überprüfung der Kabelwege auf mögliche Beschädigungen oder die Einhaltung von Normen bei der Verlegung erfolgt nicht."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die vorhandenen Übergabeprotokolle. Es wird geprüft, ob diese eine ausreichende Aussagekraft haben. Bei einer Begehung wird stichprobenartig auf die Einhaltung grundlegender Installationsregeln geachtet, z.B. saubere Verlegung und Zugentlastung."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a3-m3",
                    "uuid": "f886426a-effd-4836-b968-2354a7be4fc7",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Installationsarbeiten der Verkabelung MÜSSEN fachkundig und sorgfältig erfolgen, wobei alle relevanten Normen beachtet werden. Die fachgerechte Ausführung MUSS durch eine fachkundige Person in allen Phasen überprüft werden. Dies beinhaltet die Prüfung des Materials bei Anlieferung, die Überwachung der Montage auf Beschädigungen und die Sicherstellung, dass die Kabelwege so gewählt sind, dass eine Beschädigung durch die normale Nutzung des Gebäudes ausgeschlossen ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein externer Dienstleister wird mit der Installation beauftragt. Im Vertrag wird die Einhaltung der DIN EN 50174 und die Übergabe von qualifizierten Messprotokollen (Zertifizierungsmessung) für jede Verbindung gefordert. Ein interner Verantwortlicher (z.B. von der Haustechnik) begleitet die Arbeiten und führt eine Sichtprüfung sowie eine Plausibilitätskontrolle der Protokolle durch."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass für alle Neuinstallationen Verträge vorliegen, die die Einhaltung von Normen fordern. Es werden die Abnahmeprotokolle und die dazugehörigen, detaillierten Messprotokolle (z.B. für Permanent Link oder Channel) eingesehen. Stichprobenartig wird die Qualität der sichtbaren Installation (z.B. an Patchfeldern und Dosen) überprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a3-m4",
                    "uuid": "4e5ff7a0-b453-4f8e-9ca9-5ad97b7f0c62",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Installationsqualität wird durch einen mehrstufigen, formalisierten Abnahmeprozess sichergestellt. Zusätzlich zur Überprüfung durch eine interne fachkundige Person wird die Abnahme stichprobenartig durch einen unabhängigen Dritten (Gutachter) begleitet und verifiziert. Alle Installationsschritte werden fotografisch dokumentiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Vor dem Verschließen von Kabeltrassen, Decken oder Wänden wird der Zustand der Verlegung fotografisch festgehalten und archiviert. Ein externer Sachverständiger führt bei größeren Projekten eine baubegleitende Qualitätskontrolle durch und erstellt ein eigenes Gutachten zur Konformität der Installation."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet neben den internen Abnahmeprotokollen und Messungen auch die externen Gutachten und die Fotodokumentation. Es wird geprüft, ob der formalisierte, mehrstufige Abnahmeprozess konsequent eingehalten wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a3-m5",
                    "uuid": "3201fd51-8f71-417b-9b36-7a58ff36521f",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die gesamte Verkabelungsinfrastruktur wird mit intelligenten Komponenten (z.B. automatisierte Infrastrukturmanagement-Systeme, AIM) ausgestattet, die eine kontinuierliche physikalische Überwachung der Verbindungen ermöglichen. Installationsfehler oder spätere unautorisierte Änderungen am Patching werden sofort automatisch erkannt und gemeldet."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden Patchfelder und Verkabelungskomponenten eines AIM-Systems eingesetzt. Die Installationsarbeiten werden direkt im AIM-System dokumentiert und freigegeben. Jede Verbindung wird permanent überwacht; wird ein Patchkabel entfernt, generiert das System sofort einen Alarm."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer interagiert direkt mit dem AIM-System. Es wird geprüft, ob der im System dokumentierte Zustand der Realität entspricht (z.B. durch gezieltes Ziehen eines Patchkabels und Beobachtung der Systemreaktion). Die Konfiguration der Alarmierung und die Protokolle des Systems werden auf Vollständigkeit und korrekte Funktion überprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "10b49fdf-c3a0-499c-bbbc-a131be88cf8e",
                "control-id": "GEB.10.5.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a15-m3",
                    "uuid": "172b748c-7a60-4e24-a070-94d36bbf8b22",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es SOLLTE überlegt werden, Kabel und Verteiler gegen unbefugte Zugriffe zu sichern. Die Zahl und der Umfang derjenigen Stellen, an denen Einrichtungen der Energieversorgung und Zugangspunkte des Datennetzes für Unbefugte zugänglich sind, SOLLTE möglichst gering gehalten werden. Haupt- und Etagenverteiler werden in abschließbaren Räumen oder Schränken untergebracht."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle zentralen Verteilerschränke für die Strom- und Datenversorgung sind in dedizierten, abschließbaren Technikräumen untergebracht. Die Schlüssel zu diesen Räumen werden kontrolliert an einen begrenzten Personenkreis (IT, Haustechnik) ausgegeben. In öffentlich zugänglichen Bereichen werden Kabel, wenn möglich, unter Putz oder in geschlossenen Kabelkanälen verlegt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert bei einer Begehung, dass die Verteilerschränke verschlossen sind und sich in gesicherten Bereichen befinden. Die Regelungen zur Schlüsselverwaltung für die Technikräume werden eingesehen und auf ihre Wirksamkeit bewertet. Es wird geprüft, ob in öffentlichen Bereichen wie Fluren Kabel offen und ungeschützt verlegt sind."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a15-m4",
                    "uuid": "06e8d700-7565-4207-aa74-61a2bf82dc6f",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Zusätzlich zum Verschluss der Räume und Schränke werden diese mit Einbruchmeldeanlagen (EMA) bzw. Öffnungskontakten überwacht. Kabeltrassen, die durch nicht permanent kontrollierte Bereiche führen, werden als geschlossene, abschließbare Stahlblechkanäle ausgeführt. Netzwerkdosen in öffentlichen Bereichen werden bei Nichtbenutzung deaktiviert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Türen der Technikräume und die Verteilerschränke selbst sind mit Magnetkontakten ausgestattet, die an die EMA angeschlossen sind. Ein unberechtigtes Öffnen löst einen Alarm aus. Kabeltrassen im Keller oder in Tiefgaragen sind als manipulationssichere Kanäle ausgeführt. Netzwerk-Ports in Konferenzräumen oder Foyers werden über das Netzwerk-Managementsystem (Port-Security) standardmäßig abgeschaltet und müssen bei Bedarf freigeschaltet werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer prüft die Konfiguration der EMA und der Öffnungskontakte. Es wird getestet, ob bei einem unautorisierten Öffnungsversuch ein Alarm ausgelöst wird. Die Konfiguration der Port-Security für Dosen in öffentlichen Bereichen wird im Netzwerk-Managementsystem kontrolliert."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a15-m5",
                    "uuid": "71f81a34-4e7d-4c4d-8b95-fff19d00b748",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die gesamte kritische Verkabelungsinfrastruktur wird durch ein Leitungswegemonitoring permanent überwacht. Spezielle Überwachungskabel oder -fasern, die zusammen mit den Datenkabeln verlegt werden, erkennen Manipulationsversuche wie das Anbohren oder Öffnen der Kabeltrasse und lösen sofort einen Alarm aus. Der Zugang zu allen Verteilern wird über ein elektronisches Zutrittskontrollsystem mit Protokollierung gesteuert."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Hauptkabeltrassen zwischen den Rechenzentren und den Etagenverteilern sind als LWL-basierte Alarmanlagen ausgeführt (z.B. LIOS-System). Jede unautorisierte Erschütterung oder Öffnung der Trasse wird mit Standortangabe gemeldet. Der Zugang zu den Verteilerschränken ist nur mit einer persönlichen Transponderkarte möglich, wobei jeder Zutritt protokolliert wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Konzeption des Leitungswegemonitorings und der elektronischen Zutrittskontrolle. Die Wirksamkeit des Systems wird durch einen simulierten Manipulationsversuch an einer Teststrecke verifiziert. Die Zutrittsprotokolle der Verteilerschränke werden auf unautorisierte oder ungewöhnliche Zugriffsversuche analysiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "85ada482-8746-43c7-8f23-72b71e711810",
                "control-id": "GEB.11.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a13-m1",
                    "uuid": "3275ce0b-39a0-43cd-9135-eec3323e0688",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Nutzung von privaten Elektrogeräten und Mehrfachsteckdosen ist nicht geregelt und wird geduldet. Eine Prüfung dieser Geräte findet nicht statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Mitarbeiter bringen ihre eigenen Kaffeemaschinen, Ventilatoren und Ladegeräte mit. An vielen Arbeitsplätzen werden mehrere billige Steckdosenleisten aus dem Baumarkt hintereinandergeschaltet, um alle Geräte anzuschließen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt bei einer Begehung eine weit verbreitete Nutzung von ungeprüften Privatgeräten und eine unsachgemäße Verwendung von Steckdosenleisten (Kaskadierung) fest. Dies stellt eine erhebliche Brandgefahr dar."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a13-m2",
                    "uuid": "3eadb62e-3627-4243-9d89-cc868337ebe2",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es gibt eine Anweisung, die die Nutzung privater Elektrogeräte einschränkt. Die Verwendung von Steckdosenleisten ist erlaubt, solange diese eine CE-Kennzeichnung haben. Eine systematische Kontrolle oder Prüfung findet nicht statt."
                      },
                      {
                        "name": "guidance",
                        "value": "In der Hausordnung steht, dass private Heizlüfter verboten sind. Die Kaffeemaschine in der Teeküche wird geduldet. Die Mitarbeiter werden darauf hingewiesen, keine Steckdosenleisten hintereinander zu stecken, was aber nicht kontrolliert wird."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Hausordnung. Bei einer Begehung wird geprüft, inwieweit die Regeln bekannt sind und beachtet werden. Es werden weiterhin unsachgemäß verwendete Steckdosenleisten gefunden, wenn auch seltener."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a13-m3",
                    "uuid": "a623dc71-46c2-4039-b07c-3663af583be0",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Nutzung privater Elektrogeräte innerhalb der Institution SOLLTE klar geregelt werden. Alle Elektrogeräte MÜSSEN durch eine Elektrofachkraft geprüft und für sicher befunden werden, bevor sie eingesetzt werden. Die Verwendung von Steckdosenleisten SOLLTE soweit wie möglich vermieden werden. Fehlende Steckdosen SOLLTEN durch eine Elektrofachkraft fachgerecht nachgerüstet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine klare Richtlinie: Private Elektrogeräte sind grundsätzlich verboten, Ausnahmen müssen genehmigt und das Gerät muss von der internen Elektrofachkraft geprüft werden (E-Check). Die Verwendung von Steckdosenleisten ist nur für IT-Arbeitsplätze erlaubt und es dürfen nur vom Unternehmen beschaffte, qualitativ hochwertige Leisten verwendet werden. Kaskadierung ist streng verboten. Wenn an einem Ort dauerhaft mehr Steckdosen benötigt werden, wird ein Auftrag zur Nachrüstung erteilt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Richtlinie zur Nutzung von Elektrogeräten. Es wird geprüft, ob ein Prozess für die Prüfung und Freigabe von Geräten existiert. Bei einer Begehung wird gezielt auf die Einhaltung der Regeln geachtet, insbesondere auf das Verbot der Kaskadierung von Steckdosenleisten und das Vorhandensein von Prüfplaketten auf allen erlaubten Geräten."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a13-m4",
                    "uuid": "01775688-ed99-43e0-b049-44c83f7521b1",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Einhaltung der Regeln zur Vermeidung von Zündquellen wird proaktiv durch regelmäßige, angekündigte Begehungen durch die Elektrofachkraft oder den Brandschutzbeauftragten überprüft. Die Mitarbeiter werden regelmäßig für die Gefahren sensibilisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Quartalsweise findet eine Begehung aller Bürobereiche statt, bei der gezielt auf unzulässige Geräte und falsche Nutzung von Steckdosenleisten geachtet wird. Festgestellte Mängel werden dokumentiert und müssen sofort behoben werden. Im Rahmen der jährlichen Sicherheitsunterweisung ist die Vermeidung von Brandgefahren durch Elektrizität ein fester Bestandteil."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Protokolle der regelmäßigen Begehungen und die Unterlagen der Sicherheitsunterweisungen. Es wird bewertet, ob die Kontrollen konsequent durchgeführt werden und zu einer nachweisbaren Verbesserung der Situation führen."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a13-m5",
                    "uuid": "3784cc18-8b8c-4c98-bd73-8a73ea1de387",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Es werden technische Maßnahmen eingesetzt, um die Entstehung von Zündquellen durch Überlastung oder Fehlerströme aktiv zu verhindern. In kritischen Bereichen werden flächendeckend Brandschutzschalter (AFDDs) eingesetzt, die gefährliche Lichtbögen erkennen und den Stromkreis abschalten, bevor ein Brand entstehen kann."
                      },
                      {
                        "name": "guidance",
                        "value": "Alle Stromkreise in Serverräumen, Archiven und Teeküchen sind mit AFDDs (Arc Fault Detection Devices) nachgerüstet worden. Diese Geräte erkennen Serien- und Parallelfehlerlichtbögen, die von herkömmlichen Schutzschaltern nicht erkannt werden, und bieten so einen deutlich verbesserten Schutz vor elektrisch gezündeten Bränden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Elektropläne und verifiziert die Installation der AFDDs in den definierten kritischen Bereichen durch eine Inspektion der Verteilerkästen. Die Prüfprotokolle der AFDDs (sofern vorhanden) werden eingesehen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "fbbaf07b-e3e2-4abf-8623-b44ef63db1ae",
                "control-id": "GEB.11.1.5",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "GEB",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "inf.12.a9-m1",
                    "uuid": "4984e7ac-ff44-477d-8b8e-319a4a9fa292",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Kabeltrassen werden ohne Berücksichtigung von Brandschutzaspekten wie Überfüllung oder Belüftung geplant und betrieben. Die Brandlast wird nicht bewertet."
                      },
                      {
                        "name": "guidance",
                        "value": "Kabelkanäle werden so lange mit Kabeln gefüllt, bis physisch keine mehr hineinpassen. Eine mögliche Wärmeentwicklung oder die hohe Konzentration brennbaren Materials (Kabelmäntel) wird ignoriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt bei einer Begehung massiv überfüllte Kabeltrassen fest. Teilweise werden Kabel mit Kabelbindern an die Außenseite der Trassen befestigt, weil innen kein Platz mehr ist. Brandschutztechnische Bedenken wurden offensichtlich nicht berücksichtigt."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a9-m2",
                    "uuid": "b560bbcd-be49-49d5-abbe-004bc52a934e",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Bei der Planung von Kabeltrassen wird darauf geachtet, dass diese nicht überfüllt werden. Eine aktive Belüftung oder eine detaillierte Betrachtung der Brandlast findet jedoch nicht statt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Installationsrichtlinie besagt, dass Kabeltrassen nur bis zu einem Füllgrad von 60% belegt werden dürfen. Diese Regel wird bei Neuinstallationen beachtet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Existenz der Richtlinie zum Füllgrad. Bei einer Sichtprüfung wird der Füllgrad an mehreren Stellen der Kabeltrassen bewertet. Es wird geprüft, ob die Regel auch im Laufe der Zeit durch Nachinstallationen eingehalten wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a9-m3",
                    "uuid": "201ad62b-c142-4bd8-96c5-00d098f502a2",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Trassen SOLLTEN ausreichend dimensioniert werden, um eine Überfüllung und damit eine erhöhte Brandlast zu vermeiden. Sie SOLLTEN über eine ausreichende Be- und Entlüftung verfügen, um einen Wärmestau zu verhindern."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Planung von Kabeltrassen erfolgt unter Berücksichtigung der Normen zum Brandschutz und zur Wärmelast. In geschlossenen Trassen oder in Bereichen mit hoher Kabeldichte werden Belüftungsöffnungen vorgesehen oder die Trassen bewusst überdimensioniert. Die Berechnung der Brandlast ist Teil der Planungsdokumentation."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Planungsdokumentation und prüft, ob die Aspekte Füllgrad, Brandlast und Belüftung berücksichtigt wurden. Bei einer Begehung wird die Umsetzung kontrolliert, z.B. durch Überprüfung der Existenz von Belüftungsöffnungen und Messung der Temperatur in kritischen Trassenabschnitten."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a9-m4",
                    "uuid": "f4132261-169c-4792-b22c-2f58b41cc6de",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "In kritischen Bereichen wie Flucht- und Rettungswegen oder Serverräumen werden zusätzliche Brandschutzmaßnahmen für Trassen umgesetzt. Dies kann die Verwendung von Kabeln mit verbesserter Brandverhaltensklasse (z.B. B2ca), die Installation von Brandmeldern direkt in den Trassen oder die Nutzung von speziellen I- oder E-Kanal-Systemen für den Funktionserhalt umfassen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Hauptkabeltrassen im Rechenzentrum sind mit einem Rauchansaugsystem (RAS) ausgestattet, das eine sehr frühe Branderkennung ermöglicht. In allen Fluchtwegen werden ausschließlich Kabel der Klasse B2ca-s1a,d1,a1 verlegt, um die Brand- und Rauchentwicklung zu minimieren."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die Umsetzung der erweiterten Brandschutzmaßnahmen. Es werden die Spezifikationen der verwendeten Kabel und Brandschutzsysteme (z.B. RAS) geprüft. Die Wirksamkeit der Brandmelder in den Trassen wird im Rahmen des regulären Brandmeldertests mit überprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "inf.12.a9-m5",
                    "uuid": "1928fad2-2ced-4d60-b7f5-296936998443",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Temperatur und der Rauchstatus in allen kritischen Kabeltrassen werden permanent durch ein engmaschiges Sensornetzwerk überwacht. Die Daten fließen in die Gebäudeleittechnik und ein KI-System zur Anomalieerkennung. Bei kritischer Erwärmung werden proaktive Maßnahmen wie die Erhöhung der Raumlüftung ausgelöst, noch bevor ein Brand entsteht."
                      },
                      {
                        "name": "guidance",
                        "value": "In den Haupttrassen sind in regelmäßigen Abständen Temperatursensoren (z.B. faseroptische Liniensensoren) und Rauchmelder installiert. Die Messwerte werden kontinuierlich an ein Managementsystem gemeldet. Übersteigt die Temperatur einen definierten Schwellenwert, wird ein Voralarm an die Haustechnik gesendet und die Lüftungsanlage in dem Bereich erhöht ihre Leistung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Konfiguration des Sensornetzwerks und des Managementsystems. Die Schwellenwerte und die automatisierten Reaktionen werden auf ihre Angemessenheit geprüft. Anhand von historischen Daten wird die Zuverlässigkeit des Systems und die Reaktion auf vergangene Ereignisse (z.B. Testalarme) bewertet."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}