{
  "component-definition": {
    "uuid": "e303f9d3-b165-4500-91d6-8f2f1bd14ad4",
    "metadata": {
      "title": "SYS.3.3 Mobiltelefone - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:07:59.435552+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "ebdebdf1-29f3-423c-95df-de4343292a5d",
        "type": "hardware",
        "title": "SYS.3.3 Mobiltelefone",
        "description": "This component represents the implementation of all controls for Baustein SYS.3.3.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Die in diesem Baustein betrachteten Mobiltelefone, die auch „Feature-Phones“ oder „Dumbphones\" genannt werden, besitzen weniger Eigenschaften als ein Smartphone, bieten aber mehr Funktionen als nur die reine Telefonfunktion. So können diese Mobiltelefone zusätzlich mit einer Kamera für Videos und Fotos, einem Terminplaner, E-Mail-Programmen, Spielen, einem MP3-Player oder einem Radioempfänger ausgestattet sein. „Klassische“ Mobiltelefone verfügen in der Regel nicht über einen Touchscreen und ein Betriebssystem, auf das zusätzliche Apps installiert werden können. Diese fehlenden Funktionen unterscheidet das Mobiltelefon von einem Smartphone.\n\nMobiltelefone sind durch eine international eindeutige Seriennummer (International Mobile Equipment Identity, IMEI) gekennzeichnet. Die Identifizierung der Benutzenden des Mobiltelefons erfolgt durch die SIM-Karte, die bei Vertragsabschluss vom Mobilfunkanbietenden zugeteilt wird."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel des Bausteins ist es, typische Gefährdungen aufzuzeigen, die bei der Nutzung von Mobiltelefonen auftreten können, sowie Informationen abzusichern, die auf Mobiltelefonen gespeichert sind oder darüber übermittelt werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein SYS.3.3 Mobiltelefon ist auf alle Mobiltelefone anzuwenden, die für dienstliche Zwecke verwendet werden.\n\nDieser Baustein beschäftigt sich mit allgemeinen Aspekten von typischen Mobiltelefonen, mit Sicherheitsaspekten zur Telefonie und Nachrichtenübermittlung über das Mobilfunknetz und mit Sicherheitsaspekten zum Umgang mit den Geräten. Damit deckt dieser Baustein ein großes Spektrum unterschiedlicher Geräte ab, die an Mobilfunknetze angeschlossen werden können. Ergänzende Aspekte, die über die Kommunikation über ein Mobilfunknetz und den Umgang mit den Geräten hinausgehen, sind in weiteren Bausteinen des IT-Grundschutz-Kompendiums zu finden. So können Sicherheitsanforderungen zu Smartphones und den darauf genutzten Betriebssystemen ergänzend den Bausteinen der Schicht SYS.3.2 Tablet und Smartphone entnommen werden. Aspekte datenbasierter Telefonie werden im Baustein NET.4.2 VoIP behandelt. Verwendet das betrachtete Mobiltelefon VPNs, sollte zusätzlich der Baustein NET.3.3 VPN berücksichtigt werden. Für Smartphones oder Tablets ist der Baustein SYS.3.2.1 Allgemeine Smartphones und Tablets anzuwenden."
          },
          {
            "name": "Unzureichende Planung bei der Anschaffung von Mobiltelefonen",
            "value": "Werden in der Planungsphase relevante Eigenschaften der anzuschaffenden Mobiltelefone nicht ermittelt, könnten dringend benötigte Funktionen nicht verfügbar sein. Werden bestimmte Mobilfunkstandards nicht unterstützt, können die Geräte in bestimmten Ländern nicht verwendet werden. Im schlimmsten Fall entspricht der Funktionsumfang nicht dem Einsatzzweck, sodass diese Geräte überhaupt nicht eingesetzt werden können. Oft gibt es auch weitere Randbedingungen, die erfüllt werden müssen, damit die Geräte eingesetzt werden können. Hierzu gehören beispielsweise Sicherheitsfunktionen, die oft nicht auf den ersten Blick ersichtlich sind, aber zu Problemen bezüglich der Verfügbarkeit und Vertraulichkeit führen können, wenn sie verwendet werden."
          },
          {
            "name": "Verlust des Mobiltelefons",
            "value": "Da Mobiltelefone in der Regel klein sind und ständig transportiert werden, können sie leicht verloren gehen, vergessen oder gestohlen werden. Neben dem wirtschaftlichen Schaden wiegt der Verlust der Vertraulichkeit und Integrität der enthaltenen Daten besonders schwer. Denn über ein entwendetes Mobiltelefon könnten Angreifende auf institutionskritische Informationen der Institution zugreifen. Außerdem entstehen Kosten und Aufwände, um einen arbeitsfähigen Zustand wiederherzustellen."
          },
          {
            "name": "Sorglosigkeit im Umgang mit Informationen bei der Mobiltelefonie",
            "value": "Durch Unachtsamkeit und Sorglosigkeit der Mitarbeitenden bei der Mobiltelefonie können Dritte an schützenswerte Informationen gelangen. So können beispielsweise Informationen bei Telefongesprächen mitgehört oder aufgenommen sowie Nachrichten beim Verfassen mitgelesen werden."
          },
          {
            "name": "Unerlaubte private Nutzung des dienstlichen Mobiltelefons",
            "value": "Firmeneigene Mobiltelefone können unerlaubt für private Zwecke verwendet werden. Durch Unachtsamkeit und sorglosen Umgang können so Probleme bezüglich der Informationssicherheit der Institution entstehen, etwa wenn private und dienstliche Inhalte vermischt werden. Auf diese Weise könnten Unbefugte Kenntnis von Interna der Institution erlangen. Werden dienstliche Mobiltelefone privat genutzt, können außerdem zusätzliche Kosten für die Institution entstehen."
          },
          {
            "name": "Ausfall des Mobiltelefons",
            "value": "Der Ausfall eines Mobiltelefons kann mehrere Ursachen haben. So können Benutzende versäumt haben, den Akku des Gerätes aufzuladen, oder der Akku kann seine Fähigkeit, Energie zu speichern, verloren haben. Auch ist es möglich, dass Benutzende das Zugangspasswort oder die PIN vergessen haben und das Gerät nicht mehr nutzen können. So kann sich das Gerät bei mehrfach falscher Eingabe des Zugangscodes selbst sperren. Wird mit dem Telefon nicht sorgfältig umgegangen, kann es beschädigt werden, beispielsweise indem es herunterfällt. In allen genannten Fällen sind die Benutzenden anschließend nicht mehr erreichbar und können wiederum selbst niemanden über das Mobiltelefon erreichen."
          },
          {
            "name": "Auswertung von Verbindungsdaten bei der Nutzung von Mobiltelefonen",
            "value": "Aufgrund der Eigenschaften von mobiler Kommunikation kann nicht verhindert werden, dass die übertragenen Signale mit entsprechendem Aufwand unbefugt mitgehört und aufgezeichnet werden. Bei den meisten Funkdiensten müssen außerdem die mobilen Kommunikationsgeräte aus technischen Gründen geortet werden, um erreichbar zu sein. Somit können Standort-Informationen durch Netzbetreibende oder Dienstbetreibende verwendet werden, um Bewegungsprofile zu erstellen."
          },
          {
            "name": "Abhören von Raumgesprächen über Mobiltelefone",
            "value": "Mobiltelefone können dazu verwendet werden, unbemerkt Gespräche aufzuzeichnen oder abzuhören. In Besprechungen können über mitgebrachte Mobiltelefone Verbindungen zu unbefugten Mithörenden aufgebaut werden. Viele Mobiltelefone sind mit einer Freisprecheinrichtung ausgestattet, sodass problemlos Gespräche im gesamten Raum erfasst können. Bei vielen Geräten ist nicht sichtbar, ob sie eingeschaltet sind oder nicht. Somit kann nicht direkt erkannt werden, ob Gespräche aufgezeichnet oder abgehört werden."
          },
          {
            "name": "Einsatz veralteter Mobiltelefone",
            "value": "Da Smartphones vielfältiger als Mobiltelefone genutzt werden können, bieten viele herstellende Institutionen inzwischen ausschließlich Smartphones an. Damit übersteigt das Angebot an Smartphones deutlich das Angebot an Mobiltelefonen und es werden kaum noch Mobiltelefone produziert. Aufgrund des geringen Angebots werden zahlreiche Mobiltelefone aus Altbeständen verwendet. Altersschwache Komponenten wie Akkus werden oft durch Nachbauten von Drittanbietenden ersetzt, sodass diese Mobiltelefone weiterhin Jahrzehnte nach der Produktion eingesetzt werden können.\n\nOft sind auf diesen veralteten Mobiltelefonen Betriebssysteme installiert, die nicht mehr weiterentwickelt oder supported werden. Softwareschwachstellen können somit nicht mehr durch Updates beseitigt werden. Häufig gibt es die herstellenden Institutionen der Mobiltelefone nicht mehr, oder sie haben ihr Geschäftsfeld auf andere Märkte verlagert. Originales Zubehör und Ersatzteile können deshalb oft nicht mehr nachgekauft werden. Auch Drittherstellende bieten bei sehr alten Mobiltelefonen oft keine entsprechenden Produkte mehr an. Wenn Drittherstellende dennoch Ersatzteile anbieten, ist nicht gewährleistet, dass diese Komponenten die gleiche Qualität wie die originalen Teile besitzen. So sind beispielsweise nachgebaute Akkus oft weniger leistungsfähig als die Originale. In der Regel können diese Geräte auch oft nicht mehr repariert werden und bei Problemen gibt es kaum noch geeignete Ansprechpersonen, die helfen können."
          }
        ],
        "control-implementations": [
          {
            "uuid": "61fdb721-ffd3-4679-936c-4e35d046eb05",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/mobiltelefone_profile.json",
            "description": "Implementation for all controls in Baustein SYS.3.3",
            "implemented-requirements": [
              {
                "uuid": "77fb666b-b88e-4ebb-b980-5c5a88de814f",
                "control-id": "ASST.6.4",
                "description": "Implementation for ASST.6.4 based on BSI SYS.3.3.A4",
                "statements": [
                  {
                    "statement-id": "sys.3.3-a4-m1",
                    "uuid": "b9ae9543-399f-4af0-b1b7-6b898d19e551",
                    "description": "Ausgediente Mobiltelefone werden eingesammelt und unsortiert in einer Kiste gelagert. Es gibt keinen definierten Prozess zur Löschung von Daten oder zur sicheren Entsorgung."
                  },
                  {
                    "statement-id": "sys.3.3-a4-m2",
                    "uuid": "e6aaa573-31a7-458e-bfe4-86059ea68b2e",
                    "description": "Benutzer werden angewiesen, ihre Geräte auf Werkseinstellungen zurückzusetzen, bevor sie diese zurückgeben. Die zurückgegebenen Geräte werden in einem verschlossenen Schrank aufbewahrt, bis sie entsorgt werden."
                  },
                  {
                    "statement-id": "sys.3.3-a4-m3",
                    "uuid": "6afdcb35-0a00-4660-b70c-09b50e986148",
                    "description": "Mobiltelefone MÜSSEN vor der Entsorgung auf den Werkszustand zurückgesetzt werden. Es MUSS überprüft werden, ob alle Daten, auch auf Speicherkarten, gelöscht wurden. Gesammelte Mobiltelefone und Speicherkarten MÜSSEN bis zur Entsorgung vor unberechtigtem Zugriff geschützt aufbewahrt werden."
                  },
                  {
                    "statement-id": "sys.3.3-a4-m4",
                    "uuid": "ccb40f6c-2c72-41ff-b3c8-ca10c0c01928",
                    "description": "Es wird sichergestellt, dass die Mobiltelefone und eventuell darin verwendete Speicherkarten ordnungsgemäß und nachweislich entsorgt werden. Hierfür wird ein zertifizierter Dienstleister für Datenvernichtung beauftragt. Der gesamte Prozess wird dokumentiert."
                  },
                  {
                    "statement-id": "sys.3.3-a4-m5",
                    "uuid": "61335cc9-d124-41ab-9354-cf42803bf2f4",
                    "description": "Der gesamte Lebenszyklus der Mobiltelefone wird in einem Asset-Management-System verfolgt. Der Aussonderungsprozess wird im System angestoßen, wobei die Datenlöschung durch eine zweite Person verifiziert (Vier-Augen-Prinzip) und im System bestätigt wird, bevor das Gerät zur physischen Zerstörung freigegeben wird. Speicherkarten werden grundsätzlich physisch zerstört (z.B. geschreddert)."
                  }
                ]
              },
              {
                "uuid": "b8f7447f-75d4-4ae8-b162-9e2662b0fcc7",
                "control-id": "KONF.2.2",
                "description": "Implementation for KONF.2.2 based on BSI SYS.3.3.A10",
                "statements": [
                  {
                    "statement-id": "sys.3.3-a10-m2",
                    "uuid": "a6aca4d8-2418-46bd-ad56-1b829ceae70c",
                    "description": "Es gibt eine allgemeine Regel, dass vertrauliche Informationen nicht über Mobiltelefone verarbeitet oder übertragen werden sollen. Es gibt jedoch keine genaue Definition, was als vertraulich gilt und welche Ausnahmen es gibt."
                  },
                  {
                    "statement-id": "sys.3.3-a10-m3",
                    "uuid": "fcefaff8-76f2-40af-b277-174f3aaaf6a0",
                    "description": "Es SOLLTE geregelt sein, welche Daten über Mobiltelefone übertragen werden dürfen. Die dafür erlaubten Schnittstellen SOLLTEN festgelegt werden. Außerdem SOLLTE beschlossen werden, wie die Daten bei Bedarf zu verschlüsseln sind."
                  },
                  {
                    "statement-id": "sys.3.3-a10-m4",
                    "uuid": "aa22976e-c086-47b8-a5d4-d4c8eeec9e3c",
                    "description": "Die Regeln zur Datenübertragung sind detailliert und an eine mehrstufige Datenklassifizierungsrichtlinie gekoppelt. Es sind spezifische, genehmigte Anwendungen und Verfahren für die Übertragung von sensiblen Daten definiert (z.B. Nutzung eines sicheren Messengers, falls auf dem Gerät verfügbar). Die Benutzer werden in der Anwendung dieser Verfahren geschult."
                  }
                ]
              },
              {
                "uuid": "d0b25d4d-9ee5-46b2-9d12-23e1cfb6a497",
                "control-id": "KONF.2.4",
                "description": "Implementation for KONF.2.4 based on BSI SYS.3.3.A8",
                "statements": [
                  {
                    "statement-id": "sys.3.3-a8-m2",
                    "uuid": "4c8a0220-14b6-4ed5-bda0-51564101bd15",
                    "description": "Die Benutzer werden in einer Richtlinie darauf hingewiesen, nicht benötigte drahtlose Schnittstellen wie Bluetooth oder WLAN zu deaktivieren. Die Einhaltung wird nicht überprüft."
                  },
                  {
                    "statement-id": "sys.3.3-a8-m3",
                    "uuid": "9d80bdc7-2f32-4b8f-a0a2-cf95f54df3e7",
                    "description": "Drahtlose Schnittstellen von Mobiltelefonen wie IrDA, WLAN oder Bluetooth SOLLTEN deaktiviert werden, solange sie nicht benötigt werden."
                  },
                  {
                    "statement-id": "sys.3.3-a8-m4",
                    "uuid": "bbbf6415-1e81-4609-8cb3-bc31f3339ced",
                    "description": "Die Richtlinie zum Deaktivieren ungenutzter Schnittstellen wird durch regelmäßige Erinnerungen im Rahmen von Awareness-Kampagnen verstärkt. Die Benutzer werden explizit über die Risiken der Verbindung mit unsicheren öffentlichen WLANs oder dem Koppeln mit unbekannten Bluetooth-Geräten geschult."
                  }
                ]
              },
              {
                "uuid": "853b0d23-33ef-4ddf-97ea-2dabdbf2ce91",
                "control-id": "KONF.2.5.1.1",
                "description": "Implementation for KONF.2.5.1.1 based on BSI SYS.3.3.A1",
                "statements": [
                  {
                    "statement-id": "sys.3.3-a1-m1",
                    "uuid": "abea56ef-b0d9-4ad9-8da8-8c59c8e29124",
                    "description": "Es existiert lediglich ein Entwurf einer Sicherheitsrichtlinie für Mobiltelefone, der weder offiziell freigegeben noch an die Mitarbeitenden verteilt wurde. Die Richtlinie ist unvollständig und deckt nur grundlegende Aspekte wie die private Nutzung ab, während kritische Punkte wie der Umgang mit Verlusten fehlen."
                  },
                  {
                    "statement-id": "sys.3.3-a1-m2",
                    "uuid": "0b2558a1-16d9-497a-a286-6c9b97f217e3",
                    "description": "Eine grundlegende Sicherheitsrichtlinie wurde erstellt und allen Mitarbeitenden bei der Ausgabe eines Mobiltelefons zur Verfügung gestellt. Sie deckt die wichtigsten Nutzungsregeln ab, wird jedoch nicht regelmäßig auf Einhaltung überprüft oder aktualisiert."
                  },
                  {
                    "statement-id": "sys.3.3-a1-m3",
                    "uuid": "c2234563-4555-4889-9a31-c774462012ba",
                    "description": "Im Hinblick auf die Nutzung und Kontrolle der Geräte MUSS eine Sicherheitsrichtlinie erstellt werden. Jeder benutzenden Person eines Mobiltelefons MUSS ein Exemplar der Sicherheitsrichtlinie ausgehändigt werden. Es MUSS regelmäßig überprüft werden, ob die Sicherheitsrichtlinie eingehalten wird."
                  },
                  {
                    "statement-id": "sys.3.3-a1-m4",
                    "uuid": "aa2ae45a-abee-472b-bd11-f83a77abfc7a",
                    "description": "Die Sicherheitsrichtlinie ist integraler Bestandteil der Sicherheitsschulungen. Ihre Einhaltung wird aktiv durch regelmäßige, dokumentierte Stichproben überwacht. Die Richtlinie wird mindestens jährlich oder bei signifikanten Änderungen der Bedrohungslage oder Technologie überprüft und bei Bedarf aktualisiert."
                  },
                  {
                    "statement-id": "sys.3.3-a1-m5",
                    "uuid": "be877f2c-f25c-4b5a-b5e8-dd5bf4932ca6",
                    "description": "Die Sicherheitsrichtlinie ist in einem GRC-Tool (Governance, Risk, Compliance) abgebildet und ihre Einhaltung wird, soweit technisch möglich, durch eine zentrale Verwaltungslösung (z.B. MDM/UEM für Smartphones) automatisiert erzwungen und überwacht. Ausnahmen von der Richtlinie erfordern einen formalen, dokumentierten Risikobewertungs- und Genehmigungsprozess."
                  }
                ]
              },
              {
                "uuid": "61f17b36-cb29-4b4b-9a21-935067c1b190",
                "control-id": "KONF.3.3",
                "description": "Implementation for KONF.3.3 based on BSI SYS.3.3.A5",
                "statements": [
                  {
                    "statement-id": "sys.3.3-a5-m2",
                    "uuid": "0d002c84-aebd-453c-98c7-9336dc7454ed",
                    "description": "Die Verwendung einer SIM-Karten-PIN ist für alle Benutzer verpflichtend. Die Verwendung eines Geräte-Sperrcodes wird empfohlen, aber nicht erzwungen oder überprüft."
                  },
                  {
                    "statement-id": "sys.3.3-a5-m3",
                    "uuid": "2aba99bf-444f-42e9-9880-e3f4a3ac281a",
                    "description": "Die verfügbaren Sicherheitsmechanismen SOLLTEN auf den Mobiltelefonen genutzt und vorkonfiguriert werden. Die SIM-Karte SOLLTE durch eine sichere PIN geschützt werden. Das Mobiltelefon SOLLTE durch einen Geräte-Code geschützt werden. Die Super-PIN/PUK SOLLTE nur im Rahmen der definierten Prozesse von den Zuständigen benutzt werden."
                  },
                  {
                    "statement-id": "sys.3.3-a5-m4",
                    "uuid": "798b447e-4939-4ae6-8b5c-48c0641fdbfc",
                    "description": "Zusätzlich zur PIN- und Gerätecode-Pflicht wird, falls technisch möglich, das Gerät fest an die ausgegebene SIM-Karte gebunden (SIM-Lock). Es wird eine Richtlinie für die Komplexität der Geräte-Codes (Mindestlänge) durchgesetzt und die automatische Sperre des Bildschirms nach kurzer Inaktivität wird konfiguriert."
                  }
                ]
              },
              {
                "uuid": "69ceefb8-bfb9-4fd2-a2cb-eee1b0c45d91",
                "control-id": "KONF.3.6",
                "description": "Implementation for KONF.3.6 based on BSI SYS.3.3.A2",
                "statements": [
                  {
                    "statement-id": "sys.3.3-a2-m1",
                    "uuid": "072d916e-7d34-4abb-8f9b-57d64707aeef",
                    "description": "Die Benutzer sind sich bewusst, dass ein verlorenes Telefon gemeldet werden sollte, aber es gibt keinen dokumentierten Prozess. Die Kontaktinformationen für die Sperrung der SIM-Karte sind nicht leicht verfügbar und müssen im Einzelfall recherchiert werden."
                  },
                  {
                    "statement-id": "sys.3.3-a2-m2",
                    "uuid": "d02c9c28-2f3d-4046-9c45-56536f07f2af",
                    "description": "Ein einfacher Prozess für die Meldung eines verlorenen Geräts ist dokumentiert und im Intranet verfügbar. Die Benutzer wissen, an wen sie sich wenden müssen, um die SIM-Karte sperren zu lassen. Die Reaktion erfolgt jedoch nur während der regulären Geschäftszeiten."
                  },
                  {
                    "statement-id": "sys.3.3-a2-m3",
                    "uuid": "d4fb97c2-2046-42a0-a898-e56045b16743",
                    "description": "Bei Verlust eines Mobiltelefons MUSS die darin verwendete SIM-Karte zeitnah gesperrt werden. Alle notwendigen Informationen zur Sperrung von SIM-Karte und Mobiltelefon MÜSSEN für die zuständigen Stellen und die Benutzer unmittelbar griffbereit sein."
                  },
                  {
                    "statement-id": "sys.3.3-a2-m4",
                    "uuid": "92f64a2b-607b-4aab-8c9a-4f5d9154ea25",
                    "description": "Der Prozess zur Sperrung von SIM-Karten und Geräten wird durch einen 24/7 erreichbaren Service Desk sichergestellt. Sofern die Geräte es unterstützen, werden Mechanismen zum Diebstahlschutz wie Fernlöschung oder -sperrung aktiv genutzt. Der gesamte Prozess wird regelmäßig, mindestens einmal jährlich, getestet."
                  },
                  {
                    "statement-id": "sys.3.3-a2-m5",
                    "uuid": "3c719df6-5763-40f3-9bf3-d501464004fb",
                    "description": "Der Prozess zur Reaktion auf einen Geräteverlust ist weitgehend automatisiert. Sobald ein Benutzer ein Gerät über ein Self-Service-Portal als verloren meldet, wird automatisch die Sperrung der SIM-Karte beim Mobilfunkanbieter via API angestoßen und, falls technisch möglich, das Gerät ferngesperrt und gelöscht."
                  }
                ]
              },
              {
                "uuid": "9dd6a8dc-a3f4-4790-ba22-96197964b11a",
                "control-id": "KONF.6.3",
                "description": "Implementation for KONF.6.3 based on BSI SYS.3.3.A12",
                "statements": [
                  {
                    "statement-id": "sys.3.3-a12-m2",
                    "uuid": "939270fa-3e1c-4fef-8ffb-7269fa1a9399",
                    "description": "Ein Pool von Mobiltelefonen wird in einer einfachen Liste (z.B. Excel) verwaltet. Ausgabe und Rücknahme werden manuell vermerkt. Nach der Rückgabe wird jedes Gerät auf Werkseinstellungen zurückgesetzt."
                  },
                  {
                    "statement-id": "sys.3.3-a12-m3",
                    "uuid": "96e77056-9e27-41d8-93db-95da09d13a07",
                    "description": "Bei häufig wechselnden Benutzenden dienstlicher Mobiltelefone SOLLTE eine Sammelaufbewahrung (Pool) eingerichtet werden. Die Ausgabe und Rücknahme von Mobiltelefonen und Zubehör SOLLTE dokumentiert werden. Vor der Ausgabe SOLLTE sichergestellt werden, dass die Mobiltelefone aufgeladen und mit den nötigen Daten für die neuen Besitzenden ausgestattet sind. Zudem SOLLTEN die Benutzenden auf die Einhaltung der Sicherheitsleitlinie hingewiesen werden. Nachdem die Geräte wieder zurückgegeben wurden, SOLLTEN sie auf den Werkszustand zurückgesetzt werden."
                  },
                  {
                    "statement-id": "sys.3.3-a12-m4",
                    "uuid": "403b0e80-b884-4064-bb9e-1156e2104879",
                    "description": "Der Verleihprozess wird über ein IT-Ticketsystem verwaltet, das die Dokumentation automatisiert. Jeder Benutzer muss bei der Ausgabe ein Formular unterzeichnen, in dem er den Erhalt und die Kenntnisnahme der Sicherheitsrichtlinien bestätigt. Jedes Gerät hat ein Standard-Konfigurationsprofil, das vor der Ausgabe aufgespielt wird."
                  }
                ]
              },
              {
                "uuid": "713461db-c622-4606-9ea3-1be7d225702e",
                "control-id": "KONF.8.1",
                "description": "Implementation for KONF.8.1 based on BSI SYS.3.3.A6",
                "statements": [
                  {
                    "statement-id": "sys.3.3-a6-m2",
                    "uuid": "28a3db70-8c26-4083-b281-91e454f0d962",
                    "description": "Es existiert eine Richtlinie, die besagt, dass Benutzer verfügbare Softwareupdates für ihre Mobiltelefone installieren sollen. Die IT-Abteilung versendet gelegentlich E-Mail-Erinnerungen, wenn wichtige Updates bekannt werden."
                  },
                  {
                    "statement-id": "sys.3.3-a6-m3",
                    "uuid": "2a251e79-87d4-4780-8c74-844ce71230da",
                    "description": "Es SOLLTE regelmäßig geprüft werden, ob es Softwareupdates für die Mobiltelefone gibt. Der Umgang mit Updates SOLLTE geregelt werden. Wenn es neue Softwareupdates gibt, SOLLTE festgelegt werden, wie die Benutzenden darüber informiert werden und ob sie die Updates selber installieren dürfen oder ob die Mobiltelefone an einer zentralen Stelle hierfür abgegeben werden sollen."
                  },
                  {
                    "statement-id": "sys.3.3-a6-m4",
                    "uuid": "dd800267-5a5b-449b-b38e-d116d1fd24c7",
                    "description": "Die IT-Abteilung überwacht proaktiv und zeitnah Sicherheitsmeldungen der Hersteller für die eingesetzten Gerätemodelle. Für kritische Sicherheitsupdates wird ein beschleunigter Update-Prozess eingeleitet. Die erfolgreiche Installation wird stichprobenartig überprüft."
                  }
                ]
              },
              {
                "uuid": "2c95705a-b172-46ed-844d-26a5ebcf1ae5",
                "control-id": "NOT.4.2",
                "description": "Implementation for NOT.4.2 based on BSI SYS.3.3.A11",
                "statements": [
                  {
                    "statement-id": "sys.3.3-a11-m2",
                    "uuid": "3fb9fd8c-ae60-41bc-8bdc-37b955b440da",
                    "description": "Die Benutzer werden angewiesen, wichtige Kontaktdaten manuell auf ihrer SIM-Karte zu sichern. Es wird ein kleiner Pool an unkonfigurierten Ersatzgeräten vorgehalten."
                  },
                  {
                    "statement-id": "sys.3.3-a11-m3",
                    "uuid": "ba71dca7-7305-4b1d-a829-9c891daabdf3",
                    "description": "Die auf einem Mobiltelefon gespeicherten Daten SOLLTEN in regelmäßigen Abständen auf einem externen Medium gesichert werden. Muss ein defektes Mobiltelefon repariert werden, SOLLTEN zuvor alle Daten gelöscht und das Gerät auf den Werkszustand zurückgesetzt werden. Es SOLLTEN immer Ersatzgeräte vorhanden sein, um ein ausgefallenes Mobiltelefon kurzfristig ersetzen zu können."
                  },
                  {
                    "statement-id": "sys.3.3-a11-m4",
                    "uuid": "575fd5d3-485a-4bd0-9cfa-61dd51c81438",
                    "description": "Sofern technisch möglich, werden Kontaktdaten und Kalender zentral mit einem Server der Organisation (z.B. Exchange ActiveSync) synchronisiert. Der Austausch eines defekten Geräts ist innerhalb einer definierten, kurzen Frist (z.B. ein Arbeitstag) gewährleistet."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}