{
  "component-definition": {
    "uuid": "f10cf3ed-22d8-4bcd-b858-a7bcb5510e88",
    "metadata": {
      "title": "SYS.4.1 Drucker - Benutzerdefiniert",
      "last-modified": "2025-11-13T20:07:59.528848+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "113a6d72-6c50-49f9-8bd3-0717d7ff749c",
        "type": "hardware",
        "title": "SYS.4.1 Drucker",
        "description": "This component represents the implementation of all controls for Baustein SYS.4.1.",
        "props": [
          {
            "name": "Einleitung",
            "value": "Moderne Drucker, Kopierer und Multifunktionsgeräte sind komplexe Geräte, die neben mechanischen Komponenten eigene Betriebssysteme enthalten und Serverdienste und -funktionen bereitstellen. Da die Geräte oft vertrauliche Informationen verarbeiten, müssen sie bzw. die gesamte Druck- und Scan-Infrastruktur geschützt werden.\nAls Multifunktionsgeräte werden Geräte bezeichnet, die mehrere papierverarbeitende Funktionen bieten, etwa Drucken, Kopieren, Scannen sowie auch Versenden und Empfangen von Fax-Dokumenten.\nFür viele Geschäftsprozesse und Fachaufgaben wird auch heute noch Papier als Informationsträger benutzt. Damit sind Drucker, Kopierer oder Multifunktionsgeräte wichtige Komponenten in der IT-Infrastruktur. Fallen die Geräte aus oder werden verfälschte Dokumente ausgedruckt, kann sich das mitunter auf kritische Prozesse auswirken und zu erheblichen wirtschaftlichen Schäden führen."
          },
          {
            "name": "Zielsetzung",
            "value": "Dieser Baustein beschreibt, wie sich Drucker, Kopierer und Multifunktionsgeräte sicher betreiben lassen, sodass weder Informationen über diese Geräte abfließen können noch durch sie die Sicherheit der übrigen internen IT-Infrastruktur beeinträchtigt wird."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein SYS.4.1 Drucker, Kopierer und Multifunktionsgeräte ist für jeden Drucker, Kopierer oder jedes Multifunktionsgerät im Informationsverbund anzuwenden.\nDer Baustein behandelt die Sicherheit von Druckern, Kopierern und Multifunktionsgeräten. Vernetzte oder lokal an IT-Systemen angeschlossene Dokumentenscanner werden nicht explizit berücksichtigt. Die Risiken und Anforderungen lassen sich jedoch aus denen für Multifunktionsgeräte ableiten. Ebenso werden vernetzte Faxgeräte nicht gesondert betrachtet. Die in diesem Baustein aufgeführten Risiken und Anforderungen für die Faxfunktion gelten deshalb auch für diese Art von Geräten. Ergänzend sind die Anforderungen des Bausteins NET.4.3 Faxgeräte und Faxserver zu berücksichtigen.\nDrucker, Kopierer und Multifunktionsgeräte werden oft an Datennetze angeschlossen. Neben kabelgebundenen Anschlüssen können einige Geräte auch direkt mit einem WLAN verbunden werden. Empfehlungen hierzu sind in den Bausteinen der Teilschicht NET Netze und Kommunikation zu finden, wie z. B. im Baustein NET.2.2 WLAN-Nutzung.\nAuf Druckern, Kopierern und Multifunktionsgeräten sind oft vertrauliche Informationen gespeichert, die nach der Außerbetriebnahme auf den Geräten verbleiben. Geleaste Geräte werden häufig, je nach Vertrag, nach einer vorher festgelegten Nutzungsdauer oder -häufigkeit ausgetauscht. Sie werden spätestens nach Ablauf des Leasingvertrags zurückgegeben. Auch Papier und andere Betriebsmittel können vertrauliche Informationen beinhalten. Bevor diese Geräte und Betriebsmittel ausgesondert, getauscht, instandgesetzt oder zurückgegeben werden, müssen alle sensiblen Informationen von ihnen gelöscht werden. Empfehlungen hierzu sind nicht Gegenstand des vorliegenden Bausteins, sondern sind im Baustein CON.6 Löschen und Vernichten zu finden.\nBei Druckservern handelt es sich um IT-Systeme mit Druckwarteschlangen, Druckjobverwaltung und möglichen weiteren Funktionen, z. B. Treiberverteilung oder gesichertes Drucken. Für jeden Druckserver müssen die generellen und betriebssystemspezifischen Sicherheitsanforderungen für Server erfüllt werden. Diese werden nicht in diesem Baustein, sondern in den Bausteinen SYS.1.1 Allgemeiner Server und den jeweiligen betriebssystemspezifischen Server-Bausteinen beschrieben.\nEin essentieller Schwerpunkt bei der Absicherung von Druckern, Kopierern und Multifunktionsgeräten ist es, die auf den Geräten installierte Software regelmäßig zu aktualisieren und dadurch Softwareschwachstellen zu schließen. Der vorliegende Baustein behandelt diesen Aspekt allerdings nicht. Anforderungen hierzu sind im Baustein OPS.1.1.3 Patch- und Änderungsmanagement zu finden."
          },
          {
            "name": "2.1. Unerlaubte Einsicht in ausgedruckte Dokumente",
            "value": "Ausgedruckte Dokumente verbleiben oft für eine längere Zeit im Ausgabefach von zentralen Druckern und Multifunktionsgeräten, weil beispielsweise erst mehrere Dateien ausgedruckt und später alle zusammen abgeholt werden. Auch kann es sein, dass am Client ein falscher Drucker ausgewählt wurde und sich die Dokumente nicht am erwarteten Ort befinden. Da Etagen- oder Abteilungsdrucker von vielen Benutzenden verwendet werden, können so auch unberechtigte Personen schützenswerte Informationen einsehen oder mitnehmen.\nAuch liegengebliebene Ausdrucke in den Ausgabefächern dezentraler Arbeitsplatzdrucker, die sich in unmittelbarer Nähe in den Büroräumen befinden, sind ein Risiko. Denn Personen, die Zutritt zu diesen Räumen haben, könnten die Ausdrucke ebenso einsehen oder entnehmen.\nEine weitere Gefahr sind im Ausgabefach befindliche Faxdokumente und ausgedruckte Sendeprotokolle, auf denen neben Faxnummer, Datum, Uhrzeit und Seitenzahl mitunter ein verkleinertes Abbild der ersten Seite zu sehen ist. Da solche Protokolle erst ausgegeben werden, nachdem ein Fax verschickt wurde oder ein Sendefehler aufgetreten ist, könnten sie auch über einen längeren Zeitraum im Gerät liegen bleiben oder gar nicht abgeholt werden. Dadurch befinden sich unter Umständen vertrauliche Informationen unbeaufsichtigt im Ausgabefach und können im schlimmsten Fall gestohlen werden.\nZudem werden nicht abgeholte Dokumente irgendwann entsorgt. Das geschieht oft, indem die Ausdrucke wahllos in nahegelegene Papierkörbe geworfen werden, statt Ausdrucke mit schützenswerten Informationen sicher zu vernichten. Dadurch können diese Informationen in die öffentliche Müllentsorgung und so in die Hände Dritter gelangen.\nAuch viele Telearbeitsplätze werden mit einem eigenen Drucker oder Multifunktionsgerät ausgestattet. Hierdurch können ebenfalls schützenswerte Informationen offengelegt werden."
          },
          {
            "name": "2.2. Sichtbarkeit von Metadaten",
            "value": "Zusammen mit einem Druckauftrag werden Metadaten gesendet, die in der Regel die Kennung der Benutzenden, Datum, Uhrzeit und den Namen des Druckauftrages enthalten. Diese Daten werden im Bedienfeld und im Webserver vieler Drucker und Multifunktionsgeräte angezeigt. Der Name des Druckauftrages ergibt sich oft aus dem Namen des digitalen Dokumentes. Falls der Drucker über einen integrierten Webserver verfügt, können über einen Browser oft vertrauliche Vorgänge eingesehen werden. Ebenso sind die Metadaten auf den Druckservern im Klartext sichtbar, sofern sie nicht anonymisiert werden. Damit können Dritte an vertrauliche Informationen gelangen. Viele Geräte erlauben es zudem, Druckaufträge abzuspeichern, um sie später nach Authentisierung über eine PIN auszudrucken. Auch in diesem Fall wird der Name aller vorhandenen Dokumente im Bedienfeld eines Ausgabegerätes angezeigt.\nBestimmte Drucker und Kopierer drucken sogenannte „Yellow Dots“ (auch „Machine Identification Code“, „Tracking Dots“, „Secret Dots“) auf das Papier. Diese oft undokumentierten Wasserzeichen können das Datum und die Uhrzeit sowie die Seriennummer des Druckers beinhalten und sind mit dem bloßen Auge kaum zu erkennen. Auf diese Weise kann ein Ausdruck einer Institution oder einer bestimmten Person direkt zugewiesen und so zu der Person zurückverfolgt werden, die den Text verfasst hat. Neben datenschutzrechtlichen Auswirkungen könnten so ungewollt Informationen die Institution verlassen.\nAuch Faxprotokolle können bei vielen Multifunktionsgeräten ohne Zugriffsschutz ausgedruckt werden. Selbst wenn nur Telefonnummer, Datum, Uhrzeit und Seitenzahl aufgelistet werden, können damit schon Rückschlüsse auf personenbezogene Daten oder geschäftliche Vorgänge ermöglicht werden."
          },
          {
            "name": "2.3. Ungenügender Schutz gespeicherter Informationen",
            "value": "Drucker, Kopierer und Multifunktionsgeräte sind oft mit nichtflüchtigen Speichern ausgestattet, auf denen Informationen temporär oder auch längerfristig abgelegt werden. So werden dort z. B. Adressbücher, Dokumente, Fax-Dateien und Druckaufträge abgespeichert. Sind diese Informationen unzureichend geschützt, können Dritte darauf zugreifen und sie auslesen. Unter Umständen können sogar bereits gelöschte Informationen rekonstruiert werden, wenn unsichere Löschmethoden angewendet wurden.\nÜber Netzprotokolle können Daten im Gerät gespeichert und gelesen werden. Drucker und Multifunktionsgeräte mit Datenträgern sind, wenn diese nicht gesichert werden, oft als nicht autorisierte Fileserver nutzbar. Auf diese Weise können unkontrolliert Informationen dezentral abgespeichert werden, die nicht im Datensicherungskonzept berücksichtigt werden."
          },
          {
            "name": "2.4. Unverschlüsselte Kommunikation",
            "value": "Druck- und Scandaten werden oft unverschlüsselt über das Netz übertragen. Dadurch können die gesendeten Dokumente mitgelesen werden. Ebenso lassen sich in Druckservern temporär gespeicherte Druckdateien auslesen. Das gilt auch für zentrale Scan- und Dokumentenverarbeitungssysteme.\nWeitere Gefahrenquellen sind unverschlüsselte Kommunikationsschnittstellen zur Administration der Geräte. Wird beispielsweise über HTTP, SNMPv2 oder Telnet auf Drucker zugegriffen, werden die Informationen dabei ungeschützt transportiert. Dadurch sind die Zugriffsinformationen inklusive Gerätepasswörter gefährdet."
          },
          {
            "name": "2.5. Unberechtigter Versand von Informationen",
            "value": "Viele Multifunktionsgeräte können digitalisierte Papierdokumente per E-Mail und Fax verschicken. Ohne besondere Schutzmaßnahmen können dadurch Informationen bewusst oder auch versehentlich an nicht autorisierte Empfänger oder Empfängerinnen gelangen. Benutzende könnten beispielsweise Adressen oder Telefonnummern falsch eingeben. Als Folge werden eventuell schutzbedürftige Daten unbeabsichtigt an falsche Empfänger oder Empfängerinnen gesendet. Außerdem können mithilfe der E-Mail- oder Fax-Funktion vertrauliche Unterlagen schnell nach außen gelangen.\nViele vernetzte Drucker lassen sich so konfigurieren, dass Druckaufträge aus dem Internet per E-Mail empfangen und gescannte Dokumente als E-Mail-Anhang versendet werden können. Dabei lässt sich die freie Eingabe der Absendendenadresse missbrauchen, um E-Mails unter fremden Namen an interne und externe Personen zu versenden."
          },
          {
            "name": "2.6. Unkontrollierter Datenaustausch über Speicherschnittstellen bei Druckern, Kopierern und Multifunktionsgeräten",
            "value": "Dokumente auf Papier können mithilfe von Multifunktionsgeräten schnell kopiert werden. Durch vorhandene USB- oder SD-Anschlüsse ist es zudem möglich, selbst große Mengen an Papierunterlagen direkt und ohne jegliche Kontrolle zu digitalisieren und auf USB-Sticks oder SD-Karten zu speichern. Auch können über die Speicherschnittstellen hierauf abgelegte Dokumente direkt ausgedruckt werden.\nSind die Drucker, Kopierer und Multifunktionsgeräte an ein Datennetz oder direkt an Clients angeschlossen, können IT-Systeme oft auch direkt auf die an Drucker, Kopierer und Multifunktionsgeräte angeschlossenen Speichermedien zugreifen. Auch wenn die Einbindung von Speichermedien an IT-Systeme selbst technisch verhindert wird, können über diesen Umweg unkontrolliert Informationen über die Speicherschnittstellen kopiert werden.\nAuf diese Weise kann zum einen über die Speicherschnittstellen (Schad-)Software über die Multifunktionsgeräte auf den hieran angeschlossen Clients oder in das Datennetz der Institution gelangen. Zum anderen können auch vertrauliche (Papier-)Dokumente unbemerkt digitalisiert und unnachvollziehbar gestohlen werden."
          },
          {
            "name": "2.7. Ungenügend abgesicherte Netzzugänge von Druckern, Kopierern und Multifunktionsgeräten",
            "value": "Firewalls zwischen LAN und Internet werden häufig so konfiguriert, dass ganze Subnetze auf das Internet zugreifen können. Zudem werden Drucker, Kopierer und Multifunktionsgeräte oft dem gleichen Subnetz zugeordnet wie die Clients. Dadurch können z. B. auch die Netzdrucker auf Informationen im Internet zugreifen. Auch wenn die IT-Systeme der Institution nur über einen Proxy auf das Internet zugreifen, können Drucker, Kopierer und Multifunktionsgeräte diesen ebenfalls nutzen. Wenn die Verbindungen von und zu den Druckern aus dem Internet nicht von der Firewall abgewiesen werden, können unter Umständen schützenswerte Informationen unerwünscht das eigene Datennetz verlassen. Umgekehrt könnte ein netzfähiges Gerät unerwünscht Daten aus dem Internet empfangen und weiter verteilen. Ein Netzdrucker kann dadurch z. B. zu einem Einfallstor für Angriffe aus dem Internet werden."
          },
          {
            "name": "2.8. Mangelhafter Zugriffsschutz zur Geräteadministration",
            "value": "Vernetzte Drucker, Kopierer und Multifunktionsgeräte können über das Bedienfeld und den eingebauten Webserver verwaltet werden. Bei Auslieferung der Geräte haben diese in der Regel kein oder nur ein Standardpasswort. Wird das Passwort nicht gesetzt oder nicht geändert, kann sehr leicht auf die Geräte zugegriffen werden.\nIn vielen Institutionen werden zudem einheitliche Passwörter für alle Drucker und Multifunktionsgeräte benutzt, die nur selten geändert werden. Dadurch sind sie oft vielen internen und externen Personen bekannt und unbefugte Dritte können somit einfach auf die Geräte zugreifen.\nWeiter lassen sich über Bootmenüs Drucker und Multifunktionsgeräte in den Werkszustand zurücksetzen. Davon betroffen sind auch die Sicherheitseinstellungen. So ist beispielsweise das Gerätepasswort oft nicht mehr vorhanden, nachdem der Drucker oder das Multifunktionsgerät auf die Werkseinstellungen zurückgesetzt wurde. Ungesicherte Bootmenüs erleichtern zwar die Administration, verringern aber gleichzeitig die Sicherheit.\nDrucker, Kopierer und Multifunktionsgeräte sind mit zahlreichen Netzprotokollen ausgerüstet. Bei Auslieferung sind meistens alle Protokolle aktiviert. Dadurch könnten Angreifende z. B. auf die Geräteeinstellungen zugreifen und diese so verändern, dass schützenswerte Informationen aus dem Netz abfließen.\nViele Geräte können ihr Bedienfeld über das Netz an den Support übertragen. Damit können jedoch auch vertrauliche Eingaben der Benutzenden am Bedienfeld des Gerätes mitgelesen werden.\nIn größeren Institutionen gibt es meistens sehr viele Drucker, Kopierer und Multifunktionsgeräte. Um diese noch effizient verwalten und überwachen zu können, wird oft eine Gerätemanagementsoftware eingesetzt. Viele Institutionen schützen diese Software jedoch nicht ausreichend vor unberechtigten Zugriffen, da sie als weniger kritisches System wahrgenommen wird. Dadurch können einzelne oder auch alle Geräte unbeabsichtigt oder bewusst verändert werden."
          }
        ],
        "control-implementations": [
          {
            "uuid": "b9a0a943-a35b-4c9e-aadf-7a15cbf7ed9d",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/drucker_profile.json",
            "description": "Implementation for all controls in Baustein SYS.4.1",
            "implemented-requirements": [
              {
                "uuid": "7a9e6e89-d82e-41cf-b469-c2771ed29bb2",
                "control-id": "ARCH.2.2.10",
                "description": "Implementation for ARCH.2.2.10 based on BSI SYS.4.1.A11",
                "statements": [
                  {
                    "statement-id": "sys.4.1-a11-m3",
                    "uuid": "8d25cb2f-604a-4ef4-980a-4dbca2a9331f",
                    "description": "Der IT-Betrieb SOLLTE sicherstellen, dass netzfähige Drucker, Kopierer und Multifunktionsgeräte nicht aus Fremdnetzen erreichbar sind. Wenn Multifunktionsgeräte an das Telefonnetz angeschlossen werden, SOLLTE sichergestellt werden, dass keine unkontrollierten Datenverbindungen zwischen dem Datennetz und dem Telefonnetz aufgebaut werden können. Netzdrucker und Multifunktionsgeräte SOLLTEN in einem eigenen Netzsegment, das von den Clients und Servern der Institution getrennt ist, betrieben werden."
                  },
                  {
                    "statement-id": "sys.4.1-a11-m4",
                    "uuid": "98d7c21e-ee17-4d12-97db-5eb4e60a67b4",
                    "description": "Die Firewall-Regeln für das Drucker-Segment werden nach dem Prinzip der geringsten Rechte (Least Privilege) konfiguriert. Es wird explizit definiert, welche Clients mit welchen Druckern kommunizieren dürfen. Jeglicher ausgehender Internetverkehr aus dem Drucker-VLAN wird standardmäßig blockiert und nur für explizit genehmigte Dienste (z.B. Abruf von Firmware-Updates von Hersteller-Servern) freigegeben."
                  },
                  {
                    "statement-id": "sys.4.1-a11-m5",
                    "uuid": "b5571949-388b-4d8b-ae8e-77efb7c5b0dc",
                    "description": "Im Drucker-Segment wird Network Access Control (NAC) nach IEEE 802.1X eingesetzt. Nur authentifizierte und autorisierte Drucker dürfen auf das Netzwerk zugreifen. Der gesamte Netzwerkverkehr zum und vom Drucker-Segment wird auf Anomalien überwacht. Mikrosegmentierung wird verwendet, um die Kommunikation zwischen den Druckern selbst zu unterbinden."
                  }
                ]
              },
              {
                "uuid": "5465ada6-dcd1-4107-8253-0dd800bd41f1",
                "control-id": "GEB.7.1",
                "description": "Implementation for GEB.7.1 based on BSI SYS.4.1.A2",
                "statements": [
                  {
                    "statement-id": "sys.4.1-a2-m1",
                    "uuid": "ec7fabe7-80ce-458c-8c97-c7cde6f4eb11",
                    "description": "Nur einige zentrale Drucker, die bekanntermaßen für vertrauliche Ausdrucke genutzt werden, sind in abschließbaren Räumen aufgestellt. Für die meisten Geräte gibt es keine spezifischen Aufstellungs- oder Zugriffsregeln."
                  },
                  {
                    "statement-id": "sys.4.1-a2-m2",
                    "uuid": "aa26180b-49ff-498a-8623-51e635b3172d",
                    "description": "Alle Drucker sind in von der Institution kontrollierten Bereichen aufgestellt, sodass Unbefugte von außen keinen direkten Zugang haben. Es werden Standard-Gerätepasswörter für die Administration gesetzt, diese sind aber oft einheitlich und werden selten geändert."
                  },
                  {
                    "statement-id": "sys.4.1-a2-m3",
                    "uuid": "2446ed7d-4c45-47bd-a22c-9317ea69cbc4",
                    "description": "Der IT-Betrieb MUSS Drucker, Kopierer und Multifunktionsgeräte so aufstellen und absichern, dass nur befugte Personen die Geräte verwenden und auf verarbeitete Informationen zugreifen können. Es MUSS sichergestellt sein, dass nur berechtigte Personen die Geräte administrieren, warten und reparieren können. Mit Dienstleistenden MÜSSEN schriftliche Vertraulichkeitsvereinbarungen getroffen werden. Die Geräte MÜSSEN mit Passwörtern versehen sein, die den Vorgaben des Identitäts- und Berechtigungsmanagements entsprechen."
                  },
                  {
                    "statement-id": "sys.4.1-a2-m4",
                    "uuid": "2d5dd644-4dab-4e08-b710-32a01ebc64e0",
                    "description": "Der physische Zugriff auf Geräte wird durch organisatorische Maßnahmen (z. B. Platzierung in nicht frei zugänglichen Büros) und bei hohem Schutzbedarf durch technische Maßnahmen (z. B. Gehäuseschlösser) weiter eingeschränkt. Die Gerätepasswörter werden zentral verwaltet und regelmäßig rotiert."
                  },
                  {
                    "statement-id": "sys.4.1-a2-m5",
                    "uuid": "dbcebeab-7586-42c5-b973-d9187143ae0c",
                    "description": "Der physische und administrative Zugriff auf Drucker wird durch ein zentrales IAM-System gesteuert und überwacht. Jeder Zugriffsversuch wird protokolliert und Anomalien (z. B. wiederholte fehlgeschlagene Anmeldeversuche) lösen automatisch einen Alarm aus. Physische Sicherungsmaßnahmen werden durch Videoüberwachung an kritischen Standorten ergänzt."
                  }
                ]
              },
              {
                "uuid": "d5be38f8-7530-4afb-af96-958b4e29fc9a",
                "control-id": "KONF.2.4",
                "description": "Implementation for KONF.2.4 based on BSI SYS.4.1.A18",
                "statements": [
                  {
                    "statement-id": "sys.4.1-a18-m3",
                    "uuid": "4a33d136-5a86-4e5e-ab2b-dc7fb4e99fef",
                    "description": "Alle Drucker und Multifunktionsgeräte SOLLTEN nur vom IT-Betrieb konfiguriert werden können. Nicht benötigte Gerätefunktionen und Datenschnittstellen SOLLTEN abgeschaltet werden. Die Geräte SOLLTEN ausschließlich über verschlüsselte Protokolle wie HTTPS und SNMPv3 verwaltet werden. Sämtliche Protokolle, mit denen unverschlüsselt zugegriffen wird (insbesondere zur Konfigurationsänderung wie SNMP, Telnet, PJL), SOLLTEN ersetzt oder abgeschaltet werden."
                  },
                  {
                    "statement-id": "sys.4.1-a18-m4",
                    "uuid": "df5d00d4-ea05-4841-b2d2-befb13e8ba73",
                    "description": "Die gehärtete Konfigurationsbaseline wird zentral über eine Verwaltungssoftware auf alle Geräte ausgerollt. Die Konfiguration der Geräteflotte wird regelmäßig automatisiert auf Abweichungen von dieser Baseline überprüft."
                  },
                  {
                    "statement-id": "sys.4.1-a18-m5",
                    "uuid": "576a6ac1-a9ed-47b6-af96-5416b5e12eab",
                    "description": "Die Konfigurationsbaseline wird als „Infrastructure as Code“ (IaC) in einem Versionierungssystem verwaltet. Eine Security Configuration Management (SCM) Lösung überwacht die Konformität kontinuierlich in Echtzeit und ist in der Lage, Abweichungen automatisch zu korrigieren (Selbstheilung)."
                  }
                ]
              },
              {
                "uuid": "6f30673b-c88b-48fc-8f7e-8ea298ce745f",
                "control-id": "KONF.2.5",
                "description": "Implementation for KONF.2.5 based on BSI SYS.4.1.A21",
                "statements": [
                  {
                    "statement-id": "sys.4.1-a21-m3",
                    "uuid": "551feaeb-60f1-4a46-9ea5-d4c1b08486d4",
                    "description": "Der IT-Betrieb SOLLTE die Sicherheitseinstellungen von Druckern regelmäßig kontrollieren und korrigieren, ggf. durch ein automatisiertes System. Es SOLLTE eingeschränkt werden, dass die Geräte über das Bootmenü auf Werkseinstellungen zurückgesetzt werden können. Es SOLLTE sichergestellt sein, dass keine nicht vom Hersteller verifizierte und freigegebene Firmware oder Zusatzsoftware installiert werden kann."
                  },
                  {
                    "statement-id": "sys.4.1-a21-m4",
                    "uuid": "5d246851-0966-481a-ad82-b27d4d250d70",
                    "description": "Ein Security Configuration Management (SCM)-Tool überwacht kontinuierlich alle Geräte auf Konformität mit einer gehärteten Baseline und meldet Abweichungen automatisch. Alle Firmware-Updates werden vor dem Rollout in einer Testumgebung auf Sicherheit und Kompatibilität geprüft. Die Integrität der Firmware wird beim Update-Prozess durch digitale Signaturen überprüft."
                  },
                  {
                    "statement-id": "sys.4.1-a21-m5",
                    "uuid": "1ee88a56-3aaa-45db-acd3-a71b23e3da85",
                    "description": "Die Integrität der Geräte wird durch Secure Boot und eine kontinuierliche Laufzeit-Integritätsprüfung (Runtime Integrity Monitoring) sichergestellt, die bei jeder Manipulation an der Firmware oder kritischen Konfigurationsdateien Alarm schlägt. Jeglicher Versuch, unsignierte Firmware oder Software zu installieren, wird nicht nur blockiert, sondern löst einen hochprioren Sicherheitsvorfall aus. Alle Konfigurationsänderungen werden in einem zentralen SIEM mit den Aufzeichnungen aus dem Change-Management-System korreliert."
                  }
                ]
              },
              {
                "uuid": "e631f8a7-1cce-4000-8d87-313c3b99c3ec",
                "control-id": "KONF.3.2",
                "description": "Implementation for KONF.3.2 based on BSI SYS.4.1.A15",
                "statements": [
                  {
                    "statement-id": "sys.4.1-a15-m3",
                    "uuid": "0338b0b1-5806-47c6-81cc-c2bb9000b1ce",
                    "description": "Wenn möglich, SOLLTEN alle auf geräteinternen, nichtflüchtigen Speichermedien (z.B. Festplatten) abgelegten Informationen verschlüsselt werden. Auch Druckaufträge SOLLTEN möglichst verschlüsselt übertragen werden."
                  },
                  {
                    "statement-id": "sys.4.1-a15-m4",
                    "uuid": "65c2235c-09a5-4eb5-a12b-e7464234a83c",
                    "description": "Die Verschlüsselung des internen Speichers ist eine obligatorische Anforderung bei der Beschaffung neuer Geräte. Die Verschlüsselung der Druckdatenübertragung mittels IPPS wird für alle kompatiblen Geräte per Richtlinie erzwungen und zentral konfiguriert. Die verwendeten Verschlüsselungsalgorithmen entsprechen den aktuellen Empfehlungen."
                  },
                  {
                    "statement-id": "sys.4.1-a15-m5",
                    "uuid": "2279ffb2-93e1-49ae-b777-a566454987c1",
                    "description": "Es werden ausschließlich Geräte mit hardwarebasierter Speicherverschlüsselung (z.B. FIPS 140-2 zertifizierte Self-Encrypting Drives) eingesetzt. Die Ende-zu-Ende-Verschlüsselung von Druckaufträgen vom Client bis zum Drucker ist durchgängig implementiert. Die für die Verschlüsselung verwendeten Zertifikate werden über eine interne PKI verwaltet."
                  }
                ]
              },
              {
                "uuid": "e6211fe1-8f7e-4f15-b33b-a09732c9ec33",
                "control-id": "KONF.3.8",
                "description": "Implementation for KONF.3.8 based on BSI SYS.4.1.A20",
                "statements": [
                  {
                    "statement-id": "sys.4.1-a20-m3",
                    "uuid": "5ed25a59-bf39-4aa1-9ee5-aea06cc68ca9",
                    "description": "Es SOLLTEN auf dem Druckserver die Namen der Druckaufträge nur anonymisiert angezeigt werden. Alle Schnittstellen für externe Speichermedien SOLLTEN gesperrt werden. Geräteinterne Adressbücher SOLLTEN deaktiviert und alternative Adressierungsverfahren (z.B. LDAP) angeboten werden. Bei der E-Mail-Funktion SOLLTE sichergestellt sein, dass E-Mails nur mit der Adresse des authentisierten Benutzers und nur an interne Adressen versendet werden können. Eingehende Fax-Dokumente und Sendeberichte SOLLTEN nur autorisierten Personen zugänglich sein."
                  },
                  {
                    "statement-id": "sys.4.1-a20-m4",
                    "uuid": "6d333e91-b3d0-4c8a-be49-9c4e687ea962",
                    "description": "Die Funktion „Scan-to-Email“ ist in eine Data Loss Prevention (DLP)-Lösung integriert, die den Inhalt gescannter Dokumente auf sensible Informationen überprüft und den Versand bei Regelverstößen blockieren kann. Alle Fax-Kommunikationen (ein- und ausgehend) werden zentral protokolliert. Die LDAP-Abfragen zur Adresssuche erfolgen ausschließlich über eine verschlüsselte Verbindung (LDAPS)."
                  },
                  {
                    "statement-id": "sys.4.1-a20-m5",
                    "uuid": "9b1530f5-cfc9-4800-8548-9dd1d642995f",
                    "description": "Alle Datenflüsse (Drucken, Scannen, Kopieren, Faxen) unterliegen einer Inhaltsprüfung durch eine umfassende DLP-Lösung, die auch OCR (Texterkennung) auf Bilddateien anwendet. Die Nutzung der Fax-Funktion ist stark eingeschränkt und erfordert eine Genehmigung. Versuche, blockierte Schnittstellen zu nutzen, werden protokolliert und lösen einen Sicherheitsalarm aus."
                  }
                ]
              },
              {
                "uuid": "9d50edb5-c98c-483b-8772-6425c2276c75",
                "control-id": "KONF.4.4",
                "description": "Implementation for KONF.4.4 based on BSI SYS.4.1.A7",
                "statements": [
                  {
                    "statement-id": "sys.4.1-a7-m3",
                    "uuid": "9bb7cc21-8253-4a12-9a9e-98c3b561f585",
                    "description": "Der IT-Betrieb SOLLTE sicherstellen, dass der administrative Fernzugriff auf Drucker, Kopierer und Multifunktionsgeräte nur einer klar definierten Gruppe des Administrations- und Servicepersonals ermöglicht wird. Dies SOLLTE auch dann gewährleistet sein, wenn eine zentrale Geräteverwaltungssoftware eingesetzt wird. Es SOLLTE festgelegt werden, ob die Anzeige des Bedienfelds über ein Datennetz eingesehen werden darf, und wenn ja, dies auf den IT-Betrieb beschränkt und mit den Benutzenden abgestimmt werden."
                  },
                  {
                    "statement-id": "sys.4.1-a7-m4",
                    "uuid": "62b91ecb-dad8-4a56-b255-5bf5ad748e8d",
                    "description": "Der administrative Fernzugriff wird über ein dediziertes Verwaltungsnetz oder eine Bastion Host-Lösung weiter abgesichert. Alle administrativen Sitzungen werden protokolliert, um nachvollziehen zu können, wer wann welche Änderungen vorgenommen hat. Es werden separate, nicht-personalisierte Admin-Konten verwendet."
                  },
                  {
                    "statement-id": "sys.4.1-a7-m5",
                    "uuid": "f2b3376e-1bc8-437e-930f-193a21348392",
                    "description": "Jeglicher administrativer Fernzugriff erfolgt ausschließlich über eine Privileged Access Management (PAM)-Lösung. Diese erzwingt Multi-Faktor-Authentifizierung, zeichnet die gesamte Sitzung auf (Video- und Befehlsprotokollierung) und ermöglicht eine Just-in-Time-Rechtevergabe."
                  }
                ]
              },
              {
                "uuid": "2cb7b53e-4a97-4e6e-b7b0-59027d23de85",
                "control-id": "KONF.5.1",
                "description": "Implementation for KONF.5.1 based on BSI SYS.4.1.A14",
                "statements": [
                  {
                    "statement-id": "sys.4.1-a14-m3",
                    "uuid": "de8b1dc0-60ca-41b0-b90f-ce361a9e16aa",
                    "description": "Nur berechtigte Personen SOLLTEN auf die ausgedruckten oder kopierten Dokumente zugreifen können. Es SOLLTEN möglichst nur zentrale Drucker, Kopierer und Multifunktionsgeräte eingesetzt werden, bei denen sich die Benutzenden am Gerät authentisieren, bevor der Druckauftrag startet („Secure-Print“). Nachdem sich die Benutzenden authentisiert haben, SOLLTEN ausschließlich nur die eigenen Druckaufträge sichtbar sein. Nur die für die jeweiligen Benutzenden notwendigen Funktionen SOLLTEN freigeschaltet werden."
                  },
                  {
                    "statement-id": "sys.4.1-a14-m4",
                    "uuid": "daf92a28-748a-45c8-83e9-91c083630869",
                    "description": "Die Authentisierung am Drucker ist in das zentrale Verzeichnisdienst-System (z.B. Active Directory) integriert und erfolgt komfortabel und sicher über Mitarbeiterausweise mit RFID/NFC oder Smartcards. Die Autorisierung (d.h. die Freigabe von Funktionen wie Farbdruck, Scannen, Faxen) wird rollenbasiert über Gruppen im Verzeichnisdienst gesteuert."
                  },
                  {
                    "statement-id": "sys.4.1-a14-m5",
                    "uuid": "68e8088a-645c-463b-8e65-93446762ab78",
                    "description": "Für die Freigabe von besonders schutzbedürftigen Druckaufträgen oder den Zugriff auf kritische Funktionen wird eine Multi-Faktor-Authentifizierung (MFA) am Gerät erzwungen. Alle Authentisierungs- und Autorisierungsereignisse werden zentral protokolliert und auf Anomalien überwacht. Das Berechtigungsmodell ist dynamisch und kann auf der Klassifizierung des Dokuments basieren."
                  }
                ]
              },
              {
                "uuid": "7d8a754f-f2b0-4397-9f51-61d3397577c7",
                "control-id": "KONF.9.3",
                "description": "Implementation for KONF.9.3 based on BSI SYS.4.1.A16",
                "statements": [
                  {
                    "statement-id": "sys.4.1-a16-m3",
                    "uuid": "8c1a0328-95ff-46d7-8ccb-1fbde065f85c",
                    "description": "Um die Ausfallzeiten von Druckern, Kopierern und Multifunktionsgeräten so gering wie möglich zu halten, SOLLTEN unter anderem Ersatzgeräte bereitstehen, in Wartungsverträgen auf eine angemessene Reaktionszeit geachtet werden, eine Liste mit Fachhandlungen geführt werden, um schnell Ersatzgeräte oder -teile beschaffen zu können und falls erforderlich, häufig benötigte Ersatzteile gelagert werden."
                  },
                  {
                    "statement-id": "sys.4.1-a16-m4",
                    "uuid": "f8daddb4-413b-470f-903b-938285f1bcba",
                    "description": "Ein detaillierter Notfallplan für den Ausfall der Druckdienste ist Teil des allgemeinen Business Continuity Managements (BCM). Die Wartungsverträge beinhalten garantierte Wiederherstellungszeiten. Ein proaktives Monitoring-System überwacht den Zustand der Geräte (z.B. Tonerstand, Fehlercodes, Bauteilverschleiß) und meldet potenzielle Probleme, bevor sie zu einem Ausfall führen."
                  },
                  {
                    "statement-id": "sys.4.1-a16-m5",
                    "uuid": "47093b1d-d044-40ed-a5ff-5983417e7569",
                    "description": "Eine hohe Verfügbarkeit der Druckdienste wird durch technische Redundanz, wie geclusterte Druckserver und eine ausreichende Anzahl an Geräten pro Standort, sichergestellt. Der gesamte Prozess von der Störungsmeldung bis zur Behebung ist im ITSM-Tool automatisiert, einschließlich Eskalationsmechanismen."
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}