{
  "component-definition": {
    "uuid": "ae3fc59f-f97f-469c-8dea-f74089ac615e",
    "metadata": {
      "title": "APP.5.3 E-Mail - Benutzerdefiniert",
      "last-modified": "2025-11-13T21:34:49.532362+00:00",
      "version": "1.0.0",
      "oscal-version": "1.1.3"
    },
    "components": [
      {
        "uuid": "8c15e6af-625d-4afc-b50a-952b0740a25a",
        "type": "software",
        "title": "APP.5.3 E-Mail",
        "description": "This component represents the implementation of all controls for Baustein APP.5.3.",
        "props": [
          {
            "name": "Einleitung",
            "value": "E-Mail ist eine der am häufigsten genutzten und ältesten Internetanwendungen. E-Mails werden dazu verwendet, Texte und angehängte Dateien zu versenden. Dazu wird eine E-Mail-Adresse benötigt.<BR>Um E-Mail nutzen zu können, werden E-Mail-Server benötigt, die elektronische Nachrichten empfangen und versenden. In der Regel rufen E-Mail-Clients, mit denen auf E-Mail-Dienste zugegriffen wird, Nachrichten, die für sie bestimmt sind, mittels der Protokolle POP3 oder IMAP vom E-Mail-Server ab und senden mit dem Protokoll SMTP selbst Nachrichten an den E-Mail-Server, der diese bei Bedarf an einen anderen E-Mail-Server weiterleitet.<BR>Da E-Mail insbesondere in Unternehmen und Behörden weit verbreitet ist, sind E-Mail-Server häufig das Ziel von Angriffen.<BR>Auch E-Mail-Clients stehen im Fokus von Angriffen. Sie werden angegriffen, indem beispielsweise Schadsoftware per E-Mail versendet wird. Zusätzlich werden E-Mails auch oft als Werkzeug für Social-Engineering-Angriffe eingesetzt.<BR>Aus diesen Gründen kommt dem sicheren Betrieb und der sicheren Nutzung von E-Mail-Anwendungen eine besondere Bedeutung zu."
          },
          {
            "name": "Zielsetzung",
            "value": "Ziel dieses Bausteins ist es, die Informationen zu schützen, die mit E-Mail-Clients bzw. auf E-Mail-Servern verarbeitet werden."
          },
          {
            "name": "Abgrenzung und Modellierung",
            "value": "Der Baustein APP.5.3 Allgemeiner E-Mail-Client und -Server ist auf jeden E-Mail-Client und -Server im Informationsverbund anzuwenden.<BR>Der Baustein enthält Anforderungen für allgemeine E-Mail-Clients und -Server. Anforderungen für Serverplattformen, Betriebssysteme und Clients sind nicht Bestandteil des Bausteins. Diese sind in den Bausteinen SYS.1.1 Allgemeiner Server sowie SYS.2.1 Allgemeiner Client und in den jeweiligen betriebssystemspezifischen Bausteinen zu finden.<BR>Der Baustein APP.5.3 Allgemeiner E-Mail-Client und -Server wird in einem Informationsverbund meist in Verbindung mit einem weiteren spezifischen Baustein der Schicht APP.5 E-Mail/Groupware/Kommunikation genutzt. Diese müssen ebenfalls separat umgesetzt werden. Zu diesen Bausteinen zählt unter anderem APP.5.2 Microsoft Exchange und Outlook.<BR>Anforderungen für die Protokollierung und Datensicherung finden sich in den Bausteinen OPS.1.1.5 Protokollierung und CON.3 Datensicherungskonzept.<BR>Nicht in diesem Baustein behandelt werden Groupware-Funktionen, die neben E-Mail auch noch weitere Funktionen wie die Verwaltung von Kontaktdaten und Kalendern bieten. Ebenso werden keine reinen Cloud-Lösungen behandelt, wie sie etwa als Teil von Microsoft 365 oder Google G Suite zu finden sind. Allgemeine Anforderungen dazu sind im Baustein OPS.2.2 Cloud-Nutzung zu finden. Ebenfalls nicht betrachtet werden Webbrowser, mit denen über Webseiten auf Webmail-Dienste zugegriffen wird. Anforderungen an Webbrowser sind im Baustein APP.1.2 Webbrowser zu finden."
          },
          {
            "name": "2.1. Unzureichende Planung der E-Mail-Nutzung",
            "value": "E-Mail-Anwendungen können ohne entsprechend dokumentierte Regelungen und ein definiertes Sicherheitsverfahren in der Institution nicht sicher genutzt werden. Falls in der Planung der E-Mail-Systeme die prozessualen, organisatorischen und technischen Regelungen vernachlässigt werden, könnte dies interne sowie externe Angriffe zur Folge haben.<BR>Beispielsweise kann ein zu klein dimensionierter E-Mail-Server durch eine große Zahl von eingehenden E-Mails ausfallen. Werden keine ausreichenden Sicherheitsmaßnahmen geplant, ist es auch möglich, dass die E-Mail-Clients anfälliger für E-Mails sind, die Schadsoftware enthalten."
          },
          {
            "name": "2.2. Fehlerhafte Einstellung von E-Mail-Clients und -Servern",
            "value": "Da eine E-Mail-Infrastruktur sehr komplex sein kann, können durch die vielen möglichen Einstellungen und durch die sich gegenseitig beeinflussenden Parameter zahlreiche Sicherheitsprobleme entstehen.<BR>Beispielsweise kann ein E-Mail-Server durch eine fehlerhafte Konfiguration legitime E-Mails von anderen Servern ablehnen. Zusätzlich wäre es möglich, dass essenzielle Einstellungen ignoriert oder missachtet werden, z. B. die Transportverschlüsselung von E-Mails.<BR>Außerdem kann eine falsche Konfiguration in E-Mail-Clients dazu führen, dass diese Schadcode in E-Mails ausführen. Diese Sicherheitslücken können zu einem signifikanten Verlust der Verfügbarkeit, Integrität und Vertraulichkeit von Informationen führen.<BR>Viele Institutionen setzen keine Sicherheitsmechanismen ein, die es anderen E-Mail-Servern ermöglichen, zu überprüfen, ob eine E-Mail tatsächlich von der angegebenen Absendeadresse stammt. Außerdem kann ein falsch eingestellter E-Mail-Server dazu missbraucht werden, um Spam-E-Mails zu versenden."
          },
          {
            "name": "2.3. Unzuverlässigkeit von E-Mail",
            "value": "Über E-Mail-Anwendungen lassen sich schnell und komfortabel Daten austauschen. Das ist jedoch nicht immer zuverlässig. Zum Beispiel können durch fehlerhafte E-Mail-Server oder gestörte Übertragungswege Nachrichten verloren gehen. Ursachen dafür sind beispielsweise Spam-Filter, die legitime Nachrichten herausfiltern und verwerfen. E-Mails können auch verloren gehen, wenn die Zieladresse nicht korrekt angegeben wurde. Im schlimmsten Fall können vertrauliche Informationen an falsche Zieladressen gesendet worden sein."
          },
          {
            "name": "2.4. Schadsoftware in E-Mails",
            "value": "Es gibt verschiedene Wege, wie bei einem Angriff Schadsoftware mit Hilfe von E-Mails verbreitet werden kann. Einerseits kann schädlicher Code direkt in einer E-Mail enthalten sein. Ist der E-Mail-Client nicht richtig konfiguriert, wird der Code beim Öffnen der E-Mail ausgeführt.<BR>Eine weitere Möglichkeit besteht darin, dass Dateien mit Schadsoftware als Anhang von E-Mails versendet werden. Falls solche E-Mails nicht durch Spam- oder Virenfilter aussortiert werden und die Anhänge geöffnet werden, wird die Schadsoftware ausgeführt. Diese kann zu weitreichenden Schäden auch für andere IT-Systeme führen, wenn beispielsweise Ransomware (oft als „Erpressungstrojaner“ bezeichnet) ausgeführt wird."
          },
          {
            "name": "2.5. Social Engineering",
            "value": "E-Mails werden oft bei Angriffen dazu eingesetzt, um vertrauliche Informationen zu erhalten oder Personal zu anderem schädlichen Verhalten zu verleiten. Beispielsweise kann bei einem Angriff eine E-Mail gesendet werden, die vermeintlich von Vorgesetzten stammt und Anweisungen enthält, die der Institution schaden (sogenannter CEO-Fraud). Häufig wird dabei angewiesen, dass Geld auf Konten im Ausland überwiesen werden soll.<BR>Möglich ist auch, dass eine gefälschte E-Mail einer eigentlich vertrauenswürdigen Quelle dazu auffordert, Zugangsdaten auf einer Webseite einzugeben (Phishing). Die so gewonnenen Zugangsdaten können dann bei einem Angriff für weitere Aktionen verwendet werden.<BR>Verstärkt wird die Gefahr von Social Engineering, wenn die Institution nicht regelmäßig zu diesen Gefährdungen schult und sensibilisiert."
          },
          {
            "name": "2.6. Mitlesen und Manipulieren von E-Mails",
            "value": "E-Mails werden in der Regel unverschlüsselt und ohne digitale Signatur versendet. Deswegen können bei einem Angriff E-Mails mitgelesen und sogar beliebig verändert werden. Auf diesem Weg können vertrauliche Informationen offengelegt oder falsche Informationen verteilt werden. Es ist auch möglich, dass auf diesem Weg Schadsoftware eingespielt wird."
          }
        ],
        "control-implementations": [
          {
            "uuid": "ff04498c-47af-4403-ba33-7657c9414cdf",
            "source": "https://raw.githubusercontent.com/AG-3-Nutzergenerierte-Inhalte/Stand-der-Technik-Bibliothek/refs/heads/main/Stand-der-Technik-Bibliothek/Zielobjekt-Bausteine/profiles/e-mail_profile.json",
            "description": "Implementation for all controls in Baustein APP.5.3",
            "implemented-requirements": [
              {
                "uuid": "ea279280-c5f3-41c6-8d15-6efe078358d1",
                "control-id": "ARCH.8.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "ARCH",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a11-m3",
                    "uuid": "85eac0d8-41a8-47e5-bd6a-ca408f8966bf",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution verfügt über einen sekundären Mail-Exchanger (MX) mit niedrigerer Priorität bei einem externen Anbieter. Dieser nimmt E-Mails an, falls der primäre Server nicht erreichbar ist, und stellt sie später zu."
                      },
                      {
                        "name": "guidance",
                        "value": "Im DNS sind zwei MX-Records mit unterschiedlichen Prioritäten eingetragen. Der zweite MX-Record verweist auf einen Backup-MX-Dienst. Dies stellt nur die Redundanz des E-Mail-Empfangs sicher, nicht des Versands oder des Postfachzugriffs."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die MX-Records der Domain. Es wird getestet (z.B. durch temporäres Blockieren des primären Servers in einer Firewall), ob der sekundäre MX die E-Mails korrekt annimmt."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a11-m4",
                    "uuid": "87405b10-8eac-48ac-9e59-a6a805ef246d",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE redundante E-Mail-Server betreiben. Die redundanten E-Mail-Server SOLLTEN mit geeigneter Priorität in den MX-Records der betroffenen Domains hinterlegt werden. Es SOLLTE festgelegt werden, wie E-Mails zwischen den E-Mail-Servern synchronisiert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es werden mindestens zwei vollwertige E-Mail-Server in einem Cluster-Setup betrieben (z.B. Aktiv/Passiv oder Aktiv/Aktiv), idealerweise an getrennten Standorten. Die Postfachdatenbanken und Konfigurationen werden in kurzen Intervallen oder in Echtzeit zwischen den Servern repliziert. Ein Load Balancer oder DNS-Failover wird für den Client-Zugriff verwendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Cluster-Konzept und die Replikationseinstellungen. Es wird ein geplanter Failover-Test durchgeführt, um zu überprüfen, ob der zweite Server nahtlos übernimmt und die Daten aktuell sind."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "5e757ef2-9a27-41ab-a978-14a5328d889b",
                "control-id": "DET.4.17",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a12-m3",
                    "uuid": "41718ebb-009b-4a73-9d78-381040b44016",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der IT-Betrieb überprüft bei Problemen mit dem E-Mail-Versand manuell, ob die IP-Adressen der E-Mail-Server auf gängigen öffentlichen Block-Listen (RBLs) aufgeführt sind."
                      },
                      {
                        "name": "guidance",
                        "value": "IT-Administratoren nutzen bei Bedarf Web-basierte Tools (z.B. MXToolbox), um die Reputation der eigenen IP-Adressen zu prüfen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer befragt die Administratoren nach ihrem Vorgehen, wenn Benutzer über nicht zustellbare E-Mails berichten. Es gibt keine proaktive Überwachung."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a12-m4",
                    "uuid": "5d0c2771-acba-42b2-b3fa-2cfb426ed738",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der IT-Betrieb SOLLTE regelmäßig überprüfen, ob die E-Mail-Server der Institution auf öffentlichen Spam- oder Block-Listen aufgeführt sind."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein automatisiertes Monitoring-System oder ein externer Dienst wird genutzt, um die IP-Adressen der Mail-Server täglich gegen eine kuratierte Liste von wichtigen Block-Listen zu prüfen. Bei einem positiven Eintrag wird eine Benachrichtigung an die IT-Abteilung gesendet."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Konfiguration des Monitoring-Tools und die Benachrichtigungsprotokolle der letzten Monate. Es wird geprüft, ob ein definierter Prozess für den Fall eines Listings (Ursachenanalyse, De-Listing-Antrag) existiert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "2ddc00bd-ad50-43c5-a183-93cfdcb0bcba",
                "control-id": "KONF.10.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "CON",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a1-m1",
                    "uuid": "5a9cec8d-7997-4b53-9211-cb378181d7df",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine grundlegende Konfiguration für E-Mail-Clients ist nur für einzelne, als kritisch eingestufte Benutzer oder Systeme umgesetzt. Es gibt keine einheitliche Vorgabe für die gesamte Institution."
                      },
                      {
                        "name": "guidance",
                        "value": "Typischerweise werden manuelle Konfigurationsanleitungen per E-Mail an wenige Mitarbeiter versendet. Es findet keine Überprüfung der Umsetzung statt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer stellt durch Stichproben fest, dass nur ein kleiner Teil der E-Mail-Clients eine wie auch immer geartete Sicherheitskonfiguration aufweist. Es kann kein Konfigurationsdokument vorgelegt werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a1-m2",
                    "uuid": "645fd08c-e9ae-4d62-a945-814a4a13e7d6",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Eine standardisierte Basiskonfiguration wird auf allen E-Mail-Clients ausgerollt. Diese Konfiguration kann jedoch von den Benutzern leicht geändert werden. Die Überprüfung von Anhängen auf Schadsoftware ist aktiviert, aber weitergehende Schutzmaßnahmen wie die Deaktivierung von aktiven Inhalten sind nicht konsequent umgesetzt."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Konfiguration erfolgt oft über die Standardeinstellungen des E-Mail-Client-Installers oder ein einfaches Skript. Es gibt keine Mechanismen, die Benutzer an der Änderung der Einstellungen hindern."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass auf allen Clients eine Konfiguration vorhanden ist. Bei einer Stichprobe wird jedoch festgestellt, dass Benutzer die sicherheitsrelevanten Einstellungen (z.B. HTML-Anzeige) selbstständig geändert haben."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a1-m3",
                    "uuid": "27af4beb-d116-403d-b683-2e2384bfeb5b",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution MUSS eine dokumentierte, sichere Konfiguration für die E-Mail-Clients vorgeben und diese vorkonfiguriert zur Verfügung stellen. Dateianhänge MÜSSEN vor dem Öffnen auf Schadsoftware überprüft werden. E-Mail-Clients MÜSSEN so konfiguriert sein, dass sie HTML-Code und andere aktive Inhalte nicht automatisch interpretieren. E-Mail-Filterregeln und automatische Weiterleitungen MÜSSEN auf notwendige Anwendungsfälle beschränkt werden. Für die Kommunikation mit E-Mail-Servern über nicht vertrauenswürdige Netze MUSS eine sichere Transportverschlüsselung eingesetzt werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Die sichere Konfiguration wird zentral über ein Client-Management-System (z.B. GPOs in Active Directory) verteilt und durchgesetzt. Die Konfiguration beinhaltet explizit die Deaktivierung der automatischen HTML-Anzeige und die Konfiguration der Vorschaufunktion, sodass keine Dateien automatisch interpretiert werden. Die Überprüfung von Anhängen erfolgt durch eine lokale Antiviren-Software oder eine serverseitige Lösung."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich das Konfigurationsdokument für E-Mail-Clients vorlegen und überprüft die Einstellungen im zentralen Verwaltungswerkzeug. Anhand von Test-Clients wird verifiziert, dass aktive Inhalte blockiert werden und eine Transportverschlüsselung (z.B. TLS) für die Serverkommunikation erzwungen wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a1-m4",
                    "uuid": "5483a508-8f8a-49da-8d38-d17cde85ebaa",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE sicherstellen, dass sicherheitsrelevante Teile der Konfiguration nicht von Benutzenden geändert werden können. Ist dies technisch nicht umsetzbar, MUSS die Institution die Benutzer explizit und nachweislich darauf hinweisen, dass die Konfiguration nicht geändert werden darf. Vorschaufunktionen für Dateianhänge sind so konfiguriert, dass sie Dateien unter keinen Umständen automatisch interpretieren oder ausführen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Konfigurationseinstellungen werden durch technische Mittel (z.B. Client Management Software) gesperrt. Benutzer erhalten nur Leserechte auf die relevanten Konfigurationsdateien oder Registry-Einträge. Regelmäßige Scans überprüfen die Konformität der Clients."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer versucht als normaler Benutzer, sicherheitsrelevante Einstellungen wie die Deaktivierung der HTML-Anzeige oder die Transportverschlüsselung zu ändern. Es wird verifiziert, dass diese Versuche fehlschlagen. Alternativ wird die Konfiguration des Client-Management-Systems zur Sperrung der Einstellungen geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a1-m5",
                    "uuid": "54a6b652-b7e5-4818-927c-b957dffbe414",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Konfiguration der E-Mail-Clients wird durch ein zentrales Managementsystem nicht nur erzwungen, sondern auch kontinuierlich überwacht. Jede Abweichung von der definierten Sicherheitsbaseline führt zu einem automatisierten Alarm und, falls möglich, zu einer sofortigen automatischen Korrektur der Konfiguration. Die Sicherheitsrichtlinien für E-Mail-Clients sind in das allgemeine Endpoint-Security-Konzept integriert."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine Endpoint Detection and Response (EDR) oder Mobile Device Management (MDM) Lösung wird eingesetzt, um die Konfiguration in Echtzeit zu überwachen. Konfigurations-Baselines sind als Code (Configuration as Code) definiert und versioniert. Alle sicherheitsrelevanten Ereignisse des E-Mail-Clients werden an ein zentrales SIEM-System weitergeleitet und korreliert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Logs des EDR/MDM-Systems auf Konformitätsprüfungen und automatische Korrekturmaßnahmen. Es wird ein Testfall durchgeführt, bei dem eine Konfiguration manuell (mit administrativen Rechten) geändert wird, um die Reaktionszeit und den Erfolg der automatischen Korrektur zu validieren. Die Integration in das SIEM wird anhand von Test-Ereignissen verifiziert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "b6e6b9be-50f7-457b-9622-4ad44a358881",
                "control-id": "KONF.13.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a4-m3",
                    "uuid": "cd3ec908-37f3-44b0-834f-3c04b38726e9",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der IT-Betrieb MUSS sicherstellen, dass auf E-Mail-Servern eingehende und ausgehende E-Mails, insbesondere deren Anhänge, auf Spam-Merkmale und schädliche Inhalte überprüft werden. Die Einführung und Nutzung von E-Mail-Filterprogrammen MUSS mit den Datenschutzbeauftragten und der Personalvertretung abgestimmt sein. Die Institution MUSS festlegen, wie mit verschlüsselten E-Mails zu verfahren ist, wenn diese nicht durch das Virenschutzprogramm entschlüsselt werden können."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein zentrales E-Mail-Security-Gateway oder eine auf dem Mailserver installierte Software scannt den gesamten ein- und ausgehenden E-Mail-Verkehr. Es gibt eine dokumentierte Richtlinie, die in Abstimmung mit dem Datenschutzbeauftragten erstellt wurde und die z.B. das Vorgehen bei verschlüsselten Anhängen (z.B. Quarantäne und manuelle Freigabe) beschreibt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer lässt sich die Konfiguration des Spam- und Virenschutzes zeigen. Es wird die dokumentierte Abstimmung mit dem Datenschutzbeauftragten und der Personalvertretung eingesehen. Die Richtlinie zum Umgang mit verschlüsselten, nicht scannbaren E-Mails wird geprüft. Eine Test-E-Mail mit einem (harmlosen) Test-Virus (z.B. EICAR) wird blockiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a4-m4",
                    "uuid": "7aeb8102-1372-47b6-b3ea-4b023445d758",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Spam- und Virenschutz wird um fortschrittliche Funktionen wie Sandboxing und URL-Umschreibung erweitert. Anhänge mit unbekanntem oder potenziell gefährlichem Inhalt werden in einer isolierten Umgebung ausgeführt und analysiert, bevor sie zugestellt werden. Links in E-Mails werden zur Klickzeit auf Bösartigkeit überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "Die eingesetzte E-Mail-Security-Lösung verfügt über ein lizenziertes Advanced Threat Protection (ATP)-Modul. Dieses Modul ist für alle eingehenden E-Mails aktiviert. Die Benutzer werden darüber informiert, dass Links in E-Mails möglicherweise anders aussehen, da sie durch den Schutzdienst umgeschrieben werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration des ATP-Moduls. Eine Test-E-Mail mit einem Link zu einer bekannten Malware-Testseite wird versendet, und es wird verifiziert, dass der Klick auf den Link blockiert wird. Eine weitere Test-E-Mail mit einem harmlosen, aber unbekannten ausführbaren Anhang wird in die Quarantäne der Sandbox verschoben."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "3bfdf6c8-848d-488b-9924-54ce92d12ef9",
                "control-id": "KONF.13.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "3",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a9-m3",
                    "uuid": "06e8a19b-4c60-412a-9a2f-4caa82df5fae",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die E-Mail-Server der Institution SOLLTEN eingehende E-Mails mittels Sender Policy Framework (SPF) und DomainKeys Identified Mail (DKIM) überprüfen. Die Institution SOLLTE selbst DKIM und SPF einsetzen, um von ihr versendete E-Mails zu authentisieren. Der SPF-Eintrag SOLLTE den Softfail-Parameter (~all) nur zu Testzwecken verwenden."
                      },
                      {
                        "name": "guidance",
                        "value": "Der E-Mail-Server ist so konfiguriert, dass er SPF- und DKIM-Prüfungen für eingehende E-Mails durchführt und die Ergebnisse im E-Mail-Header vermerkt. Für die eigene Domain ist ein SPF-Record mit allen sendeberechtigten Servern und einem Softfail-Eintrag (~all) im DNS veröffentlicht. Ein DKIM-Schlüssel ist generiert und der öffentliche Teil im DNS hinterlegt; der Server signiert ausgehende Mails."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die DNS-Einträge (SPF, DKIM) der Domain mit öffentlichen Tools. Durch das Senden einer Test-E-Mail von und an die Institution wird in den Headern verifiziert, dass ausgehende Mails signiert und eingehende Mails geprüft werden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a9-m4",
                    "uuid": "7138037b-0349-4d89-8043-01cd88de63c4",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der SPF-Eintrag SOLLTE den \"-all\" (Hardfail) Parameter enthalten. Die Institution SOLLTE DMARC nutzen. DMARC-Einträge SOLLTEN vorgeben, dass E-Mails im Fehlerfall abgewiesen werden (`p=reject`). DMARC-Reporte SOLLTEN regelmäßig ausgewertet werden. Die E-Mail-Kommunikation SOLLTE über MTA-STS abgesichert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Der SPF-Eintrag wird auf `-all` verschärft. Ein DMARC-Eintrag wird im DNS veröffentlicht, zunächst mit `p=none`, dann `p=quarantine` und schließlich `p=reject`. DMARC-Analyse-Tools werden genutzt, um die eingehenden Berichte auszuwerten. Eine MTA-STS-Richtlinie wird auf einem Webserver bereitgestellt und im DNS verankert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die DNS-Einträge für SPF (`-all`) und DMARC (`p=reject`). Es werden die Prozesse und Tools zur Auswertung der DMARC-Berichte geprüft. Die korrekte Konfiguration von MTA-STS wird mit Online-Tools validiert."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a9-m5",
                    "uuid": "6ff9cc57-d2cf-4737-b67b-7c00463be3b1",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE zusätzlich zu SPF, DKIM, DMARC und MTA-STS die E-Mail-Kommunikation über DANE absichern, um die Authentizität des TLS-Zertifikats des Zielservers zu validieren. Die Auswertung von DMARC-Berichten ist automatisiert, um Spoofing-Angriffe in Echtzeit zu erkennen und darauf zu reagieren."
                      },
                      {
                        "name": "guidance",
                        "value": "Voraussetzung für DANE ist der Einsatz von DNSSEC für die Domain der Institution. Entsprechende TLSA-Records werden im DNS veröffentlicht. Der Mailserver ist so konfiguriert, dass er DANE-Einträge bei ausgehenden Verbindungen validiert. Die DMARC-Berichte fließen in ein SIEM-System ein, das bei Anomalien (z.B. hohes Volumen an fehlgeschlagenen Authentifizierungen) Alarme auslöst."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die korrekte Implementierung von DNSSEC und die dazugehörigen TLSA-Records für DANE mit öffentlichen Test-Tools. Die Konfiguration des Mailservers zur DANE-Validierung wird geprüft. Im SIEM-System wird die korrekte Verarbeitung und Alarmierung bei DMARC-Anomalien kontrolliert."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "3356fcbc-deed-4396-a333-8281007a0264",
                "control-id": "KONF.13.7",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "DET",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a13-m4",
                    "uuid": "856c6cef-775a-4a69-b748-fe89ace55ed1",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE TLS-Reporting einsetzen, um Berichte über die erfolgreiche oder fehlgeschlagene TLS-Verschlüsselung bei der E-Mail-Zustellung zu erhalten. Es SOLLTE festgelegt werden, ob TLS-Reports an andere Institutionen versendet werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein DNS-Eintrag für TLS-RPT wird veröffentlicht, der auf einen Endpunkt verweist, der die Berichte entgegennimmt. Ein Dienst (intern oder extern) wird genutzt, um die eingehenden JSON-Berichte zu aggregieren und auszuwerten. Dies hilft, Probleme mit der Transportverschlüsselung proaktiv zu erkennen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert den TLS-RPT-Eintrag im DNS. Es werden die gesammelten Berichte und die daraus abgeleiteten Maßnahmen eingesehen. Die Konfiguration des Mailservers zum Versand eigener TLS-Reports wird überprüft."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "6ac8cfb9-4d5c-4a2c-bb9d-d4cfdaaebd9b",
                "control-id": "KONF.14.1",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "SYS",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a2-m1",
                    "uuid": "8f7ea745-6a5d-4904-b745-91c7fea76250",
                    "description": "Maturity Level 1: Partial",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der E-Mail-Server ist mit den Standardeinstellungen installiert. Es gibt keine spezifische Härtung oder Konfiguration, um ihn als Open Relay zu verhindern oder DoS-Angriffe abzuwehren."
                      },
                      {
                        "name": "guidance",
                        "value": "Der Server wurde nach einer einfachen Anleitung aus dem Internet aufgesetzt. Sicherheitsaspekte wie Transportverschlüsselung oder Zugriffsbeschränkungen wurden nicht berücksichtigt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Ein externer Test zeigt, dass der Server als Open Relay missbraucht werden kann. Eine Port-Scan-Analyse zeigt unverschlüsselte E-Mail-Protokolle wie SMTP (Port 25) ohne STARTTLS."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a2-m2",
                    "uuid": "30380118-b9cc-49b0-9a31-0fdd946fc6b7",
                    "description": "Maturity Level 2: Foundational",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der E-Mail-Server bietet eine sichere Transportverschlüsselung (TLS) an, erzwingt diese jedoch nicht. Unverschlüsselte Verbindungen sind weiterhin möglich. Der Server ist grundlegend so konfiguriert, dass er nicht als Open Relay fungiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein gültiges TLS-Zertifikat ist auf dem Server installiert. Die Konfiguration erlaubt jedoch sowohl verschlüsselte (z.B. SMTPS Port 465, IMAPS Port 993) als auch unverschlüsselte Verbindungen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert, dass eine verschlüsselte Verbindung zum Server aufgebaut werden kann. Ein nachfolgender Test zeigt jedoch, dass auch eine unverschlüsselte Verbindung akzeptiert wird. Der Open-Relay-Test ist negativ."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a2-m3",
                    "uuid": "b6440c0f-ed2b-4372-88ce-c98eddef7dd0",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für den E-Mail-Empfang über nicht vertrauenswürdige Netze MUSS der E-Mail-Server eine sichere Transportverschlüsselung anbieten. Der IT-Betrieb MUSS den Server so konfigurieren, dass E-Mail-Clients nur über eine sichere Transportverschlüsselung auf Postfächer zugreifen können. Der IT-Betrieb MUSS den Server so einstellen, dass er nicht als Spam-Relay missbraucht werden kann. Es MUSS eine geeignete Größenbeschränkung für Postfächer eingerichtet und dokumentiert werden, und der IT-Betrieb MUSS Schutzmechanismen gegen DoS-Attacken ergreifen."
                      },
                      {
                        "name": "guidance",
                        "value": "Die Serverkonfiguration erzwingt TLS für Client-Verbindungen (z.B. über SMTPS, IMAPS, POP3S oder STARTTLS mit obligatorischer Verschlüsselung). Der Empfang von unverschlüsselten E-Mails von anderen Servern wird noch toleriert, aber protokolliert. Als DoS-Schutz sind Ratenbegrenzungen (Rate Limiting) für Verbindungen und Nachrichten pro Zeiteinheit konfiguriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Serverkonfiguration, um sicherzustellen, dass unverschlüsselte Client-Logins deaktiviert sind. Es wird die Dokumentation für die Postfachgrößen und die DoS-Schutzmaßnahmen geprüft. Ein Test-Client kann sich ohne TLS nicht verbinden."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a2-m4",
                    "uuid": "abf2e471-2ed7-44cf-b345-14abeecbd3c5",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der Empfang von E-Mails über unverschlüsselte Verbindungen SOLLTE deaktiviert werden. Beim Versand von E-Mails an andere Server SOLLTE eine sichere Transportverschlüsselung genutzt werden, und der Versand über unsichere Verbindungen SOLLTE deaktiviert werden (opportunistic TLS mit erzwungener Verschlüsselung, wo möglich)."
                      },
                      {
                        "name": "guidance",
                        "value": "Der E-Mail-Server ist so konfiguriert, dass er bei der Kommunikation mit anderen Servern TLS erzwingt (z.B. über `smtp_tls_security_level = encrypt` in Postfix). Für wichtige Kommunikationspartner, die kein TLS anbieten, werden Ausnahmeregeln definiert und dokumentiert. Der unverschlüsselte Empfang von E-Mails wird gänzlich abgelehnt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer analysiert die Serverkonfigurationsdateien bezüglich der TLS-Richtlinien für ausgehenden und eingehenden Server-zu-Server-Verkehr. E-Mail-Header von Testnachrichten werden analysiert, um die Verwendung von TLS zu bestätigen. Es wird geprüft, ob eine E-Mail von einem Test-Server, der kein TLS anbietet, abgewiesen wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a2-m5",
                    "uuid": "9625d424-0267-4ebe-982e-a186a7baff61",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die E-Mail-Kommunikation wird durch den Einsatz von DANE und MTA-STS umfassend abgesichert. Dies verhindert Man-in-the-Middle-Angriffe durch Downgrading der Verschlüsselung. Es werden nur aktuelle und starke Verschlüsselungsprotokolle und Cipher-Suiten zugelassen. Die Serverkonfiguration wird regelmäßig automatisiert auf Einhaltung der Sicherheitsrichtlinie überprüft."
                      },
                      {
                        "name": "guidance",
                        "value": "DNSSEC ist für die Domains der Institution aktiviert. TLSA-Records für DANE werden im DNS veröffentlicht. Eine MTA-STS-Richtlinie wird per HTTPS bereitgestellt und die entsprechenden DNS-Einträge werden gesetzt. Die Serverkonfiguration wird mittels spezialisierter Tools (z.B. `testssl.sh`, Qualys SSL Labs) regelmäßig geprüft und die Ergebnisse werden zur Nachbesserung genutzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer verifiziert die korrekte Konfiguration von DNSSEC, DANE (TLSA-Records) und MTA-STS (HTTPS-Policy und DNS-Records) mit öffentlich verfügbaren Online-Tools. Die Serverkonfiguration wird auf die ausschließliche Verwendung starker Cipher-Suiten und Protokolle (z.B. TLS 1.2, TLS 1.3) überprüft. Automatisierte Konfigurations-Audit-Berichte werden eingesehen."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "b689728a-dadc-4389-b926-9db3eb8414b8",
                "control-id": "KONF.14.1.2",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "5",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Implementation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "APP",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a10-m3",
                    "uuid": "6e179368-c09d-4b3e-8847-8383c7b466a2",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Für den Austausch von E-Mails mit besonders hohem Schutzbedarf werden Ende-zu-Ende-Verschlüsselung (E2EE) und digitale Signaturen auf individueller Basis eingesetzt. Die Benutzer sind geschult, die entsprechenden Werkzeuge (z.B. S/MIME, PGP) zu verwenden, wenn dies erforderlich ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Es gibt eine Richtlinie, die definiert, wann E2EE zu verwenden ist. Einzelne Benutzer oder Abteilungen erhalten die notwendigen Zertifikate oder Schlüssel und werden in deren Anwendung geschult. Die Nutzung ist freiwillig bzw. anlassbezogen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet die Richtlinie zur E2EE. Es wird durch Interviews mit Schlüsselpersonen verifiziert, ob und wie E2EE in der Praxis für sensible Kommunikation eingesetzt wird."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a10-m4",
                    "uuid": "75d346e0-68e5-4576-bbc4-94a56b78423e",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE eine Ende-zu-Ende-Verschlüsselung sowie digitale Signaturen für E-Mails einsetzen. Es SOLLTEN nur Protokolle (z.B. S/MIME, OpenPGP) genutzt werden, die dem aktuellen Stand der Technik entsprechen. Die Schlüssel- und Zertifikatsverwaltung wird zentralisiert."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein zentrales Gateway oder eine Public-Key-Infrastruktur (PKI) wird zur Verwaltung von Schlüsseln und Zertifikaten für S/MIME oder OpenPGP eingesetzt. Die E2EE-Funktionalität ist in die E-Mail-Clients aller relevanten Mitarbeiter integriert und vorkonfiguriert."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration der zentralen Schlüsselverwaltung. Es wird verifiziert, dass die eingesetzten Protokolle und Algorithmen dem Stand der Technik entsprechen (z.B. keine veralteten Hash- oder Verschlüsselungsalgorithmen). Stichprobenartig wird die korrekte Konfiguration der Clients geprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a10-m5",
                    "uuid": "b7c7e8be-7d40-4a0d-9146-9b165aeadc5a",
                    "description": "Maturity Level 5: Comprehensive",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Nutzung von Ende-zu-Ende-Verschlüsselung und digitalen Signaturen wird basierend auf Inhalts- oder Empfängerrichtlinien automatisch erzwungen. E-Mails, die bestimmte Kriterien erfüllen (z.B. Versand an externe Partner, enthaltene Schlüsselwörter), werden automatisch signiert und verschlüsselt, ohne dass ein Benutzereingriff erforderlich ist."
                      },
                      {
                        "name": "guidance",
                        "value": "Ein E-Mail-Gateway mit Richtlinien-basierter Verschlüsselung wird eingesetzt. Dieses Gateway verwaltet die Schlüssel und wendet die Verschlüsselung transparent an. Alternativ werden Client-Plugins verwendet, die eine richtlinienbasierte Verschlüsselung erzwingen."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer überprüft die Konfiguration der Verschlüsselungsrichtlinien auf dem Gateway. Es werden Test-E-Mails versendet, die die definierten Kriterien erfüllen, um zu validieren, dass die automatische Verschlüsselung und Signatur korrekt angewendet wird."
                      }
                    ]
                  }
                ]
              },
              {
                "uuid": "ab287c4a-de7b-439d-bd22-e5be204f3d33",
                "control-id": "NOT.4.3",
                "description": "",
                "props": [
                  {
                    "name": "level",
                    "value": "1",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "phase",
                    "value": "Operation",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "practice",
                    "value": "NOT",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_c",
                    "value": "false",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_i",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  },
                  {
                    "name": "effective_on_a",
                    "value": "true",
                    "ns": "https://www.bsi.bund.de/ns/grundschutz"
                  }
                ],
                "statements": [
                  {
                    "statement-id": "app.5.3-a3-m3",
                    "uuid": "83abf1f8-d5a1-464f-bc8f-5db17da16078",
                    "description": "Maturity Level 3: Defined",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Der IT-Betrieb MUSS die Daten der E-Mail-Server und -Clients regelmäßig sichern. Dafür MUSS die Institution regeln, wie die gesendeten und empfangenen E-Mails der E-Mail-Clients sowie die E-Mails auf den Servern gesichert werden."
                      },
                      {
                        "name": "guidance",
                        "value": "Es existiert ein dokumentiertes Datensicherungskonzept, das explizit die E-Mail-Server umfasst. Die Sicherung der Serverdaten erfolgt automatisiert und regelmäßig (z.B. täglich). Für lokal auf Clients gespeicherte E-Mails (z.B. in PST-Dateien) gibt es eine klare Anweisung an die Benutzer, diese auf Netzlaufwerke zu verschieben, die ebenfalls gesichert werden."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das Datensicherungskonzept und die Backup-Protokolle des E-Mail-Servers. Es wird die Richtlinie für die Sicherung von clientseitigen E-Mails eingesehen. Die erfolgreiche Durchführung der Server-Backups wird stichprobenartig überprüft."
                      }
                    ]
                  },
                  {
                    "statement-id": "app.5.3-a3-m4",
                    "uuid": "aba1cfe4-28b2-48a6-9bb3-da58f64764ac",
                    "description": "Maturity Level 4: Enhanced",
                    "props": [
                      {
                        "name": "statement",
                        "value": "Die Institution SOLLTE bei der Archivierung beachten, dass E-Mails möglicherweise nur lokal auf Clients gespeichert sind. Das Datensicherungskonzept wird um ein Archivierungskonzept erweitert, das gesetzliche und regulatorische Aufbewahrungsfristen berücksichtigt. Es werden regelmäßig Wiederherstellungstests durchgeführt, um die Integrität der Sicherungen zu überprüfen."
                      },
                      {
                        "name": "guidance",
                        "value": "Eine dedizierte E-Mail-Archivierungslösung wird eingesetzt, die alle ein- und ausgehenden E-Mails revisionssicher speichert. Dies reduziert die Notwendigkeit, clientseitige Archive zu sichern. Das Backup-Konzept wird um jährliche, protokollierte Wiederherstellungstests für das E-Mail-System ergänzt."
                      },
                      {
                        "name": "assessment-method",
                        "value": "Der Prüfer sichtet das E-Mail-Archivierungskonzept und überprüft dessen Konformität mit den relevanten Aufbewahrungspflichten. Die Protokolle der durchgeführten Wiederherstellungstests werden eingesehen. Es wird geprüft, ob die Archivierungslösung korrekt funktioniert (z.B. durch Suche nach einer Test-E-Mail im Archiv)."
                      }
                    ]
                  }
                ]
              }
            ]
          }
        ]
      }
    ]
  }
}